; ModuleID = 'blender/source/blender/editors/space_clip/clip_editor.c'
source_filename = "blender/source/blender/editors/space_clip/clip_editor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!59 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_BAKE", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "WM_JOB_TYPE_FILESEL_THUMBNAIL", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_BUILD_PROXY", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_TRACK_MARKERS", value: 11, isUnsigned: true)
!63 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_SOLVE_CAMERA", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_PREFETCH", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "WM_JOB_TYPE_SEQ_BUILD_PROXY", value: 14, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 380, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!69 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!72 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!73 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!74 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!75 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!76 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!77 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!78 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!79 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceClip_Flag", file: !4, line: 1113, baseType: !5, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!82 = !DIEnumerator(name: "SC_SHOW_MARKER_PATTERN", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "SC_SHOW_MARKER_SEARCH", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "SC_LOCK_SELECTION", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "SC_SHOW_TINY_MARKER", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "SC_SHOW_TRACK_PATH", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "SC_SHOW_BUNDLES", value: 32, isUnsigned: true)
!88 = !DIEnumerator(name: "SC_MUTE_FOOTAGE", value: 64, isUnsigned: true)
!89 = !DIEnumerator(name: "SC_HIDE_DISABLED", value: 128, isUnsigned: true)
!90 = !DIEnumerator(name: "SC_SHOW_NAMES", value: 256, isUnsigned: true)
!91 = !DIEnumerator(name: "SC_SHOW_GRID", value: 512, isUnsigned: true)
!92 = !DIEnumerator(name: "SC_SHOW_STABLE", value: 1024, isUnsigned: true)
!93 = !DIEnumerator(name: "SC_MANUAL_CALIBRATION", value: 2048, isUnsigned: true)
!94 = !DIEnumerator(name: "SC_SHOW_GPENCIL", value: 4096, isUnsigned: true)
!95 = !DIEnumerator(name: "SC_SHOW_FILTERS", value: 8192, isUnsigned: true)
!96 = !DIEnumerator(name: "SC_SHOW_GRAPH_FRAMES", value: 16384, isUnsigned: true)
!97 = !DIEnumerator(name: "SC_SHOW_GRAPH_TRACKS_MOTION", value: 32768, isUnsigned: true)
!98 = !DIEnumerator(name: "SC_LOCK_TIMECURSOR", value: 131072, isUnsigned: true)
!99 = !DIEnumerator(name: "SC_SHOW_SECONDS", value: 262144, isUnsigned: true)
!100 = !DIEnumerator(name: "SC_SHOW_GRAPH_SEL_ONLY", value: 524288, isUnsigned: true)
!101 = !DIEnumerator(name: "SC_SHOW_GRAPH_HIDDEN", value: 1048576, isUnsigned: true)
!102 = !DIEnumerator(name: "SC_SHOW_GRAPH_TRACKS_ERROR", value: 2097152, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 133, baseType: !5, size: 32, elements: !104)
!104 = !{!105, !106}
!105 = !DIEnumerator(name: "MCLIP_SRC_SEQUENCE", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "MCLIP_SRC_MOVIE", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TaskPriority", file: !108, line: 70, baseType: !5, size: 32, elements: !109)
!108 = !DIFile(filename: "blender/source/blender/blenlib/BLI_task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = !{!110, !111}
!110 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 1, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 145, baseType: !5, size: 32, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIEnumerator(name: "MCLIP_USE_PROXY", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "MCLIP_USE_PROXY_CUSTOM_DIR", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "MCLIP_TIMECODE_FLAGS", value: 3, isUnsigned: true)
!117 = !{!118, !119, !120, !121, !123, !192, !558, !667, !691}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !125, line: 130, baseType: !126)
!125 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !125, line: 117, size: 960, elements: !127)
!127 = !{!128, !129, !130, !132, !151, !155, !157, !158, !159, !160}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !125, line: 118, baseType: !118, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !125, line: 118, baseType: !118, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !126, file: !125, line: 119, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !126, file: !125, line: 120, baseType: !133, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !125, line: 136, size: 17600, elements: !135)
!135 = !{!136, !137, !138, !141, !146, !147, !148}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !134, file: !125, line: 137, baseType: !124, size: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !134, file: !125, line: 138, baseType: !123, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !134, file: !125, line: 139, baseType: !139, size: 64, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !125, line: 43, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !125, line: 140, baseType: !142, size: 8192, offset: 1088)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 8192, elements: !144)
!143 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !{!145}
!145 = !DISubrange(count: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !134, file: !125, line: 141, baseType: !142, size: 8192, offset: 9280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !134, file: !125, line: 148, baseType: !133, size: 64, offset: 17472)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !134, file: !125, line: 150, baseType: !149, size: 64, offset: 17536)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !125, line: 45, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !125, line: 121, baseType: !152, size: 528, offset: 256)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 528, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 66)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !125, line: 126, baseType: !156, size: 16, offset: 784)
!156 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !126, file: !125, line: 127, baseType: !120, size: 32, offset: 800)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !126, file: !125, line: 128, baseType: !120, size: 32, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !126, file: !125, line: 128, baseType: !120, size: 32, offset: 864)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !126, file: !125, line: 129, baseType: !161, size: 64, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !125, line: 75, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !125, line: 62, size: 1024, elements: !164)
!164 = !{!165, !167, !168, !169, !170, !171, !175, !176, !190, !191}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !125, line: 63, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !163, file: !125, line: 63, baseType: !166, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !125, line: 64, baseType: !143, size: 8, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !163, file: !125, line: 64, baseType: !143, size: 8, offset: 136)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !125, line: 65, baseType: !156, size: 16, offset: 144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !125, line: 66, baseType: !172, size: 512, offset: 160)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 512, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !163, file: !125, line: 67, baseType: !120, size: 32, offset: 672)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !125, line: 69, baseType: !177, size: 256, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !125, line: 60, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !125, line: 48, size: 256, elements: !179)
!179 = !{!180, !181, !188, !189}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !178, file: !125, line: 49, baseType: !118, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !178, file: !125, line: 58, baseType: !182, size: 128, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !183, line: 71, baseType: !184)
!183 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !183, line: 69, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !184, file: !183, line: 70, baseType: !118, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !184, file: !183, line: 70, baseType: !118, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !178, file: !125, line: 59, baseType: !120, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !178, file: !125, line: 59, baseType: !120, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !163, file: !125, line: 70, baseType: !120, size: 32, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !163, file: !125, line: 74, baseType: !120, size: 32, offset: 992)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !4, line: 1110, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !4, line: 1074, size: 3264, elements: !195)
!195 = !{!196, !211, !212, !213, !214, !215, !216, !217, !218, !219, !225, !531, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !4, line: 1075, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !200)
!200 = !{!201, !203, !204, !205, !206, !207}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !4, line: 86, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !4, line: 86, baseType: !202, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !199, file: !4, line: 87, baseType: !182, size: 128, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !199, file: !4, line: 88, baseType: !120, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !199, file: !4, line: 89, baseType: !119, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !199, file: !4, line: 90, baseType: !208, size: 128, offset: 320)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !4, line: 1075, baseType: !197, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !194, file: !4, line: 1076, baseType: !182, size: 128, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !194, file: !4, line: 1077, baseType: !120, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !194, file: !4, line: 1079, baseType: !119, size: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !194, file: !4, line: 1079, baseType: !119, size: 32, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !194, file: !4, line: 1080, baseType: !119, size: 32, offset: 352)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !194, file: !4, line: 1080, baseType: !119, size: 32, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !194, file: !4, line: 1081, baseType: !119, size: 32, offset: 416)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !194, file: !4, line: 1083, baseType: !220, size: 64, offset: 448)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !35, line: 50, size: 64, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !220, file: !35, line: 51, baseType: !120, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !220, file: !35, line: 52, baseType: !156, size: 16, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !220, file: !35, line: 52, baseType: !156, size: 16, offset: 48)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !194, file: !4, line: 1084, baseType: !226, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !35, line: 64, size: 19136, elements: !228)
!228 = !{!229, !230, !234, !235, !236, !237, !241, !242, !243, !247, !250, !253, !514, !515, !526, !527, !528, !529, !530}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !227, file: !35, line: 65, baseType: !124, size: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !227, file: !35, line: 66, baseType: !231, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !233, line: 48, flags: DIFlagFwdDecl)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !35, line: 68, baseType: !142, size: 8192, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !227, file: !35, line: 70, baseType: !120, size: 32, offset: 9216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !227, file: !35, line: 71, baseType: !120, size: 32, offset: 9248)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !227, file: !35, line: 72, baseType: !238, size: 64, offset: 9280)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 2)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !227, file: !35, line: 74, baseType: !119, size: 32, offset: 9344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !227, file: !35, line: 74, baseType: !119, size: 32, offset: 9376)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !227, file: !35, line: 76, baseType: !244, size: 64, offset: 9408)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !246, line: 85, flags: DIFlagFwdDecl)
!246 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !227, file: !35, line: 77, baseType: !248, size: 64, offset: 9472)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !35, line: 77, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !227, file: !35, line: 78, baseType: !251, size: 64, offset: 9536)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !67, line: 45, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !227, file: !35, line: 80, baseType: !254, size: 2624, offset: 9600)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !67, line: 340, size: 2624, elements: !255)
!255 = !{!256, !284, !303, !304, !305, !323, !384, !385, !491, !492, !493, !494, !503}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !254, file: !67, line: 341, baseType: !257, size: 576)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !67, line: 251, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !67, line: 207, size: 576, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !258, file: !67, line: 208, baseType: !120, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !258, file: !67, line: 211, baseType: !156, size: 16, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !258, file: !67, line: 212, baseType: !156, size: 16, offset: 48)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !258, file: !67, line: 213, baseType: !119, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !258, file: !67, line: 214, baseType: !156, size: 16, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !258, file: !67, line: 215, baseType: !156, size: 16, offset: 112)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !258, file: !67, line: 216, baseType: !156, size: 16, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !258, file: !67, line: 217, baseType: !156, size: 16, offset: 144)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !258, file: !67, line: 218, baseType: !156, size: 16, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !258, file: !67, line: 219, baseType: !156, size: 16, offset: 176)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !258, file: !67, line: 220, baseType: !119, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !258, file: !67, line: 222, baseType: !156, size: 16, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !258, file: !67, line: 225, baseType: !156, size: 16, offset: 240)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !258, file: !67, line: 228, baseType: !120, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !258, file: !67, line: 229, baseType: !120, size: 32, offset: 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !258, file: !67, line: 233, baseType: !120, size: 32, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !258, file: !67, line: 236, baseType: !156, size: 16, offset: 352)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !258, file: !67, line: 236, baseType: !156, size: 16, offset: 368)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !258, file: !67, line: 241, baseType: !119, size: 32, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !258, file: !67, line: 244, baseType: !120, size: 32, offset: 416)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !258, file: !67, line: 244, baseType: !120, size: 32, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !258, file: !67, line: 245, baseType: !119, size: 32, offset: 480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !258, file: !67, line: 248, baseType: !119, size: 32, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !258, file: !67, line: 250, baseType: !120, size: 32, offset: 544)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !254, file: !67, line: 342, baseType: !285, size: 448, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !67, line: 79, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !67, line: 61, size: 448, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !298, !299, !300, !301, !302}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !286, file: !67, line: 62, baseType: !118, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !286, file: !67, line: 64, baseType: !156, size: 16, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !286, file: !67, line: 65, baseType: !156, size: 16, offset: 80)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !286, file: !67, line: 67, baseType: !119, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !286, file: !67, line: 68, baseType: !119, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !286, file: !67, line: 69, baseType: !119, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !286, file: !67, line: 70, baseType: !156, size: 16, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !286, file: !67, line: 71, baseType: !156, size: 16, offset: 208)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !286, file: !67, line: 72, baseType: !297, size: 64, offset: 224)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !239)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !286, file: !67, line: 75, baseType: !119, size: 32, offset: 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !286, file: !67, line: 75, baseType: !119, size: 32, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !286, file: !67, line: 75, baseType: !119, size: 32, offset: 352)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !286, file: !67, line: 78, baseType: !119, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !286, file: !67, line: 78, baseType: !119, size: 32, offset: 416)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !254, file: !67, line: 343, baseType: !182, size: 128, offset: 1024)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !254, file: !67, line: 344, baseType: !182, size: 128, offset: 1152)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !254, file: !67, line: 345, baseType: !306, size: 192, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !67, line: 278, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !67, line: 270, size: 192, elements: !308)
!308 = !{!309, !310, !311, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !307, file: !67, line: 271, baseType: !120, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !307, file: !67, line: 273, baseType: !119, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !307, file: !67, line: 275, baseType: !120, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !307, file: !67, line: 276, baseType: !120, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !307, file: !67, line: 277, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !67, line: 55, size: 576, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !315, file: !67, line: 56, baseType: !120, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !315, file: !67, line: 57, baseType: !119, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !315, file: !67, line: 58, baseType: !320, size: 512, offset: 64)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !321)
!321 = !{!322, !322}
!322 = !DISubrange(count: 4)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !254, file: !67, line: 346, baseType: !324, size: 384, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !67, line: 268, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !67, line: 253, size: 384, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !378, !379, !380, !381, !382, !383}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !67, line: 254, baseType: !120, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !325, file: !67, line: 255, baseType: !120, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !325, file: !67, line: 255, baseType: !120, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !325, file: !67, line: 258, baseType: !119, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !325, file: !67, line: 259, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !67, line: 164, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !67, line: 108, size: 1664, elements: !335)
!335 = !{!336, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !360, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !67, line: 109, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !67, line: 109, baseType: !337, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !67, line: 111, baseType: !172, size: 512, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !334, file: !67, line: 119, baseType: !297, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !334, file: !67, line: 119, baseType: !297, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !334, file: !67, line: 125, baseType: !297, size: 64, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !334, file: !67, line: 125, baseType: !297, size: 64, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !334, file: !67, line: 127, baseType: !297, size: 64, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !334, file: !67, line: 130, baseType: !120, size: 32, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !334, file: !67, line: 131, baseType: !120, size: 32, offset: 992)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !334, file: !67, line: 132, baseType: !348, size: 64, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !67, line: 106, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !67, line: 81, size: 512, elements: !351)
!351 = !{!352, !353, !356, !357, !358, !359}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !350, file: !67, line: 82, baseType: !297, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !350, file: !67, line: 97, baseType: !354, size: 256, offset: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 256, elements: !355)
!355 = !{!322, !240}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !350, file: !67, line: 102, baseType: !297, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !350, file: !67, line: 102, baseType: !297, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !350, file: !67, line: 104, baseType: !120, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !67, line: 105, baseType: !120, size: 32, offset: 480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !334, file: !67, line: 135, baseType: !361, size: 96, offset: 1088)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 96, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 3)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !334, file: !67, line: 136, baseType: !119, size: 32, offset: 1184)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !67, line: 139, baseType: !120, size: 32, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !334, file: !67, line: 139, baseType: !120, size: 32, offset: 1248)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !334, file: !67, line: 139, baseType: !120, size: 32, offset: 1280)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !334, file: !67, line: 140, baseType: !361, size: 96, offset: 1312)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !334, file: !67, line: 143, baseType: !156, size: 16, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !334, file: !67, line: 144, baseType: !156, size: 16, offset: 1424)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !334, file: !67, line: 145, baseType: !156, size: 16, offset: 1440)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !334, file: !67, line: 148, baseType: !156, size: 16, offset: 1456)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !334, file: !67, line: 149, baseType: !120, size: 32, offset: 1472)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !334, file: !67, line: 150, baseType: !119, size: 32, offset: 1504)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !334, file: !67, line: 152, baseType: !251, size: 64, offset: 1536)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !334, file: !67, line: 163, baseType: !119, size: 32, offset: 1600)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !334, file: !67, line: 163, baseType: !119, size: 32, offset: 1632)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !325, file: !67, line: 261, baseType: !119, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !325, file: !67, line: 261, baseType: !119, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !325, file: !67, line: 261, baseType: !119, size: 32, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !325, file: !67, line: 263, baseType: !120, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !325, file: !67, line: 266, baseType: !120, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !325, file: !67, line: 267, baseType: !119, size: 32, offset: 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !254, file: !67, line: 347, baseType: !332, size: 64, offset: 1856)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !254, file: !67, line: 348, baseType: !386, size: 64, offset: 1920)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !67, line: 205, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !67, line: 186, size: 1024, elements: !389)
!389 = !{!390, !392, !393, !394, !396, !397, !398, !406, !407, !408, !489, !490}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !388, file: !67, line: 187, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !388, file: !67, line: 187, baseType: !391, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !388, file: !67, line: 189, baseType: !172, size: 512, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !388, file: !67, line: 191, baseType: !395, size: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !388, file: !67, line: 193, baseType: !120, size: 32, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !388, file: !67, line: 193, baseType: !120, size: 32, offset: 736)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !388, file: !67, line: 195, baseType: !399, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !67, line: 184, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !67, line: 166, size: 320, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !401, file: !67, line: 180, baseType: !354, size: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !401, file: !67, line: 182, baseType: !120, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !67, line: 183, baseType: !120, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !388, file: !67, line: 196, baseType: !120, size: 32, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !67, line: 198, baseType: !120, size: 32, offset: 864)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !388, file: !67, line: 200, baseType: !409, size: 64, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !411, line: 77, size: 15424, elements: !412)
!411 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!412 = !{!413, !414, !415, !418, !421, !422, !425, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !443, !444, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !470, !471, !472, !478, !479, !483}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !410, file: !411, line: 78, baseType: !124, size: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 80, baseType: !142, size: 8192, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !410, file: !411, line: 82, baseType: !416, size: 64, offset: 9152)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !411, line: 43, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !410, file: !411, line: 83, baseType: !419, size: 64, offset: 9216)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !125, line: 46, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !410, file: !411, line: 86, baseType: !244, size: 64, offset: 9280)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !410, file: !411, line: 87, baseType: !423, size: 64, offset: 9344)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !411, line: 44, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !410, file: !411, line: 89, baseType: !426, size: 512, offset: 9408)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 512, elements: !209)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !410, file: !411, line: 90, baseType: !156, size: 16, offset: 9920)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !410, file: !411, line: 90, baseType: !156, size: 16, offset: 9936)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !410, file: !411, line: 92, baseType: !156, size: 16, offset: 9952)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !411, line: 92, baseType: !156, size: 16, offset: 9968)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !410, file: !411, line: 93, baseType: !156, size: 16, offset: 9984)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !411, line: 93, baseType: !156, size: 16, offset: 10000)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !410, file: !411, line: 94, baseType: !120, size: 32, offset: 10016)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !410, file: !411, line: 97, baseType: !156, size: 16, offset: 10048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !410, file: !411, line: 97, baseType: !156, size: 16, offset: 10064)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !410, file: !411, line: 98, baseType: !156, size: 16, offset: 10080)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !410, file: !411, line: 98, baseType: !156, size: 16, offset: 10096)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !410, file: !411, line: 99, baseType: !156, size: 16, offset: 10112)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !410, file: !411, line: 99, baseType: !156, size: 16, offset: 10128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !410, file: !411, line: 100, baseType: !5, size: 32, offset: 10144)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !410, file: !411, line: 101, baseType: !442, size: 64, offset: 10176)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !410, file: !411, line: 103, baseType: !149, size: 64, offset: 10240)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !410, file: !411, line: 104, baseType: !445, size: 64, offset: 10304)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !125, line: 159, size: 448, elements: !447)
!447 = !{!448, !450, !451, !453, !454, !456}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !446, file: !125, line: 161, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !239)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !446, file: !125, line: 162, baseType: !449, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !446, file: !125, line: 163, baseType: !452, size: 32, offset: 128)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 32, elements: !239)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !446, file: !125, line: 164, baseType: !452, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !446, file: !125, line: 165, baseType: !455, size: 128, offset: 192)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 128, elements: !239)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !446, file: !125, line: 166, baseType: !457, size: 128, offset: 320)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 128, elements: !239)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !410, file: !411, line: 107, baseType: !119, size: 32, offset: 10368)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !410, file: !411, line: 108, baseType: !120, size: 32, offset: 10400)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !410, file: !411, line: 109, baseType: !156, size: 16, offset: 10432)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !410, file: !411, line: 110, baseType: !156, size: 16, offset: 10448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !410, file: !411, line: 113, baseType: !120, size: 32, offset: 10464)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !410, file: !411, line: 113, baseType: !120, size: 32, offset: 10496)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !410, file: !411, line: 114, baseType: !143, size: 8, offset: 10528)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !410, file: !411, line: 114, baseType: !143, size: 8, offset: 10536)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !410, file: !411, line: 115, baseType: !156, size: 16, offset: 10544)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !410, file: !411, line: 116, baseType: !468, size: 128, offset: 10560)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 128, elements: !469)
!469 = !{!322}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !410, file: !411, line: 119, baseType: !119, size: 32, offset: 10688)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !410, file: !411, line: 119, baseType: !119, size: 32, offset: 10720)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !410, file: !411, line: 122, baseType: !473, size: 512, offset: 10752)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !474, line: 182, baseType: !475)
!474 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !474, line: 180, size: 512, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !475, file: !474, line: 181, baseType: !172, size: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !410, file: !411, line: 123, baseType: !143, size: 8, offset: 11264)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !410, file: !411, line: 125, baseType: !480, size: 56, offset: 11272)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 56, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 7)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !410, file: !411, line: 126, baseType: !484, size: 4096, offset: 11328)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 4096, elements: !209)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !411, line: 69, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !411, line: 67, size: 512, elements: !487)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !411, line: 68, baseType: !172, size: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !388, file: !67, line: 201, baseType: !119, size: 32, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !388, file: !67, line: 204, baseType: !120, size: 32, offset: 992)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !254, file: !67, line: 350, baseType: !182, size: 128, offset: 1984)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !254, file: !67, line: 351, baseType: !120, size: 32, offset: 2112)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !254, file: !67, line: 351, baseType: !120, size: 32, offset: 2144)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !254, file: !67, line: 353, baseType: !495, size: 64, offset: 2176)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !67, line: 297, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !67, line: 295, size: 2048, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !497, file: !67, line: 296, baseType: !500, size: 2048)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 2048, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !254, file: !67, line: 355, baseType: !504, size: 384, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !67, line: 338, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !67, line: 322, size: 384, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !505, file: !67, line: 323, baseType: !120, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !505, file: !67, line: 325, baseType: !156, size: 16, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !67, line: 326, baseType: !156, size: 16, offset: 48)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !505, file: !67, line: 331, baseType: !182, size: 128, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !505, file: !67, line: 334, baseType: !182, size: 128, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !505, file: !67, line: 335, baseType: !120, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !505, file: !67, line: 337, baseType: !120, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !227, file: !35, line: 81, baseType: !118, size: 64, offset: 12224)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !227, file: !35, line: 85, baseType: !516, size: 6208, offset: 12288)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !35, line: 55, size: 6208, elements: !517)
!517 = !{!518, !522, !523, !524, !525}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !516, file: !35, line: 56, baseType: !519, size: 6144)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 6144, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 768)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !516, file: !35, line: 58, baseType: !156, size: 16, offset: 6144)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !516, file: !35, line: 59, baseType: !156, size: 16, offset: 6160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !516, file: !35, line: 60, baseType: !156, size: 16, offset: 6176)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !516, file: !35, line: 61, baseType: !156, size: 16, offset: 6192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !35, line: 86, baseType: !120, size: 32, offset: 18496)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !227, file: !35, line: 88, baseType: !120, size: 32, offset: 18528)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !227, file: !35, line: 90, baseType: !120, size: 32, offset: 18560)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !227, file: !35, line: 94, baseType: !120, size: 32, offset: 18592)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !227, file: !35, line: 100, baseType: !473, size: 512, offset: 18624)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !194, file: !4, line: 1085, baseType: !532, size: 1088, offset: 576)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !35, line: 103, size: 1088, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !617, !618, !619, !620, !621, !622, !623, !625}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !532, file: !35, line: 104, baseType: !156, size: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !532, file: !35, line: 105, baseType: !156, size: 16, offset: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !532, file: !35, line: 106, baseType: !120, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !532, file: !35, line: 107, baseType: !120, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !532, file: !35, line: 107, baseType: !120, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !532, file: !35, line: 108, baseType: !350, size: 512, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !532, file: !35, line: 109, baseType: !541, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !543, line: 70, size: 19840, elements: !544)
!543 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !556, !559, !560, !561, !562, !563, !565, !567, !568, !569, !573, !574, !575, !576, !577, !580, !581, !582, !583, !584, !587, !588, !589, !590, !591, !595, !596, !597, !600, !601, !610}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !543, line: 71, baseType: !541, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !542, file: !543, line: 71, baseType: !541, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !542, file: !543, line: 74, baseType: !120, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !542, file: !543, line: 74, baseType: !120, size: 32, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !542, file: !543, line: 79, baseType: !122, size: 8, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !542, file: !543, line: 80, baseType: !120, size: 32, offset: 224)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !542, file: !543, line: 83, baseType: !120, size: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !542, file: !543, line: 84, baseType: !120, size: 32, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !542, file: !543, line: 87, baseType: !442, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !542, file: !543, line: 88, baseType: !555, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !542, file: !543, line: 93, baseType: !557, size: 128, offset: 448)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 128, elements: !239)
!558 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !542, file: !543, line: 96, baseType: !120, size: 32, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !542, file: !543, line: 96, baseType: !120, size: 32, offset: 608)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !542, file: !543, line: 97, baseType: !120, size: 32, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !542, file: !543, line: 97, baseType: !120, size: 32, offset: 672)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !542, file: !543, line: 98, baseType: !564, size: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !542, file: !543, line: 101, baseType: !566, size: 64, offset: 768)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !542, file: !543, line: 102, baseType: !555, size: 64, offset: 832)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !542, file: !543, line: 105, baseType: !119, size: 32, offset: 896)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !542, file: !543, line: 108, baseType: !570, size: 1280, offset: 960)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 1280, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 20)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !542, file: !543, line: 109, baseType: !120, size: 32, offset: 2240)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !542, file: !543, line: 109, baseType: !120, size: 32, offset: 2272)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !542, file: !543, line: 112, baseType: !120, size: 32, offset: 2304)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !542, file: !543, line: 113, baseType: !120, size: 32, offset: 2336)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !542, file: !543, line: 114, baseType: !578, size: 64, offset: 2368)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !543, line: 50, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !542, file: !543, line: 115, baseType: !118, size: 64, offset: 2432)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !542, file: !543, line: 118, baseType: !120, size: 32, offset: 2496)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !542, file: !543, line: 119, baseType: !142, size: 8192, offset: 2528)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !542, file: !543, line: 120, baseType: !142, size: 8192, offset: 10720)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !542, file: !543, line: 123, baseType: !585, size: 64, offset: 18944)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !543, line: 123, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !542, file: !543, line: 124, baseType: !120, size: 32, offset: 19008)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !542, file: !543, line: 127, baseType: !121, size: 64, offset: 19072)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !542, file: !543, line: 128, baseType: !5, size: 32, offset: 19136)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !542, file: !543, line: 129, baseType: !5, size: 32, offset: 19168)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !542, file: !543, line: 132, baseType: !592, size: 64, offset: 19200)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !594, line: 56, flags: DIFlagFwdDecl)
!594 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !542, file: !543, line: 133, baseType: !592, size: 64, offset: 19264)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !542, file: !543, line: 134, baseType: !442, size: 64, offset: 19328)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !542, file: !543, line: 135, baseType: !598, size: 64, offset: 19392)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !543, line: 135, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !542, file: !543, line: 136, baseType: !120, size: 32, offset: 19456)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !542, file: !543, line: 137, baseType: !602, size: 128, offset: 19488)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !603, line: 89, baseType: !604)
!603 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !603, line: 86, size: 128, elements: !605)
!605 = !{!606, !607, !608, !609}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !604, file: !603, line: 87, baseType: !120, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !604, file: !603, line: 87, baseType: !120, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !604, file: !603, line: 88, baseType: !120, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !604, file: !603, line: 88, baseType: !120, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !542, file: !543, line: 140, baseType: !611, size: 192, offset: 19648)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !543, line: 55, size: 192, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !611, file: !543, line: 56, baseType: !5, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !611, file: !543, line: 57, baseType: !5, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !611, file: !543, line: 58, baseType: !121, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !611, file: !543, line: 59, baseType: !5, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !532, file: !35, line: 110, baseType: !541, size: 64, offset: 704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !532, file: !35, line: 111, baseType: !297, size: 64, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !532, file: !35, line: 112, baseType: !156, size: 16, offset: 832)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !532, file: !35, line: 113, baseType: !156, size: 16, offset: 848)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !532, file: !35, line: 114, baseType: !120, size: 32, offset: 864)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !532, file: !35, line: 115, baseType: !337, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !532, file: !35, line: 116, baseType: !624, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !532, file: !35, line: 117, baseType: !297, size: 64, offset: 1024)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !4, line: 1087, baseType: !120, size: 32, offset: 1664)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !194, file: !4, line: 1088, baseType: !156, size: 16, offset: 1696)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !194, file: !4, line: 1089, baseType: !156, size: 16, offset: 1712)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !194, file: !4, line: 1091, baseType: !120, size: 32, offset: 1728)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !194, file: !4, line: 1094, baseType: !297, size: 64, offset: 1760)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !194, file: !4, line: 1094, baseType: !119, size: 32, offset: 1824)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !194, file: !4, line: 1094, baseType: !119, size: 32, offset: 1856)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !194, file: !4, line: 1095, baseType: !120, size: 32, offset: 1888)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !194, file: !4, line: 1096, baseType: !320, size: 512, offset: 1920)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !194, file: !4, line: 1096, baseType: !320, size: 512, offset: 2432)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !194, file: !4, line: 1100, baseType: !120, size: 32, offset: 2944)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !194, file: !4, line: 1103, baseType: !156, size: 16, offset: 2976)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !194, file: !4, line: 1103, baseType: !156, size: 16, offset: 2992)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !194, file: !4, line: 1105, baseType: !120, size: 32, offset: 3008)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !194, file: !4, line: 1105, baseType: !120, size: 32, offset: 3040)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !194, file: !4, line: 1107, baseType: !297, size: 64, offset: 3072)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !194, file: !4, line: 1109, baseType: !643, size: 128, offset: 3136)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !4, line: 554, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !4, line: 545, size: 128, elements: !645)
!645 = !{!646, !660, !661, !662, !663}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !644, file: !4, line: 548, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !649, line: 46, size: 1344, elements: !650)
!649 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !648, file: !649, line: 47, baseType: !124, size: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !648, file: !649, line: 48, baseType: !231, size: 64, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "masklayers", scope: !648, file: !649, line: 49, baseType: !182, size: 128, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_act", scope: !648, file: !649, line: 50, baseType: !120, size: 32, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_tot", scope: !648, file: !649, line: 51, baseType: !120, size: 32, offset: 1184)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !648, file: !649, line: 53, baseType: !120, size: 32, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !648, file: !649, line: 53, baseType: !120, size: 32, offset: 1248)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !648, file: !649, line: 55, baseType: !120, size: 32, offset: 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !648, file: !649, line: 56, baseType: !120, size: 32, offset: 1312)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !644, file: !4, line: 550, baseType: !143, size: 8, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !644, file: !4, line: 551, baseType: !143, size: 8, offset: 72)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !644, file: !4, line: 552, baseType: !143, size: 8, offset: 80)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !644, file: !4, line: 553, baseType: !664, size: 40, offset: 88)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 40, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 5)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrefetchQueue", file: !1, line: 621, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrefetchQueue", file: !1, line: 607, size: 448, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !687, !689, !690}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "initial_frame", scope: !669, file: !1, line: 608, baseType: !120, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame", scope: !669, file: !1, line: 608, baseType: !120, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !669, file: !1, line: 608, baseType: !120, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !669, file: !1, line: 608, baseType: !120, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !669, file: !1, line: 609, baseType: !156, size: 16, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !669, file: !1, line: 609, baseType: !156, size: 16, offset: 144)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !669, file: !1, line: 614, baseType: !122, size: 8, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !669, file: !1, line: 616, baseType: !679, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !680, line: 127, baseType: !681)
!680 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !682, line: 9, baseType: !683)
!682 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !684, line: 26, baseType: !685)
!684 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !686, line: 42, baseType: !5)
!686 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!687 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !669, file: !1, line: 618, baseType: !688, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "do_update", scope: !669, file: !1, line: 619, baseType: !688, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !669, file: !1, line: 620, baseType: !555, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !35, line: 101, baseType: !227)
!693 = !{i32 7, !"Dwarf Version", i32 4}
!694 = !{i32 2, !"Debug Info Version", i32 3}
!695 = !{i32 1, !"wchar_size", i32 4}
!696 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!697 = distinct !DISubprogram(name: "ED_space_clip_poll", scope: !1, file: !1, line: 78, type: !698, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!698 = !DISubroutineType(types: !699)
!699 = !{!120, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !702, line: 69, baseType: !703)
!702 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !704, line: 44, flags: DIFlagFwdDecl)
!704 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!705 = !{}
!706 = !DILocalVariable(name: "C", arg: 1, scope: !697, file: !1, line: 78, type: !700)
!707 = !DILocation(line: 78, column: 34, scope: !697)
!708 = !DILocalVariable(name: "sc", scope: !697, file: !1, line: 80, type: !192)
!709 = !DILocation(line: 80, column: 13, scope: !697)
!710 = !DILocation(line: 80, column: 36, scope: !697)
!711 = !DILocation(line: 80, column: 18, scope: !697)
!712 = !DILocation(line: 82, column: 6, scope: !713)
!713 = distinct !DILexicalBlock(scope: !697, file: !1, line: 82, column: 6)
!714 = !DILocation(line: 82, column: 9, scope: !713)
!715 = !DILocation(line: 82, column: 12, scope: !713)
!716 = !DILocation(line: 82, column: 16, scope: !713)
!717 = !DILocation(line: 82, column: 6, scope: !697)
!718 = !DILocation(line: 83, column: 3, scope: !713)
!719 = !DILocation(line: 85, column: 2, scope: !697)
!720 = !DILocation(line: 86, column: 1, scope: !697)
!721 = distinct !DISubprogram(name: "ED_space_clip_view_clip_poll", scope: !1, file: !1, line: 88, type: !698, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!722 = !DILocalVariable(name: "C", arg: 1, scope: !721, file: !1, line: 88, type: !700)
!723 = !DILocation(line: 88, column: 44, scope: !721)
!724 = !DILocalVariable(name: "sc", scope: !721, file: !1, line: 90, type: !192)
!725 = !DILocation(line: 90, column: 13, scope: !721)
!726 = !DILocation(line: 90, column: 36, scope: !721)
!727 = !DILocation(line: 90, column: 18, scope: !721)
!728 = !DILocation(line: 92, column: 6, scope: !729)
!729 = distinct !DILexicalBlock(scope: !721, file: !1, line: 92, column: 6)
!730 = !DILocation(line: 92, column: 6, scope: !721)
!731 = !DILocation(line: 93, column: 10, scope: !732)
!732 = distinct !DILexicalBlock(scope: !729, file: !1, line: 92, column: 10)
!733 = !DILocation(line: 93, column: 14, scope: !732)
!734 = !DILocation(line: 93, column: 19, scope: !732)
!735 = !DILocation(line: 93, column: 3, scope: !732)
!736 = !DILocation(line: 96, column: 2, scope: !721)
!737 = !DILocation(line: 97, column: 1, scope: !721)
!738 = distinct !DISubprogram(name: "ED_space_clip_tracking_poll", scope: !1, file: !1, line: 99, type: !698, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!739 = !DILocalVariable(name: "C", arg: 1, scope: !738, file: !1, line: 99, type: !700)
!740 = !DILocation(line: 99, column: 43, scope: !738)
!741 = !DILocalVariable(name: "sc", scope: !738, file: !1, line: 101, type: !192)
!742 = !DILocation(line: 101, column: 13, scope: !738)
!743 = !DILocation(line: 101, column: 36, scope: !738)
!744 = !DILocation(line: 101, column: 18, scope: !738)
!745 = !DILocation(line: 103, column: 6, scope: !746)
!746 = distinct !DILexicalBlock(scope: !738, file: !1, line: 103, column: 6)
!747 = !DILocation(line: 103, column: 9, scope: !746)
!748 = !DILocation(line: 103, column: 12, scope: !746)
!749 = !DILocation(line: 103, column: 16, scope: !746)
!750 = !DILocation(line: 103, column: 6, scope: !738)
!751 = !DILocation(line: 104, column: 45, scope: !746)
!752 = !DILocation(line: 104, column: 10, scope: !746)
!753 = !DILocation(line: 104, column: 3, scope: !746)
!754 = !DILocation(line: 106, column: 2, scope: !738)
!755 = !DILocation(line: 107, column: 1, scope: !738)
!756 = distinct !DISubprogram(name: "ED_space_clip_check_show_trackedit", scope: !1, file: !1, line: 509, type: !757, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!757 = !DISubroutineType(types: !758)
!758 = !{!122, !192}
!759 = !DILocalVariable(name: "sc", arg: 1, scope: !756, file: !1, line: 509, type: !192)
!760 = !DILocation(line: 509, column: 52, scope: !756)
!761 = !DILocation(line: 511, column: 6, scope: !762)
!762 = distinct !DILexicalBlock(scope: !756, file: !1, line: 511, column: 6)
!763 = !DILocation(line: 511, column: 6, scope: !756)
!764 = !DILocation(line: 512, column: 10, scope: !765)
!765 = distinct !DILexicalBlock(scope: !762, file: !1, line: 511, column: 10)
!766 = !DILocation(line: 512, column: 14, scope: !765)
!767 = !DILocation(line: 512, column: 19, scope: !765)
!768 = !DILocation(line: 512, column: 3, scope: !765)
!769 = !DILocation(line: 515, column: 2, scope: !756)
!770 = !DILocation(line: 516, column: 1, scope: !756)
!771 = distinct !DISubprogram(name: "ED_space_clip_maskedit_poll", scope: !1, file: !1, line: 109, type: !698, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!772 = !DILocalVariable(name: "C", arg: 1, scope: !771, file: !1, line: 109, type: !700)
!773 = !DILocation(line: 109, column: 43, scope: !771)
!774 = !DILocalVariable(name: "sc", scope: !771, file: !1, line: 111, type: !192)
!775 = !DILocation(line: 111, column: 13, scope: !771)
!776 = !DILocation(line: 111, column: 36, scope: !771)
!777 = !DILocation(line: 111, column: 18, scope: !771)
!778 = !DILocation(line: 113, column: 6, scope: !779)
!779 = distinct !DILexicalBlock(scope: !771, file: !1, line: 113, column: 6)
!780 = !DILocation(line: 113, column: 9, scope: !779)
!781 = !DILocation(line: 113, column: 12, scope: !779)
!782 = !DILocation(line: 113, column: 16, scope: !779)
!783 = !DILocation(line: 113, column: 6, scope: !771)
!784 = !DILocation(line: 114, column: 44, scope: !785)
!785 = distinct !DILexicalBlock(scope: !779, file: !1, line: 113, column: 22)
!786 = !DILocation(line: 114, column: 10, scope: !785)
!787 = !DILocation(line: 114, column: 3, scope: !785)
!788 = !DILocation(line: 117, column: 2, scope: !771)
!789 = !DILocation(line: 118, column: 1, scope: !771)
!790 = distinct !DISubprogram(name: "ED_space_clip_check_show_maskedit", scope: !1, file: !1, line: 518, type: !757, scopeLine: 519, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!791 = !DILocalVariable(name: "sc", arg: 1, scope: !790, file: !1, line: 518, type: !192)
!792 = !DILocation(line: 518, column: 51, scope: !790)
!793 = !DILocation(line: 520, column: 6, scope: !794)
!794 = distinct !DILexicalBlock(scope: !790, file: !1, line: 520, column: 6)
!795 = !DILocation(line: 520, column: 6, scope: !790)
!796 = !DILocation(line: 521, column: 10, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !1, line: 520, column: 10)
!798 = !DILocation(line: 521, column: 14, scope: !797)
!799 = !DILocation(line: 521, column: 19, scope: !797)
!800 = !DILocation(line: 521, column: 3, scope: !797)
!801 = !DILocation(line: 524, column: 2, scope: !790)
!802 = !DILocation(line: 525, column: 1, scope: !790)
!803 = distinct !DISubprogram(name: "ED_space_clip_maskedit_mask_poll", scope: !1, file: !1, line: 120, type: !698, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!804 = !DILocalVariable(name: "C", arg: 1, scope: !803, file: !1, line: 120, type: !700)
!805 = !DILocation(line: 120, column: 48, scope: !803)
!806 = !DILocation(line: 122, column: 34, scope: !807)
!807 = distinct !DILexicalBlock(scope: !803, file: !1, line: 122, column: 6)
!808 = !DILocation(line: 122, column: 6, scope: !807)
!809 = !DILocation(line: 122, column: 6, scope: !803)
!810 = !DILocalVariable(name: "clip", scope: !811, file: !1, line: 123, type: !691)
!811 = distinct !DILexicalBlock(scope: !807, file: !1, line: 122, column: 38)
!812 = !DILocation(line: 123, column: 14, scope: !811)
!813 = !DILocation(line: 123, column: 45, scope: !811)
!814 = !DILocation(line: 123, column: 21, scope: !811)
!815 = !DILocation(line: 125, column: 7, scope: !816)
!816 = distinct !DILexicalBlock(scope: !811, file: !1, line: 125, column: 7)
!817 = !DILocation(line: 125, column: 7, scope: !811)
!818 = !DILocalVariable(name: "sc", scope: !819, file: !1, line: 126, type: !192)
!819 = distinct !DILexicalBlock(scope: !816, file: !1, line: 125, column: 13)
!820 = !DILocation(line: 126, column: 15, scope: !819)
!821 = !DILocation(line: 126, column: 38, scope: !819)
!822 = !DILocation(line: 126, column: 20, scope: !819)
!823 = !DILocation(line: 128, column: 11, scope: !819)
!824 = !DILocation(line: 128, column: 15, scope: !819)
!825 = !DILocation(line: 128, column: 25, scope: !819)
!826 = !DILocation(line: 128, column: 30, scope: !819)
!827 = !DILocation(line: 128, column: 4, scope: !819)
!828 = !DILocation(line: 130, column: 2, scope: !811)
!829 = !DILocation(line: 132, column: 2, scope: !803)
!830 = !DILocation(line: 133, column: 1, scope: !803)
!831 = distinct !DISubprogram(name: "ED_space_clip_get_size", scope: !1, file: !1, line: 137, type: !832, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !192, !566, !566}
!834 = !DILocalVariable(name: "sc", arg: 1, scope: !831, file: !1, line: 137, type: !192)
!835 = !DILocation(line: 137, column: 40, scope: !831)
!836 = !DILocalVariable(name: "width", arg: 2, scope: !831, file: !1, line: 137, type: !566)
!837 = !DILocation(line: 137, column: 49, scope: !831)
!838 = !DILocalVariable(name: "height", arg: 3, scope: !831, file: !1, line: 137, type: !566)
!839 = !DILocation(line: 137, column: 61, scope: !831)
!840 = !DILocation(line: 139, column: 6, scope: !841)
!841 = distinct !DILexicalBlock(scope: !831, file: !1, line: 139, column: 6)
!842 = !DILocation(line: 139, column: 10, scope: !841)
!843 = !DILocation(line: 139, column: 6, scope: !831)
!844 = !DILocation(line: 140, column: 26, scope: !845)
!845 = distinct !DILexicalBlock(scope: !841, file: !1, line: 139, column: 16)
!846 = !DILocation(line: 140, column: 30, scope: !845)
!847 = !DILocation(line: 140, column: 37, scope: !845)
!848 = !DILocation(line: 140, column: 41, scope: !845)
!849 = !DILocation(line: 140, column: 47, scope: !845)
!850 = !DILocation(line: 140, column: 54, scope: !845)
!851 = !DILocation(line: 140, column: 3, scope: !845)
!852 = !DILocation(line: 141, column: 2, scope: !845)
!853 = !DILocation(line: 143, column: 13, scope: !854)
!854 = distinct !DILexicalBlock(scope: !841, file: !1, line: 142, column: 7)
!855 = !DILocation(line: 143, column: 20, scope: !854)
!856 = !DILocation(line: 143, column: 4, scope: !854)
!857 = !DILocation(line: 143, column: 10, scope: !854)
!858 = !DILocation(line: 145, column: 1, scope: !831)
!859 = distinct !DISubprogram(name: "ED_space_clip_get_size_fl", scope: !1, file: !1, line: 147, type: !860, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !192, !555}
!862 = !DILocalVariable(name: "sc", arg: 1, scope: !859, file: !1, line: 147, type: !192)
!863 = !DILocation(line: 147, column: 43, scope: !859)
!864 = !DILocalVariable(name: "size", arg: 2, scope: !859, file: !1, line: 147, type: !555)
!865 = !DILocation(line: 147, column: 53, scope: !859)
!866 = !DILocalVariable(name: "size_i", scope: !859, file: !1, line: 149, type: !238)
!867 = !DILocation(line: 149, column: 6, scope: !859)
!868 = !DILocation(line: 150, column: 25, scope: !859)
!869 = !DILocation(line: 150, column: 30, scope: !859)
!870 = !DILocation(line: 150, column: 42, scope: !859)
!871 = !DILocation(line: 150, column: 2, scope: !859)
!872 = !DILocation(line: 151, column: 12, scope: !859)
!873 = !DILocation(line: 151, column: 2, scope: !859)
!874 = !DILocation(line: 151, column: 10, scope: !859)
!875 = !DILocation(line: 152, column: 12, scope: !859)
!876 = !DILocation(line: 152, column: 2, scope: !859)
!877 = !DILocation(line: 152, column: 10, scope: !859)
!878 = !DILocation(line: 153, column: 1, scope: !859)
!879 = distinct !DISubprogram(name: "ED_space_clip_get_zoom", scope: !1, file: !1, line: 155, type: !880, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !705)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !192, !882, !555, !555}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !884, line: 267, baseType: !885)
!884 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !884, line: 230, size: 3072, elements: !886)
!886 = !{!887, !889, !890, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !885, file: !884, line: 231, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !885, file: !884, line: 231, baseType: !888, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !885, file: !884, line: 233, baseType: !891, size: 1280, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !892, line: 71, baseType: !893)
!892 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !892, line: 40, size: 1280, elements: !894)
!894 = !{!895, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !929}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !893, file: !892, line: 41, baseType: !896, size: 128)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !603, line: 95, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !603, line: 92, size: 128, elements: !898)
!898 = !{!899, !900, !901, !902}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !897, file: !603, line: 93, baseType: !119, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !897, file: !603, line: 93, baseType: !119, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !897, file: !603, line: 94, baseType: !119, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !897, file: !603, line: 94, baseType: !119, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !893, file: !892, line: 41, baseType: !896, size: 128, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !893, file: !892, line: 42, baseType: !602, size: 128, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !893, file: !892, line: 42, baseType: !602, size: 128, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !893, file: !892, line: 43, baseType: !602, size: 128, offset: 512)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !893, file: !892, line: 45, baseType: !297, size: 64, offset: 640)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !893, file: !892, line: 45, baseType: !297, size: 64, offset: 704)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !893, file: !892, line: 46, baseType: !119, size: 32, offset: 768)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !893, file: !892, line: 46, baseType: !119, size: 32, offset: 800)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !893, file: !892, line: 48, baseType: !156, size: 16, offset: 832)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !893, file: !892, line: 49, baseType: !156, size: 16, offset: 848)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !893, file: !892, line: 51, baseType: !156, size: 16, offset: 864)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !893, file: !892, line: 52, baseType: !156, size: 16, offset: 880)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !893, file: !892, line: 53, baseType: !156, size: 16, offset: 896)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !893, file: !892, line: 55, baseType: !156, size: 16, offset: 912)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !893, file: !892, line: 56, baseType: !156, size: 16, offset: 928)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !893, file: !892, line: 58, baseType: !156, size: 16, offset: 944)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !893, file: !892, line: 58, baseType: !156, size: 16, offset: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !893, file: !892, line: 59, baseType: !156, size: 16, offset: 976)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !893, file: !892, line: 59, baseType: !156, size: 16, offset: 992)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !893, file: !892, line: 61, baseType: !156, size: 16, offset: 1008)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !893, file: !892, line: 63, baseType: !555, size: 64, offset: 1024)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !893, file: !892, line: 64, baseType: !120, size: 32, offset: 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !893, file: !892, line: 65, baseType: !120, size: 32, offset: 1120)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !893, file: !892, line: 68, baseType: !927, size: 64, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !892, line: 68, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !893, file: !892, line: 69, baseType: !930, size: 64, offset: 1216)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !932, line: 490, size: 768, elements: !933)
!932 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!933 = !{!934, !935, !936, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !932, line: 491, baseType: !930, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !931, file: !932, line: 491, baseType: !930, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !931, file: !932, line: 493, baseType: !937, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !939, line: 169, size: 2048, elements: !940)
!939 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!940 = !{!941, !942, !943, !944, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1895, !1898, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !938, file: !939, line: 170, baseType: !937, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !938, file: !939, line: 170, baseType: !937, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !938, file: !939, line: 172, baseType: !118, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !938, file: !939, line: 174, baseType: !945, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !884, line: 49, size: 1984, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !946, file: !884, line: 50, baseType: !124, size: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !946, file: !884, line: 52, baseType: !182, size: 128, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !946, file: !884, line: 53, baseType: !182, size: 128, offset: 1088)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !946, file: !884, line: 54, baseType: !182, size: 128, offset: 1216)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !946, file: !884, line: 55, baseType: !182, size: 128, offset: 1344)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !946, file: !884, line: 57, baseType: !954, size: 64, offset: 1472)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !956, line: 1216, size: 39680, elements: !957)
!956 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!957 = !{!958, !959, !960, !963, !966, !967, !968, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !994, !1060, !1198, !1407, !1410, !1691, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1713, !1714, !1715, !1716, !1717, !1725, !1792, !1799, !1800, !1807, !1808, !1812, !1813, !1814, !1815, !1816}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !955, file: !956, line: 1217, baseType: !124, size: 960)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !955, file: !956, line: 1218, baseType: !231, size: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !955, file: !956, line: 1220, baseType: !961, size: 64, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !233, line: 43, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !955, file: !956, line: 1221, baseType: !964, size: 64, offset: 1088)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !956, line: 52, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !955, file: !956, line: 1223, baseType: !954, size: 64, offset: 1152)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !955, file: !956, line: 1225, baseType: !182, size: 128, offset: 1216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !955, file: !956, line: 1226, baseType: !969, size: 64, offset: 1344)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !956, line: 69, size: 320, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !956, line: 70, baseType: !969, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !970, file: !956, line: 70, baseType: !969, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !970, file: !956, line: 71, baseType: !5, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !970, file: !956, line: 71, baseType: !5, size: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !970, file: !956, line: 72, baseType: !120, size: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !970, file: !956, line: 73, baseType: !156, size: 16, offset: 224)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !970, file: !956, line: 73, baseType: !156, size: 16, offset: 240)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !970, file: !956, line: 74, baseType: !961, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !955, file: !956, line: 1227, baseType: !961, size: 64, offset: 1408)
