; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_cursor.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_cursor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TexSnapshot = type { i32, i32, i32, i32, float, i8 }
%struct.CursorSnapshot = type { i32, i32, i32 }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }

!250 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!251 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!252 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!253 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!254 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!255 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!256 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!257 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!258 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!259 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!260 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!261 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!262 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!263 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!264 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!265 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!266 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!267 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!268 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!269 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!270 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!271 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!272 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!273 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OverlayControlFlags", file: !6, line: 85, baseType: !7, size: 32, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DIEnumerator(name: "PAINT_INVALID_OVERLAY_TEXTURE_PRIMARY", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "PAINT_INVALID_OVERLAY_TEXTURE_SECONDARY", value: 4, isUnsigned: true)
!278 = !DIEnumerator(name: "PAINT_INVALID_OVERLAY_CURVE", value: 8, isUnsigned: true)
!279 = !DIEnumerator(name: "PAINT_OVERLAY_OVERRIDE_CURSOR", value: 16, isUnsigned: true)
!280 = !DIEnumerator(name: "PAINT_OVERLAY_OVERRIDE_PRIMARY", value: 32, isUnsigned: true)
!281 = !DIEnumerator(name: "PAINT_OVERLAY_OVERRIDE_SECONDARY", value: 64, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OverlayFlags", file: !23, line: 227, baseType: !7, size: 32, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289}
!284 = !DIEnumerator(name: "BRUSH_OVERLAY_CURSOR", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "BRUSH_OVERLAY_PRIMARY", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "BRUSH_OVERLAY_SECONDARY", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "BRUSH_OVERLAY_CURSOR_OVERRIDE_ON_STROKE", value: 8, isUnsigned: true)
!288 = !DIEnumerator(name: "BRUSH_OVERLAY_PRIMARY_OVERRIDE_ON_STROKE", value: 16, isUnsigned: true)
!289 = !DIEnumerator(name: "BRUSH_OVERLAY_SECONDARY_OVERRIDE_ON_STROKE", value: 32, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 119, baseType: !7, size: 32, elements: !292)
!291 = !DIFile(filename: "blender/source/blender/editors/include/ED_view3d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIEnumerator(name: "V3D_PROJ_TEST_NOP", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_BB", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_WIN", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_NEAR", value: 4, isUnsigned: true)
!297 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_ZERO", value: 8, isUnsigned: true)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 109, baseType: !7, size: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305}
!300 = !DIEnumerator(name: "V3D_PROJ_RET_OK", value: 0, isUnsigned: true)
!301 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_NEAR", value: 1, isUnsigned: true)
!302 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_ZERO", value: 2, isUnsigned: true)
!303 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_BB", value: 3, isUnsigned: true)
!304 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_WIN", value: 4, isUnsigned: true)
!305 = !DIEnumerator(name: "V3D_PROJ_RET_OVERFLOW", value: 5, isUnsigned: true)
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!308 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!309 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !311, line: 278, baseType: !312)
!311 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!313 = !{!0, !314, !326}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "secondary_snap", scope: !2, file: !3, line: 98, type: !316, isLocal: true, isDefinition: true)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "TexSnapshot", file: !3, line: 89, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TexSnapshot", file: !3, line: 82, size: 192, elements: !318)
!318 = !{!319, !321, !322, !323, !324, !325}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_texture", scope: !317, file: !3, line: 83, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !311, line: 272, baseType: !7)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !317, file: !3, line: 84, baseType: !24, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !317, file: !3, line: 85, baseType: !24, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "old_size", scope: !317, file: !3, line: 86, baseType: !24, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "old_zoom", scope: !317, file: !3, line: 87, baseType: !309, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "old_col", scope: !317, file: !3, line: 88, baseType: !312, size: 8, offset: 160)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "cursor_snap", scope: !2, file: !3, line: 99, type: !328, isLocal: true, isDefinition: true)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "CursorSnapshot", file: !3, line: 95, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CursorSnapshot", file: !3, line: 91, size: 96, elements: !330)
!330 = !{!331, !332, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_texture", scope: !329, file: !3, line: 92, baseType: !320, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !329, file: !3, line: 93, baseType: !24, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !329, file: !3, line: 94, baseType: !24, size: 32, offset: 64)
!334 = !{i32 7, !"Dwarf Version", i32 4}
!335 = !{i32 2, !"Debug Info Version", i32 3}
!336 = !{i32 1, !"wchar_size", i32 4}
!337 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!338 = distinct !DISubprogram(name: "paint_cursor_delete_textures", scope: !3, file: !3, line: 102, type: !339, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !341)
!339 = !DISubroutineType(types: !340)
!340 = !{null}
!341 = !{}
!342 = !DILocation(line: 104, column: 19, scope: !343)
!343 = distinct !DILexicalBlock(scope: !338, file: !3, line: 104, column: 6)
!344 = !DILocation(line: 104, column: 6, scope: !343)
!345 = !DILocation(line: 104, column: 6, scope: !338)
!346 = !DILocation(line: 105, column: 3, scope: !343)
!347 = !DILocation(line: 106, column: 21, scope: !348)
!348 = distinct !DILexicalBlock(scope: !338, file: !3, line: 106, column: 6)
!349 = !DILocation(line: 106, column: 6, scope: !348)
!350 = !DILocation(line: 106, column: 6, scope: !338)
!351 = !DILocation(line: 107, column: 3, scope: !348)
!352 = !DILocation(line: 108, column: 18, scope: !353)
!353 = distinct !DILexicalBlock(scope: !338, file: !3, line: 108, column: 6)
!354 = !DILocation(line: 108, column: 6, scope: !353)
!355 = !DILocation(line: 108, column: 6, scope: !338)
!356 = !DILocation(line: 109, column: 3, scope: !353)
!357 = !DILocation(line: 111, column: 2, scope: !338)
!358 = !DILocation(line: 112, column: 2, scope: !338)
!359 = !DILocation(line: 113, column: 2, scope: !338)
!360 = !DILocation(line: 115, column: 2, scope: !338)
!361 = !DILocation(line: 116, column: 1, scope: !338)
!362 = distinct !DISubprogram(name: "paint_cursor_start", scope: !3, file: !3, line: 1078, type: !363, scopeLine: 1079, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !341)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365, !370}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !367, line: 69, baseType: !368)
!367 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !369, line: 44, flags: DIFlagFwdDecl)
!369 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!24, !365}
!373 = !DILocalVariable(name: "C", arg: 1, scope: !362, file: !3, line: 1078, type: !365)
!374 = !DILocation(line: 1078, column: 35, scope: !362)
!375 = !DILocalVariable(name: "poll", arg: 2, scope: !362, file: !3, line: 1078, type: !370)
!376 = !DILocation(line: 1078, column: 44, scope: !362)
!377 = !DILocalVariable(name: "p", scope: !362, file: !3, line: 1080, type: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !17, line: 830, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !17, line: 813, size: 320, elements: !381)
!381 = !{!382, !2753, !2762, !2763, !2765, !2766, !2767}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !380, file: !17, line: 814, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !23, line: 54, size: 16448, elements: !385)
!385 = !{!386, !456, !551, !601, !2665, !2666, !2667, !2668, !2671, !2672, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729, !2730, !2731, !2732, !2733, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !384, file: !23, line: 55, baseType: !387, size: 960)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !388, line: 130, baseType: !389)
!388 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !388, line: 117, size: 960, elements: !390)
!390 = !{!391, !392, !393, !395, !415, !419, !421, !422, !423, !424}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !389, file: !388, line: 118, baseType: !307, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !389, file: !388, line: 118, baseType: !307, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !389, file: !388, line: 119, baseType: !394, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !389, file: !388, line: 120, baseType: !396, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !388, line: 136, size: 17600, elements: !398)
!398 = !{!399, !400, !402, !405, !410, !411, !412}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !397, file: !388, line: 137, baseType: !387, size: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !397, file: !388, line: 138, baseType: !401, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !397, file: !388, line: 139, baseType: !403, size: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !388, line: 43, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !388, line: 140, baseType: !406, size: 8192, offset: 1088)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 8192, elements: !408)
!407 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!408 = !{!409}
!409 = !DISubrange(count: 1024)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !397, file: !388, line: 141, baseType: !406, size: 8192, offset: 9280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !397, file: !388, line: 148, baseType: !396, size: 64, offset: 17472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !397, file: !388, line: 150, baseType: !413, size: 64, offset: 17536)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !388, line: 45, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !388, line: 121, baseType: !416, size: 528, offset: 256)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 528, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 66)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !389, file: !388, line: 126, baseType: !420, size: 16, offset: 784)
!420 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !389, file: !388, line: 127, baseType: !24, size: 32, offset: 800)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !389, file: !388, line: 128, baseType: !24, size: 32, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !389, file: !388, line: 128, baseType: !24, size: 32, offset: 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !389, file: !388, line: 129, baseType: !425, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !388, line: 75, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !388, line: 62, size: 1024, elements: !428)
!428 = !{!429, !431, !432, !433, !434, !435, !439, !440, !454, !455}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !427, file: !388, line: 63, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !427, file: !388, line: 63, baseType: !430, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !388, line: 64, baseType: !407, size: 8, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !427, file: !388, line: 64, baseType: !407, size: 8, offset: 136)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !427, file: !388, line: 65, baseType: !420, size: 16, offset: 144)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !427, file: !388, line: 66, baseType: !436, size: 512, offset: 160)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 512, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !427, file: !388, line: 67, baseType: !24, size: 32, offset: 672)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !427, file: !388, line: 69, baseType: !441, size: 256, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !388, line: 60, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !388, line: 48, size: 256, elements: !443)
!443 = !{!444, !445, !452, !453}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !442, file: !388, line: 49, baseType: !307, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !442, file: !388, line: 58, baseType: !446, size: 128, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !447, line: 71, baseType: !448)
!447 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !447, line: 69, size: 128, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !448, file: !447, line: 70, baseType: !307, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !448, file: !447, line: 70, baseType: !307, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !442, file: !388, line: 59, baseType: !24, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !442, file: !388, line: 59, baseType: !24, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !427, file: !388, line: 70, baseType: !24, size: 32, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !427, file: !388, line: 74, baseType: !24, size: 32, offset: 992)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !384, file: !23, line: 57, baseType: !457, size: 192, offset: 960)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrushClone", file: !23, line: 48, size: 192, elements: !458)
!458 = !{!459, !547, !549, !550}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !457, file: !23, line: 49, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !462, line: 77, size: 15424, elements: !463)
!462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = !{!464, !465, !466, !469, !472, !475, !478, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !528, !529, !530, !536, !537, !541}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !461, file: !462, line: 78, baseType: !387, size: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !462, line: 80, baseType: !406, size: 8192, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !461, file: !462, line: 82, baseType: !467, size: 64, offset: 9152)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !462, line: 43, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !461, file: !462, line: 83, baseType: !470, size: 64, offset: 9216)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !388, line: 46, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !461, file: !462, line: 86, baseType: !473, size: 64, offset: 9280)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !462, line: 41, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !461, file: !462, line: 87, baseType: !476, size: 64, offset: 9344)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !462, line: 44, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !461, file: !462, line: 89, baseType: !479, size: 512, offset: 9408)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 512, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !461, file: !462, line: 90, baseType: !420, size: 16, offset: 9920)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !461, file: !462, line: 90, baseType: !420, size: 16, offset: 9936)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !461, file: !462, line: 92, baseType: !420, size: 16, offset: 9952)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !462, line: 92, baseType: !420, size: 16, offset: 9968)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !461, file: !462, line: 93, baseType: !420, size: 16, offset: 9984)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !461, file: !462, line: 93, baseType: !420, size: 16, offset: 10000)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !461, file: !462, line: 94, baseType: !24, size: 32, offset: 10016)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !461, file: !462, line: 97, baseType: !420, size: 16, offset: 10048)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !461, file: !462, line: 97, baseType: !420, size: 16, offset: 10064)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !461, file: !462, line: 98, baseType: !420, size: 16, offset: 10080)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !461, file: !462, line: 98, baseType: !420, size: 16, offset: 10096)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !461, file: !462, line: 99, baseType: !420, size: 16, offset: 10112)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !461, file: !462, line: 99, baseType: !420, size: 16, offset: 10128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !461, file: !462, line: 100, baseType: !7, size: 32, offset: 10144)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !461, file: !462, line: 101, baseType: !497, size: 64, offset: 10176)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !461, file: !462, line: 103, baseType: !413, size: 64, offset: 10240)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !461, file: !462, line: 104, baseType: !500, size: 64, offset: 10304)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !388, line: 159, size: 448, elements: !502)
!502 = !{!503, !507, !508, !510, !511, !513}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !501, file: !388, line: 161, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 2)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !501, file: !388, line: 162, baseType: !504, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !501, file: !388, line: 163, baseType: !509, size: 32, offset: 128)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 32, elements: !505)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !501, file: !388, line: 164, baseType: !509, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !501, file: !388, line: 165, baseType: !512, size: 128, offset: 192)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 128, elements: !505)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !501, file: !388, line: 166, baseType: !514, size: 128, offset: 320)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 128, elements: !505)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !461, file: !462, line: 107, baseType: !309, size: 32, offset: 10368)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !461, file: !462, line: 108, baseType: !24, size: 32, offset: 10400)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !461, file: !462, line: 109, baseType: !420, size: 16, offset: 10432)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !461, file: !462, line: 110, baseType: !420, size: 16, offset: 10448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !461, file: !462, line: 113, baseType: !24, size: 32, offset: 10464)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !461, file: !462, line: 113, baseType: !24, size: 32, offset: 10496)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !461, file: !462, line: 114, baseType: !407, size: 8, offset: 10528)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !461, file: !462, line: 114, baseType: !407, size: 8, offset: 10536)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !461, file: !462, line: 115, baseType: !420, size: 16, offset: 10544)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !461, file: !462, line: 116, baseType: !525, size: 128, offset: 10560)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 128, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 4)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !461, file: !462, line: 119, baseType: !309, size: 32, offset: 10688)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !461, file: !462, line: 119, baseType: !309, size: 32, offset: 10720)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !461, file: !462, line: 122, baseType: !531, size: 512, offset: 10752)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !532, line: 182, baseType: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !532, line: 180, size: 512, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !532, line: 181, baseType: !436, size: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !461, file: !462, line: 123, baseType: !407, size: 8, offset: 11264)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !461, file: !462, line: 125, baseType: !538, size: 56, offset: 11272)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 56, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 7)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !461, file: !462, line: 126, baseType: !542, size: 4096, offset: 11328)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 4096, elements: !480)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !462, line: 69, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !462, line: 67, size: 512, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !544, file: !462, line: 68, baseType: !436, size: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !457, file: !23, line: 50, baseType: !548, size: 64, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 64, elements: !505)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !457, file: !23, line: 51, baseType: !309, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !457, file: !23, line: 51, baseType: !309, size: 32, offset: 160)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !384, file: !23, line: 58, baseType: !552, size: 64, offset: 1152)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !532, line: 72, size: 3072, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !568, !569, !594, !598, !599, !600}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !553, file: !532, line: 73, baseType: !24, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !553, file: !532, line: 73, baseType: !24, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !553, file: !532, line: 74, baseType: !24, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !553, file: !532, line: 75, baseType: !24, size: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !553, file: !532, line: 77, baseType: !560, size: 128, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !561, line: 95, baseType: !562)
!561 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !561, line: 92, size: 128, elements: !563)
!563 = !{!564, !565, !566, !567}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !562, file: !561, line: 93, baseType: !309, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !562, file: !561, line: 93, baseType: !309, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !562, file: !561, line: 94, baseType: !309, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !562, file: !561, line: 94, baseType: !309, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !553, file: !532, line: 77, baseType: !560, size: 128, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !553, file: !532, line: 79, baseType: !570, size: 2304, offset: 384)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 2304, elements: !526)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !532, line: 67, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !532, line: 55, size: 576, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !590, !591, !592, !593}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !572, file: !532, line: 56, baseType: !420, size: 16)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !572, file: !532, line: 56, baseType: !420, size: 16, offset: 16)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !572, file: !532, line: 58, baseType: !309, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !572, file: !532, line: 59, baseType: !309, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !572, file: !532, line: 59, baseType: !309, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !572, file: !532, line: 60, baseType: !548, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !572, file: !532, line: 60, baseType: !548, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !572, file: !532, line: 61, baseType: !582, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !532, line: 47, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !532, line: 44, size: 96, elements: !585)
!585 = !{!586, !587, !588, !589}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !584, file: !532, line: 45, baseType: !309, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !584, file: !532, line: 45, baseType: !309, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !532, line: 46, baseType: !420, size: 16, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !584, file: !532, line: 46, baseType: !420, size: 16, offset: 80)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !572, file: !532, line: 62, baseType: !582, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !572, file: !532, line: 64, baseType: !582, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !572, file: !532, line: 65, baseType: !548, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !572, file: !532, line: 66, baseType: !548, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !553, file: !532, line: 80, baseType: !595, size: 96, offset: 2688)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 96, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 3)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !553, file: !532, line: 80, baseType: !595, size: 96, offset: 2784)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !553, file: !532, line: 81, baseType: !595, size: 96, offset: 2880)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !553, file: !532, line: 83, baseType: !595, size: 96, offset: 2976)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !384, file: !23, line: 59, baseType: !602, size: 2496, offset: 1216)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !603, line: 57, size: 2496, elements: !604)
!603 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!604 = !{!605, !606, !607, !608, !609, !2464, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !602, file: !603, line: 59, baseType: !420, size: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !602, file: !603, line: 59, baseType: !420, size: 16, offset: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !602, file: !603, line: 59, baseType: !420, size: 16, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !602, file: !603, line: 59, baseType: !420, size: 16, offset: 48)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !602, file: !603, line: 60, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !612, line: 115, size: 11392, elements: !613)
!612 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!613 = !{!614, !615, !618, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !717, !726, !740, !741, !783, !784, !787, !788, !804, !805, !806, !807, !808, !809, !810, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2381, !2384, !2385, !2386, !2387, !2388, !2389, !2392, !2414, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2426, !2429, !2432, !2433, !2452, !2453}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !611, file: !612, line: 116, baseType: !387, size: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !611, file: !612, line: 117, baseType: !616, size: 64, offset: 960)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !603, line: 45, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !611, file: !612, line: 119, baseType: !619, size: 64, offset: 1024)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 155, size: 1856, elements: !621)
!621 = !{!622, !625, !628, !631, !634, !635, !636, !638, !658, !660, !664, !667, !668, !669, !670, !673, !676, !677, !678, !679, !680, !684, !685, !686, !687, !688, !692, !693, !696, !699, !700, !701, !702}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !620, file: !6, line: 157, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !6, line: 157, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !620, file: !6, line: 158, baseType: !626, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !6, line: 49, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !620, file: !6, line: 159, baseType: !629, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !6, line: 159, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !620, file: !6, line: 160, baseType: !632, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !6, line: 160, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !620, file: !6, line: 161, baseType: !24, size: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !620, file: !6, line: 161, baseType: !24, size: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !620, file: !6, line: 162, baseType: !637, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !620, file: !6, line: 163, baseType: !639, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !641, line: 45, size: 1472, elements: !642)
!641 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !641, line: 46, baseType: !639, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !641, line: 46, baseType: !639, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !640, file: !641, line: 48, baseType: !309, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !640, file: !641, line: 51, baseType: !309, size: 32, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !640, file: !641, line: 53, baseType: !420, size: 16, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !640, file: !641, line: 54, baseType: !420, size: 16, offset: 208)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !640, file: !641, line: 56, baseType: !420, size: 16, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !640, file: !641, line: 57, baseType: !420, size: 16, offset: 240)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !640, file: !641, line: 59, baseType: !24, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !640, file: !641, line: 60, baseType: !24, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !640, file: !641, line: 62, baseType: !307, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !641, line: 63, baseType: !436, size: 512, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !640, file: !641, line: 64, baseType: !436, size: 512, offset: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !640, file: !641, line: 67, baseType: !309, size: 32, offset: 1408)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !640, file: !641, line: 68, baseType: !309, size: 32, offset: 1440)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !620, file: !6, line: 164, baseType: !659, size: 64, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !620, file: !6, line: 167, baseType: !661, size: 64, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !6, line: 44, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !620, file: !6, line: 170, baseType: !665, size: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !6, line: 39, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !620, file: !6, line: 171, baseType: !24, size: 32, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !620, file: !6, line: 172, baseType: !24, size: 32, offset: 672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !620, file: !6, line: 173, baseType: !312, size: 8, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !620, file: !6, line: 175, baseType: !671, size: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !6, line: 175, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !620, file: !6, line: 178, baseType: !674, size: 64, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !6, line: 55, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !620, file: !6, line: 179, baseType: !312, size: 8, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !620, file: !6, line: 182, baseType: !312, size: 8, offset: 904)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !620, file: !6, line: 183, baseType: !637, size: 64, offset: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !620, file: !6, line: 184, baseType: !637, size: 64, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !620, file: !6, line: 185, baseType: !681, size: 64, offset: 1088)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 288, elements: !683)
!683 = !{!597, !597}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !620, file: !6, line: 188, baseType: !312, size: 8, offset: 1152)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !620, file: !6, line: 191, baseType: !7, size: 32, offset: 1184)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !620, file: !6, line: 191, baseType: !497, size: 64, offset: 1216)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !620, file: !6, line: 191, baseType: !7, size: 32, offset: 1280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !620, file: !6, line: 192, baseType: !689, size: 64, offset: 1344)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !691, line: 33, flags: DIFlagFwdDecl)
!691 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_brush.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!692 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !620, file: !6, line: 195, baseType: !637, size: 64, offset: 1408)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !620, file: !6, line: 197, baseType: !694, size: 64, offset: 1472)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !6, line: 197, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !620, file: !6, line: 198, baseType: !697, size: 64, offset: 1536)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !6, line: 59, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !620, file: !6, line: 201, baseType: !312, size: 8, offset: 1600)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !620, file: !6, line: 202, baseType: !595, size: 96, offset: 1632)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !620, file: !6, line: 204, baseType: !595, size: 96, offset: 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !620, file: !6, line: 205, baseType: !24, size: 32, offset: 1824)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !612, line: 121, baseType: !420, size: 16, offset: 1088)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !611, file: !612, line: 121, baseType: !420, size: 16, offset: 1104)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !611, file: !612, line: 122, baseType: !24, size: 32, offset: 1120)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !611, file: !612, line: 122, baseType: !24, size: 32, offset: 1152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !611, file: !612, line: 122, baseType: !24, size: 32, offset: 1184)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !611, file: !612, line: 123, baseType: !436, size: 512, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !611, file: !612, line: 124, baseType: !610, size: 64, offset: 1728)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !611, file: !612, line: 124, baseType: !610, size: 64, offset: 1792)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !611, file: !612, line: 127, baseType: !610, size: 64, offset: 1856)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !611, file: !612, line: 127, baseType: !610, size: 64, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !611, file: !612, line: 127, baseType: !610, size: 64, offset: 1984)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !611, file: !612, line: 128, baseType: !715, size: 64, offset: 2048)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !603, line: 46, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !611, file: !612, line: 130, baseType: !718, size: 64, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !612, line: 97, size: 832, elements: !720)
!720 = !{!721, !724, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !719, file: !612, line: 98, baseType: !722, size: 768)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 768, elements: !723)
!723 = !{!481, !597}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !719, file: !612, line: 99, baseType: !24, size: 32, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !719, file: !612, line: 99, baseType: !24, size: 32, offset: 800)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !611, file: !612, line: 131, baseType: !727, size: 64, offset: 2176)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !729, line: 486, size: 1600, elements: !730)
!729 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !728, file: !729, line: 487, baseType: !387, size: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !728, file: !729, line: 489, baseType: !446, size: 128, offset: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !728, file: !729, line: 490, baseType: !446, size: 128, offset: 1088)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !728, file: !729, line: 491, baseType: !446, size: 128, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !728, file: !729, line: 492, baseType: !446, size: 128, offset: 1344)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !728, file: !729, line: 494, baseType: !24, size: 32, offset: 1472)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !728, file: !729, line: 495, baseType: !24, size: 32, offset: 1504)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !728, file: !729, line: 497, baseType: !24, size: 32, offset: 1536)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !728, file: !729, line: 498, baseType: !24, size: 32, offset: 1568)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !611, file: !612, line: 132, baseType: !727, size: 64, offset: 2240)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !611, file: !612, line: 133, baseType: !742, size: 64, offset: 2304)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !729, line: 334, size: 1728, elements: !744)
!744 = !{!745, !746, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !782}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !743, file: !729, line: 335, baseType: !446, size: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !743, file: !729, line: 336, baseType: !747, size: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !749, line: 51, flags: DIFlagFwdDecl)
!749 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !729, line: 338, baseType: !420, size: 16, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !743, file: !729, line: 338, baseType: !420, size: 16, offset: 208)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !743, file: !729, line: 339, baseType: !7, size: 32, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !743, file: !729, line: 340, baseType: !24, size: 32, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !743, file: !729, line: 342, baseType: !309, size: 32, offset: 288)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !743, file: !729, line: 343, baseType: !595, size: 96, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !743, file: !729, line: 344, baseType: !595, size: 96, offset: 416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !743, file: !729, line: 347, baseType: !446, size: 128, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !743, file: !729, line: 349, baseType: !24, size: 32, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !743, file: !729, line: 350, baseType: !24, size: 32, offset: 672)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !743, file: !729, line: 351, baseType: !307, size: 64, offset: 704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !743, file: !729, line: 352, baseType: !307, size: 64, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !743, file: !729, line: 354, baseType: !763, size: 384, offset: 832)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !729, line: 116, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !729, line: 94, size: 384, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !764, file: !729, line: 96, baseType: !24, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !764, file: !729, line: 96, baseType: !24, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !764, file: !729, line: 97, baseType: !24, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !764, file: !729, line: 97, baseType: !24, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !764, file: !729, line: 99, baseType: !420, size: 16, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !764, file: !729, line: 100, baseType: !420, size: 16, offset: 144)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !764, file: !729, line: 102, baseType: !420, size: 16, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !764, file: !729, line: 105, baseType: !420, size: 16, offset: 176)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !764, file: !729, line: 108, baseType: !420, size: 16, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !764, file: !729, line: 109, baseType: !420, size: 16, offset: 208)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !764, file: !729, line: 111, baseType: !420, size: 16, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !764, file: !729, line: 112, baseType: !420, size: 16, offset: 240)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !764, file: !729, line: 114, baseType: !24, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !764, file: !729, line: 114, baseType: !24, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !764, file: !729, line: 115, baseType: !24, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !764, file: !729, line: 115, baseType: !24, size: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !743, file: !729, line: 355, baseType: !436, size: 512, offset: 1216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !611, file: !612, line: 134, baseType: !307, size: 64, offset: 2368)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !611, file: !612, line: 136, baseType: !785, size: 64, offset: 2432)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !612, line: 58, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !611, file: !612, line: 138, baseType: !763, size: 384, offset: 2496)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !611, file: !612, line: 139, baseType: !789, size: 64, offset: 2880)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !729, line: 80, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !729, line: 72, size: 192, elements: !792)
!792 = !{!793, !800, !801, !802, !803}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !791, file: !729, line: 73, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !729, line: 59, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !729, line: 56, size: 128, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !796, file: !729, line: 57, baseType: !595, size: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !796, file: !729, line: 58, baseType: !24, size: 32, offset: 96)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !791, file: !729, line: 74, baseType: !24, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !791, file: !729, line: 76, baseType: !24, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !791, file: !729, line: 77, baseType: !24, size: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !791, file: !729, line: 79, baseType: !24, size: 32, offset: 160)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !611, file: !612, line: 141, baseType: !446, size: 128, offset: 2944)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !611, file: !612, line: 142, baseType: !446, size: 128, offset: 3072)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !611, file: !612, line: 143, baseType: !446, size: 128, offset: 3200)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !611, file: !612, line: 144, baseType: !446, size: 128, offset: 3328)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !611, file: !612, line: 146, baseType: !24, size: 32, offset: 3456)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !611, file: !612, line: 147, baseType: !24, size: 32, offset: 3488)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !611, file: !612, line: 150, baseType: !811, size: 64, offset: 3520)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !814, line: 93, size: 7552, elements: !815)
!814 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !864, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !974, !2251, !2252, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2292}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !813, file: !814, line: 94, baseType: !387, size: 960)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !813, file: !814, line: 95, baseType: !616, size: 64, offset: 960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !813, file: !814, line: 97, baseType: !420, size: 16, offset: 1024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !813, file: !814, line: 97, baseType: !420, size: 16, offset: 1040)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !813, file: !814, line: 99, baseType: !309, size: 32, offset: 1056)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !813, file: !814, line: 99, baseType: !309, size: 32, offset: 1088)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !813, file: !814, line: 99, baseType: !309, size: 32, offset: 1120)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !813, file: !814, line: 100, baseType: !309, size: 32, offset: 1152)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !813, file: !814, line: 100, baseType: !309, size: 32, offset: 1184)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !813, file: !814, line: 100, baseType: !309, size: 32, offset: 1216)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !813, file: !814, line: 101, baseType: !309, size: 32, offset: 1248)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !813, file: !814, line: 101, baseType: !309, size: 32, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !813, file: !814, line: 101, baseType: !309, size: 32, offset: 1312)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !813, file: !814, line: 102, baseType: !309, size: 32, offset: 1344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !813, file: !814, line: 102, baseType: !309, size: 32, offset: 1376)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !813, file: !814, line: 102, baseType: !309, size: 32, offset: 1408)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !813, file: !814, line: 103, baseType: !309, size: 32, offset: 1440)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !813, file: !814, line: 103, baseType: !309, size: 32, offset: 1472)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !813, file: !814, line: 103, baseType: !309, size: 32, offset: 1504)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !813, file: !814, line: 103, baseType: !309, size: 32, offset: 1536)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !813, file: !814, line: 103, baseType: !309, size: 32, offset: 1568)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !813, file: !814, line: 104, baseType: !309, size: 32, offset: 1600)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !813, file: !814, line: 104, baseType: !309, size: 32, offset: 1632)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !813, file: !814, line: 104, baseType: !309, size: 32, offset: 1664)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !813, file: !814, line: 104, baseType: !309, size: 32, offset: 1696)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !813, file: !814, line: 104, baseType: !309, size: 32, offset: 1728)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !813, file: !814, line: 105, baseType: !309, size: 32, offset: 1760)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !813, file: !814, line: 108, baseType: !844, size: 704, offset: 1792)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !814, line: 53, size: 704, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !844, file: !814, line: 54, baseType: !309, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !844, file: !814, line: 55, baseType: !309, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !844, file: !814, line: 56, baseType: !309, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !844, file: !814, line: 57, baseType: !309, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !844, file: !814, line: 59, baseType: !595, size: 96, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !844, file: !814, line: 60, baseType: !595, size: 96, offset: 224)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !844, file: !814, line: 61, baseType: !595, size: 96, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !844, file: !814, line: 63, baseType: !309, size: 32, offset: 416)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !844, file: !814, line: 64, baseType: !309, size: 32, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !844, file: !814, line: 65, baseType: !309, size: 32, offset: 480)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !844, file: !814, line: 67, baseType: !420, size: 16, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !844, file: !814, line: 68, baseType: !420, size: 16, offset: 528)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !844, file: !814, line: 69, baseType: !420, size: 16, offset: 544)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !844, file: !814, line: 70, baseType: !420, size: 16, offset: 560)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !844, file: !814, line: 72, baseType: !309, size: 32, offset: 576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !844, file: !814, line: 73, baseType: !309, size: 32, offset: 608)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !844, file: !814, line: 74, baseType: !309, size: 32, offset: 640)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !844, file: !814, line: 75, baseType: !309, size: 32, offset: 672)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !813, file: !814, line: 109, baseType: !865, size: 128, offset: 2496)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !814, line: 79, size: 128, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !865, file: !814, line: 80, baseType: !24, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !865, file: !814, line: 81, baseType: !24, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !865, file: !814, line: 82, baseType: !24, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !865, file: !814, line: 83, baseType: !24, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !813, file: !814, line: 111, baseType: !309, size: 32, offset: 2624)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !813, file: !814, line: 111, baseType: !309, size: 32, offset: 2656)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !813, file: !814, line: 112, baseType: !309, size: 32, offset: 2688)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !813, file: !814, line: 112, baseType: !309, size: 32, offset: 2720)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !813, file: !814, line: 113, baseType: !309, size: 32, offset: 2752)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !813, file: !814, line: 114, baseType: !309, size: 32, offset: 2784)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !813, file: !814, line: 114, baseType: !309, size: 32, offset: 2816)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !813, file: !814, line: 115, baseType: !420, size: 16, offset: 2848)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !813, file: !814, line: 115, baseType: !420, size: 16, offset: 2864)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !813, file: !814, line: 116, baseType: !420, size: 16, offset: 2880)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !813, file: !814, line: 117, baseType: !407, size: 8, offset: 2896)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !813, file: !814, line: 117, baseType: !407, size: 8, offset: 2904)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !813, file: !814, line: 119, baseType: !309, size: 32, offset: 2912)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !813, file: !814, line: 119, baseType: !309, size: 32, offset: 2944)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !813, file: !814, line: 120, baseType: !420, size: 16, offset: 2976)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !813, file: !814, line: 120, baseType: !420, size: 16, offset: 2992)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !813, file: !814, line: 121, baseType: !309, size: 32, offset: 3008)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !813, file: !814, line: 121, baseType: !309, size: 32, offset: 3040)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !813, file: !814, line: 122, baseType: !309, size: 32, offset: 3072)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !813, file: !814, line: 123, baseType: !309, size: 32, offset: 3104)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !813, file: !814, line: 124, baseType: !420, size: 16, offset: 3136)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !813, file: !814, line: 125, baseType: !420, size: 16, offset: 3152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !813, file: !814, line: 127, baseType: !24, size: 32, offset: 3168)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !813, file: !814, line: 127, baseType: !24, size: 32, offset: 3200)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !813, file: !814, line: 128, baseType: !24, size: 32, offset: 3232)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !813, file: !814, line: 128, baseType: !24, size: 32, offset: 3264)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !813, file: !814, line: 129, baseType: !420, size: 16, offset: 3296)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !813, file: !814, line: 129, baseType: !420, size: 16, offset: 3312)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !813, file: !814, line: 129, baseType: !420, size: 16, offset: 3328)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !813, file: !814, line: 129, baseType: !420, size: 16, offset: 3344)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !813, file: !814, line: 130, baseType: !309, size: 32, offset: 3360)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !813, file: !814, line: 130, baseType: !309, size: 32, offset: 3392)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !813, file: !814, line: 130, baseType: !309, size: 32, offset: 3424)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !813, file: !814, line: 130, baseType: !309, size: 32, offset: 3456)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !813, file: !814, line: 131, baseType: !309, size: 32, offset: 3488)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !813, file: !814, line: 131, baseType: !309, size: 32, offset: 3520)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !813, file: !814, line: 131, baseType: !309, size: 32, offset: 3552)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !813, file: !814, line: 131, baseType: !309, size: 32, offset: 3584)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !813, file: !814, line: 132, baseType: !309, size: 32, offset: 3616)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !813, file: !814, line: 132, baseType: !309, size: 32, offset: 3648)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !813, file: !814, line: 133, baseType: !436, size: 512, offset: 3680)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !813, file: !814, line: 135, baseType: !309, size: 32, offset: 4192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !813, file: !814, line: 136, baseType: !309, size: 32, offset: 4224)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !813, file: !814, line: 137, baseType: !309, size: 32, offset: 4256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !813, file: !814, line: 138, baseType: !24, size: 32, offset: 4288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !813, file: !814, line: 141, baseType: !407, size: 8, offset: 4320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !813, file: !814, line: 141, baseType: !407, size: 8, offset: 4328)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !813, file: !814, line: 141, baseType: !407, size: 8, offset: 4336)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !813, file: !814, line: 141, baseType: !407, size: 8, offset: 4344)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !813, file: !814, line: 142, baseType: !420, size: 16, offset: 4352)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !813, file: !814, line: 142, baseType: !420, size: 16, offset: 4368)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !813, file: !814, line: 142, baseType: !420, size: 16, offset: 4384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !813, file: !814, line: 145, baseType: !407, size: 8, offset: 4400)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !813, file: !814, line: 145, baseType: !407, size: 8, offset: 4408)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !813, file: !814, line: 148, baseType: !420, size: 16, offset: 4416)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !813, file: !814, line: 148, baseType: !420, size: 16, offset: 4432)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !813, file: !814, line: 149, baseType: !309, size: 32, offset: 4448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !813, file: !814, line: 149, baseType: !309, size: 32, offset: 4480)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !813, file: !814, line: 152, baseType: !525, size: 128, offset: 4512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !813, file: !814, line: 153, baseType: !309, size: 32, offset: 4640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !813, file: !814, line: 154, baseType: !309, size: 32, offset: 4672)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !813, file: !814, line: 157, baseType: !420, size: 16, offset: 4704)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !813, file: !814, line: 157, baseType: !420, size: 16, offset: 4720)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !813, file: !814, line: 160, baseType: !935, size: 64, offset: 4736)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !603, line: 113, size: 6208, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !947}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !936, file: !603, line: 114, baseType: !420, size: 16)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !936, file: !603, line: 114, baseType: !420, size: 16, offset: 16)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !936, file: !603, line: 115, baseType: !407, size: 8, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !936, file: !603, line: 115, baseType: !407, size: 8, offset: 40)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !936, file: !603, line: 116, baseType: !407, size: 8, offset: 48)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !936, file: !603, line: 117, baseType: !944, size: 8, offset: 56)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 8, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 1)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !936, file: !603, line: 119, baseType: !948, size: 6144, offset: 64)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 6144, elements: !958)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !603, line: 109, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !603, line: 106, size: 192, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !950, file: !603, line: 107, baseType: !309, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !950, file: !603, line: 107, baseType: !309, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !950, file: !603, line: 107, baseType: !309, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !950, file: !603, line: 107, baseType: !309, size: 32, offset: 96)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !950, file: !603, line: 107, baseType: !309, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !950, file: !603, line: 108, baseType: !24, size: 32, offset: 160)
!958 = !{!959}
!959 = !DISubrange(count: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !813, file: !814, line: 161, baseType: !935, size: 64, offset: 4800)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !813, file: !814, line: 162, baseType: !407, size: 8, offset: 4864)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !813, file: !814, line: 162, baseType: !407, size: 8, offset: 4872)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !813, file: !814, line: 163, baseType: !407, size: 8, offset: 4880)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !813, file: !814, line: 163, baseType: !407, size: 8, offset: 4888)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !813, file: !814, line: 164, baseType: !420, size: 16, offset: 4896)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !813, file: !814, line: 164, baseType: !420, size: 16, offset: 4912)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !813, file: !814, line: 165, baseType: !309, size: 32, offset: 4928)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !813, file: !814, line: 165, baseType: !309, size: 32, offset: 4960)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !813, file: !814, line: 167, baseType: !970, size: 1152, offset: 4992)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 1152, elements: !972)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!972 = !{!973}
!973 = !DISubrange(count: 18)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !813, file: !814, line: 168, baseType: !975, size: 64, offset: 6144)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !977, line: 328, size: 3456, elements: !978)
!977 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!978 = !{!979, !980, !981, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2229, !2230, !2231, !2234, !2238, !2242, !2246, !2247, !2248, !2249, !2250}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !976, file: !977, line: 329, baseType: !387, size: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !976, file: !977, line: 330, baseType: !616, size: 64, offset: 960)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !976, file: !977, line: 332, baseType: !982, size: 64, offset: 1024)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !984, line: 283, size: 4096, elements: !985)
!984 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!985 = !{!986, !987, !988, !989, !993, !994, !998, !1475, !2177, !2181, !2187, !2191, !2192, !2193, !2194, !2198, !2199}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !984, line: 284, baseType: !24, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !983, file: !984, line: 285, baseType: !436, size: 512, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !983, file: !984, line: 287, baseType: !436, size: 512, offset: 544)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !983, file: !984, line: 288, baseType: !990, size: 2048, offset: 1056)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 2048, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !983, file: !984, line: 289, baseType: !24, size: 32, offset: 3104)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !983, file: !984, line: 292, baseType: !995, size: 64, offset: 3136)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !975}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !983, file: !984, line: 293, baseType: !999, size: 64, offset: 3200)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null, !975, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !977, line: 167, size: 3712, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !977, line: 168, baseType: !1002, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1003, file: !977, line: 168, baseType: !1002, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !1003, file: !977, line: 168, baseType: !1002, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1003, file: !977, line: 170, baseType: !425, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1003, file: !977, line: 172, baseType: !1010, size: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !984, line: 144, size: 6016, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1187, !1188, !1189, !1279, !1283, !1287, !1288, !1358, !1362, !1366, !1367, !1368, !1369, !1373, !1374, !1378, !1382, !1386, !1390, !1394, !1398, !1402, !1403, !1410, !1412, !1421, !1430}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1011, file: !984, line: 145, baseType: !307, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1011, file: !984, line: 145, baseType: !307, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !1011, file: !984, line: 146, baseType: !420, size: 16, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1011, file: !984, line: 148, baseType: !436, size: 512, offset: 144)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1011, file: !984, line: 149, baseType: !24, size: 32, offset: 672)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1011, file: !984, line: 151, baseType: !436, size: 512, offset: 704)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1011, file: !984, line: 152, baseType: !990, size: 2048, offset: 1216)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1011, file: !984, line: 153, baseType: !24, size: 32, offset: 3264)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1011, file: !984, line: 155, baseType: !309, size: 32, offset: 3296)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !1011, file: !984, line: 155, baseType: !309, size: 32, offset: 3328)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !1011, file: !984, line: 155, baseType: !309, size: 32, offset: 3360)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1011, file: !984, line: 156, baseType: !309, size: 32, offset: 3392)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !1011, file: !984, line: 156, baseType: !309, size: 32, offset: 3424)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !1011, file: !984, line: 156, baseType: !309, size: 32, offset: 3456)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !1011, file: !984, line: 157, baseType: !420, size: 16, offset: 3488)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1011, file: !984, line: 157, baseType: !420, size: 16, offset: 3504)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !1011, file: !984, line: 157, baseType: !420, size: 16, offset: 3520)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1011, file: !984, line: 160, baseType: !1031, size: 64, offset: 3584)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !984, line: 109, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !984, line: 98, size: 1408, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1186}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1033, file: !984, line: 99, baseType: !24, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1033, file: !984, line: 99, baseType: !24, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1033, file: !984, line: 100, baseType: !436, size: 512, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !1033, file: !984, line: 101, baseType: !309, size: 32, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1033, file: !984, line: 101, baseType: !309, size: 32, offset: 608)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !1033, file: !984, line: 101, baseType: !309, size: 32, offset: 640)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !1033, file: !984, line: 101, baseType: !309, size: 32, offset: 672)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1033, file: !984, line: 102, baseType: !309, size: 32, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1033, file: !984, line: 102, baseType: !309, size: 32, offset: 736)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1033, file: !984, line: 103, baseType: !24, size: 32, offset: 768)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1033, file: !984, line: 104, baseType: !24, size: 32, offset: 800)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !1033, file: !984, line: 107, baseType: !1047, size: 64, offset: 832)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !977, line: 87, size: 2816, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1171}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !977, line: 88, baseType: !1047, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1048, file: !977, line: 88, baseType: !1047, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !1048, file: !977, line: 88, baseType: !1047, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1048, file: !977, line: 90, baseType: !425, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1048, file: !977, line: 92, baseType: !436, size: 512, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !977, line: 94, baseType: !436, size: 512, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !1048, file: !977, line: 99, baseType: !307, size: 64, offset: 1280)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1048, file: !977, line: 101, baseType: !420, size: 16, offset: 1344)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1048, file: !977, line: 101, baseType: !420, size: 16, offset: 1360)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1048, file: !977, line: 102, baseType: !420, size: 16, offset: 1376)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !1048, file: !977, line: 103, baseType: !420, size: 16, offset: 1392)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1048, file: !977, line: 104, baseType: !1062, size: 64, offset: 1408)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !984, line: 114, size: 1600, elements: !1064)
!1064 = !{!1065, !1066, !1087, !1091, !1095, !1099, !1103, !1107, !1108, !1112, !1141, !1142, !1143}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1063, file: !984, line: 115, baseType: !436, size: 512)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1063, file: !984, line: 117, baseType: !1067, size: 64, offset: 512)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !1070, !1071, !1074, !1074, !1085}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1073, line: 46, flags: DIFlagFwdDecl)
!1073 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !369, line: 55, size: 192, elements: !1076)
!1076 = !{!1077, !1081, !1084}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1075, file: !369, line: 58, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !369, line: 56, size: 64, elements: !1079)
!1079 = !{!1080}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1078, file: !369, line: 57, baseType: !307, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1075, file: !369, line: 60, baseType: !1082, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !369, line: 41, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !369, line: 61, baseType: !307, size: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !1063, file: !984, line: 118, baseType: !1088, size: 64, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !1070, !1074, !1074, !659}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !1063, file: !984, line: 120, baseType: !1092, size: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !1070, !1071, !1074}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !1063, file: !984, line: 121, baseType: !1096, size: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !1070, !1074, !659}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !1063, file: !984, line: 122, baseType: !1100, size: 64, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
