; ModuleID = 'blender/source/blender/blenkernel/intern/seqeffects.c'
source_filename = "blender/source/blender/blenkernel/intern/seqeffects.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !70, globals: !127, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/seqeffects.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !35, !64}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 335, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!9 = !DIEnumerator(name: "SEQ_LEFTSEL", value: 2)
!10 = !DIEnumerator(name: "SEQ_RIGHTSEL", value: 4)
!11 = !DIEnumerator(name: "SEQ_OVERLAP", value: 8)
!12 = !DIEnumerator(name: "SEQ_FILTERY", value: 16)
!13 = !DIEnumerator(name: "SEQ_MUTE", value: 32)
!14 = !DIEnumerator(name: "SEQ_MAKE_PREMUL", value: 64)
!15 = !DIEnumerator(name: "SEQ_REVERSE_FRAMES", value: 128)
!16 = !DIEnumerator(name: "SEQ_IPO_FRAME_LOCKED", value: 256)
!17 = !DIEnumerator(name: "SEQ_EFFECT_NOT_LOADED", value: 512)
!18 = !DIEnumerator(name: "SEQ_FLAG_DELETE", value: 1024)
!19 = !DIEnumerator(name: "SEQ_FLIPX", value: 2048)
!20 = !DIEnumerator(name: "SEQ_FLIPY", value: 4096)
!21 = !DIEnumerator(name: "SEQ_MAKE_FLOAT", value: 8192)
!22 = !DIEnumerator(name: "SEQ_LOCK", value: 16384)
!23 = !DIEnumerator(name: "SEQ_USE_PROXY", value: 32768)
!24 = !DIEnumerator(name: "SEQ_USE_TRANSFORM", value: 65536)
!25 = !DIEnumerator(name: "SEQ_USE_CROP", value: 131072)
!26 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_DIR", value: 524288)
!27 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_FILE", value: 2097152)
!28 = !DIEnumerator(name: "SEQ_USE_EFFECT_DEFAULT_FADE", value: 4194304)
!29 = !DIEnumerator(name: "SEQ_USE_LINEAR_MODIFIERS", value: 8388608)
!30 = !DIEnumerator(name: "SEQ_AUDIO_VOLUME_ANIMATED", value: 16777216)
!31 = !DIEnumerator(name: "SEQ_AUDIO_PITCH_ANIMATED", value: 33554432)
!32 = !DIEnumerator(name: "SEQ_AUDIO_PAN_ANIMATED", value: 67108864)
!33 = !DIEnumerator(name: "SEQ_AUDIO_DRAW_WAVEFORM", value: 134217728)
!34 = !DIEnumerator(name: "SEQ_INVALID_EFFECT", value: -2147483648)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 404, baseType: !36, size: 32, elements: !37)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!38 = !DIEnumerator(name: "SEQ_TYPE_IMAGE", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "SEQ_TYPE_META", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "SEQ_TYPE_SCENE", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "SEQ_TYPE_MOVIE", value: 3, isUnsigned: true)
!42 = !DIEnumerator(name: "SEQ_TYPE_SOUND_RAM", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "SEQ_TYPE_SOUND_HD", value: 5, isUnsigned: true)
!44 = !DIEnumerator(name: "SEQ_TYPE_MOVIECLIP", value: 6, isUnsigned: true)
!45 = !DIEnumerator(name: "SEQ_TYPE_MASK", value: 7, isUnsigned: true)
!46 = !DIEnumerator(name: "SEQ_TYPE_EFFECT", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "SEQ_TYPE_CROSS", value: 8, isUnsigned: true)
!48 = !DIEnumerator(name: "SEQ_TYPE_ADD", value: 9, isUnsigned: true)
!49 = !DIEnumerator(name: "SEQ_TYPE_SUB", value: 10, isUnsigned: true)
!50 = !DIEnumerator(name: "SEQ_TYPE_ALPHAOVER", value: 11, isUnsigned: true)
!51 = !DIEnumerator(name: "SEQ_TYPE_ALPHAUNDER", value: 12, isUnsigned: true)
!52 = !DIEnumerator(name: "SEQ_TYPE_GAMCROSS", value: 13, isUnsigned: true)
!53 = !DIEnumerator(name: "SEQ_TYPE_MUL", value: 14, isUnsigned: true)
!54 = !DIEnumerator(name: "SEQ_TYPE_OVERDROP", value: 15, isUnsigned: true)
!55 = !DIEnumerator(name: "SEQ_TYPE_WIPE", value: 25, isUnsigned: true)
!56 = !DIEnumerator(name: "SEQ_TYPE_GLOW", value: 26, isUnsigned: true)
!57 = !DIEnumerator(name: "SEQ_TYPE_TRANSFORM", value: 27, isUnsigned: true)
!58 = !DIEnumerator(name: "SEQ_TYPE_COLOR", value: 28, isUnsigned: true)
!59 = !DIEnumerator(name: "SEQ_TYPE_SPEED", value: 29, isUnsigned: true)
!60 = !DIEnumerator(name: "SEQ_TYPE_MULTICAM", value: 30, isUnsigned: true)
!61 = !DIEnumerator(name: "SEQ_TYPE_ADJUSTMENT", value: 31, isUnsigned: true)
!62 = !DIEnumerator(name: "SEQ_TYPE_GAUSSIAN_BLUR", value: 40, isUnsigned: true)
!63 = !DIEnumerator(name: "SEQ_TYPE_EFFECT_MAX", value: 40, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 94, baseType: !36, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "GlowR", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "GlowG", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "GlowB", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "GlowA", value: 3, isUnsigned: true)
!70 = !{!71, !82, !77, !83, !7, !85, !86, !87, !96, !76, !106, !118}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpeedControlVars", file: !6, line: 252, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpeedControlVars", file: !6, line: 246, size: 192, elements: !74)
!74 = !{!75, !78, !79, !80, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "frameMap", scope: !73, file: !6, line: 247, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "globalSpeed", scope: !73, file: !6, line: 248, baseType: !77, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !6, line: 249, baseType: !7, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !73, file: !6, line: 250, baseType: !7, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lastValidFrame", scope: !73, file: !6, line: 251, baseType: !7, size: 32, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "WipeVars", file: !6, line: 219, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WipeVars", file: !6, line: 216, size: 96, elements: !90)
!90 = !{!91, !92, !93, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "edgeWidth", scope: !89, file: !6, line: 217, baseType: !77, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !89, file: !6, line: 217, baseType: !77, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !89, file: !6, line: 218, baseType: !94, size: 16, offset: 64)
!94 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "wipetype", scope: !89, file: !6, line: 218, baseType: !94, size: 16, offset: 80)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlowVars", file: !6, line: 228, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlowVars", file: !6, line: 221, size: 192, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "fMini", scope: !98, file: !6, line: 222, baseType: !77, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fClamp", scope: !98, file: !6, line: 223, baseType: !77, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fBoost", scope: !98, file: !6, line: 224, baseType: !77, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dDist", scope: !98, file: !6, line: 225, baseType: !77, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dQuality", scope: !98, file: !6, line: 226, baseType: !7, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bNoComp", scope: !98, file: !6, line: 227, baseType: !7, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransformVars", file: !6, line: 239, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransformVars", file: !6, line: 230, size: 256, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ScalexIni", scope: !108, file: !6, line: 231, baseType: !77, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ScaleyIni", scope: !108, file: !6, line: 232, baseType: !77, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "xIni", scope: !108, file: !6, line: 233, baseType: !77, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "yIni", scope: !108, file: !6, line: 234, baseType: !77, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rotIni", scope: !108, file: !6, line: 235, baseType: !77, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "percent", scope: !108, file: !6, line: 236, baseType: !7, size: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "interpolation", scope: !108, file: !6, line: 237, baseType: !7, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "uniform_scale", scope: !108, file: !6, line: 238, baseType: !7, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "SolidColorVars", file: !6, line: 244, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SolidColorVars", file: !6, line: 241, size: 128, elements: !121)
!121 = !{!122, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !120, file: !6, line: 242, baseType: !123, size: 96)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 96, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !120, file: !6, line: 243, baseType: !77, size: 32, offset: 96)
!127 = !{!0, !128, !134, !139, !141, !143, !145, !147, !152, !154, !156, !161}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "gamtab", scope: !2, file: !3, line: 590, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 1048576, elements: !132)
!131 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!132 = !{!133}
!133 = !DISubrange(count: 65536)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "igamtab1", scope: !2, file: !3, line: 591, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 4096, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 256)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "valid_gamma", scope: !2, file: !3, line: 603, type: !77, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "valid_inv_gamma", scope: !2, file: !3, line: 604, type: !77, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "color_step", scope: !2, file: !3, line: 601, type: !77, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "inv_color_step", scope: !2, file: !3, line: 602, type: !77, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "color_domain_table", scope: !2, file: !3, line: 600, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 12832, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 401)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "gamma_range_table", scope: !2, file: !3, line: 596, type: !149, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "inv_gamma_range_table", scope: !2, file: !3, line: 598, type: !149, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "gamfactor_table", scope: !2, file: !3, line: 597, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 12800, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 400)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "inv_gamfactor_table", scope: !2, file: !3, line: 599, type: !158, isLocal: true, isDefinition: true)
!163 = !{i32 7, !"Dwarf Version", i32 4}
!164 = !{i32 2, !"Debug Info Version", i32 3}
!165 = !{i32 1, !"wchar_size", i32 4}
!166 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!167 = distinct !DISubprogram(name: "BKE_sequence_effect_speed_rebuild_map", scope: !3, file: !3, line: 2442, type: !168, scopeLine: 2443, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1285)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170, !360, !84}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !172, line: 1299, baseType: !173)
!172 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !172, line: 1216, size: 39680, elements: !174)
!174 = !{!175, !243, !313, !316, !319, !321, !322, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !348, !351, !511, !869, !872, !1153, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1175, !1176, !1177, !1178, !1179, !1187, !1254, !1261, !1264, !1271, !1272, !1278, !1279, !1280, !1281, !1282}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !172, line: 1217, baseType: !176, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !177, line: 130, baseType: !178)
!177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !177, line: 117, size: 960, elements: !179)
!179 = !{!180, !181, !182, !184, !203, !207, !208, !209, !210, !211}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !177, line: 118, baseType: !82, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !177, line: 118, baseType: !82, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !178, file: !177, line: 119, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !178, file: !177, line: 120, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !177, line: 136, size: 17600, elements: !187)
!187 = !{!188, !189, !191, !194, !198, !199, !200}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !177, line: 137, baseType: !176, size: 960)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !186, file: !177, line: 138, baseType: !190, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !186, file: !177, line: 139, baseType: !192, size: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !177, line: 43, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !177, line: 140, baseType: !195, size: 8192, offset: 1088)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8192, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1024)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !186, file: !177, line: 141, baseType: !195, size: 8192, offset: 9280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !186, file: !177, line: 148, baseType: !185, size: 64, offset: 17472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !186, file: !177, line: 150, baseType: !201, size: 64, offset: 17536)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !177, line: 45, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !177, line: 121, baseType: !204, size: 528, offset: 256)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 528, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 66)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !178, file: !177, line: 126, baseType: !94, size: 16, offset: 784)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !178, file: !177, line: 127, baseType: !7, size: 32, offset: 800)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !178, file: !177, line: 128, baseType: !7, size: 32, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !178, file: !177, line: 128, baseType: !7, size: 32, offset: 864)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !178, file: !177, line: 129, baseType: !212, size: 64, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !177, line: 75, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !177, line: 62, size: 1024, elements: !215)
!215 = !{!216, !218, !219, !220, !221, !222, !226, !227, !241, !242}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !177, line: 63, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !214, file: !177, line: 63, baseType: !217, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !177, line: 64, baseType: !85, size: 8, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !214, file: !177, line: 64, baseType: !85, size: 8, offset: 136)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !214, file: !177, line: 65, baseType: !94, size: 16, offset: 144)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !177, line: 66, baseType: !223, size: 512, offset: 160)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 512, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !214, file: !177, line: 67, baseType: !7, size: 32, offset: 672)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !177, line: 69, baseType: !228, size: 256, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !177, line: 60, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !177, line: 48, size: 256, elements: !230)
!230 = !{!231, !232, !239, !240}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !229, file: !177, line: 49, baseType: !82, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !229, file: !177, line: 58, baseType: !233, size: 128, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !234, line: 71, baseType: !235)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !234, line: 69, size: 128, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !235, file: !234, line: 70, baseType: !82, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !235, file: !234, line: 70, baseType: !82, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !229, file: !177, line: 59, baseType: !7, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !229, file: !177, line: 59, baseType: !7, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !214, file: !177, line: 70, baseType: !7, size: 32, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !214, file: !177, line: 74, baseType: !7, size: 32, offset: 992)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !173, file: !172, line: 1218, baseType: !244, size: 64, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !246, line: 838, size: 768, elements: !247)
!246 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !{!248, !263, !264, !274, !275, !306, !307, !308, !309, !310, !311, !312}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !245, file: !246, line: 840, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !251, line: 499, baseType: !252)
!251 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !251, line: 486, size: 1600, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !252, file: !251, line: 487, baseType: !176, size: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !252, file: !251, line: 489, baseType: !233, size: 128, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !252, file: !251, line: 490, baseType: !233, size: 128, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !252, file: !251, line: 491, baseType: !233, size: 128, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !252, file: !251, line: 492, baseType: !233, size: 128, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !251, line: 494, baseType: !7, size: 32, offset: 1472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !252, file: !251, line: 495, baseType: !7, size: 32, offset: 1504)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !252, file: !251, line: 497, baseType: !7, size: 32, offset: 1536)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !252, file: !251, line: 498, baseType: !7, size: 32, offset: 1568)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !245, file: !246, line: 844, baseType: !249, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !245, file: !246, line: 848, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !246, line: 549, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !246, line: 544, size: 320, elements: !268)
!268 = !{!269, !271, !272, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !246, line: 545, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !246, line: 545, baseType: !270, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !267, file: !246, line: 547, baseType: !249, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !267, file: !246, line: 548, baseType: !233, size: 128, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !245, file: !246, line: 851, baseType: !233, size: 128, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !245, file: !246, line: 853, baseType: !276, size: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !246, line: 594, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !246, line: 561, size: 1664, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !246, line: 562, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !278, file: !246, line: 562, baseType: !281, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !278, file: !246, line: 564, baseType: !233, size: 128, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !278, file: !246, line: 565, baseType: !249, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !278, file: !246, line: 566, baseType: !265, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !278, file: !246, line: 568, baseType: !233, size: 128, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !278, file: !246, line: 569, baseType: !233, size: 128, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !278, file: !246, line: 571, baseType: !223, size: 512, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !278, file: !246, line: 573, baseType: !77, size: 32, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !278, file: !246, line: 574, baseType: !77, size: 32, offset: 1184)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !278, file: !246, line: 576, baseType: !77, size: 32, offset: 1216)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !278, file: !246, line: 576, baseType: !77, size: 32, offset: 1248)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !278, file: !246, line: 577, baseType: !77, size: 32, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !278, file: !246, line: 577, baseType: !77, size: 32, offset: 1312)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !278, file: !246, line: 579, baseType: !77, size: 32, offset: 1344)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !278, file: !246, line: 580, baseType: !77, size: 32, offset: 1376)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !278, file: !246, line: 582, baseType: !77, size: 32, offset: 1408)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !278, file: !246, line: 582, baseType: !77, size: 32, offset: 1440)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !278, file: !246, line: 583, baseType: !94, size: 16, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !278, file: !246, line: 585, baseType: !94, size: 16, offset: 1488)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !278, file: !246, line: 586, baseType: !94, size: 16, offset: 1504)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !246, line: 588, baseType: !94, size: 16, offset: 1520)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !278, file: !246, line: 590, baseType: !82, size: 64, offset: 1536)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !246, line: 592, baseType: !7, size: 32, offset: 1600)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !278, file: !246, line: 593, baseType: !7, size: 32, offset: 1632)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !245, file: !246, line: 858, baseType: !233, size: 128, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !245, file: !246, line: 859, baseType: !233, size: 128, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !246, line: 862, baseType: !7, size: 32, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !245, file: !246, line: 863, baseType: !7, size: 32, offset: 672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !245, file: !246, line: 866, baseType: !94, size: 16, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !245, file: !246, line: 867, baseType: !94, size: 16, offset: 720)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !245, file: !246, line: 868, baseType: !77, size: 32, offset: 736)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !173, file: !172, line: 1220, baseType: !314, size: 64, offset: 1024)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !172, line: 50, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !173, file: !172, line: 1221, baseType: !317, size: 64, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !172, line: 52, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !173, file: !172, line: 1223, baseType: !320, size: 64, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !173, file: !172, line: 1225, baseType: !233, size: 128, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !173, file: !172, line: 1226, baseType: !323, size: 64, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !172, line: 69, size: 320, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !172, line: 70, baseType: !323, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !324, file: !172, line: 70, baseType: !323, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !324, file: !172, line: 71, baseType: !36, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !324, file: !172, line: 71, baseType: !36, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !172, line: 72, baseType: !7, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !324, file: !172, line: 73, baseType: !94, size: 16, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !324, file: !172, line: 73, baseType: !94, size: 16, offset: 240)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !324, file: !172, line: 74, baseType: !314, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !173, file: !172, line: 1227, baseType: !314, size: 64, offset: 1408)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !173, file: !172, line: 1229, baseType: !123, size: 96, offset: 1472)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !173, file: !172, line: 1230, baseType: !123, size: 96, offset: 1568)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !173, file: !172, line: 1231, baseType: !123, size: 96, offset: 1664)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !173, file: !172, line: 1231, baseType: !123, size: 96, offset: 1760)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !173, file: !172, line: 1233, baseType: !36, size: 32, offset: 1856)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !173, file: !172, line: 1234, baseType: !7, size: 32, offset: 1888)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !173, file: !172, line: 1235, baseType: !36, size: 32, offset: 1920)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !172, line: 1237, baseType: !94, size: 16, offset: 1952)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !173, file: !172, line: 1239, baseType: !85, size: 8, offset: 1968)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !173, file: !172, line: 1240, baseType: !345, size: 8, offset: 1976)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !173, file: !172, line: 1242, baseType: !349, size: 64, offset: 1984)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !172, line: 57, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !173, file: !172, line: 1244, baseType: !352, size: 64, offset: 2048)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !6, line: 200, size: 17024, elements: !354)
!354 = !{!355, !357, !358, !359, !496, !497, !498, !499, !500, !501, !502}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !353, file: !6, line: 201, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !353, file: !6, line: 202, baseType: !233, size: 128, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !353, file: !6, line: 203, baseType: !233, size: 128, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !353, file: !6, line: 206, baseType: !360, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !6, line: 190, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !6, line: 126, size: 2816, elements: !363)
!363 = !{!364, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !460, !463, !464, !465, !468, !471, !472, !473, !474, !475, !476, !477, !478, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !495}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !6, line: 127, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !362, file: !6, line: 127, baseType: !365, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !362, file: !6, line: 128, baseType: !82, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !362, file: !6, line: 129, baseType: !82, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !6, line: 130, baseType: !223, size: 512, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !362, file: !6, line: 132, baseType: !7, size: 32, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !6, line: 132, baseType: !7, size: 32, offset: 800)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !362, file: !6, line: 133, baseType: !7, size: 32, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !362, file: !6, line: 134, baseType: !7, size: 32, offset: 864)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !362, file: !6, line: 134, baseType: !7, size: 32, offset: 896)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !362, file: !6, line: 134, baseType: !7, size: 32, offset: 928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !362, file: !6, line: 135, baseType: !7, size: 32, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !362, file: !6, line: 135, baseType: !7, size: 32, offset: 992)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !362, file: !6, line: 136, baseType: !7, size: 32, offset: 1024)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !362, file: !6, line: 136, baseType: !7, size: 32, offset: 1056)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !362, file: !6, line: 137, baseType: !7, size: 32, offset: 1088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !362, file: !6, line: 137, baseType: !7, size: 32, offset: 1120)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !362, file: !6, line: 138, baseType: !77, size: 32, offset: 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !362, file: !6, line: 139, baseType: !77, size: 32, offset: 1184)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !362, file: !6, line: 139, baseType: !77, size: 32, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !362, file: !6, line: 141, baseType: !94, size: 16, offset: 1248)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !362, file: !6, line: 142, baseType: !94, size: 16, offset: 1264)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !362, file: !6, line: 143, baseType: !7, size: 32, offset: 1280)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !362, file: !6, line: 144, baseType: !7, size: 32, offset: 1312)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !362, file: !6, line: 146, baseType: !390, size: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !6, line: 114, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !6, line: 99, size: 7232, elements: !393)
!393 = !{!394, !396, !397, !398, !399, !400, !401, !410, !414, !428, !437, !444, !454}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !6, line: 100, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !392, file: !6, line: 100, baseType: !395, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !392, file: !6, line: 101, baseType: !7, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !392, file: !6, line: 101, baseType: !7, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !392, file: !6, line: 102, baseType: !7, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !392, file: !6, line: 102, baseType: !7, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !392, file: !6, line: 103, baseType: !402, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !6, line: 59, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !6, line: 56, size: 2112, elements: !405)
!405 = !{!406, !408, !409}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !404, file: !6, line: 57, baseType: !407, size: 2048)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, elements: !137)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !404, file: !6, line: 58, baseType: !7, size: 32, offset: 2048)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !404, file: !6, line: 58, baseType: !7, size: 32, offset: 2080)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !392, file: !6, line: 106, baseType: !411, size: 6144, offset: 320)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 6144, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !392, file: !6, line: 107, baseType: !415, size: 64, offset: 6464)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !6, line: 97, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !6, line: 83, size: 8320, elements: !418)
!418 = !{!419, !420, !421, !424, !425, !426, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !417, file: !6, line: 84, baseType: !411, size: 6144)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !417, file: !6, line: 87, baseType: !407, size: 2048, offset: 6144)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !417, file: !6, line: 88, baseType: !422, size: 64, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !6, line: 88, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !417, file: !6, line: 90, baseType: !94, size: 16, offset: 8256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !417, file: !6, line: 92, baseType: !94, size: 16, offset: 8272)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !417, file: !6, line: 93, baseType: !94, size: 16, offset: 8288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !417, file: !6, line: 95, baseType: !94, size: 16, offset: 8304)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !392, file: !6, line: 108, baseType: !429, size: 64, offset: 6528)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !6, line: 66, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !6, line: 61, size: 128, elements: !432)
!432 = !{!433, !434, !435, !436}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !431, file: !6, line: 62, baseType: !7, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !431, file: !6, line: 63, baseType: !7, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !431, file: !6, line: 64, baseType: !7, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !431, file: !6, line: 65, baseType: !7, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !392, file: !6, line: 109, baseType: !438, size: 64, offset: 6592)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !6, line: 71, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !6, line: 68, size: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !440, file: !6, line: 69, baseType: !7, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !440, file: !6, line: 70, baseType: !7, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !392, file: !6, line: 110, baseType: !445, size: 64, offset: 6656)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !6, line: 81, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !6, line: 73, size: 352, elements: !448)
!448 = !{!449, !450, !451, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !447, file: !6, line: 74, baseType: !123, size: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !447, file: !6, line: 75, baseType: !123, size: 96, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !447, file: !6, line: 76, baseType: !123, size: 96, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !6, line: 77, baseType: !7, size: 32, offset: 288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !6, line: 78, baseType: !7, size: 32, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !392, file: !6, line: 113, baseType: !455, size: 512, offset: 6720)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !456, line: 182, baseType: !457)
!456 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !456, line: 180, size: 512, elements: !458)
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !457, file: !456, line: 181, baseType: !223, size: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !362, file: !6, line: 148, baseType: !461, size: 64, offset: 1408)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !6, line: 49, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !362, file: !6, line: 151, baseType: !320, size: 64, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !362, file: !6, line: 152, baseType: !314, size: 64, offset: 1536)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !362, file: !6, line: 153, baseType: !466, size: 64, offset: 1600)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !172, line: 62, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !362, file: !6, line: 154, baseType: !469, size: 64, offset: 1664)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !6, line: 154, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !362, file: !6, line: 156, baseType: !422, size: 64, offset: 1728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !362, file: !6, line: 158, baseType: !77, size: 32, offset: 1792)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !362, file: !6, line: 159, baseType: !77, size: 32, offset: 1824)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !362, file: !6, line: 162, baseType: !365, size: 64, offset: 1856)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !362, file: !6, line: 162, baseType: !365, size: 64, offset: 1920)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !362, file: !6, line: 162, baseType: !365, size: 64, offset: 1984)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !362, file: !6, line: 164, baseType: !233, size: 128, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !362, file: !6, line: 166, baseType: !479, size: 64, offset: 2176)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !6, line: 51, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !362, file: !6, line: 167, baseType: !82, size: 64, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !362, file: !6, line: 168, baseType: !77, size: 32, offset: 2304)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !362, file: !6, line: 170, baseType: !77, size: 32, offset: 2336)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !362, file: !6, line: 170, baseType: !77, size: 32, offset: 2368)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !362, file: !6, line: 171, baseType: !77, size: 32, offset: 2400)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !362, file: !6, line: 173, baseType: !82, size: 64, offset: 2432)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !362, file: !6, line: 175, baseType: !7, size: 32, offset: 2496)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !362, file: !6, line: 176, baseType: !7, size: 32, offset: 2528)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !362, file: !6, line: 179, baseType: !7, size: 32, offset: 2560)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !362, file: !6, line: 180, baseType: !77, size: 32, offset: 2592)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !362, file: !6, line: 183, baseType: !7, size: 32, offset: 2624)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !362, file: !6, line: 185, baseType: !85, size: 8, offset: 2656)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !362, file: !6, line: 186, baseType: !494, size: 24, offset: 2664)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 24, elements: !124)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !362, file: !6, line: 189, baseType: !233, size: 128, offset: 2688)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !353, file: !6, line: 207, baseType: !195, size: 8192, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !353, file: !6, line: 208, baseType: !195, size: 8192, offset: 8576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !353, file: !6, line: 210, baseType: !7, size: 32, offset: 16768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !353, file: !6, line: 210, baseType: !7, size: 32, offset: 16800)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !353, file: !6, line: 211, baseType: !7, size: 32, offset: 16832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !353, file: !6, line: 211, baseType: !7, size: 32, offset: 16864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !353, file: !6, line: 212, baseType: !503, size: 128, offset: 16896)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !504, line: 95, baseType: !505)
!504 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !504, line: 92, size: 128, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !505, file: !504, line: 93, baseType: !77, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !505, file: !504, line: 93, baseType: !77, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !505, file: !504, line: 94, baseType: !77, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !505, file: !504, line: 94, baseType: !77, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !173, file: !172, line: 1246, baseType: !512, size: 64, offset: 2112)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !172, line: 1067, size: 5184, elements: !514)
!514 = !{!515, !546, !547, !562, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !584, !741, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !852}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !513, file: !172, line: 1068, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !172, line: 934, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !172, line: 925, size: 576, elements: !519)
!519 = !{!520, !538, !539, !540, !541, !542, !545}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !518, file: !172, line: 926, baseType: !521, size: 320)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !172, line: 830, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !172, line: 813, size: 320, elements: !523)
!523 = !{!524, !527, !530, !531, !535, !536, !537}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !522, file: !172, line: 814, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !172, line: 51, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !522, file: !172, line: 815, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !172, line: 815, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !522, file: !172, line: 818, baseType: !82, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !522, file: !172, line: 819, baseType: !532, size: 32, offset: 192)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 32, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 4)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !522, file: !172, line: 822, baseType: !7, size: 32, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !522, file: !172, line: 826, baseType: !7, size: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !522, file: !172, line: 829, baseType: !7, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !518, file: !172, line: 928, baseType: !94, size: 16, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !518, file: !172, line: 928, baseType: !94, size: 16, offset: 336)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !518, file: !172, line: 929, baseType: !7, size: 32, offset: 352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !518, file: !172, line: 930, baseType: !86, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !518, file: !172, line: 931, baseType: !543, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !172, line: 931, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !518, file: !172, line: 933, baseType: !82, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !513, file: !172, line: 1069, baseType: !516, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !513, file: !172, line: 1070, baseType: !548, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !172, line: 916, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !172, line: 891, size: 704, elements: !551)
!551 = !{!552, !553, !554, !556, !557, !558, !559, !560, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !550, file: !172, line: 892, baseType: !521, size: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !550, file: !172, line: 896, baseType: !7, size: 32, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !550, file: !172, line: 900, baseType: !555, size: 96, offset: 352)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !124)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !550, file: !172, line: 903, baseType: !77, size: 32, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !550, file: !172, line: 906, baseType: !7, size: 32, offset: 480)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !550, file: !172, line: 909, baseType: !77, size: 32, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !550, file: !172, line: 912, baseType: !77, size: 32, offset: 544)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !550, file: !172, line: 914, baseType: !314, size: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !550, file: !172, line: 915, baseType: !82, size: 64, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !513, file: !172, line: 1071, baseType: !563, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !172, line: 920, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !172, line: 918, size: 320, elements: !566)
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !565, file: !172, line: 919, baseType: !521, size: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !513, file: !172, line: 1075, baseType: !77, size: 32, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !513, file: !172, line: 1077, baseType: !77, size: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !513, file: !172, line: 1078, baseType: !77, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !513, file: !172, line: 1079, baseType: !94, size: 16, offset: 352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !513, file: !172, line: 1082, baseType: !94, size: 16, offset: 368)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !513, file: !172, line: 1085, baseType: !85, size: 8, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !513, file: !172, line: 1086, baseType: !85, size: 8, offset: 392)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !513, file: !172, line: 1087, baseType: !85, size: 8, offset: 400)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !513, file: !172, line: 1088, baseType: !85, size: 8, offset: 408)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !513, file: !172, line: 1090, baseType: !77, size: 32, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !513, file: !172, line: 1093, baseType: !94, size: 16, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !513, file: !172, line: 1096, baseType: !85, size: 8, offset: 464)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !513, file: !172, line: 1098, baseType: !581, size: 40, offset: 472)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 40, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 5)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !513, file: !172, line: 1101, baseType: !585, size: 832, offset: 512)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !172, line: 836, size: 832, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !596, !597, !598, !737, !738, !739, !740}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !585, file: !172, line: 837, baseType: !521, size: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !172, line: 839, baseType: !94, size: 16, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !585, file: !172, line: 839, baseType: !94, size: 16, offset: 336)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !585, file: !172, line: 842, baseType: !94, size: 16, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !585, file: !172, line: 842, baseType: !94, size: 16, offset: 368)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !585, file: !172, line: 843, baseType: !593, size: 32, offset: 384)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 32, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 2)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !585, file: !172, line: 845, baseType: !7, size: 32, offset: 416)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !585, file: !172, line: 847, baseType: !82, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !585, file: !172, line: 848, baseType: !599, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !601, line: 77, size: 15424, elements: !602)
!601 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!602 = !{!603, !604, !605, !608, !611, !612, !679, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !723, !724, !725, !726, !727, !731}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !600, file: !601, line: 78, baseType: !176, size: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !601, line: 80, baseType: !195, size: 8192, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !600, file: !601, line: 82, baseType: !606, size: 64, offset: 9152)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !601, line: 43, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !600, file: !601, line: 83, baseType: !609, size: 64, offset: 9216)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !177, line: 46, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !600, file: !601, line: 86, baseType: !422, size: 64, offset: 9280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !600, file: !601, line: 87, baseType: !613, size: 64, offset: 9344)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !615, line: 110, size: 1152, elements: !616)
!615 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!616 = !{!617, !618, !619, !620, !621, !622, !623, !625, !626, !627, !635, !636, !637, !638, !640, !674, !675, !676, !677}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !614, file: !615, line: 111, baseType: !613, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !614, file: !615, line: 111, baseType: !613, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !614, file: !615, line: 114, baseType: !7, size: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !614, file: !615, line: 114, baseType: !7, size: 32, offset: 160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !614, file: !615, line: 115, baseType: !94, size: 16, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !614, file: !615, line: 115, baseType: !94, size: 16, offset: 208)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !614, file: !615, line: 118, baseType: !624, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !614, file: !615, line: 120, baseType: !76, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !614, file: !615, line: 122, baseType: !76, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !614, file: !615, line: 125, baseType: !628, size: 128, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !504, line: 89, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !504, line: 86, size: 128, elements: !630)
!630 = !{!631, !632, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !629, file: !504, line: 87, baseType: !7, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !629, file: !504, line: 87, baseType: !7, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !629, file: !504, line: 88, baseType: !7, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !629, file: !504, line: 88, baseType: !7, size: 32, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !614, file: !615, line: 127, baseType: !7, size: 32, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !614, file: !615, line: 127, baseType: !7, size: 32, offset: 608)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !614, file: !615, line: 130, baseType: !233, size: 128, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !614, file: !615, line: 133, baseType: !639, size: 128, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !628)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !614, file: !615, line: 134, baseType: !641, size: 64, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !615, line: 108, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !615, line: 85, size: 1600, elements: !645)
!645 = !{!646, !648, !649, !653, !654, !655, !656, !657, !658, !659, !662, !666, !667, !668, !669, !670, !671, !672, !673}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !644, file: !615, line: 86, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !644, file: !615, line: 86, baseType: !647, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !615, line: 89, baseType: !650, size: 592, offset: 128)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 592, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 74)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !644, file: !615, line: 90, baseType: !36, size: 32, offset: 736)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !644, file: !615, line: 90, baseType: !36, size: 32, offset: 768)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !644, file: !615, line: 90, baseType: !36, size: 32, offset: 800)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !644, file: !615, line: 91, baseType: !7, size: 32, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !644, file: !615, line: 91, baseType: !7, size: 32, offset: 864)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !644, file: !615, line: 91, baseType: !7, size: 32, offset: 896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !644, file: !615, line: 93, baseType: !660, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !172, line: 179, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !644, file: !615, line: 94, baseType: !663, size: 64, offset: 1024)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !665, line: 43, flags: DIFlagFwdDecl)
!665 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !644, file: !615, line: 96, baseType: !76, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !644, file: !615, line: 97, baseType: !76, size: 64, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !644, file: !615, line: 98, baseType: !76, size: 64, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !644, file: !615, line: 99, baseType: !624, size: 64, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !644, file: !615, line: 101, baseType: !7, size: 32, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !644, file: !615, line: 101, baseType: !7, size: 32, offset: 1376)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !644, file: !615, line: 104, baseType: !82, size: 64, offset: 1408)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !644, file: !615, line: 106, baseType: !233, size: 128, offset: 1472)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !614, file: !615, line: 137, baseType: !7, size: 32, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !614, file: !615, line: 140, baseType: !7, size: 32, offset: 992)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !614, file: !615, line: 143, baseType: !7, size: 32, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !614, file: !615, line: 146, baseType: !678, size: 64, offset: 1088)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !600, file: !601, line: 89, baseType: !680, size: 512, offset: 9408)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 512, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !600, file: !601, line: 90, baseType: !94, size: 16, offset: 9920)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !600, file: !601, line: 90, baseType: !94, size: 16, offset: 9936)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !600, file: !601, line: 92, baseType: !94, size: 16, offset: 9952)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !600, file: !601, line: 92, baseType: !94, size: 16, offset: 9968)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !600, file: !601, line: 93, baseType: !94, size: 16, offset: 9984)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !601, line: 93, baseType: !94, size: 16, offset: 10000)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !600, file: !601, line: 94, baseType: !7, size: 32, offset: 10016)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !600, file: !601, line: 97, baseType: !94, size: 16, offset: 10048)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !600, file: !601, line: 97, baseType: !94, size: 16, offset: 10064)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !600, file: !601, line: 98, baseType: !94, size: 16, offset: 10080)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !600, file: !601, line: 98, baseType: !94, size: 16, offset: 10096)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !600, file: !601, line: 99, baseType: !94, size: 16, offset: 10112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !600, file: !601, line: 99, baseType: !94, size: 16, offset: 10128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !600, file: !601, line: 100, baseType: !36, size: 32, offset: 10144)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !600, file: !601, line: 101, baseType: !86, size: 64, offset: 10176)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !600, file: !601, line: 103, baseType: !201, size: 64, offset: 10240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !600, file: !601, line: 104, baseType: !700, size: 64, offset: 10304)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !177, line: 159, size: 448, elements: !702)
!702 = !{!703, !705, !706, !707, !708, !710}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !701, file: !177, line: 161, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !594)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !701, file: !177, line: 162, baseType: !704, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !701, file: !177, line: 163, baseType: !593, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !701, file: !177, line: 164, baseType: !593, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !701, file: !177, line: 165, baseType: !709, size: 128, offset: 192)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, elements: !594)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !701, file: !177, line: 166, baseType: !711, size: 128, offset: 320)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 128, elements: !594)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !600, file: !601, line: 107, baseType: !77, size: 32, offset: 10368)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !600, file: !601, line: 108, baseType: !7, size: 32, offset: 10400)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !600, file: !601, line: 109, baseType: !94, size: 16, offset: 10432)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !600, file: !601, line: 110, baseType: !94, size: 16, offset: 10448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !600, file: !601, line: 113, baseType: !7, size: 32, offset: 10464)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !600, file: !601, line: 113, baseType: !7, size: 32, offset: 10496)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !600, file: !601, line: 114, baseType: !85, size: 8, offset: 10528)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !600, file: !601, line: 114, baseType: !85, size: 8, offset: 10536)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !600, file: !601, line: 115, baseType: !94, size: 16, offset: 10544)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !600, file: !601, line: 116, baseType: !722, size: 128, offset: 10560)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !533)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !600, file: !601, line: 119, baseType: !77, size: 32, offset: 10688)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !600, file: !601, line: 119, baseType: !77, size: 32, offset: 10720)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !600, file: !601, line: 122, baseType: !455, size: 512, offset: 10752)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !600, file: !601, line: 123, baseType: !85, size: 8, offset: 11264)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !600, file: !601, line: 125, baseType: !728, size: 56, offset: 11272)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 56, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 7)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !600, file: !601, line: 126, baseType: !732, size: 4096, offset: 11328)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 4096, elements: !681)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !601, line: 69, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !601, line: 67, size: 512, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !601, line: 68, baseType: !223, size: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !585, file: !172, line: 849, baseType: !599, size: 64, offset: 576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !585, file: !172, line: 850, baseType: !599, size: 64, offset: 640)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !585, file: !172, line: 851, baseType: !123, size: 96, offset: 704)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !585, file: !172, line: 852, baseType: !77, size: 32, offset: 800)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !513, file: !172, line: 1104, baseType: !742, size: 1344, offset: 1344)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !172, line: 867, size: 1344, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !742, file: !172, line: 868, baseType: !94, size: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !742, file: !172, line: 869, baseType: !94, size: 16, offset: 16)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !742, file: !172, line: 870, baseType: !94, size: 16, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !742, file: !172, line: 871, baseType: !94, size: 16, offset: 48)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !742, file: !172, line: 873, baseType: !749, size: 896, offset: 64)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 896, elements: !729)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !172, line: 864, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !172, line: 859, size: 128, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !751, file: !172, line: 860, baseType: !94, size: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !751, file: !172, line: 861, baseType: !94, size: 16, offset: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !751, file: !172, line: 861, baseType: !94, size: 16, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !751, file: !172, line: 861, baseType: !94, size: 16, offset: 48)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !751, file: !172, line: 862, baseType: !7, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !751, file: !172, line: 863, baseType: !77, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !742, file: !172, line: 874, baseType: !82, size: 64, offset: 960)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !742, file: !172, line: 876, baseType: !77, size: 32, offset: 1024)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !742, file: !172, line: 876, baseType: !77, size: 32, offset: 1056)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !742, file: !172, line: 878, baseType: !7, size: 32, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !742, file: !172, line: 879, baseType: !7, size: 32, offset: 1120)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !742, file: !172, line: 881, baseType: !7, size: 32, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !742, file: !172, line: 881, baseType: !7, size: 32, offset: 1184)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !742, file: !172, line: 883, baseType: !320, size: 64, offset: 1216)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !742, file: !172, line: 884, baseType: !314, size: 64, offset: 1280)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !513, file: !172, line: 1107, baseType: !77, size: 32, offset: 2688)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !513, file: !172, line: 1110, baseType: !77, size: 32, offset: 2720)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !513, file: !172, line: 1113, baseType: !94, size: 16, offset: 2752)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !513, file: !172, line: 1113, baseType: !94, size: 16, offset: 2768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !513, file: !172, line: 1116, baseType: !85, size: 8, offset: 2784)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !513, file: !172, line: 1117, baseType: !345, size: 8, offset: 2792)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !513, file: !172, line: 1120, baseType: !94, size: 16, offset: 2800)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !513, file: !172, line: 1121, baseType: !77, size: 32, offset: 2816)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !513, file: !172, line: 1122, baseType: !77, size: 32, offset: 2848)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !513, file: !172, line: 1123, baseType: !77, size: 32, offset: 2880)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !513, file: !172, line: 1124, baseType: !77, size: 32, offset: 2912)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !513, file: !172, line: 1125, baseType: !77, size: 32, offset: 2944)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !513, file: !172, line: 1126, baseType: !77, size: 32, offset: 2976)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !513, file: !172, line: 1127, baseType: !77, size: 32, offset: 3008)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !513, file: !172, line: 1128, baseType: !77, size: 32, offset: 3040)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !513, file: !172, line: 1129, baseType: !77, size: 32, offset: 3072)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !513, file: !172, line: 1130, baseType: !77, size: 32, offset: 3104)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !513, file: !172, line: 1131, baseType: !94, size: 16, offset: 3136)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !513, file: !172, line: 1132, baseType: !85, size: 8, offset: 3152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !513, file: !172, line: 1133, baseType: !85, size: 8, offset: 3160)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !513, file: !172, line: 1134, baseType: !494, size: 24, offset: 3168)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !513, file: !172, line: 1135, baseType: !85, size: 8, offset: 3192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !513, file: !172, line: 1138, baseType: !314, size: 64, offset: 3200)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !513, file: !172, line: 1139, baseType: !85, size: 8, offset: 3264)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !513, file: !172, line: 1140, baseType: !85, size: 8, offset: 3272)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !513, file: !172, line: 1141, baseType: !85, size: 8, offset: 3280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !513, file: !172, line: 1142, baseType: !85, size: 8, offset: 3288)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !513, file: !172, line: 1143, baseType: !85, size: 8, offset: 3296)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !513, file: !172, line: 1144, baseType: !797, size: 64, offset: 3304)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !681)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !513, file: !172, line: 1145, baseType: !797, size: 64, offset: 3368)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !513, file: !172, line: 1148, baseType: !85, size: 8, offset: 3432)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !513, file: !172, line: 1149, baseType: !85, size: 8, offset: 3440)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !513, file: !172, line: 1152, baseType: !85, size: 8, offset: 3448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !513, file: !172, line: 1152, baseType: !85, size: 8, offset: 3456)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !513, file: !172, line: 1153, baseType: !85, size: 8, offset: 3464)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !513, file: !172, line: 1154, baseType: !94, size: 16, offset: 3472)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !513, file: !172, line: 1154, baseType: !94, size: 16, offset: 3488)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !513, file: !172, line: 1155, baseType: !94, size: 16, offset: 3504)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !513, file: !172, line: 1155, baseType: !94, size: 16, offset: 3520)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !513, file: !172, line: 1156, baseType: !85, size: 8, offset: 3536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !513, file: !172, line: 1157, baseType: !85, size: 8, offset: 3544)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !513, file: !172, line: 1159, baseType: !85, size: 8, offset: 3552)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !513, file: !172, line: 1160, baseType: !85, size: 8, offset: 3560)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !513, file: !172, line: 1161, baseType: !85, size: 8, offset: 3568)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !513, file: !172, line: 1162, baseType: !85, size: 8, offset: 3576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !513, file: !172, line: 1165, baseType: !7, size: 32, offset: 3584)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !513, file: !172, line: 1166, baseType: !7, size: 32, offset: 3616)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !513, file: !172, line: 1167, baseType: !7, size: 32, offset: 3648)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !513, file: !172, line: 1168, baseType: !7, size: 32, offset: 3680)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !513, file: !172, line: 1171, baseType: !94, size: 16, offset: 3712)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !513, file: !172, line: 1171, baseType: !94, size: 16, offset: 3728)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !513, file: !172, line: 1172, baseType: !7, size: 32, offset: 3744)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !513, file: !172, line: 1173, baseType: !77, size: 32, offset: 3776)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !513, file: !172, line: 1174, baseType: !77, size: 32, offset: 3808)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !513, file: !172, line: 1177, baseType: !824, size: 1024, offset: 3840)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !172, line: 963, size: 1024, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !850, !851}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !824, file: !172, line: 965, baseType: !7, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !824, file: !172, line: 968, baseType: !77, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !824, file: !172, line: 971, baseType: !77, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !824, file: !172, line: 974, baseType: !77, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !824, file: !172, line: 977, baseType: !123, size: 96, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !824, file: !172, line: 979, baseType: !123, size: 96, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !824, file: !172, line: 982, baseType: !7, size: 32, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !824, file: !172, line: 987, baseType: !834, size: 64, offset: 352)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !594)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !824, file: !172, line: 989, baseType: !77, size: 32, offset: 416)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !824, file: !172, line: 994, baseType: !7, size: 32, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !824, file: !172, line: 995, baseType: !7, size: 32, offset: 480)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !824, file: !172, line: 997, baseType: !85, size: 8, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !824, file: !172, line: 998, baseType: !728, size: 56, offset: 520)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !824, file: !172, line: 1000, baseType: !77, size: 32, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !824, file: !172, line: 1003, baseType: !834, size: 64, offset: 608)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !824, file: !172, line: 1006, baseType: !7, size: 32, offset: 672)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !824, file: !172, line: 1009, baseType: !77, size: 32, offset: 704)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !824, file: !172, line: 1012, baseType: !834, size: 64, offset: 736)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !824, file: !172, line: 1015, baseType: !834, size: 64, offset: 800)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !824, file: !172, line: 1018, baseType: !7, size: 32, offset: 864)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !824, file: !172, line: 1019, baseType: !848, size: 64, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !172, line: 63, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !824, file: !172, line: 1023, baseType: !77, size: 32, offset: 960)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !824, file: !172, line: 1024, baseType: !7, size: 32, offset: 992)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !513, file: !172, line: 1179, baseType: !853, size: 320, offset: 4864)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !172, line: 1043, size: 320, elements: !854)
!854 = !{!855, !856, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !853, file: !172, line: 1044, baseType: !85, size: 8)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !853, file: !172, line: 1045, baseType: !857, size: 16, offset: 8)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 16, elements: !594)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !853, file: !172, line: 1048, baseType: !85, size: 8, offset: 24)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !853, file: !172, line: 1049, baseType: !77, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !853, file: !172, line: 1049, baseType: !77, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !853, file: !172, line: 1052, baseType: !77, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !853, file: !172, line: 1052, baseType: !77, size: 32, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !853, file: !172, line: 1053, baseType: !85, size: 8, offset: 160)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !853, file: !172, line: 1054, baseType: !494, size: 24, offset: 168)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !853, file: !172, line: 1057, baseType: !77, size: 32, offset: 192)
