; ModuleID = 'blender/source/blender/editors/space_clip/clip_dopesheet_draw.c'
source_filename = "blender/source/blender/editors/space_clip/clip_dopesheet_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!1087 = !DIEnumerator(name: "MENU", value: 5632, isUnsigned: true)
!1088 = !DIEnumerator(name: "ICONTOG", value: 6656, isUnsigned: true)
!1089 = !DIEnumerator(name: "NUMSLI", value: 7168, isUnsigned: true)
!1090 = !DIEnumerator(name: "COLOR", value: 7680, isUnsigned: true)
!1091 = !DIEnumerator(name: "SCROLL", value: 9216, isUnsigned: true)
!1092 = !DIEnumerator(name: "BLOCK", value: 9728, isUnsigned: true)
!1093 = !DIEnumerator(name: "BUTM", value: 10240, isUnsigned: true)
!1094 = !DIEnumerator(name: "SEPR", value: 10752, isUnsigned: true)
!1095 = !DIEnumerator(name: "LINK", value: 11264, isUnsigned: true)
!1096 = !DIEnumerator(name: "INLINK", value: 11776, isUnsigned: true)
!1097 = !DIEnumerator(name: "KEYEVT", value: 12288, isUnsigned: true)
!1098 = !DIEnumerator(name: "HSVCUBE", value: 13312, isUnsigned: true)
!1099 = !DIEnumerator(name: "PULLDOWN", value: 13824, isUnsigned: true)
!1100 = !DIEnumerator(name: "ROUNDBOX", value: 14336, isUnsigned: true)
!1101 = !DIEnumerator(name: "BUT_COLORBAND", value: 15360, isUnsigned: true)
!1102 = !DIEnumerator(name: "BUT_NORMAL", value: 15872, isUnsigned: true)
!1103 = !DIEnumerator(name: "BUT_CURVE", value: 16384, isUnsigned: true)
!1104 = !DIEnumerator(name: "ICONTOGN", value: 17408, isUnsigned: true)
!1105 = !DIEnumerator(name: "LISTBOX", value: 17920, isUnsigned: true)
!1106 = !DIEnumerator(name: "LISTROW", value: 18432, isUnsigned: true)
!1107 = !DIEnumerator(name: "TOGBUT", value: 18944, isUnsigned: true)
!1108 = !DIEnumerator(name: "OPTION", value: 19456, isUnsigned: true)
!1109 = !DIEnumerator(name: "OPTIONN", value: 19968, isUnsigned: true)
!1110 = !DIEnumerator(name: "TRACKPREVIEW", value: 20480, isUnsigned: true)
!1111 = !DIEnumerator(name: "SEARCH_MENU", value: 20992, isUnsigned: true)
!1112 = !DIEnumerator(name: "BUT_EXTRA", value: 21504, isUnsigned: true)
!1113 = !DIEnumerator(name: "HSVCIRCLE", value: 22016, isUnsigned: true)
!1114 = !DIEnumerator(name: "HOTKEYEVT", value: 23552, isUnsigned: true)
!1115 = !DIEnumerator(name: "BUT_IMAGE", value: 24064, isUnsigned: true)
!1116 = !DIEnumerator(name: "HISTOGRAM", value: 24576, isUnsigned: true)
!1117 = !DIEnumerator(name: "WAVEFORM", value: 25088, isUnsigned: true)
!1118 = !DIEnumerator(name: "VECTORSCOPE", value: 25600, isUnsigned: true)
!1119 = !DIEnumerator(name: "PROGRESSBAR", value: 26112, isUnsigned: true)
!1120 = !DIEnumerator(name: "SEARCH_MENU_UNLINK", value: 26624, isUnsigned: true)
!1121 = !DIEnumerator(name: "NODESOCKET", value: 27136, isUnsigned: true)
!1122 = !DIEnumerator(name: "SEPRLINE", value: 27648, isUnsigned: true)
!1123 = !DIEnumerator(name: "GRIP", value: 28160, isUnsigned: true)
!1124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 499, baseType: !12, size: 32, elements: !1125)
!1125 = !{!1126, !1127, !1128}
!1126 = !DIEnumerator(name: "TRACKING_COVERAGE_BAD", value: 0, isUnsigned: true)
!1127 = !DIEnumerator(name: "TRACKING_COVERAGE_ACCEPTABLE", value: 1, isUnsigned: true)
!1128 = !DIEnumerator(name: "TRACKING_COVERAGE_OK", value: 2, isUnsigned: true)
!1129 = !{!6}
!1130 = !{!0, !1131, !1135}
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(name: "displist1", scope: !2, file: !3, line: 85, type: !1133, isLocal: true, isDefinition: true)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !1134, line: 272, baseType: !12)
!1134 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(name: "displist2", scope: !2, file: !3, line: 86, type: !1133, isLocal: true, isDefinition: true)
!1137 = !{}
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 256, elements: !1140)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!1140 = !{!1141, !1142}
!1141 = !DISubrange(count: 4)
!1142 = !DISubrange(count: 2)
!1143 = !{i32 7, !"Dwarf Version", i32 4}
!1144 = !{i32 2, !"Debug Info Version", i32 3}
!1145 = !{i32 1, !"wchar_size", i32 4}
!1146 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1147 = distinct !DISubprogram(name: "clip_draw_dopesheet_main", scope: !3, file: !3, line: 167, type: !1148, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1137)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !1150, !1609, !1716}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !1152, line: 1110, baseType: !1153)
!1152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !1152, line: 1074, size: 3264, elements: !1154)
!1154 = !{!1155, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1194, !1557, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1153, file: !1152, line: 1075, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !1152, line: 91, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !1152, line: 85, size: 448, elements: !1159)
!1159 = !{!1160, !1162, !1163, !1171, !1173, !1174}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1158, file: !1152, line: 86, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1158, file: !1152, line: 86, baseType: !1161, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1158, file: !1152, line: 87, baseType: !1164, size: 128, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1165, line: 71, baseType: !1166)
!1165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1165, line: 69, size: 128, elements: !1167)
!1167 = !{!1168, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1166, file: !1165, line: 70, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1166, file: !1165, line: 70, baseType: !1169, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1158, file: !1152, line: 88, baseType: !1172, size: 32, offset: 256)
!1172 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1158, file: !1152, line: 89, baseType: !6, size: 32, offset: 288)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1158, file: !1152, line: 90, baseType: !1175, size: 128, offset: 320)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 128, elements: !1177)
!1176 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1177 = !{!1178}
!1178 = !DISubrange(count: 8)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1153, file: !1152, line: 1075, baseType: !1156, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1153, file: !1152, line: 1076, baseType: !1164, size: 128, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1153, file: !1152, line: 1077, baseType: !1172, size: 32, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !1153, file: !1152, line: 1079, baseType: !6, size: 32, offset: 288)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !1153, file: !1152, line: 1079, baseType: !6, size: 32, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !1153, file: !1152, line: 1080, baseType: !6, size: 32, offset: 352)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !1153, file: !1152, line: 1080, baseType: !6, size: 32, offset: 384)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !1153, file: !1152, line: 1081, baseType: !6, size: 32, offset: 416)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !1153, file: !1152, line: 1083, baseType: !1188, size: 64, offset: 448)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !1189, line: 50, size: 64, elements: !1190)
!1189 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1188, file: !1189, line: 51, baseType: !1172, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !1188, file: !1189, line: 52, baseType: !1176, size: 16, offset: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !1188, file: !1189, line: 52, baseType: !1176, size: 16, offset: 48)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1153, file: !1152, line: 1084, baseType: !1195, size: 64, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1189, line: 64, size: 19136, elements: !1197)
!1197 = !{!1198, !1261, !1264, !1265, !1266, !1267, !1270, !1271, !1272, !1275, !1278, !1281, !1540, !1541, !1552, !1553, !1554, !1555, !1556}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1196, file: !1189, line: 65, baseType: !1199, size: 960)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1200, line: 130, baseType: !1201)
!1200 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1200, line: 117, size: 960, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1207, !1227, !1231, !1232, !1233, !1234, !1235}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1201, file: !1200, line: 118, baseType: !1169, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1201, file: !1200, line: 118, baseType: !1169, size: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1201, file: !1200, line: 119, baseType: !1206, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1201, file: !1200, line: 120, baseType: !1208, size: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1200, line: 136, size: 17600, elements: !1210)
!1210 = !{!1211, !1212, !1214, !1217, !1222, !1223, !1224}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1209, file: !1200, line: 137, baseType: !1199, size: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1209, file: !1200, line: 138, baseType: !1213, size: 64, offset: 960)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1209, file: !1200, line: 139, baseType: !1215, size: 64, offset: 1024)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1200, line: 43, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1209, file: !1200, line: 140, baseType: !1218, size: 8192, offset: 1088)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 8192, elements: !1220)
!1219 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1220 = !{!1221}
!1221 = !DISubrange(count: 1024)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1209, file: !1200, line: 141, baseType: !1218, size: 8192, offset: 9280)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1209, file: !1200, line: 148, baseType: !1208, size: 64, offset: 17472)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1209, file: !1200, line: 150, baseType: !1225, size: 64, offset: 17536)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1200, line: 45, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1201, file: !1200, line: 121, baseType: !1228, size: 528, offset: 256)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 528, elements: !1229)
!1229 = !{!1230}
!1230 = !DISubrange(count: 66)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1201, file: !1200, line: 126, baseType: !1176, size: 16, offset: 784)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1201, file: !1200, line: 127, baseType: !1172, size: 32, offset: 800)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1201, file: !1200, line: 128, baseType: !1172, size: 32, offset: 832)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1201, file: !1200, line: 128, baseType: !1172, size: 32, offset: 864)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1201, file: !1200, line: 129, baseType: !1236, size: 64, offset: 896)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1200, line: 75, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1200, line: 62, size: 1024, elements: !1239)
!1239 = !{!1240, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1259, !1260}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1238, file: !1200, line: 63, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1238, file: !1200, line: 63, baseType: !1241, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1238, file: !1200, line: 64, baseType: !1219, size: 8, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1238, file: !1200, line: 64, baseType: !1219, size: 8, offset: 136)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1238, file: !1200, line: 65, baseType: !1176, size: 16, offset: 144)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1238, file: !1200, line: 66, baseType: !1247, size: 512, offset: 160)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 512, elements: !1248)
!1248 = !{!1249}
!1249 = !DISubrange(count: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1238, file: !1200, line: 67, baseType: !1172, size: 32, offset: 672)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1238, file: !1200, line: 69, baseType: !1252, size: 256, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1200, line: 60, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1200, line: 48, size: 256, elements: !1254)
!1254 = !{!1255, !1256, !1257, !1258}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1253, file: !1200, line: 49, baseType: !1169, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1253, file: !1200, line: 58, baseType: !1164, size: 128, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1253, file: !1200, line: 59, baseType: !1172, size: 32, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1253, file: !1200, line: 59, baseType: !1172, size: 32, offset: 224)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1238, file: !1200, line: 70, baseType: !1172, size: 32, offset: 960)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1238, file: !1200, line: 74, baseType: !1172, size: 32, offset: 992)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1196, file: !1189, line: 66, baseType: !1262, size: 64, offset: 960)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1189, line: 43, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1196, file: !1189, line: 68, baseType: !1218, size: 8192, offset: 1024)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1196, file: !1189, line: 70, baseType: !1172, size: 32, offset: 9216)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1196, file: !1189, line: 71, baseType: !1172, size: 32, offset: 9248)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1196, file: !1189, line: 72, baseType: !1268, size: 64, offset: 9280)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 64, elements: !1269)
!1269 = !{!1142}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1196, file: !1189, line: 74, baseType: !6, size: 32, offset: 9344)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1196, file: !1189, line: 74, baseType: !6, size: 32, offset: 9376)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1196, file: !1189, line: 76, baseType: !1273, size: 64, offset: 9408)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1189, line: 42, flags: DIFlagFwdDecl)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1196, file: !1189, line: 77, baseType: !1276, size: 64, offset: 9472)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1189, line: 77, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1196, file: !1189, line: 78, baseType: !1279, size: 64, offset: 9536)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !208, line: 45, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1196, file: !1189, line: 80, baseType: !1282, size: 2624, offset: 9600)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !208, line: 340, size: 2624, elements: !1283)
!1283 = !{!1284, !1312, !1331, !1332, !1333, !1350, !1410, !1411, !1517, !1518, !1519, !1520, !1529}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1282, file: !208, line: 341, baseType: !1285, size: 576)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !208, line: 251, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !208, line: 207, size: 576, elements: !1287)
!1287 = !{!1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1286, file: !208, line: 208, baseType: !1172, size: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1286, file: !208, line: 211, baseType: !1176, size: 16, offset: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1286, file: !208, line: 212, baseType: !1176, size: 16, offset: 48)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1286, file: !208, line: 213, baseType: !6, size: 32, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1286, file: !208, line: 214, baseType: !1176, size: 16, offset: 96)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1286, file: !208, line: 215, baseType: !1176, size: 16, offset: 112)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1286, file: !208, line: 216, baseType: !1176, size: 16, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1286, file: !208, line: 217, baseType: !1176, size: 16, offset: 144)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1286, file: !208, line: 218, baseType: !1176, size: 16, offset: 160)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1286, file: !208, line: 219, baseType: !1176, size: 16, offset: 176)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1286, file: !208, line: 220, baseType: !6, size: 32, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1286, file: !208, line: 222, baseType: !1176, size: 16, offset: 224)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1286, file: !208, line: 225, baseType: !1176, size: 16, offset: 240)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1286, file: !208, line: 228, baseType: !1172, size: 32, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1286, file: !208, line: 229, baseType: !1172, size: 32, offset: 288)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1286, file: !208, line: 233, baseType: !1172, size: 32, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1286, file: !208, line: 236, baseType: !1176, size: 16, offset: 352)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1286, file: !208, line: 236, baseType: !1176, size: 16, offset: 368)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1286, file: !208, line: 241, baseType: !6, size: 32, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1286, file: !208, line: 244, baseType: !1172, size: 32, offset: 416)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1286, file: !208, line: 244, baseType: !1172, size: 32, offset: 448)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1286, file: !208, line: 245, baseType: !6, size: 32, offset: 480)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1286, file: !208, line: 248, baseType: !6, size: 32, offset: 512)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1286, file: !208, line: 250, baseType: !1172, size: 32, offset: 544)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1282, file: !208, line: 342, baseType: !1313, size: 448, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !208, line: 79, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !208, line: 61, size: 448, elements: !1315)
!1315 = !{!1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1326, !1327, !1328, !1329, !1330}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1314, file: !208, line: 62, baseType: !1169, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1314, file: !208, line: 64, baseType: !1176, size: 16, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1314, file: !208, line: 65, baseType: !1176, size: 16, offset: 80)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1314, file: !208, line: 67, baseType: !6, size: 32, offset: 96)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1314, file: !208, line: 68, baseType: !6, size: 32, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1314, file: !208, line: 69, baseType: !6, size: 32, offset: 160)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1314, file: !208, line: 70, baseType: !1176, size: 16, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1314, file: !208, line: 71, baseType: !1176, size: 16, offset: 208)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1314, file: !208, line: 72, baseType: !1325, size: 64, offset: 224)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !1269)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1314, file: !208, line: 75, baseType: !6, size: 32, offset: 288)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1314, file: !208, line: 75, baseType: !6, size: 32, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1314, file: !208, line: 75, baseType: !6, size: 32, offset: 352)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1314, file: !208, line: 78, baseType: !6, size: 32, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1314, file: !208, line: 78, baseType: !6, size: 32, offset: 416)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1282, file: !208, line: 343, baseType: !1164, size: 128, offset: 1024)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1282, file: !208, line: 344, baseType: !1164, size: 128, offset: 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1282, file: !208, line: 345, baseType: !1334, size: 192, offset: 1280)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !208, line: 278, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !208, line: 270, size: 192, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1340, !1341}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1335, file: !208, line: 271, baseType: !1172, size: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1335, file: !208, line: 273, baseType: !6, size: 32, offset: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1335, file: !208, line: 275, baseType: !1172, size: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1335, file: !208, line: 276, baseType: !1172, size: 32, offset: 96)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1335, file: !208, line: 277, baseType: !1342, size: 64, offset: 128)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !208, line: 55, size: 576, elements: !1344)
!1344 = !{!1345, !1346, !1347}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1343, file: !208, line: 56, baseType: !1172, size: 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1343, file: !208, line: 57, baseType: !6, size: 32, offset: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1343, file: !208, line: 58, baseType: !1348, size: 512, offset: 64)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !1349)
!1349 = !{!1141, !1141}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1282, file: !208, line: 346, baseType: !1351, size: 384, offset: 1472)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !208, line: 268, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !208, line: 253, size: 384, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1404, !1405, !1406, !1407, !1408, !1409}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1352, file: !208, line: 254, baseType: !1172, size: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1352, file: !208, line: 255, baseType: !1172, size: 32, offset: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1352, file: !208, line: 255, baseType: !1172, size: 32, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1352, file: !208, line: 258, baseType: !6, size: 32, offset: 96)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1352, file: !208, line: 259, baseType: !1359, size: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !208, line: 164, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !208, line: 108, size: 1664, elements: !1362)
!1362 = !{!1363, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1386, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1361, file: !208, line: 109, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1361, file: !208, line: 109, baseType: !1364, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1361, file: !208, line: 111, baseType: !1247, size: 512, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1361, file: !208, line: 119, baseType: !1325, size: 64, offset: 640)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1361, file: !208, line: 119, baseType: !1325, size: 64, offset: 704)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1361, file: !208, line: 125, baseType: !1325, size: 64, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1361, file: !208, line: 125, baseType: !1325, size: 64, offset: 832)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1361, file: !208, line: 127, baseType: !1325, size: 64, offset: 896)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1361, file: !208, line: 130, baseType: !1172, size: 32, offset: 960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1361, file: !208, line: 131, baseType: !1172, size: 32, offset: 992)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1361, file: !208, line: 132, baseType: !1375, size: 64, offset: 1024)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !208, line: 106, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !208, line: 81, size: 512, elements: !1378)
!1378 = !{!1379, !1380, !1382, !1383, !1384, !1385}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1377, file: !208, line: 82, baseType: !1325, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1377, file: !208, line: 97, baseType: !1381, size: 256, offset: 64)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !1140)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1377, file: !208, line: 102, baseType: !1325, size: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1377, file: !208, line: 102, baseType: !1325, size: 64, offset: 384)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1377, file: !208, line: 104, baseType: !1172, size: 32, offset: 448)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1377, file: !208, line: 105, baseType: !1172, size: 32, offset: 480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1361, file: !208, line: 135, baseType: !1387, size: 96, offset: 1088)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 96, elements: !1388)
!1388 = !{!1389}
!1389 = !DISubrange(count: 3)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1361, file: !208, line: 136, baseType: !6, size: 32, offset: 1184)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1361, file: !208, line: 139, baseType: !1172, size: 32, offset: 1216)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1361, file: !208, line: 139, baseType: !1172, size: 32, offset: 1248)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1361, file: !208, line: 139, baseType: !1172, size: 32, offset: 1280)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1361, file: !208, line: 140, baseType: !1387, size: 96, offset: 1312)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1361, file: !208, line: 143, baseType: !1176, size: 16, offset: 1408)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1361, file: !208, line: 144, baseType: !1176, size: 16, offset: 1424)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1361, file: !208, line: 145, baseType: !1176, size: 16, offset: 1440)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1361, file: !208, line: 148, baseType: !1176, size: 16, offset: 1456)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1361, file: !208, line: 149, baseType: !1172, size: 32, offset: 1472)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1361, file: !208, line: 150, baseType: !6, size: 32, offset: 1504)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1361, file: !208, line: 152, baseType: !1279, size: 64, offset: 1536)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1361, file: !208, line: 163, baseType: !6, size: 32, offset: 1600)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1361, file: !208, line: 163, baseType: !6, size: 32, offset: 1632)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1352, file: !208, line: 261, baseType: !6, size: 32, offset: 192)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1352, file: !208, line: 261, baseType: !6, size: 32, offset: 224)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1352, file: !208, line: 261, baseType: !6, size: 32, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1352, file: !208, line: 263, baseType: !1172, size: 32, offset: 288)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1352, file: !208, line: 266, baseType: !1172, size: 32, offset: 320)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1352, file: !208, line: 267, baseType: !6, size: 32, offset: 352)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1282, file: !208, line: 347, baseType: !1359, size: 64, offset: 1856)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1282, file: !208, line: 348, baseType: !1412, size: 64, offset: 1920)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !208, line: 205, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !208, line: 186, size: 1024, elements: !1415)
!1415 = !{!1416, !1418, !1419, !1420, !1422, !1423, !1424, !1432, !1433, !1434, !1515, !1516}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1414, file: !208, line: 187, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1414, file: !208, line: 187, baseType: !1417, size: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1414, file: !208, line: 189, baseType: !1247, size: 512, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1414, file: !208, line: 191, baseType: !1421, size: 64, offset: 640)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1414, file: !208, line: 193, baseType: !1172, size: 32, offset: 704)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1414, file: !208, line: 193, baseType: !1172, size: 32, offset: 736)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1414, file: !208, line: 195, baseType: !1425, size: 64, offset: 768)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !208, line: 184, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !208, line: 166, size: 320, elements: !1428)
!1428 = !{!1429, !1430, !1431}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1427, file: !208, line: 180, baseType: !1381, size: 256)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1427, file: !208, line: 182, baseType: !1172, size: 32, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1427, file: !208, line: 183, baseType: !1172, size: 32, offset: 288)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1414, file: !208, line: 196, baseType: !1172, size: 32, offset: 832)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1414, file: !208, line: 198, baseType: !1172, size: 32, offset: 864)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1414, file: !208, line: 200, baseType: !1435, size: 64, offset: 896)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1437, line: 77, size: 15424, elements: !1438)
!1437 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1438 = !{!1439, !1440, !1441, !1444, !1447, !1448, !1451, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1469, !1470, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1496, !1497, !1498, !1504, !1505, !1509}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1436, file: !1437, line: 78, baseType: !1199, size: 960)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1436, file: !1437, line: 80, baseType: !1218, size: 8192, offset: 960)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1436, file: !1437, line: 82, baseType: !1442, size: 64, offset: 9152)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1437, line: 43, flags: DIFlagFwdDecl)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1436, file: !1437, line: 83, baseType: !1445, size: 64, offset: 9216)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1200, line: 46, flags: DIFlagFwdDecl)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1436, file: !1437, line: 86, baseType: !1273, size: 64, offset: 9280)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1436, file: !1437, line: 87, baseType: !1449, size: 64, offset: 9344)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1437, line: 44, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1436, file: !1437, line: 89, baseType: !1452, size: 512, offset: 9408)
!1452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1449, size: 512, elements: !1177)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1436, file: !1437, line: 90, baseType: !1176, size: 16, offset: 9920)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1436, file: !1437, line: 90, baseType: !1176, size: 16, offset: 9936)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1436, file: !1437, line: 92, baseType: !1176, size: 16, offset: 9952)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1436, file: !1437, line: 92, baseType: !1176, size: 16, offset: 9968)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1436, file: !1437, line: 93, baseType: !1176, size: 16, offset: 9984)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1436, file: !1437, line: 93, baseType: !1176, size: 16, offset: 10000)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1436, file: !1437, line: 94, baseType: !1172, size: 32, offset: 10016)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1436, file: !1437, line: 97, baseType: !1176, size: 16, offset: 10048)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1436, file: !1437, line: 97, baseType: !1176, size: 16, offset: 10064)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1436, file: !1437, line: 98, baseType: !1176, size: 16, offset: 10080)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1436, file: !1437, line: 98, baseType: !1176, size: 16, offset: 10096)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1436, file: !1437, line: 99, baseType: !1176, size: 16, offset: 10112)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1436, file: !1437, line: 99, baseType: !1176, size: 16, offset: 10128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1436, file: !1437, line: 100, baseType: !12, size: 32, offset: 10144)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1436, file: !1437, line: 101, baseType: !1468, size: 64, offset: 10176)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1436, file: !1437, line: 103, baseType: !1225, size: 64, offset: 10240)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1436, file: !1437, line: 104, baseType: !1471, size: 64, offset: 10304)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1200, line: 159, size: 448, elements: !1473)
!1473 = !{!1474, !1476, !1477, !1479, !1480, !1482}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1472, file: !1200, line: 161, baseType: !1475, size: 64)
!1475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !1269)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1472, file: !1200, line: 162, baseType: !1475, size: 64, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1472, file: !1200, line: 163, baseType: !1478, size: 32, offset: 128)
!1478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 32, elements: !1269)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1472, file: !1200, line: 164, baseType: !1478, size: 32, offset: 160)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1472, file: !1200, line: 165, baseType: !1481, size: 128, offset: 192)
!1481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1468, size: 128, elements: !1269)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1472, file: !1200, line: 166, baseType: !1483, size: 128, offset: 320)
!1483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1445, size: 128, elements: !1269)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1436, file: !1437, line: 107, baseType: !6, size: 32, offset: 10368)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1436, file: !1437, line: 108, baseType: !1172, size: 32, offset: 10400)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1436, file: !1437, line: 109, baseType: !1176, size: 16, offset: 10432)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1436, file: !1437, line: 110, baseType: !1176, size: 16, offset: 10448)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1436, file: !1437, line: 113, baseType: !1172, size: 32, offset: 10464)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1436, file: !1437, line: 113, baseType: !1172, size: 32, offset: 10496)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1436, file: !1437, line: 114, baseType: !1219, size: 8, offset: 10528)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1436, file: !1437, line: 114, baseType: !1219, size: 8, offset: 10536)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1436, file: !1437, line: 115, baseType: !1176, size: 16, offset: 10544)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1436, file: !1437, line: 116, baseType: !1494, size: 128, offset: 10560)
!1494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !1495)
!1495 = !{!1141}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1436, file: !1437, line: 119, baseType: !6, size: 32, offset: 10688)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1436, file: !1437, line: 119, baseType: !6, size: 32, offset: 10720)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1436, file: !1437, line: 122, baseType: !1499, size: 512, offset: 10752)
!1499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1500, line: 182, baseType: !1501)
!1500 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1500, line: 180, size: 512, elements: !1502)
!1502 = !{!1503}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1501, file: !1500, line: 181, baseType: !1247, size: 512)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1436, file: !1437, line: 123, baseType: !1219, size: 8, offset: 11264)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1436, file: !1437, line: 125, baseType: !1506, size: 56, offset: 11272)
!1506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 56, elements: !1507)
!1507 = !{!1508}
!1508 = !DISubrange(count: 7)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1436, file: !1437, line: 126, baseType: !1510, size: 4096, offset: 11328)
!1510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1511, size: 4096, elements: !1177)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1437, line: 69, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1437, line: 67, size: 512, elements: !1513)
!1513 = !{!1514}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1512, file: !1437, line: 68, baseType: !1247, size: 512)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1414, file: !208, line: 201, baseType: !6, size: 32, offset: 960)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1414, file: !208, line: 204, baseType: !1172, size: 32, offset: 992)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1282, file: !208, line: 350, baseType: !1164, size: 128, offset: 1984)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1282, file: !208, line: 351, baseType: !1172, size: 32, offset: 2112)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1282, file: !208, line: 351, baseType: !1172, size: 32, offset: 2144)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1282, file: !208, line: 353, baseType: !1521, size: 64, offset: 2176)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !208, line: 297, baseType: !1523)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !208, line: 295, size: 2048, elements: !1524)
!1524 = !{!1525}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1523, file: !208, line: 296, baseType: !1526, size: 2048)
!1526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 2048, elements: !1527)
!1527 = !{!1528}
!1528 = !DISubrange(count: 256)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1282, file: !208, line: 355, baseType: !1530, size: 384, offset: 2240)
!1530 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !208, line: 338, baseType: !1531)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !208, line: 322, size: 384, elements: !1532)
!1532 = !{!1533, !1534, !1535, !1536, !1537, !1538, !1539}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1531, file: !208, line: 323, baseType: !1172, size: 32)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1531, file: !208, line: 325, baseType: !1176, size: 16, offset: 32)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1531, file: !208, line: 326, baseType: !1176, size: 16, offset: 48)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1531, file: !208, line: 331, baseType: !1164, size: 128, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1531, file: !208, line: 334, baseType: !1164, size: 128, offset: 192)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1531, file: !208, line: 335, baseType: !1172, size: 32, offset: 320)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1531, file: !208, line: 337, baseType: !1172, size: 32, offset: 352)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1196, file: !1189, line: 81, baseType: !1169, size: 64, offset: 12224)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1196, file: !1189, line: 85, baseType: !1542, size: 6208, offset: 12288)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1189, line: 55, size: 6208, elements: !1543)
!1543 = !{!1544, !1548, !1549, !1550, !1551}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1542, file: !1189, line: 56, baseType: !1545, size: 6144)
!1545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 6144, elements: !1546)
!1546 = !{!1547}
!1547 = !DISubrange(count: 768)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1542, file: !1189, line: 58, baseType: !1176, size: 16, offset: 6144)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1542, file: !1189, line: 59, baseType: !1176, size: 16, offset: 6160)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1542, file: !1189, line: 60, baseType: !1176, size: 16, offset: 6176)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1542, file: !1189, line: 61, baseType: !1176, size: 16, offset: 6192)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1196, file: !1189, line: 86, baseType: !1172, size: 32, offset: 18496)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1196, file: !1189, line: 88, baseType: !1172, size: 32, offset: 18528)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1196, file: !1189, line: 90, baseType: !1172, size: 32, offset: 18560)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1196, file: !1189, line: 94, baseType: !1172, size: 32, offset: 18592)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1196, file: !1189, line: 100, baseType: !1499, size: 512, offset: 18624)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !1153, file: !1152, line: 1085, baseType: !1558, size: 1088, offset: 576)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !1189, line: 103, size: 1088, elements: !1559)
!1559 = !{!1560, !1561, !1562, !1563, !1564, !1565, !1566, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1577}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1558, file: !1189, line: 104, baseType: !1176, size: 16)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !1558, file: !1189, line: 105, baseType: !1176, size: 16, offset: 16)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !1558, file: !1189, line: 106, baseType: !1172, size: 32, offset: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1558, file: !1189, line: 107, baseType: !1172, size: 32, offset: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1558, file: !1189, line: 107, baseType: !1172, size: 32, offset: 96)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !1558, file: !1189, line: 108, baseType: !1377, size: 512, offset: 128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !1558, file: !1189, line: 109, baseType: !1567, size: 64, offset: 640)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64)
!1568 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !208, line: 46, flags: DIFlagFwdDecl)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !1558, file: !1189, line: 110, baseType: !1567, size: 64, offset: 704)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !1558, file: !1189, line: 111, baseType: !1325, size: 64, offset: 768)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !1558, file: !1189, line: 112, baseType: !1176, size: 16, offset: 832)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !1558, file: !1189, line: 113, baseType: !1176, size: 16, offset: 848)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1558, file: !1189, line: 114, baseType: !1172, size: 32, offset: 864)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1558, file: !1189, line: 115, baseType: !1364, size: 64, offset: 896)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !1558, file: !1189, line: 116, baseType: !1576, size: 64, offset: 960)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !1558, file: !1189, line: 117, baseType: !1325, size: 64, offset: 1024)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1153, file: !1152, line: 1087, baseType: !1172, size: 32, offset: 1664)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1153, file: !1152, line: 1088, baseType: !1176, size: 16, offset: 1696)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1153, file: !1152, line: 1089, baseType: !1176, size: 16, offset: 1712)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !1153, file: !1152, line: 1091, baseType: !1172, size: 32, offset: 1728)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1153, file: !1152, line: 1094, baseType: !1325, size: 64, offset: 1760)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1153, file: !1152, line: 1094, baseType: !6, size: 32, offset: 1824)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !1153, file: !1152, line: 1094, baseType: !6, size: 32, offset: 1856)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1153, file: !1152, line: 1095, baseType: !1172, size: 32, offset: 1888)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !1153, file: !1152, line: 1096, baseType: !1348, size: 512, offset: 1920)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !1153, file: !1152, line: 1096, baseType: !1348, size: 512, offset: 2432)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !1153, file: !1152, line: 1100, baseType: !1172, size: 32, offset: 2944)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !1153, file: !1152, line: 1103, baseType: !1176, size: 16, offset: 2976)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1153, file: !1152, line: 1103, baseType: !1176, size: 16, offset: 2992)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1153, file: !1152, line: 1105, baseType: !1172, size: 32, offset: 3008)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !1153, file: !1152, line: 1105, baseType: !1172, size: 32, offset: 3040)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1153, file: !1152, line: 1107, baseType: !1325, size: 64, offset: 3072)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !1153, file: !1152, line: 1109, baseType: !1595, size: 128, offset: 3136)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !1152, line: 554, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !1152, line: 545, size: 128, elements: !1597)
!1597 = !{!1598, !1602, !1603, !1604, !1605}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1596, file: !1152, line: 548, baseType: !1599, size: 64)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64)
!1600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1601, line: 264, flags: DIFlagFwdDecl)
!1601 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !1596, file: !1152, line: 550, baseType: !1219, size: 8, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !1596, file: !1152, line: 551, baseType: !1219, size: 8, offset: 72)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !1596, file: !1152, line: 552, baseType: !1219, size: 8, offset: 80)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1596, file: !1152, line: 553, baseType: !1606, size: 40, offset: 88)
!1606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 40, elements: !1607)
!1607 = !{!1608}
!1608 = !DISubrange(count: 5)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !1611, line: 267, baseType: !1612)
!1611 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1611, line: 230, size: 3072, elements: !1613)
!1613 = !{!1614, !1616, !1617, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1715}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1612, file: !1611, line: 231, baseType: !1615, size: 64)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1612, file: !1611, line: 231, baseType: !1615, size: 64, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1612, file: !1611, line: 233, baseType: !1618, size: 1280, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1619, line: 71, baseType: !1620)
!1619 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1619, line: 40, size: 1280, elements: !1621)
!1621 = !{!1622, !1631, !1632, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1660, !1661, !1662, !1665}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1620, file: !1619, line: 41, baseType: !1623, size: 128)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1624, line: 95, baseType: !1625)
!1624 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1624, line: 92, size: 128, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1625, file: !1624, line: 93, baseType: !6, size: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1625, file: !1624, line: 93, baseType: !6, size: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1625, file: !1624, line: 94, baseType: !6, size: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1625, file: !1624, line: 94, baseType: !6, size: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1620, file: !1619, line: 41, baseType: !1623, size: 128, offset: 128)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1620, file: !1619, line: 42, baseType: !1633, size: 128, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1624, line: 89, baseType: !1634)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1624, line: 86, size: 128, elements: !1635)
!1635 = !{!1636, !1637, !1638, !1639}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1634, file: !1624, line: 87, baseType: !1172, size: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1634, file: !1624, line: 87, baseType: !1172, size: 32, offset: 32)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1634, file: !1624, line: 88, baseType: !1172, size: 32, offset: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1634, file: !1624, line: 88, baseType: !1172, size: 32, offset: 96)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1620, file: !1619, line: 42, baseType: !1633, size: 128, offset: 384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1620, file: !1619, line: 43, baseType: !1633, size: 128, offset: 512)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1620, file: !1619, line: 45, baseType: !1325, size: 64, offset: 640)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1620, file: !1619, line: 45, baseType: !1325, size: 64, offset: 704)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1620, file: !1619, line: 46, baseType: !6, size: 32, offset: 768)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1620, file: !1619, line: 46, baseType: !6, size: 32, offset: 800)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1620, file: !1619, line: 48, baseType: !1176, size: 16, offset: 832)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1620, file: !1619, line: 49, baseType: !1176, size: 16, offset: 848)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1620, file: !1619, line: 51, baseType: !1176, size: 16, offset: 864)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1620, file: !1619, line: 52, baseType: !1176, size: 16, offset: 880)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1620, file: !1619, line: 53, baseType: !1176, size: 16, offset: 896)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1620, file: !1619, line: 55, baseType: !1176, size: 16, offset: 912)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1620, file: !1619, line: 56, baseType: !1176, size: 16, offset: 928)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1620, file: !1619, line: 58, baseType: !1176, size: 16, offset: 944)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1620, file: !1619, line: 58, baseType: !1176, size: 16, offset: 960)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1620, file: !1619, line: 59, baseType: !1176, size: 16, offset: 976)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1620, file: !1619, line: 59, baseType: !1176, size: 16, offset: 992)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1620, file: !1619, line: 61, baseType: !1176, size: 16, offset: 1008)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1620, file: !1619, line: 63, baseType: !1659, size: 64, offset: 1024)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1620, file: !1619, line: 64, baseType: !1172, size: 32, offset: 1088)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1620, file: !1619, line: 65, baseType: !1172, size: 32, offset: 1120)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1620, file: !1619, line: 68, baseType: !1663, size: 64, offset: 1152)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64)
!1664 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1619, line: 68, flags: DIFlagFwdDecl)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1620, file: !1619, line: 69, baseType: !1666, size: 64, offset: 1216)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1668, line: 490, size: 768, elements: !1669)
!1668 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1669 = !{!1670, !1671, !1672, !1675, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1667, file: !1668, line: 491, baseType: !1666, size: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1667, file: !1668, line: 491, baseType: !1666, size: 64, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1667, file: !1668, line: 493, baseType: !1673, size: 64, offset: 128)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64)
!1674 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1601, line: 59, flags: DIFlagFwdDecl)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !1667, file: !1668, line: 495, baseType: !1676, size: 64, offset: 192)
!1676 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !1667, file: !1668, line: 496, baseType: !1172, size: 32, offset: 256)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1667, file: !1668, line: 497, baseType: !1169, size: 64, offset: 320)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1667, file: !1668, line: 499, baseType: !1676, size: 64, offset: 384)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !1667, file: !1668, line: 500, baseType: !1676, size: 64, offset: 448)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !1667, file: !1668, line: 502, baseType: !1676, size: 64, offset: 512)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !1667, file: !1668, line: 503, baseType: !1676, size: 64, offset: 576)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !1667, file: !1668, line: 504, baseType: !1676, size: 64, offset: 640)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !1667, file: !1668, line: 505, baseType: !1172, size: 32, offset: 704)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !1612, file: !1611, line: 234, baseType: !1633, size: 128, offset: 1408)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !1612, file: !1611, line: 235, baseType: !1633, size: 128, offset: 1536)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1612, file: !1611, line: 236, baseType: !1176, size: 16, offset: 1664)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1612, file: !1611, line: 236, baseType: !1176, size: 16, offset: 1680)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1612, file: !1611, line: 238, baseType: !1176, size: 16, offset: 1696)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !1612, file: !1611, line: 239, baseType: !1176, size: 16, offset: 1712)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1612, file: !1611, line: 240, baseType: !1176, size: 16, offset: 1728)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1612, file: !1611, line: 241, baseType: !1176, size: 16, offset: 1744)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !1612, file: !1611, line: 243, baseType: !6, size: 32, offset: 1760)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1612, file: !1611, line: 244, baseType: !1176, size: 16, offset: 1792)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1612, file: !1611, line: 244, baseType: !1176, size: 16, offset: 1808)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !1612, file: !1611, line: 246, baseType: !1176, size: 16, offset: 1824)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !1612, file: !1611, line: 247, baseType: !1176, size: 16, offset: 1840)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !1612, file: !1611, line: 248, baseType: !1176, size: 16, offset: 1856)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !1612, file: !1611, line: 249, baseType: !1176, size: 16, offset: 1872)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !1612, file: !1611, line: 250, baseType: !1176, size: 16, offset: 1888)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1612, file: !1611, line: 251, baseType: !1176, size: 16, offset: 1904)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1612, file: !1611, line: 253, baseType: !1703, size: 64, offset: 1920)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64)
!1704 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1611, line: 42, flags: DIFlagFwdDecl)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !1612, file: !1611, line: 255, baseType: !1164, size: 128, offset: 1984)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !1612, file: !1611, line: 256, baseType: !1164, size: 128, offset: 2112)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !1612, file: !1611, line: 257, baseType: !1164, size: 128, offset: 2240)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !1612, file: !1611, line: 258, baseType: !1164, size: 128, offset: 2368)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !1612, file: !1611, line: 259, baseType: !1164, size: 128, offset: 2496)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1612, file: !1611, line: 260, baseType: !1164, size: 128, offset: 2624)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !1612, file: !1611, line: 261, baseType: !1164, size: 128, offset: 2752)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !1612, file: !1611, line: 263, baseType: !1666, size: 64, offset: 2880)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !1612, file: !1611, line: 265, baseType: !1714, size: 64, offset: 2944)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !1612, file: !1611, line: 266, baseType: !1169, size: 64, offset: 3008)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64)
!1717 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !1718, line: 1299, baseType: !1719)
!1718 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1718, line: 1216, size: 39680, elements: !1720)
!1720 = !{!1721, !1722, !1723, !2000, !2003, !2004, !2005, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2031, !2097, !2232, !2443, !2446, !2728, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2750, !2751, !2752, !2753, !2754, !2762, !2829, !2836, !2837, !2844, !2845, !2846, !2847, !2848, !2849, !2850}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1719, file: !1718, line: 1217, baseType: !1199, size: 960)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1719, file: !1718, line: 1218, baseType: !1262, size: 64, offset: 960)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1719, file: !1718, line: 1220, baseType: !1724, size: 64, offset: 1024)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64)
!1725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1726, line: 115, size: 11392, elements: !1727)
!1726 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1727 = !{!1728, !1729, !1730, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1748, !1757, !1771, !1772, !1813, !1814, !1815, !1816, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1928, !1931, !1934, !1935, !1936, !1937, !1938, !1941, !1944, !1947, !1948, !1954, !1955, !1956, !1957, !1958, !1959, !1961, !1964, !1967, !1968, !1988, !1989}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1725, file: !1726, line: 116, baseType: !1199, size: 960)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1725, file: !1726, line: 117, baseType: !1262, size: 64, offset: 960)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1725, file: !1726, line: 119, baseType: !1731, size: 64, offset: 1024)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64)
!1732 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1726, line: 57, flags: DIFlagFwdDecl)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1725, file: !1726, line: 121, baseType: !1176, size: 16, offset: 1088)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1725, file: !1726, line: 121, baseType: !1176, size: 16, offset: 1104)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1725, file: !1726, line: 122, baseType: !1172, size: 32, offset: 1120)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1725, file: !1726, line: 122, baseType: !1172, size: 32, offset: 1152)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1725, file: !1726, line: 122, baseType: !1172, size: 32, offset: 1184)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1725, file: !1726, line: 123, baseType: !1247, size: 512, offset: 1216)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1725, file: !1726, line: 124, baseType: !1724, size: 64, offset: 1728)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1725, file: !1726, line: 124, baseType: !1724, size: 64, offset: 1792)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1725, file: !1726, line: 127, baseType: !1724, size: 64, offset: 1856)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1725, file: !1726, line: 127, baseType: !1724, size: 64, offset: 1920)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1725, file: !1726, line: 127, baseType: !1724, size: 64, offset: 1984)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1725, file: !1726, line: 128, baseType: !1745, size: 64, offset: 2048)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64)
!1746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1747, line: 46, flags: DIFlagFwdDecl)
!1747 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1725, file: !1726, line: 130, baseType: !1749, size: 64, offset: 2112)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64)
!1750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1726, line: 97, size: 832, elements: !1751)
!1751 = !{!1752, !1755, !1756}
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1750, file: !1726, line: 98, baseType: !1753, size: 768)
!1753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 768, elements: !1754)
!1754 = !{!1178, !1389}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1750, file: !1726, line: 99, baseType: !1172, size: 32, offset: 768)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1750, file: !1726, line: 99, baseType: !1172, size: 32, offset: 800)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1725, file: !1726, line: 131, baseType: !1758, size: 64, offset: 2176)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64)
!1759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1760, line: 486, size: 1600, elements: !1761)
!1760 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1761 = !{!1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770}
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1759, file: !1760, line: 487, baseType: !1199, size: 960)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1759, file: !1760, line: 489, baseType: !1164, size: 128, offset: 960)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1759, file: !1760, line: 490, baseType: !1164, size: 128, offset: 1088)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1759, file: !1760, line: 491, baseType: !1164, size: 128, offset: 1216)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1759, file: !1760, line: 492, baseType: !1164, size: 128, offset: 1344)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1759, file: !1760, line: 494, baseType: !1172, size: 32, offset: 1472)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1759, file: !1760, line: 495, baseType: !1172, size: 32, offset: 1504)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1759, file: !1760, line: 497, baseType: !1172, size: 32, offset: 1536)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1759, file: !1760, line: 498, baseType: !1172, size: 32, offset: 1568)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1725, file: !1726, line: 132, baseType: !1758, size: 64, offset: 2240)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1725, file: !1726, line: 133, baseType: !1773, size: 64, offset: 2304)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64)
!1774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1760, line: 334, size: 1728, elements: !1775)
!1775 = !{!1776, !1777, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1812}
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1774, file: !1760, line: 335, baseType: !1164, size: 128)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1774, file: !1760, line: 336, baseType: !1778, size: 64, offset: 128)
!1778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1779, size: 64)
!1779 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1760, line: 47, flags: DIFlagFwdDecl)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1774, file: !1760, line: 338, baseType: !1176, size: 16, offset: 192)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1774, file: !1760, line: 338, baseType: !1176, size: 16, offset: 208)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1774, file: !1760, line: 339, baseType: !12, size: 32, offset: 224)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1774, file: !1760, line: 340, baseType: !1172, size: 32, offset: 256)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1774, file: !1760, line: 342, baseType: !6, size: 32, offset: 288)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1774, file: !1760, line: 343, baseType: !1387, size: 96, offset: 320)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1774, file: !1760, line: 344, baseType: !1387, size: 96, offset: 416)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1774, file: !1760, line: 347, baseType: !1164, size: 128, offset: 512)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1774, file: !1760, line: 349, baseType: !1172, size: 32, offset: 640)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1774, file: !1760, line: 350, baseType: !1172, size: 32, offset: 672)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1774, file: !1760, line: 351, baseType: !1169, size: 64, offset: 704)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1774, file: !1760, line: 352, baseType: !1169, size: 64, offset: 768)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1774, file: !1760, line: 354, baseType: !1793, size: 384, offset: 832)
!1793 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1760, line: 116, baseType: !1794)
!1794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1760, line: 94, size: 384, elements: !1795)
!1795 = !{!1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811}
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1794, file: !1760, line: 96, baseType: !1172, size: 32)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1794, file: !1760, line: 96, baseType: !1172, size: 32, offset: 32)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1794, file: !1760, line: 97, baseType: !1172, size: 32, offset: 64)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1794, file: !1760, line: 97, baseType: !1172, size: 32, offset: 96)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1794, file: !1760, line: 99, baseType: !1176, size: 16, offset: 128)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1794, file: !1760, line: 100, baseType: !1176, size: 16, offset: 144)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1794, file: !1760, line: 102, baseType: !1176, size: 16, offset: 160)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1794, file: !1760, line: 105, baseType: !1176, size: 16, offset: 176)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1794, file: !1760, line: 108, baseType: !1176, size: 16, offset: 192)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1794, file: !1760, line: 109, baseType: !1176, size: 16, offset: 208)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1794, file: !1760, line: 111, baseType: !1176, size: 16, offset: 224)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1794, file: !1760, line: 112, baseType: !1176, size: 16, offset: 240)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1794, file: !1760, line: 114, baseType: !1172, size: 32, offset: 256)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1794, file: !1760, line: 114, baseType: !1172, size: 32, offset: 288)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1794, file: !1760, line: 115, baseType: !1172, size: 32, offset: 320)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1794, file: !1760, line: 115, baseType: !1172, size: 32, offset: 352)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1774, file: !1760, line: 355, baseType: !1247, size: 512, offset: 1216)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1725, file: !1726, line: 134, baseType: !1169, size: 64, offset: 2368)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1725, file: !1726, line: 136, baseType: !1279, size: 64, offset: 2432)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1725, file: !1726, line: 138, baseType: !1793, size: 384, offset: 2496)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1725, file: !1726, line: 139, baseType: !1817, size: 64, offset: 2880)
!1817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1818, size: 64)
!1818 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1760, line: 80, baseType: !1819)
!1819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1760, line: 72, size: 192, elements: !1820)
!1820 = !{!1821, !1828, !1829, !1830, !1831}
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1819, file: !1760, line: 73, baseType: !1822, size: 64)
!1822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1823, size: 64)
!1823 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1760, line: 59, baseType: !1824)
!1824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1760, line: 56, size: 128, elements: !1825)
!1825 = !{!1826, !1827}
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1824, file: !1760, line: 57, baseType: !1387, size: 96)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1824, file: !1760, line: 58, baseType: !1172, size: 32, offset: 96)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1819, file: !1760, line: 74, baseType: !1172, size: 32, offset: 64)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1819, file: !1760, line: 76, baseType: !1172, size: 32, offset: 96)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1819, file: !1760, line: 77, baseType: !1172, size: 32, offset: 128)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1819, file: !1760, line: 79, baseType: !1172, size: 32, offset: 160)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1725, file: !1726, line: 141, baseType: !1164, size: 128, offset: 2944)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1725, file: !1726, line: 142, baseType: !1164, size: 128, offset: 3072)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1725, file: !1726, line: 143, baseType: !1164, size: 128, offset: 3200)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1725, file: !1726, line: 144, baseType: !1164, size: 128, offset: 3328)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1725, file: !1726, line: 146, baseType: !1172, size: 32, offset: 3456)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1725, file: !1726, line: 147, baseType: !1172, size: 32, offset: 3488)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1725, file: !1726, line: 150, baseType: !1839, size: 64, offset: 3520)
!1839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1840, size: 64)
!1840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1841, size: 64)
!1841 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1726, line: 50, flags: DIFlagFwdDecl)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1725, file: !1726, line: 151, baseType: !1714, size: 64, offset: 3584)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1725, file: !1726, line: 152, baseType: !1172, size: 32, offset: 3648)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1725, file: !1726, line: 153, baseType: !1172, size: 32, offset: 3680)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1725, file: !1726, line: 156, baseType: !1387, size: 96, offset: 3712)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1725, file: !1726, line: 156, baseType: !1387, size: 96, offset: 3808)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1725, file: !1726, line: 156, baseType: !1387, size: 96, offset: 3904)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1725, file: !1726, line: 157, baseType: !1387, size: 96, offset: 4000)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1725, file: !1726, line: 158, baseType: !1387, size: 96, offset: 4096)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1725, file: !1726, line: 159, baseType: !1387, size: 96, offset: 4192)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1725, file: !1726, line: 160, baseType: !1387, size: 96, offset: 4288)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1725, file: !1726, line: 160, baseType: !1387, size: 96, offset: 4384)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1725, file: !1726, line: 161, baseType: !1494, size: 128, offset: 4480)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1725, file: !1726, line: 161, baseType: !1494, size: 128, offset: 4608)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1725, file: !1726, line: 162, baseType: !1387, size: 96, offset: 4736)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1725, file: !1726, line: 162, baseType: !1387, size: 96, offset: 4832)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1725, file: !1726, line: 163, baseType: !6, size: 32, offset: 4928)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1725, file: !1726, line: 163, baseType: !6, size: 32, offset: 4960)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1725, file: !1726, line: 164, baseType: !1348, size: 512, offset: 4992)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1725, file: !1726, line: 165, baseType: !1348, size: 512, offset: 5504)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1725, file: !1726, line: 166, baseType: !1348, size: 512, offset: 6016)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1725, file: !1726, line: 167, baseType: !1348, size: 512, offset: 6528)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1725, file: !1726, line: 176, baseType: !1348, size: 512, offset: 7040)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1725, file: !1726, line: 178, baseType: !12, size: 32, offset: 7552)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1725, file: !1726, line: 180, baseType: !1176, size: 16, offset: 7584)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1725, file: !1726, line: 181, baseType: !1176, size: 16, offset: 7600)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1725, file: !1726, line: 183, baseType: !1176, size: 16, offset: 7616)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1725, file: !1726, line: 183, baseType: !1176, size: 16, offset: 7632)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1725, file: !1726, line: 184, baseType: !1176, size: 16, offset: 7648)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1725, file: !1726, line: 184, baseType: !1176, size: 16, offset: 7664)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1725, file: !1726, line: 185, baseType: !1176, size: 16, offset: 7680)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1725, file: !1726, line: 186, baseType: !1176, size: 16, offset: 7696)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1725, file: !1726, line: 187, baseType: !1176, size: 16, offset: 7712)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1725, file: !1726, line: 188, baseType: !1219, size: 8, offset: 7728)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1725, file: !1726, line: 189, baseType: !1219, size: 8, offset: 7736)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1725, file: !1726, line: 192, baseType: !1172, size: 32, offset: 7744)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1725, file: !1726, line: 192, baseType: !1172, size: 32, offset: 7776)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1725, file: !1726, line: 192, baseType: !1172, size: 32, offset: 7808)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1725, file: !1726, line: 192, baseType: !1172, size: 32, offset: 7840)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1725, file: !1726, line: 194, baseType: !1172, size: 32, offset: 7872)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1725, file: !1726, line: 202, baseType: !6, size: 32, offset: 7904)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1725, file: !1726, line: 202, baseType: !6, size: 32, offset: 7936)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1725, file: !1726, line: 202, baseType: !6, size: 32, offset: 7968)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1725, file: !1726, line: 211, baseType: !6, size: 32, offset: 8000)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1725, file: !1726, line: 212, baseType: !6, size: 32, offset: 8032)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1725, file: !1726, line: 213, baseType: !6, size: 32, offset: 8064)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1725, file: !1726, line: 214, baseType: !6, size: 32, offset: 8096)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1725, file: !1726, line: 215, baseType: !6, size: 32, offset: 8128)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1725, file: !1726, line: 216, baseType: !6, size: 32, offset: 8160)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1725, file: !1726, line: 219, baseType: !6, size: 32, offset: 8192)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1725, file: !1726, line: 220, baseType: !6, size: 32, offset: 8224)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1725, file: !1726, line: 221, baseType: !6, size: 32, offset: 8256)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1725, file: !1726, line: 224, baseType: !1894, size: 16, offset: 8288)
!1894 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
