; ModuleID = 'blender/source/blender/editors/space_info/info_stats.c'
source_filename = "blender/source/blender/editors/space_info/info_stats.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }

!88 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!89 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!90 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!91 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!92 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !94, line: 187, baseType: !5, size: 32, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!96 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!99 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!100 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!101 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!102 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!103 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!104 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!105 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!106 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!107 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!108 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!109 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!110 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!111 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!112 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!113 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!114 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!115 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!116 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!117 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!118 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 394, baseType: !5, size: 32, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!121 = !DIEnumerator(name: "OB_NEG_SCALE", value: 4, isUnsigned: true)
!122 = !DIEnumerator(name: "OB_DUPLIFRAMES", value: 8, isUnsigned: true)
!123 = !DIEnumerator(name: "OB_DUPLIVERTS", value: 16, isUnsigned: true)
!124 = !DIEnumerator(name: "OB_DUPLIROT", value: 32, isUnsigned: true)
!125 = !DIEnumerator(name: "OB_DUPLINOSPEED", value: 64, isUnsigned: true)
!126 = !DIEnumerator(name: "OB_DUPLIGROUP", value: 256, isUnsigned: true)
!127 = !DIEnumerator(name: "OB_DUPLIFACES", value: 512, isUnsigned: true)
!128 = !DIEnumerator(name: "OB_DUPLIFACES_SCALE", value: 1024, isUnsigned: true)
!129 = !DIEnumerator(name: "OB_DUPLIPARTS", value: 2048, isUnsigned: true)
!130 = !DIEnumerator(name: "OB_RENDER_DUPLI", value: 4096, isUnsigned: true)
!131 = !DIEnumerator(name: "OB_NO_CONSTRAINTS", value: 8192, isUnsigned: true)
!132 = !DIEnumerator(name: "OB_NO_PSYS_UPDATE", value: 16384, isUnsigned: true)
!133 = !DIEnumerator(name: "OB_DUPLI", value: 2840, isUnsigned: true)
!134 = !{!135}
!135 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!136 = !{i32 7, !"Dwarf Version", i32 4}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{i32 1, !"wchar_size", i32 4}
!139 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!140 = distinct !DISubprogram(name: "ED_info_stats_clear", scope: !1, file: !1, line: 475, type: !141, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2277)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !145, line: 1299, baseType: !146)
!145 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !145, line: 1216, size: 39680, elements: !147)
!147 = !{!148, !220, !223, !1232, !1235, !1236, !1237, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1266, !1269, !1880, !1901, !2151, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2173, !2174, !2175, !2176, !2177, !2185, !2251, !2258, !2259, !2266, !2269, !2270, !2271, !2272, !2273, !2274}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !146, file: !145, line: 1217, baseType: !149, size: 960)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !150, line: 130, baseType: !151)
!150 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !150, line: 117, size: 960, elements: !152)
!152 = !{!153, !155, !156, !158, !178, !182, !184, !186, !187, !188}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !151, file: !150, line: 118, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !150, line: 118, baseType: !154, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !151, file: !150, line: 119, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !151, file: !150, line: 120, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !150, line: 136, size: 17600, elements: !161)
!161 = !{!162, !163, !165, !168, !173, !174, !175}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !150, line: 137, baseType: !149, size: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !160, file: !150, line: 138, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !160, file: !150, line: 139, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !150, line: 43, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !150, line: 140, baseType: !169, size: 8192, offset: 1088)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 8192, elements: !171)
!170 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !{!172}
!172 = !DISubrange(count: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !160, file: !150, line: 141, baseType: !169, size: 8192, offset: 9280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !160, file: !150, line: 148, baseType: !159, size: 64, offset: 17472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !160, file: !150, line: 150, baseType: !176, size: 64, offset: 17536)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !150, line: 45, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !150, line: 121, baseType: !179, size: 528, offset: 256)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 528, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 66)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !151, file: !150, line: 126, baseType: !183, size: 16, offset: 784)
!183 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !151, file: !150, line: 127, baseType: !185, size: 32, offset: 800)
!185 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !151, file: !150, line: 128, baseType: !185, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !151, file: !150, line: 128, baseType: !185, size: 32, offset: 864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !151, file: !150, line: 129, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !150, line: 75, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !150, line: 62, size: 1024, elements: !192)
!192 = !{!193, !195, !196, !197, !198, !199, !203, !204, !218, !219}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !150, line: 63, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !150, line: 63, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !150, line: 64, baseType: !170, size: 8, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !191, file: !150, line: 64, baseType: !170, size: 8, offset: 136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !150, line: 65, baseType: !183, size: 16, offset: 144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !150, line: 66, baseType: !200, size: 512, offset: 160)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 512, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !191, file: !150, line: 67, baseType: !185, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !150, line: 69, baseType: !205, size: 256, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !150, line: 60, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !150, line: 48, size: 256, elements: !207)
!207 = !{!208, !209, !216, !217}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !206, file: !150, line: 49, baseType: !154, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !206, file: !150, line: 58, baseType: !210, size: 128, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !211, line: 71, baseType: !212)
!211 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !211, line: 69, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !212, file: !211, line: 70, baseType: !154, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !212, file: !211, line: 70, baseType: !154, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !150, line: 59, baseType: !185, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !206, file: !150, line: 59, baseType: !185, size: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !150, line: 70, baseType: !185, size: 32, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !191, file: !150, line: 74, baseType: !185, size: 32, offset: 992)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !146, file: !145, line: 1218, baseType: !221, size: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !94, line: 37, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !146, file: !145, line: 1220, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !70, line: 115, size: 11392, elements: !226)
!226 = !{!227, !228, !229, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !526, !536, !550, !551, !591, !592, !595, !596, !612, !613, !614, !615, !616, !617, !618, !622, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !638, !639, !640, !641, !642, !643, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !703, !704, !705, !706, !707, !708, !709, !710, !711, !715, !718, !727, !728, !729, !730, !731, !734, !756, !1178, !1179, !1185, !1186, !1187, !1188, !1189, !1190, !1192, !1195, !1198, !1200, !1220, !1221}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !225, file: !70, line: 116, baseType: !149, size: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !225, file: !70, line: 117, baseType: !221, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !225, file: !70, line: 119, baseType: !230, size: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !232, line: 155, size: 1856, elements: !233)
!232 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !237, !251, !260, !266, !267, !268, !270, !273, !275, !279, !475, !476, !477, !479, !482, !485, !486, !487, !488, !489, !493, !494, !495, !497, !498, !501, !502, !505, !508, !509, !510, !511}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !231, file: !232, line: 157, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !232, line: 157, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !231, file: !232, line: 158, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !240, line: 65, size: 160, elements: !241)
!240 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = !{!242, !247, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !239, file: !240, line: 66, baseType: !243, size: 96)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 96, elements: !245)
!244 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !239, file: !240, line: 67, baseType: !248, size: 48, offset: 96)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 48, elements: !245)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !240, line: 68, baseType: !170, size: 8, offset: 144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !239, file: !240, line: 68, baseType: !170, size: 8, offset: 152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !231, file: !232, line: 159, baseType: !252, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !240, line: 79, size: 96, elements: !254)
!254 = !{!255, !256, !257, !258, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !253, file: !240, line: 81, baseType: !185, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !253, file: !240, line: 82, baseType: !185, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !253, file: !240, line: 83, baseType: !183, size: 16, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !240, line: 84, baseType: !170, size: 8, offset: 80)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !253, file: !240, line: 84, baseType: !170, size: 8, offset: 88)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !231, file: !232, line: 160, baseType: !261, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !240, line: 88, size: 64, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !262, file: !240, line: 89, baseType: !5, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !262, file: !240, line: 90, baseType: !5, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !231, file: !232, line: 161, baseType: !185, size: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !231, file: !232, line: 161, baseType: !185, size: 32, offset: 288)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !231, file: !232, line: 162, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !231, file: !232, line: 163, baseType: !271, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !43, line: 92, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !231, file: !232, line: 164, baseType: !274, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !231, file: !232, line: 167, baseType: !276, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !43, line: 355, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !231, file: !232, line: 170, baseType: !280, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !282, line: 186, size: 8064, elements: !283)
!282 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !297, !298, !299, !300, !361, !365, !369, !370, !371, !372, !373, !374, !375, !376, !431, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !281, file: !282, line: 187, baseType: !185, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !281, file: !282, line: 187, baseType: !185, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !281, file: !282, line: 187, baseType: !185, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !281, file: !282, line: 187, baseType: !185, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !281, file: !282, line: 188, baseType: !185, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !281, file: !282, line: 188, baseType: !185, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !281, file: !282, line: 188, baseType: !185, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !281, file: !282, line: 193, baseType: !170, size: 8, offset: 224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !281, file: !282, line: 197, baseType: !170, size: 8, offset: 232)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !281, file: !282, line: 201, baseType: !294, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !296, line: 71, flags: DIFlagFwdDecl)
!296 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !281, file: !282, line: 201, baseType: !294, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !281, file: !282, line: 201, baseType: !294, size: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !281, file: !282, line: 201, baseType: !294, size: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !281, file: !282, line: 208, baseType: !301, size: 64, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !282, line: 103, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !282, line: 90, size: 448, elements: !305)
!305 = !{!306, !315, !320, !321, !322}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !304, file: !282, line: 91, baseType: !307, size: 128)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !282, line: 82, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !282, line: 64, size: 128, elements: !309)
!309 = !{!310, !311, !312, !313, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !282, line: 65, baseType: !154, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !308, file: !282, line: 66, baseType: !185, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !308, file: !282, line: 73, baseType: !170, size: 8, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !308, file: !282, line: 74, baseType: !170, size: 8, offset: 104)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !308, file: !282, line: 80, baseType: !170, size: 8, offset: 112)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !304, file: !282, line: 92, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !282, line: 180, size: 16, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !317, file: !282, line: 181, baseType: !183, size: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !304, file: !282, line: 94, baseType: !243, size: 96, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !304, file: !282, line: 95, baseType: !243, size: 96, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !304, file: !282, line: 102, baseType: !323, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !282, line: 110, size: 640, elements: !325)
!325 = !{!326, !327, !328, !330, !331, !354, !360}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !324, file: !282, line: 111, baseType: !307, size: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !324, file: !282, line: 112, baseType: !316, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !324, file: !282, line: 114, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !324, file: !282, line: 114, baseType: !329, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !324, file: !282, line: 118, baseType: !332, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !282, line: 125, size: 576, elements: !334)
!334 = !{!335, !336, !337, !338, !350, !351, !352, !353}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !333, file: !282, line: 126, baseType: !307, size: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !333, file: !282, line: 129, baseType: !329, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !333, file: !282, line: 130, baseType: !323, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !333, file: !282, line: 131, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !282, line: 164, size: 448, elements: !341)
!341 = !{!342, !343, !344, !347, !348, !349}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !340, file: !282, line: 165, baseType: !307, size: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !340, file: !282, line: 166, baseType: !316, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !340, file: !282, line: 172, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !282, line: 140, baseType: !333)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !340, file: !282, line: 174, baseType: !185, size: 32, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !340, file: !282, line: 175, baseType: !243, size: 96, offset: 288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !340, file: !282, line: 176, baseType: !183, size: 16, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !333, file: !282, line: 135, baseType: !332, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !333, file: !282, line: 135, baseType: !332, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !282, line: 139, baseType: !332, size: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !282, line: 139, baseType: !332, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !324, file: !282, line: 122, baseType: !355, size: 128, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !282, line: 108, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !282, line: 106, size: 128, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !282, line: 107, baseType: !323, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !282, line: 107, baseType: !323, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !324, file: !282, line: 122, baseType: !355, size: 128, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !281, file: !282, line: 209, baseType: !362, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !282, line: 123, baseType: !324)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !281, file: !282, line: 210, baseType: !366, size: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !282, line: 178, baseType: !340)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !281, file: !282, line: 213, baseType: !185, size: 32, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !281, file: !282, line: 214, baseType: !185, size: 32, offset: 736)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !281, file: !282, line: 215, baseType: !185, size: 32, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !281, file: !282, line: 218, baseType: !294, size: 64, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !281, file: !282, line: 218, baseType: !294, size: 64, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !281, file: !282, line: 218, baseType: !294, size: 64, offset: 960)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !281, file: !282, line: 220, baseType: !185, size: 32, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !281, file: !282, line: 221, baseType: !377, size: 64, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !379)
!379 = !{!380, !417, !418, !424, !427, !428, !430}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !378, file: !4, line: 191, baseType: !381, size: 5120)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 5120, elements: !415)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !383)
!383 = !{!384, !387, !389, !399, !400}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !382, file: !4, line: 148, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !382, file: !4, line: 149, baseType: !388, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !382, file: !4, line: 150, baseType: !390, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !392)
!392 = !{!393, !395, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !391, file: !4, line: 139, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !391, file: !4, line: 140, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !391, file: !4, line: 141, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !382, file: !4, line: 152, baseType: !185, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !4, line: 162, baseType: !401, size: 128, offset: 192)
!401 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !382, file: !4, line: 155, size: 128, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !409}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !401, file: !4, line: 156, baseType: !185, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !401, file: !4, line: 157, baseType: !244, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !401, file: !4, line: 158, baseType: !154, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !401, file: !4, line: 159, baseType: !243, size: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !401, file: !4, line: 160, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !401, file: !4, line: 161, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !412, line: 48, baseType: !413)
!412 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !414, line: 51, flags: DIFlagFwdDecl)
!414 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!415 = !{!416}
!416 = !DISubrange(count: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !378, file: !4, line: 192, baseType: !381, size: 5120, offset: 5120)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !378, file: !4, line: 193, baseType: !419, size: 64, offset: 10240)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422, !377}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !282, line: 246, baseType: !281)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !378, file: !4, line: 194, baseType: !425, size: 64, offset: 10304)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !4, line: 195, baseType: !185, size: 32, offset: 10368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !378, file: !4, line: 196, baseType: !429, size: 32, offset: 10400)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !378, file: !4, line: 197, baseType: !185, size: 32, offset: 10432)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !281, file: !282, line: 223, baseType: !432, size: 1600, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !296, line: 73, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !296, line: 64, size: 1600, elements: !434)
!434 = !{!435, !450, !454, !455, !456, !457, !458}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !433, file: !296, line: 65, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !296, line: 53, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !296, line: 42, size: 832, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !438, file: !296, line: 43, baseType: !185, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !438, file: !296, line: 44, baseType: !185, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !438, file: !296, line: 45, baseType: !185, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !438, file: !296, line: 46, baseType: !185, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !438, file: !296, line: 47, baseType: !185, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !438, file: !296, line: 48, baseType: !185, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !438, file: !296, line: 49, baseType: !185, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !438, file: !296, line: 50, baseType: !185, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !438, file: !296, line: 51, baseType: !200, size: 512, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !438, file: !296, line: 52, baseType: !154, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !433, file: !296, line: 66, baseType: !451, size: 1312, offset: 64)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 1312, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 41)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !433, file: !296, line: 69, baseType: !185, size: 32, offset: 1376)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !433, file: !296, line: 69, baseType: !185, size: 32, offset: 1408)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !433, file: !296, line: 70, baseType: !185, size: 32, offset: 1440)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !433, file: !296, line: 71, baseType: !294, size: 64, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !433, file: !296, line: 72, baseType: !459, size: 64, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !296, line: 59, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !296, line: 57, size: 8192, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !461, file: !296, line: 58, baseType: !169, size: 8192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !281, file: !282, line: 223, baseType: !432, size: 1600, offset: 2752)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !281, file: !282, line: 223, baseType: !432, size: 1600, offset: 4352)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !281, file: !282, line: 223, baseType: !432, size: 1600, offset: 5952)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !281, file: !282, line: 233, baseType: !183, size: 16, offset: 7552)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !281, file: !282, line: 236, baseType: !185, size: 32, offset: 7584)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !281, file: !282, line: 238, baseType: !185, size: 32, offset: 7616)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !281, file: !282, line: 238, baseType: !185, size: 32, offset: 7648)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !281, file: !282, line: 239, baseType: !210, size: 128, offset: 7680)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !281, file: !282, line: 241, baseType: !367, size: 64, offset: 7808)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !281, file: !282, line: 243, baseType: !210, size: 128, offset: 7872)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !281, file: !282, line: 245, baseType: !154, size: 64, offset: 8000)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !231, file: !232, line: 171, baseType: !185, size: 32, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !231, file: !232, line: 172, baseType: !185, size: 32, offset: 672)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !231, file: !232, line: 173, baseType: !478, size: 8, offset: 704)
!478 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !231, file: !232, line: 175, baseType: !480, size: 64, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !232, line: 175, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !231, file: !232, line: 178, baseType: !483, size: 64, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !43, line: 100, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !231, file: !232, line: 179, baseType: !478, size: 8, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !231, file: !232, line: 182, baseType: !478, size: 8, offset: 904)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !231, file: !232, line: 183, baseType: !269, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !231, file: !232, line: 184, baseType: !269, size: 64, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !231, file: !232, line: 185, baseType: !490, size: 64, offset: 1088)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 288, elements: !492)
!492 = !{!246, !246}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !231, file: !232, line: 188, baseType: !478, size: 8, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !231, file: !232, line: 191, baseType: !5, size: 32, offset: 1184)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !231, file: !232, line: 191, baseType: !496, size: 64, offset: 1216)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !231, file: !232, line: 191, baseType: !5, size: 32, offset: 1280)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !231, file: !232, line: 192, baseType: !499, size: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !232, line: 61, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !231, file: !232, line: 195, baseType: !269, size: 64, offset: 1408)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !231, file: !232, line: 197, baseType: !503, size: 64, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !232, line: 197, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !231, file: !232, line: 198, baseType: !506, size: 64, offset: 1536)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !232, line: 59, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !231, file: !232, line: 201, baseType: !478, size: 8, offset: 1600)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !231, file: !232, line: 202, baseType: !243, size: 96, offset: 1632)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !231, file: !232, line: 204, baseType: !243, size: 96, offset: 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !231, file: !232, line: 205, baseType: !185, size: 32, offset: 1824)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !70, line: 121, baseType: !183, size: 16, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !225, file: !70, line: 121, baseType: !183, size: 16, offset: 1104)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !225, file: !70, line: 122, baseType: !185, size: 32, offset: 1120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !225, file: !70, line: 122, baseType: !185, size: 32, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !225, file: !70, line: 122, baseType: !185, size: 32, offset: 1184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !225, file: !70, line: 123, baseType: !200, size: 512, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !225, file: !70, line: 124, baseType: !224, size: 64, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !225, file: !70, line: 124, baseType: !224, size: 64, offset: 1792)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !225, file: !70, line: 127, baseType: !224, size: 64, offset: 1856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !225, file: !70, line: 127, baseType: !224, size: 64, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !225, file: !70, line: 127, baseType: !224, size: 64, offset: 1984)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !225, file: !70, line: 128, baseType: !524, size: 64, offset: 2048)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !414, line: 44, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !225, file: !70, line: 130, baseType: !527, size: 64, offset: 2112)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !70, line: 97, size: 832, elements: !529)
!529 = !{!530, !534, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !528, file: !70, line: 98, baseType: !531, size: 768)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 768, elements: !532)
!532 = !{!533, !246}
!533 = !DISubrange(count: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !70, line: 99, baseType: !185, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !528, file: !70, line: 99, baseType: !185, size: 32, offset: 800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !225, file: !70, line: 131, baseType: !537, size: 64, offset: 2176)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !539, line: 486, size: 1600, elements: !540)
!539 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !538, file: !539, line: 487, baseType: !149, size: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !538, file: !539, line: 489, baseType: !210, size: 128, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !538, file: !539, line: 490, baseType: !210, size: 128, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !538, file: !539, line: 491, baseType: !210, size: 128, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !538, file: !539, line: 492, baseType: !210, size: 128, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !539, line: 494, baseType: !185, size: 32, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !538, file: !539, line: 495, baseType: !185, size: 32, offset: 1504)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !538, file: !539, line: 497, baseType: !185, size: 32, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !538, file: !539, line: 498, baseType: !185, size: 32, offset: 1568)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !225, file: !70, line: 132, baseType: !537, size: 64, offset: 2240)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !225, file: !70, line: 133, baseType: !552, size: 64, offset: 2304)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !539, line: 334, size: 1728, elements: !554)
!554 = !{!555, !556, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !590}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !553, file: !539, line: 335, baseType: !210, size: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !553, file: !539, line: 336, baseType: !557, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !553, file: !539, line: 338, baseType: !183, size: 16, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !553, file: !539, line: 338, baseType: !183, size: 16, offset: 208)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !553, file: !539, line: 339, baseType: !5, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !553, file: !539, line: 340, baseType: !185, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !553, file: !539, line: 342, baseType: !244, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !553, file: !539, line: 343, baseType: !243, size: 96, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !553, file: !539, line: 344, baseType: !243, size: 96, offset: 416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !553, file: !539, line: 347, baseType: !210, size: 128, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !553, file: !539, line: 349, baseType: !185, size: 32, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !553, file: !539, line: 350, baseType: !185, size: 32, offset: 672)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !553, file: !539, line: 351, baseType: !154, size: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !553, file: !539, line: 352, baseType: !154, size: 64, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !553, file: !539, line: 354, baseType: !571, size: 384, offset: 832)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !539, line: 116, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !539, line: 94, size: 384, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !572, file: !539, line: 96, baseType: !185, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !572, file: !539, line: 96, baseType: !185, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !572, file: !539, line: 97, baseType: !185, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !572, file: !539, line: 97, baseType: !185, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !572, file: !539, line: 99, baseType: !183, size: 16, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !572, file: !539, line: 100, baseType: !183, size: 16, offset: 144)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !572, file: !539, line: 102, baseType: !183, size: 16, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !572, file: !539, line: 105, baseType: !183, size: 16, offset: 176)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !572, file: !539, line: 108, baseType: !183, size: 16, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !572, file: !539, line: 109, baseType: !183, size: 16, offset: 208)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !572, file: !539, line: 111, baseType: !183, size: 16, offset: 224)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !572, file: !539, line: 112, baseType: !183, size: 16, offset: 240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !572, file: !539, line: 114, baseType: !185, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !572, file: !539, line: 114, baseType: !185, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !572, file: !539, line: 115, baseType: !185, size: 32, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !572, file: !539, line: 115, baseType: !185, size: 32, offset: 352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !553, file: !539, line: 355, baseType: !200, size: 512, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !70, line: 134, baseType: !154, size: 64, offset: 2368)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !225, file: !70, line: 136, baseType: !593, size: 64, offset: 2432)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !145, line: 61, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !225, file: !70, line: 138, baseType: !571, size: 384, offset: 2496)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !225, file: !70, line: 139, baseType: !597, size: 64, offset: 2880)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !539, line: 80, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !539, line: 72, size: 192, elements: !600)
!600 = !{!601, !608, !609, !610, !611}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !599, file: !539, line: 73, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !539, line: 59, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !539, line: 56, size: 128, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !604, file: !539, line: 57, baseType: !243, size: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !604, file: !539, line: 58, baseType: !185, size: 32, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !599, file: !539, line: 74, baseType: !185, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !599, file: !539, line: 76, baseType: !185, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !599, file: !539, line: 77, baseType: !185, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !599, file: !539, line: 79, baseType: !185, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !225, file: !70, line: 141, baseType: !210, size: 128, offset: 2944)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !225, file: !70, line: 142, baseType: !210, size: 128, offset: 3072)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !225, file: !70, line: 143, baseType: !210, size: 128, offset: 3200)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !225, file: !70, line: 144, baseType: !210, size: 128, offset: 3328)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !225, file: !70, line: 146, baseType: !185, size: 32, offset: 3456)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !225, file: !70, line: 147, baseType: !185, size: 32, offset: 3488)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !225, file: !70, line: 150, baseType: !619, size: 64, offset: 3520)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !414, line: 46, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !225, file: !70, line: 151, baseType: !623, size: 64, offset: 3584)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !225, file: !70, line: 152, baseType: !185, size: 32, offset: 3648)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !225, file: !70, line: 153, baseType: !185, size: 32, offset: 3680)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !225, file: !70, line: 156, baseType: !243, size: 96, offset: 3712)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !225, file: !70, line: 156, baseType: !243, size: 96, offset: 3808)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !225, file: !70, line: 156, baseType: !243, size: 96, offset: 3904)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !225, file: !70, line: 157, baseType: !243, size: 96, offset: 4000)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !225, file: !70, line: 158, baseType: !243, size: 96, offset: 4096)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !225, file: !70, line: 159, baseType: !243, size: 96, offset: 4192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !225, file: !70, line: 160, baseType: !243, size: 96, offset: 4288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !225, file: !70, line: 160, baseType: !243, size: 96, offset: 4384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !225, file: !70, line: 161, baseType: !635, size: 128, offset: 4480)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 4)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !225, file: !70, line: 161, baseType: !635, size: 128, offset: 4608)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !225, file: !70, line: 162, baseType: !243, size: 96, offset: 4736)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !225, file: !70, line: 162, baseType: !243, size: 96, offset: 4832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !225, file: !70, line: 163, baseType: !244, size: 32, offset: 4928)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !225, file: !70, line: 163, baseType: !244, size: 32, offset: 4960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !225, file: !70, line: 164, baseType: !644, size: 512, offset: 4992)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 512, elements: !645)
!645 = !{!637, !637}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !225, file: !70, line: 165, baseType: !644, size: 512, offset: 5504)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !225, file: !70, line: 166, baseType: !644, size: 512, offset: 6016)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !225, file: !70, line: 167, baseType: !644, size: 512, offset: 6528)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !225, file: !70, line: 176, baseType: !644, size: 512, offset: 7040)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !225, file: !70, line: 178, baseType: !5, size: 32, offset: 7552)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !70, line: 180, baseType: !183, size: 16, offset: 7584)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !225, file: !70, line: 181, baseType: !183, size: 16, offset: 7600)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !225, file: !70, line: 183, baseType: !183, size: 16, offset: 7616)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !225, file: !70, line: 183, baseType: !183, size: 16, offset: 7632)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !225, file: !70, line: 184, baseType: !183, size: 16, offset: 7648)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !225, file: !70, line: 184, baseType: !183, size: 16, offset: 7664)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !225, file: !70, line: 185, baseType: !183, size: 16, offset: 7680)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !225, file: !70, line: 186, baseType: !183, size: 16, offset: 7696)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !225, file: !70, line: 187, baseType: !183, size: 16, offset: 7712)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !225, file: !70, line: 188, baseType: !170, size: 8, offset: 7728)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !225, file: !70, line: 189, baseType: !170, size: 8, offset: 7736)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !225, file: !70, line: 192, baseType: !185, size: 32, offset: 7744)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !225, file: !70, line: 192, baseType: !185, size: 32, offset: 7776)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !225, file: !70, line: 192, baseType: !185, size: 32, offset: 7808)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !225, file: !70, line: 192, baseType: !185, size: 32, offset: 7840)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !225, file: !70, line: 194, baseType: !185, size: 32, offset: 7872)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !225, file: !70, line: 202, baseType: !244, size: 32, offset: 7904)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !225, file: !70, line: 202, baseType: !244, size: 32, offset: 7936)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !225, file: !70, line: 202, baseType: !244, size: 32, offset: 7968)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !225, file: !70, line: 211, baseType: !244, size: 32, offset: 8000)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !225, file: !70, line: 212, baseType: !244, size: 32, offset: 8032)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !225, file: !70, line: 213, baseType: !244, size: 32, offset: 8064)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !225, file: !70, line: 214, baseType: !244, size: 32, offset: 8096)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !225, file: !70, line: 215, baseType: !244, size: 32, offset: 8128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !225, file: !70, line: 216, baseType: !244, size: 32, offset: 8160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !225, file: !70, line: 219, baseType: !244, size: 32, offset: 8192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !225, file: !70, line: 220, baseType: !244, size: 32, offset: 8224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !225, file: !70, line: 221, baseType: !244, size: 32, offset: 8256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !225, file: !70, line: 224, baseType: !680, size: 16, offset: 8288)
!680 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !225, file: !70, line: 224, baseType: !680, size: 16, offset: 8304)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !225, file: !70, line: 226, baseType: !183, size: 16, offset: 8320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !225, file: !70, line: 228, baseType: !170, size: 8, offset: 8336)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !225, file: !70, line: 229, baseType: !170, size: 8, offset: 8344)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !225, file: !70, line: 231, baseType: !183, size: 16, offset: 8352)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !225, file: !70, line: 232, baseType: !170, size: 8, offset: 8368)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !225, file: !70, line: 233, baseType: !170, size: 8, offset: 8376)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !225, file: !70, line: 234, baseType: !244, size: 32, offset: 8384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !225, file: !70, line: 235, baseType: !244, size: 32, offset: 8416)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !225, file: !70, line: 237, baseType: !210, size: 128, offset: 8448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !225, file: !70, line: 238, baseType: !210, size: 128, offset: 8576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !225, file: !70, line: 239, baseType: !210, size: 128, offset: 8704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !225, file: !70, line: 240, baseType: !210, size: 128, offset: 8832)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !225, file: !70, line: 242, baseType: !244, size: 32, offset: 8960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !225, file: !70, line: 244, baseType: !183, size: 16, offset: 8992)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !225, file: !70, line: 245, baseType: !680, size: 16, offset: 9008)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !225, file: !70, line: 246, baseType: !635, size: 128, offset: 9024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !225, file: !70, line: 248, baseType: !185, size: 32, offset: 9152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !225, file: !70, line: 249, baseType: !185, size: 32, offset: 9184)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !225, file: !70, line: 251, baseType: !701, size: 64, offset: 9216)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !70, line: 251, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !225, file: !70, line: 253, baseType: !170, size: 8, offset: 9280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !225, file: !70, line: 254, baseType: !170, size: 8, offset: 9288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !225, file: !70, line: 255, baseType: !183, size: 16, offset: 9296)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !225, file: !70, line: 256, baseType: !243, size: 96, offset: 9312)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !225, file: !70, line: 258, baseType: !210, size: 128, offset: 9408)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !225, file: !70, line: 259, baseType: !210, size: 128, offset: 9536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !225, file: !70, line: 260, baseType: !210, size: 128, offset: 9664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !225, file: !70, line: 261, baseType: !210, size: 128, offset: 9792)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !225, file: !70, line: 263, baseType: !712, size: 64, offset: 9920)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !714, line: 244, flags: DIFlagFwdDecl)
!714 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!715 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !225, file: !70, line: 264, baseType: !716, size: 64, offset: 9984)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !70, line: 53, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !225, file: !70, line: 265, baseType: !719, size: 64, offset: 10048)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !721, line: 51, size: 1216, elements: !722)
!721 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !720, file: !721, line: 52, baseType: !149, size: 960)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !720, file: !721, line: 54, baseType: !210, size: 128, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !720, file: !721, line: 59, baseType: !5, size: 32, offset: 1088)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !720, file: !721, line: 60, baseType: !243, size: 96, offset: 1120)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !225, file: !70, line: 267, baseType: !170, size: 8, offset: 10112)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !225, file: !70, line: 268, baseType: !170, size: 8, offset: 10120)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !225, file: !70, line: 269, baseType: !183, size: 16, offset: 10128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !225, file: !70, line: 270, baseType: !244, size: 32, offset: 10144)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !225, file: !70, line: 272, baseType: !732, size: 64, offset: 10176)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !70, line: 54, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !225, file: !70, line: 275, baseType: !735, size: 64, offset: 10240)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !737, line: 49, size: 448, elements: !738)
!737 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !736, file: !737, line: 50, baseType: !210, size: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !736, file: !737, line: 51, baseType: !210, size: 128, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !736, file: !737, line: 52, baseType: !210, size: 128, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !736, file: !737, line: 53, baseType: !743, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !414, line: 65, size: 128, elements: !745)
!745 = !{!746, !754, !755}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !744, file: !414, line: 66, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !414, line: 56, size: 320, elements: !749)
!749 = !{!750, !751, !752, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !748, file: !414, line: 57, baseType: !635, size: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !748, file: !414, line: 58, baseType: !635, size: 128, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !748, file: !414, line: 59, baseType: !244, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !748, file: !414, line: 59, baseType: !244, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !744, file: !414, line: 67, baseType: !185, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !744, file: !414, line: 68, baseType: !244, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !225, file: !70, line: 277, baseType: !757, size: 64, offset: 10304)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !43, line: 178, size: 13504, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !777, !780, !782, !783, !785, !786, !787, !788, !794, !799, !800, !804, !805, !806, !807, !808, !812, !824, !838, !842, !846, !850, !854, !858, !862, !866, !870, !874, !878, !879, !880, !881, !882, !883, !887, !888, !889, !890, !894, !895, !896, !897, !898, !903, !904, !905, !906, !907, !911, !912, !913, !914, !915, !922, !933, !938, !944, !954, !959, !970, !977, !984, !988, !992, !996, !1000, !1001, !1002, !1006, !1010, !1011, !1012, !1016, !1017, !1026, !1135, !1139, !1147, !1151, !1155, !1159, !1167, !1177}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !758, file: !43, line: 180, baseType: !432, size: 1600)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !758, file: !43, line: 180, baseType: !432, size: 1600, offset: 1600)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !758, file: !43, line: 180, baseType: !432, size: 1600, offset: 3200)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !758, file: !43, line: 180, baseType: !432, size: 1600, offset: 4800)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !758, file: !43, line: 180, baseType: !432, size: 1600, offset: 6400)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !758, file: !43, line: 181, baseType: !185, size: 32, offset: 8000)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !758, file: !43, line: 181, baseType: !185, size: 32, offset: 8032)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !758, file: !43, line: 181, baseType: !185, size: 32, offset: 8064)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !758, file: !43, line: 181, baseType: !185, size: 32, offset: 8096)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !758, file: !43, line: 181, baseType: !185, size: 32, offset: 8128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !758, file: !43, line: 182, baseType: !185, size: 32, offset: 8160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !758, file: !43, line: 183, baseType: !185, size: 32, offset: 8192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !758, file: !43, line: 184, baseType: !773, size: 64, offset: 8256)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !774, line: 124, baseType: !775)
!774 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !774, line: 124, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !758, file: !43, line: 185, baseType: !778, size: 64, offset: 8320)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !43, line: 97, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !43, line: 186, baseType: !781, size: 32, offset: 8384)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !43, line: 132, baseType: !42)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !758, file: !43, line: 187, baseType: !244, size: 32, offset: 8416)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !758, file: !43, line: 188, baseType: !784, size: 32, offset: 8448)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !43, line: 175, baseType: !48)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !758, file: !43, line: 189, baseType: !185, size: 32, offset: 8480)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !758, file: !43, line: 190, baseType: !619, size: 64, offset: 8512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !758, file: !43, line: 193, baseType: !170, size: 8, offset: 8576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !758, file: !43, line: 196, baseType: !789, size: 64, offset: 8640)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !43, line: 177, baseType: !758)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !758, file: !43, line: 199, baseType: !795, size: 64, offset: 8704)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !792, !798}
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !758, file: !43, line: 202, baseType: !789, size: 64, offset: 8768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !758, file: !43, line: 207, baseType: !801, size: 64, offset: 8832)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!185, !792}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !758, file: !43, line: 208, baseType: !801, size: 64, offset: 8896)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !758, file: !43, line: 209, baseType: !801, size: 64, offset: 8960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !758, file: !43, line: 210, baseType: !801, size: 64, offset: 9024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !758, file: !43, line: 211, baseType: !801, size: 64, offset: 9088)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !758, file: !43, line: 218, baseType: !809, size: 64, offset: 9152)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !792, !185, !238}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !758, file: !43, line: 219, baseType: !813, size: 64, offset: 9216)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !792, !185, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !240, line: 48, size: 96, elements: !818)
!818 = !{!819, !820, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !817, file: !240, line: 49, baseType: !5, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !817, file: !240, line: 49, baseType: !5, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !817, file: !240, line: 50, baseType: !170, size: 8, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !817, file: !240, line: 50, baseType: !170, size: 8, offset: 72)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !817, file: !240, line: 51, baseType: !183, size: 16, offset: 80)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !758, file: !43, line: 220, baseType: !825, size: 64, offset: 9280)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !792, !185, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !240, line: 42, size: 160, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !829, file: !240, line: 43, baseType: !5, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !829, file: !240, line: 43, baseType: !5, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !829, file: !240, line: 43, baseType: !5, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !829, file: !240, line: 43, baseType: !5, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !829, file: !240, line: 44, baseType: !183, size: 16, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !829, file: !240, line: 45, baseType: !170, size: 8, offset: 144)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !240, line: 45, baseType: !170, size: 8, offset: 152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !758, file: !43, line: 227, baseType: !839, size: 64, offset: 9344)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!238, !792}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !758, file: !43, line: 228, baseType: !843, size: 64, offset: 9408)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!816, !792}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !758, file: !43, line: 229, baseType: !847, size: 64, offset: 9472)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!828, !792}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !758, file: !43, line: 230, baseType: !851, size: 64, offset: 9536)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!261, !792}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !758, file: !43, line: 231, baseType: !855, size: 64, offset: 9600)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!252, !792}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !758, file: !43, line: 236, baseType: !859, size: 64, offset: 9664)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !792, !238}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !758, file: !43, line: 237, baseType: !863, size: 64, offset: 9728)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !792, !816}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !758, file: !43, line: 238, baseType: !867, size: 64, offset: 9792)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !792, !828}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !758, file: !43, line: 239, baseType: !871, size: 64, offset: 9856)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !792, !261}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !758, file: !43, line: 240, baseType: !875, size: 64, offset: 9920)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !792, !252}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !758, file: !43, line: 245, baseType: !839, size: 64, offset: 9984)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !758, file: !43, line: 246, baseType: !843, size: 64, offset: 10048)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !758, file: !43, line: 247, baseType: !847, size: 64, offset: 10112)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !758, file: !43, line: 248, baseType: !851, size: 64, offset: 10176)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !758, file: !43, line: 249, baseType: !855, size: 64, offset: 10240)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !758, file: !43, line: 255, baseType: !884, size: 64, offset: 10304)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!154, !792, !185, !185}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !758, file: !43, line: 256, baseType: !884, size: 64, offset: 10368)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !758, file: !43, line: 257, baseType: !884, size: 64, offset: 10432)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !758, file: !43, line: 258, baseType: !884, size: 64, offset: 10496)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !758, file: !43, line: 264, baseType: !891, size: 64, offset: 10560)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!154, !792, !185}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !758, file: !43, line: 265, baseType: !891, size: 64, offset: 10624)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !758, file: !43, line: 266, baseType: !891, size: 64, offset: 10688)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !758, file: !43, line: 267, baseType: !891, size: 64, offset: 10752)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !758, file: !43, line: 268, baseType: !891, size: 64, offset: 10816)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !758, file: !43, line: 272, baseType: !899, size: 64, offset: 10880)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!902, !792}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !758, file: !43, line: 273, baseType: !899, size: 64, offset: 10944)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !758, file: !43, line: 274, baseType: !899, size: 64, offset: 11008)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !758, file: !43, line: 275, baseType: !899, size: 64, offset: 11072)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !758, file: !43, line: 276, baseType: !899, size: 64, offset: 11136)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !758, file: !43, line: 279, baseType: !908, size: 64, offset: 11200)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !792, !185, !902, !185}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !758, file: !43, line: 280, baseType: !908, size: 64, offset: 11264)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !758, file: !43, line: 281, baseType: !908, size: 64, offset: 11328)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !758, file: !43, line: 284, baseType: !801, size: 64, offset: 11392)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !758, file: !43, line: 285, baseType: !801, size: 64, offset: 11456)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !758, file: !43, line: 286, baseType: !916, size: 64, offset: 11520)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!919, !792}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !43, line: 82, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !758, file: !43, line: 287, baseType: !923, size: 64, offset: 11584)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!926, !792}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !43, line: 120, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !43, line: 117, size: 256, elements: !929)
!929 = !{!930, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !928, file: !43, line: 118, baseType: !931, size: 128)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 128, elements: !636)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !928, file: !43, line: 119, baseType: !931, size: 128, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !758, file: !43, line: 288, baseType: !934, size: 64, offset: 11648)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!937, !792}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !758, file: !43, line: 289, baseType: !939, size: 64, offset: 11712)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !792, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !43, line: 83, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !758, file: !43, line: 290, baseType: !945, size: 64, offset: 11776)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!948, !792}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !43, line: 126, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !43, line: 123, size: 32, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !950, file: !43, line: 124, baseType: !183, size: 16)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !950, file: !43, line: 125, baseType: !170, size: 8, offset: 16)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !758, file: !43, line: 291, baseType: !955, size: 64, offset: 11840)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !792}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !758, file: !43, line: 299, baseType: !960, size: 64, offset: 11904)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !792, !963, !154, !969}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !154, !185, !966, !966, !967}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !43, line: 162, baseType: !53)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !758, file: !43, line: 309, baseType: !971, size: 64, offset: 11968)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !792, !974, !154}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !154, !185, !966, !966}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !758, file: !43, line: 317, baseType: !978, size: 64, offset: 12032)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !792, !981, !154, !969}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !154, !185, !185, !966, !966}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !758, file: !43, line: 327, baseType: !985, size: 64, offset: 12096)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !792, !974, !154, !969}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !758, file: !43, line: 337, baseType: !989, size: 64, offset: 12160)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !792, !274, !274}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !758, file: !43, line: 344, baseType: !993, size: 64, offset: 12224)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !792, !185, !274}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !758, file: !43, line: 347, baseType: !997, size: 64, offset: 12288)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !792, !269}
