; ModuleID = 'blender/source/blender/render/intern/source/pixelshading.c'
source_filename = "blender/source/blender/render/intern/source/pixelshading.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/pixelshading.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!10 = distinct !DISubprogram(name: "shadeHaloFloat", scope: !1, file: !1, line: 278, type: !11, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{!5, !13, !638, !5, !4, !4, !4, !19}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "HaloRen", file: !15, line: 427, baseType: !16)
!15 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HaloRen", file: !15, line: 413, size: 1024, elements: !17)
!17 = !{!18, !20, !21, !22, !23, !24, !25, !26, !27, !28, !32, !33, !34, !35, !36, !37, !38, !39, !40, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !53, !1789}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "miny", scope: !16, file: !15, line: 414, baseType: !19, size: 16)
!19 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "maxy", scope: !16, file: !15, line: 414, baseType: !19, size: 16, offset: 16)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !16, file: !15, line: 415, baseType: !4, size: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "xs", scope: !16, file: !15, line: 415, baseType: !4, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ys", scope: !16, file: !15, line: 415, baseType: !4, size: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !16, file: !15, line: 415, baseType: !4, size: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "radsq", scope: !16, file: !15, line: 415, baseType: !4, size: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !16, file: !15, line: 415, baseType: !4, size: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cos", scope: !16, file: !15, line: 415, baseType: !4, size: 32, offset: 224)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !16, file: !15, line: 415, baseType: !29, size: 96, offset: 256)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 3)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !16, file: !15, line: 415, baseType: !29, size: 96, offset: 352)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "hard", scope: !16, file: !15, line: 416, baseType: !4, size: 32, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !16, file: !15, line: 416, baseType: !4, size: 32, offset: 480)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !16, file: !15, line: 416, baseType: !4, size: 32, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !16, file: !15, line: 416, baseType: !4, size: 32, offset: 544)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "zs", scope: !16, file: !15, line: 417, baseType: !5, size: 32, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "zd", scope: !16, file: !15, line: 417, baseType: !5, size: 32, offset: 608)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "zBufDist", scope: !16, file: !15, line: 418, baseType: !5, size: 32, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "starpoints", scope: !16, file: !15, line: 419, baseType: !41, size: 8, offset: 672)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, file: !15, line: 419, baseType: !41, size: 8, offset: 680)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !16, file: !15, line: 419, baseType: !41, size: 8, offset: 688)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !16, file: !15, line: 419, baseType: !41, size: 8, offset: 696)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !16, file: !15, line: 420, baseType: !41, size: 8, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !16, file: !15, line: 420, baseType: !41, size: 8, offset: 712)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !16, file: !15, line: 420, baseType: !41, size: 8, offset: 720)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !16, file: !15, line: 421, baseType: !19, size: 16, offset: 736)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !16, file: !15, line: 422, baseType: !4, size: 32, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !16, file: !15, line: 423, baseType: !5, size: 32, offset: 800)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !16, file: !15, line: 424, baseType: !52, size: 32, offset: 832)
!52 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !16, file: !15, line: 425, baseType: !54, size: 64, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !56, line: 93, size: 7552, elements: !57)
!56 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !127, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !176, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !245, !246, !247, !248, !249, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1788}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !55, file: !56, line: 94, baseType: !59, size: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !60, line: 130, baseType: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !60, line: 117, size: 960, elements: !62)
!62 = !{!63, !65, !66, !68, !87, !91, !92, !93, !94, !95}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !60, line: 118, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !61, file: !60, line: 118, baseType: !64, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !61, file: !60, line: 119, baseType: !67, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !61, file: !60, line: 120, baseType: !69, size: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !60, line: 136, size: 17600, elements: !71)
!71 = !{!72, !73, !75, !78, !82, !83, !84}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !60, line: 137, baseType: !59, size: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !70, file: !60, line: 138, baseType: !74, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !70, file: !60, line: 139, baseType: !76, size: 64, offset: 1024)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !60, line: 43, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !60, line: 140, baseType: !79, size: 8192, offset: 1088)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1024)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !70, file: !60, line: 141, baseType: !79, size: 8192, offset: 9280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !70, file: !60, line: 148, baseType: !69, size: 64, offset: 17472)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !70, file: !60, line: 150, baseType: !85, size: 64, offset: 17536)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !60, line: 45, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !60, line: 121, baseType: !88, size: 528, offset: 256)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 528, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 66)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !61, file: !60, line: 126, baseType: !19, size: 16, offset: 784)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !61, file: !60, line: 127, baseType: !5, size: 32, offset: 800)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !61, file: !60, line: 128, baseType: !5, size: 32, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !61, file: !60, line: 128, baseType: !5, size: 32, offset: 864)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !61, file: !60, line: 129, baseType: !96, size: 64, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !60, line: 75, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !60, line: 62, size: 1024, elements: !99)
!99 = !{!100, !102, !103, !104, !105, !106, !110, !111, !125, !126}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !60, line: 63, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !60, line: 63, baseType: !101, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !60, line: 64, baseType: !41, size: 8, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !98, file: !60, line: 64, baseType: !41, size: 8, offset: 136)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !98, file: !60, line: 65, baseType: !19, size: 16, offset: 144)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !60, line: 66, baseType: !107, size: 512, offset: 160)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !98, file: !60, line: 67, baseType: !5, size: 32, offset: 672)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !60, line: 69, baseType: !112, size: 256, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !60, line: 60, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !60, line: 48, size: 256, elements: !114)
!114 = !{!115, !116, !123, !124}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !113, file: !60, line: 49, baseType: !64, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !113, file: !60, line: 58, baseType: !117, size: 128, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !118, line: 71, baseType: !119)
!118 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !118, line: 69, size: 128, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !119, file: !118, line: 70, baseType: !64, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !119, file: !118, line: 70, baseType: !64, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !113, file: !60, line: 59, baseType: !5, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !113, file: !60, line: 59, baseType: !5, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !98, file: !60, line: 70, baseType: !5, size: 32, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !98, file: !60, line: 74, baseType: !5, size: 32, offset: 992)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !55, file: !56, line: 95, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !56, line: 48, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !55, file: !56, line: 97, baseType: !19, size: 16, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !55, file: !56, line: 97, baseType: !19, size: 16, offset: 1040)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !55, file: !56, line: 99, baseType: !4, size: 32, offset: 1056)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !55, file: !56, line: 99, baseType: !4, size: 32, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !55, file: !56, line: 99, baseType: !4, size: 32, offset: 1120)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !55, file: !56, line: 100, baseType: !4, size: 32, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !55, file: !56, line: 100, baseType: !4, size: 32, offset: 1184)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !55, file: !56, line: 100, baseType: !4, size: 32, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !55, file: !56, line: 101, baseType: !4, size: 32, offset: 1248)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !55, file: !56, line: 101, baseType: !4, size: 32, offset: 1280)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !55, file: !56, line: 101, baseType: !4, size: 32, offset: 1312)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !55, file: !56, line: 102, baseType: !4, size: 32, offset: 1344)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !55, file: !56, line: 102, baseType: !4, size: 32, offset: 1376)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !55, file: !56, line: 102, baseType: !4, size: 32, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !55, file: !56, line: 103, baseType: !4, size: 32, offset: 1440)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !55, file: !56, line: 103, baseType: !4, size: 32, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !55, file: !56, line: 103, baseType: !4, size: 32, offset: 1504)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !55, file: !56, line: 103, baseType: !4, size: 32, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !55, file: !56, line: 103, baseType: !4, size: 32, offset: 1568)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !55, file: !56, line: 104, baseType: !4, size: 32, offset: 1600)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !55, file: !56, line: 104, baseType: !4, size: 32, offset: 1632)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !55, file: !56, line: 104, baseType: !4, size: 32, offset: 1664)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !55, file: !56, line: 104, baseType: !4, size: 32, offset: 1696)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !55, file: !56, line: 104, baseType: !4, size: 32, offset: 1728)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !55, file: !56, line: 105, baseType: !4, size: 32, offset: 1760)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !55, file: !56, line: 108, baseType: !156, size: 704, offset: 1792)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !56, line: 53, size: 704, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !156, file: !56, line: 54, baseType: !4, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !156, file: !56, line: 55, baseType: !4, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !156, file: !56, line: 56, baseType: !4, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !156, file: !56, line: 57, baseType: !4, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !156, file: !56, line: 59, baseType: !29, size: 96, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !156, file: !56, line: 60, baseType: !29, size: 96, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !156, file: !56, line: 61, baseType: !29, size: 96, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !156, file: !56, line: 63, baseType: !4, size: 32, offset: 416)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !156, file: !56, line: 64, baseType: !4, size: 32, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !156, file: !56, line: 65, baseType: !4, size: 32, offset: 480)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !156, file: !56, line: 67, baseType: !19, size: 16, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !156, file: !56, line: 68, baseType: !19, size: 16, offset: 528)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !156, file: !56, line: 69, baseType: !19, size: 16, offset: 544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !156, file: !56, line: 70, baseType: !19, size: 16, offset: 560)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !156, file: !56, line: 72, baseType: !4, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !156, file: !56, line: 73, baseType: !4, size: 32, offset: 608)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !156, file: !56, line: 74, baseType: !4, size: 32, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !156, file: !56, line: 75, baseType: !4, size: 32, offset: 672)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !55, file: !56, line: 109, baseType: !177, size: 128, offset: 2496)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !56, line: 79, size: 128, elements: !178)
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !56, line: 80, baseType: !5, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !177, file: !56, line: 81, baseType: !5, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !177, file: !56, line: 82, baseType: !5, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !177, file: !56, line: 83, baseType: !5, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !55, file: !56, line: 111, baseType: !4, size: 32, offset: 2624)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !55, file: !56, line: 111, baseType: !4, size: 32, offset: 2656)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !55, file: !56, line: 112, baseType: !4, size: 32, offset: 2688)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !55, file: !56, line: 112, baseType: !4, size: 32, offset: 2720)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !55, file: !56, line: 113, baseType: !4, size: 32, offset: 2752)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !55, file: !56, line: 114, baseType: !4, size: 32, offset: 2784)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !55, file: !56, line: 114, baseType: !4, size: 32, offset: 2816)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !55, file: !56, line: 115, baseType: !19, size: 16, offset: 2848)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !55, file: !56, line: 115, baseType: !19, size: 16, offset: 2864)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !55, file: !56, line: 116, baseType: !19, size: 16, offset: 2880)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !55, file: !56, line: 117, baseType: !41, size: 8, offset: 2896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !55, file: !56, line: 117, baseType: !41, size: 8, offset: 2904)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !55, file: !56, line: 119, baseType: !4, size: 32, offset: 2912)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !55, file: !56, line: 119, baseType: !4, size: 32, offset: 2944)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !55, file: !56, line: 120, baseType: !19, size: 16, offset: 2976)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !55, file: !56, line: 120, baseType: !19, size: 16, offset: 2992)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !55, file: !56, line: 121, baseType: !4, size: 32, offset: 3008)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !55, file: !56, line: 121, baseType: !4, size: 32, offset: 3040)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !55, file: !56, line: 122, baseType: !4, size: 32, offset: 3072)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !55, file: !56, line: 123, baseType: !4, size: 32, offset: 3104)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !55, file: !56, line: 124, baseType: !19, size: 16, offset: 3136)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !55, file: !56, line: 125, baseType: !19, size: 16, offset: 3152)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !55, file: !56, line: 127, baseType: !5, size: 32, offset: 3168)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !55, file: !56, line: 127, baseType: !5, size: 32, offset: 3200)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !55, file: !56, line: 128, baseType: !5, size: 32, offset: 3232)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !55, file: !56, line: 128, baseType: !5, size: 32, offset: 3264)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !55, file: !56, line: 129, baseType: !19, size: 16, offset: 3296)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !55, file: !56, line: 129, baseType: !19, size: 16, offset: 3312)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !55, file: !56, line: 129, baseType: !19, size: 16, offset: 3328)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !55, file: !56, line: 129, baseType: !19, size: 16, offset: 3344)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !55, file: !56, line: 130, baseType: !4, size: 32, offset: 3360)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !55, file: !56, line: 130, baseType: !4, size: 32, offset: 3392)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !55, file: !56, line: 130, baseType: !4, size: 32, offset: 3424)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !55, file: !56, line: 130, baseType: !4, size: 32, offset: 3456)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !55, file: !56, line: 131, baseType: !4, size: 32, offset: 3488)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !55, file: !56, line: 131, baseType: !4, size: 32, offset: 3520)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !55, file: !56, line: 131, baseType: !4, size: 32, offset: 3552)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !55, file: !56, line: 131, baseType: !4, size: 32, offset: 3584)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !55, file: !56, line: 132, baseType: !4, size: 32, offset: 3616)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !55, file: !56, line: 132, baseType: !4, size: 32, offset: 3648)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !55, file: !56, line: 133, baseType: !107, size: 512, offset: 3680)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !55, file: !56, line: 135, baseType: !4, size: 32, offset: 4192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !55, file: !56, line: 136, baseType: !4, size: 32, offset: 4224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !55, file: !56, line: 137, baseType: !4, size: 32, offset: 4256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !55, file: !56, line: 138, baseType: !5, size: 32, offset: 4288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !55, file: !56, line: 141, baseType: !41, size: 8, offset: 4320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !55, file: !56, line: 141, baseType: !41, size: 8, offset: 4328)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !55, file: !56, line: 141, baseType: !41, size: 8, offset: 4336)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !55, file: !56, line: 141, baseType: !41, size: 8, offset: 4344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !55, file: !56, line: 142, baseType: !19, size: 16, offset: 4352)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !55, file: !56, line: 142, baseType: !19, size: 16, offset: 4368)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !55, file: !56, line: 142, baseType: !19, size: 16, offset: 4384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !55, file: !56, line: 145, baseType: !41, size: 8, offset: 4400)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !55, file: !56, line: 145, baseType: !41, size: 8, offset: 4408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !55, file: !56, line: 148, baseType: !19, size: 16, offset: 4416)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !55, file: !56, line: 148, baseType: !19, size: 16, offset: 4432)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !55, file: !56, line: 149, baseType: !4, size: 32, offset: 4448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !55, file: !56, line: 149, baseType: !4, size: 32, offset: 4480)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !55, file: !56, line: 152, baseType: !242, size: 128, offset: 4512)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 4)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !55, file: !56, line: 153, baseType: !4, size: 32, offset: 4640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !55, file: !56, line: 154, baseType: !4, size: 32, offset: 4672)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !55, file: !56, line: 157, baseType: !19, size: 16, offset: 4704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !55, file: !56, line: 157, baseType: !19, size: 16, offset: 4720)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !55, file: !56, line: 160, baseType: !250, size: 64, offset: 4736)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !252, line: 113, size: 6208, elements: !253)
!252 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !{!254, !255, !256, !257, !258, !259, !263}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !251, file: !252, line: 114, baseType: !19, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !251, file: !252, line: 114, baseType: !19, size: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !251, file: !252, line: 115, baseType: !41, size: 8, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !251, file: !252, line: 115, baseType: !41, size: 8, offset: 40)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !251, file: !252, line: 116, baseType: !41, size: 8, offset: 48)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !251, file: !252, line: 117, baseType: !260, size: 8, offset: 56)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 1)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !252, line: 119, baseType: !264, size: 6144, offset: 64)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 6144, elements: !274)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !252, line: 109, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !252, line: 106, size: 192, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !266, file: !252, line: 107, baseType: !4, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !266, file: !252, line: 107, baseType: !4, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !266, file: !252, line: 107, baseType: !4, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !266, file: !252, line: 107, baseType: !4, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !266, file: !252, line: 107, baseType: !4, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !266, file: !252, line: 108, baseType: !5, size: 32, offset: 160)
!274 = !{!275}
!275 = !DISubrange(count: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !55, file: !56, line: 161, baseType: !250, size: 64, offset: 4800)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !55, file: !56, line: 162, baseType: !41, size: 8, offset: 4864)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !55, file: !56, line: 162, baseType: !41, size: 8, offset: 4872)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !55, file: !56, line: 163, baseType: !41, size: 8, offset: 4880)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !55, file: !56, line: 163, baseType: !41, size: 8, offset: 4888)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !55, file: !56, line: 164, baseType: !19, size: 16, offset: 4896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !55, file: !56, line: 164, baseType: !19, size: 16, offset: 4912)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !55, file: !56, line: 165, baseType: !4, size: 32, offset: 4928)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !55, file: !56, line: 165, baseType: !4, size: 32, offset: 4960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !55, file: !56, line: 167, baseType: !286, size: 1152, offset: 4992)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 1152, elements: !1746)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !252, line: 57, size: 2496, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !1480, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !288, file: !252, line: 59, baseType: !19, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !288, file: !252, line: 59, baseType: !19, size: 16, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !288, file: !252, line: 59, baseType: !19, size: 16, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !288, file: !252, line: 59, baseType: !19, size: 16, offset: 48)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !288, file: !252, line: 60, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !297, line: 115, size: 11392, elements: !298)
!297 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!298 = !{!299, !300, !301, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !318, !328, !342, !343, !384, !385, !388, !389, !405, !406, !407, !408, !409, !410, !411, !413, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !491, !492, !493, !494, !495, !496, !497, !498, !499, !502, !505, !514, !515, !516, !517, !518, !521, !524, !527, !528, !534, !535, !536, !537, !538, !539, !541, !544, !547, !551, !1468, !1469}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !297, line: 116, baseType: !59, size: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !296, file: !297, line: 117, baseType: !128, size: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !296, file: !297, line: 119, baseType: !302, size: 64, offset: 1024)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !297, line: 57, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !297, line: 121, baseType: !19, size: 16, offset: 1088)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !296, file: !297, line: 121, baseType: !19, size: 16, offset: 1104)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !296, file: !297, line: 122, baseType: !5, size: 32, offset: 1120)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !296, file: !297, line: 122, baseType: !5, size: 32, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !296, file: !297, line: 122, baseType: !5, size: 32, offset: 1184)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !296, file: !297, line: 123, baseType: !107, size: 512, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !296, file: !297, line: 124, baseType: !295, size: 64, offset: 1728)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !296, file: !297, line: 124, baseType: !295, size: 64, offset: 1792)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !296, file: !297, line: 127, baseType: !295, size: 64, offset: 1856)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !296, file: !297, line: 127, baseType: !295, size: 64, offset: 1920)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !296, file: !297, line: 127, baseType: !295, size: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !296, file: !297, line: 128, baseType: !316, size: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !56, line: 49, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !296, file: !297, line: 130, baseType: !319, size: 64, offset: 2112)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !297, line: 97, size: 832, elements: !321)
!321 = !{!322, !326, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !320, file: !297, line: 98, baseType: !323, size: 768)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 768, elements: !324)
!324 = !{!325, !31}
!325 = !DISubrange(count: 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !297, line: 99, baseType: !5, size: 32, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !320, file: !297, line: 99, baseType: !5, size: 32, offset: 800)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !296, file: !297, line: 131, baseType: !329, size: 64, offset: 2176)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !331, line: 486, size: 1600, elements: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !331, line: 487, baseType: !59, size: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !330, file: !331, line: 489, baseType: !117, size: 128, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !330, file: !331, line: 490, baseType: !117, size: 128, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !330, file: !331, line: 491, baseType: !117, size: 128, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !330, file: !331, line: 492, baseType: !117, size: 128, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !331, line: 494, baseType: !5, size: 32, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !330, file: !331, line: 495, baseType: !5, size: 32, offset: 1504)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !330, file: !331, line: 497, baseType: !5, size: 32, offset: 1536)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !331, line: 498, baseType: !5, size: 32, offset: 1568)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !296, file: !297, line: 132, baseType: !329, size: 64, offset: 2240)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !296, file: !297, line: 133, baseType: !344, size: 64, offset: 2304)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !331, line: 334, size: 1728, elements: !346)
!346 = !{!347, !348, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !383}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !345, file: !331, line: 335, baseType: !117, size: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !345, file: !331, line: 336, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !331, line: 47, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !345, file: !331, line: 338, baseType: !19, size: 16, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !345, file: !331, line: 338, baseType: !19, size: 16, offset: 208)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !345, file: !331, line: 339, baseType: !52, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !345, file: !331, line: 340, baseType: !5, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !345, file: !331, line: 342, baseType: !4, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !345, file: !331, line: 343, baseType: !29, size: 96, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !345, file: !331, line: 344, baseType: !29, size: 96, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !345, file: !331, line: 347, baseType: !117, size: 128, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !345, file: !331, line: 349, baseType: !5, size: 32, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !345, file: !331, line: 350, baseType: !5, size: 32, offset: 672)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !345, file: !331, line: 351, baseType: !64, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !345, file: !331, line: 352, baseType: !64, size: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !345, file: !331, line: 354, baseType: !364, size: 384, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !331, line: 116, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !331, line: 94, size: 384, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !365, file: !331, line: 96, baseType: !5, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !365, file: !331, line: 96, baseType: !5, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !365, file: !331, line: 97, baseType: !5, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !365, file: !331, line: 97, baseType: !5, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !365, file: !331, line: 99, baseType: !19, size: 16, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !365, file: !331, line: 100, baseType: !19, size: 16, offset: 144)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !365, file: !331, line: 102, baseType: !19, size: 16, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !365, file: !331, line: 105, baseType: !19, size: 16, offset: 176)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !365, file: !331, line: 108, baseType: !19, size: 16, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !365, file: !331, line: 109, baseType: !19, size: 16, offset: 208)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !365, file: !331, line: 111, baseType: !19, size: 16, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !365, file: !331, line: 112, baseType: !19, size: 16, offset: 240)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !365, file: !331, line: 114, baseType: !5, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !365, file: !331, line: 114, baseType: !5, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !365, file: !331, line: 115, baseType: !5, size: 32, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !365, file: !331, line: 115, baseType: !5, size: 32, offset: 352)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !345, file: !331, line: 355, baseType: !107, size: 512, offset: 1216)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !296, file: !297, line: 134, baseType: !64, size: 64, offset: 2368)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !296, file: !297, line: 136, baseType: !386, size: 64, offset: 2432)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !297, line: 58, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !296, file: !297, line: 138, baseType: !364, size: 384, offset: 2496)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !296, file: !297, line: 139, baseType: !390, size: 64, offset: 2880)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !331, line: 80, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !331, line: 72, size: 192, elements: !393)
!393 = !{!394, !401, !402, !403, !404}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !392, file: !331, line: 73, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !331, line: 59, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !331, line: 56, size: 128, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !397, file: !331, line: 57, baseType: !29, size: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !331, line: 58, baseType: !5, size: 32, offset: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !392, file: !331, line: 74, baseType: !5, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !392, file: !331, line: 76, baseType: !5, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !392, file: !331, line: 77, baseType: !5, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !392, file: !331, line: 79, baseType: !5, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !296, file: !297, line: 141, baseType: !117, size: 128, offset: 2944)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !296, file: !297, line: 142, baseType: !117, size: 128, offset: 3072)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !296, file: !297, line: 143, baseType: !117, size: 128, offset: 3200)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !296, file: !297, line: 144, baseType: !117, size: 128, offset: 3328)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !296, file: !297, line: 146, baseType: !5, size: 32, offset: 3456)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !296, file: !297, line: 147, baseType: !5, size: 32, offset: 3488)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !296, file: !297, line: 150, baseType: !412, size: 64, offset: 3520)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !296, file: !297, line: 151, baseType: !414, size: 64, offset: 3584)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !296, file: !297, line: 152, baseType: !5, size: 32, offset: 3648)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !296, file: !297, line: 153, baseType: !5, size: 32, offset: 3680)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !296, file: !297, line: 156, baseType: !29, size: 96, offset: 3712)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !296, file: !297, line: 156, baseType: !29, size: 96, offset: 3808)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !296, file: !297, line: 156, baseType: !29, size: 96, offset: 3904)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !296, file: !297, line: 157, baseType: !29, size: 96, offset: 4000)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !296, file: !297, line: 158, baseType: !29, size: 96, offset: 4096)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !296, file: !297, line: 159, baseType: !29, size: 96, offset: 4192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !296, file: !297, line: 160, baseType: !29, size: 96, offset: 4288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !296, file: !297, line: 160, baseType: !29, size: 96, offset: 4384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !296, file: !297, line: 161, baseType: !242, size: 128, offset: 4480)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !296, file: !297, line: 161, baseType: !242, size: 128, offset: 4608)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !296, file: !297, line: 162, baseType: !29, size: 96, offset: 4736)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !296, file: !297, line: 162, baseType: !29, size: 96, offset: 4832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !296, file: !297, line: 163, baseType: !4, size: 32, offset: 4928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !296, file: !297, line: 163, baseType: !4, size: 32, offset: 4960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !296, file: !297, line: 164, baseType: !432, size: 512, offset: 4992)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !433)
!433 = !{!244, !244}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !296, file: !297, line: 165, baseType: !432, size: 512, offset: 5504)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !296, file: !297, line: 166, baseType: !432, size: 512, offset: 6016)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !296, file: !297, line: 167, baseType: !432, size: 512, offset: 6528)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !296, file: !297, line: 176, baseType: !432, size: 512, offset: 7040)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !296, file: !297, line: 178, baseType: !52, size: 32, offset: 7552)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !297, line: 180, baseType: !19, size: 16, offset: 7584)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !296, file: !297, line: 181, baseType: !19, size: 16, offset: 7600)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !296, file: !297, line: 183, baseType: !19, size: 16, offset: 7616)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !296, file: !297, line: 183, baseType: !19, size: 16, offset: 7632)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !296, file: !297, line: 184, baseType: !19, size: 16, offset: 7648)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !296, file: !297, line: 184, baseType: !19, size: 16, offset: 7664)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !296, file: !297, line: 185, baseType: !19, size: 16, offset: 7680)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !296, file: !297, line: 186, baseType: !19, size: 16, offset: 7696)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !296, file: !297, line: 187, baseType: !19, size: 16, offset: 7712)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !296, file: !297, line: 188, baseType: !41, size: 8, offset: 7728)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !296, file: !297, line: 189, baseType: !41, size: 8, offset: 7736)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !296, file: !297, line: 192, baseType: !5, size: 32, offset: 7744)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !296, file: !297, line: 192, baseType: !5, size: 32, offset: 7776)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !296, file: !297, line: 192, baseType: !5, size: 32, offset: 7808)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !296, file: !297, line: 192, baseType: !5, size: 32, offset: 7840)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !296, file: !297, line: 194, baseType: !5, size: 32, offset: 7872)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !296, file: !297, line: 202, baseType: !4, size: 32, offset: 7904)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !296, file: !297, line: 202, baseType: !4, size: 32, offset: 7936)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !296, file: !297, line: 202, baseType: !4, size: 32, offset: 7968)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !296, file: !297, line: 211, baseType: !4, size: 32, offset: 8000)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !296, file: !297, line: 212, baseType: !4, size: 32, offset: 8032)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !296, file: !297, line: 213, baseType: !4, size: 32, offset: 8064)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !296, file: !297, line: 214, baseType: !4, size: 32, offset: 8096)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !296, file: !297, line: 215, baseType: !4, size: 32, offset: 8128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !296, file: !297, line: 216, baseType: !4, size: 32, offset: 8160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !296, file: !297, line: 219, baseType: !4, size: 32, offset: 8192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !296, file: !297, line: 220, baseType: !4, size: 32, offset: 8224)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !296, file: !297, line: 221, baseType: !4, size: 32, offset: 8256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !296, file: !297, line: 224, baseType: !468, size: 16, offset: 8288)
!468 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !296, file: !297, line: 224, baseType: !468, size: 16, offset: 8304)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !296, file: !297, line: 226, baseType: !19, size: 16, offset: 8320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !296, file: !297, line: 228, baseType: !41, size: 8, offset: 8336)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !296, file: !297, line: 229, baseType: !41, size: 8, offset: 8344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !296, file: !297, line: 231, baseType: !19, size: 16, offset: 8352)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !296, file: !297, line: 232, baseType: !41, size: 8, offset: 8368)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !296, file: !297, line: 233, baseType: !41, size: 8, offset: 8376)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !296, file: !297, line: 234, baseType: !4, size: 32, offset: 8384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !296, file: !297, line: 235, baseType: !4, size: 32, offset: 8416)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !296, file: !297, line: 237, baseType: !117, size: 128, offset: 8448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !296, file: !297, line: 238, baseType: !117, size: 128, offset: 8576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !296, file: !297, line: 239, baseType: !117, size: 128, offset: 8704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !296, file: !297, line: 240, baseType: !117, size: 128, offset: 8832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !296, file: !297, line: 242, baseType: !4, size: 32, offset: 8960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !296, file: !297, line: 244, baseType: !19, size: 16, offset: 8992)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !296, file: !297, line: 245, baseType: !468, size: 16, offset: 9008)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !296, file: !297, line: 246, baseType: !242, size: 128, offset: 9024)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !296, file: !297, line: 248, baseType: !5, size: 32, offset: 9152)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !296, file: !297, line: 249, baseType: !5, size: 32, offset: 9184)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !296, file: !297, line: 251, baseType: !489, size: 64, offset: 9216)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !297, line: 251, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !296, file: !297, line: 253, baseType: !41, size: 8, offset: 9280)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !296, file: !297, line: 254, baseType: !41, size: 8, offset: 9288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !296, file: !297, line: 255, baseType: !19, size: 16, offset: 9296)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !296, file: !297, line: 256, baseType: !29, size: 96, offset: 9312)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !296, file: !297, line: 258, baseType: !117, size: 128, offset: 9408)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !296, file: !297, line: 259, baseType: !117, size: 128, offset: 9536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !296, file: !297, line: 260, baseType: !117, size: 128, offset: 9664)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !296, file: !297, line: 261, baseType: !117, size: 128, offset: 9792)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !296, file: !297, line: 263, baseType: !500, size: 64, offset: 9920)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !297, line: 52, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !296, file: !297, line: 264, baseType: !503, size: 64, offset: 9984)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !297, line: 53, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !296, file: !297, line: 265, baseType: !506, size: 64, offset: 10048)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !508, line: 51, size: 1216, elements: !509)
!508 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!509 = !{!510, !511, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !507, file: !508, line: 52, baseType: !59, size: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !507, file: !508, line: 54, baseType: !117, size: 128, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !507, file: !508, line: 59, baseType: !52, size: 32, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !507, file: !508, line: 60, baseType: !29, size: 96, offset: 1120)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !296, file: !297, line: 267, baseType: !41, size: 8, offset: 10112)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !296, file: !297, line: 268, baseType: !41, size: 8, offset: 10120)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !296, file: !297, line: 269, baseType: !19, size: 16, offset: 10128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !296, file: !297, line: 270, baseType: !4, size: 32, offset: 10144)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !296, file: !297, line: 272, baseType: !519, size: 64, offset: 10176)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !297, line: 54, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !296, file: !297, line: 275, baseType: !522, size: 64, offset: 10240)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !297, line: 275, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !296, file: !297, line: 277, baseType: !525, size: 64, offset: 10304)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !297, line: 56, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !296, file: !297, line: 277, baseType: !525, size: 64, offset: 10368)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !296, file: !297, line: 278, baseType: !529, size: 64, offset: 10432)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !530, line: 27, baseType: !531)
!530 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !532, line: 45, baseType: !533)
!532 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!533 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !296, file: !297, line: 279, baseType: !529, size: 64, offset: 10496)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !296, file: !297, line: 280, baseType: !52, size: 32, offset: 10560)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !296, file: !297, line: 281, baseType: !52, size: 32, offset: 10592)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !296, file: !297, line: 283, baseType: !117, size: 128, offset: 10624)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !296, file: !297, line: 284, baseType: !117, size: 128, offset: 10752)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !296, file: !297, line: 285, baseType: !540, size: 64, offset: 10880)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !296, file: !297, line: 287, baseType: !542, size: 64, offset: 10944)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !297, line: 59, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !296, file: !297, line: 288, baseType: !545, size: 64, offset: 11008)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !297, line: 288, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !296, file: !297, line: 290, baseType: !548, size: 64, offset: 11072)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 2)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !296, file: !297, line: 291, baseType: !552, size: 64, offset: 11136)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !554, line: 65, baseType: !555)
!554 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !554, line: 50, size: 320, elements: !556)
!556 = !{!557, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !555, file: !554, line: 51, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !560, line: 1216, size: 39680, elements: !561)
!560 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!561 = !{!562, !563, !564, !565, !665, !666, !667, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !694, !1035, !1038, !1328, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1350, !1351, !1352, !1353, !1354, !1362, !1429, !1436, !1437, !1444, !1447, !1448, !1449, !1450, !1451, !1452}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !559, file: !560, line: 1217, baseType: !59, size: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !559, file: !560, line: 1218, baseType: !128, size: 64, offset: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !559, file: !560, line: 1220, baseType: !295, size: 64, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !559, file: !560, line: 1221, baseType: !566, size: 64, offset: 1088)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !568, line: 52, size: 4224, elements: !569)
!568 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !644, !646, !662}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !567, file: !568, line: 53, baseType: !59, size: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !567, file: !568, line: 54, baseType: !128, size: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !567, file: !568, line: 56, baseType: !19, size: 16, offset: 1024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !567, file: !568, line: 56, baseType: !19, size: 16, offset: 1040)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !567, file: !568, line: 57, baseType: !19, size: 16, offset: 1056)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !567, file: !568, line: 57, baseType: !19, size: 16, offset: 1072)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !567, file: !568, line: 59, baseType: !4, size: 32, offset: 1088)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !567, file: !568, line: 59, baseType: !4, size: 32, offset: 1120)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !567, file: !568, line: 59, baseType: !4, size: 32, offset: 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !567, file: !568, line: 60, baseType: !4, size: 32, offset: 1184)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !567, file: !568, line: 60, baseType: !4, size: 32, offset: 1216)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !567, file: !568, line: 60, baseType: !4, size: 32, offset: 1248)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !567, file: !568, line: 61, baseType: !4, size: 32, offset: 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !567, file: !568, line: 61, baseType: !4, size: 32, offset: 1312)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !567, file: !568, line: 61, baseType: !4, size: 32, offset: 1344)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !567, file: !568, line: 68, baseType: !4, size: 32, offset: 1376)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !567, file: !568, line: 68, baseType: !4, size: 32, offset: 1408)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !567, file: !568, line: 68, baseType: !4, size: 32, offset: 1440)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !567, file: !568, line: 69, baseType: !4, size: 32, offset: 1472)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !567, file: !568, line: 69, baseType: !4, size: 32, offset: 1504)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !567, file: !568, line: 74, baseType: !4, size: 32, offset: 1536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !567, file: !568, line: 79, baseType: !4, size: 32, offset: 1568)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !567, file: !568, line: 81, baseType: !19, size: 16, offset: 1600)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !567, file: !568, line: 91, baseType: !19, size: 16, offset: 1616)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !567, file: !568, line: 92, baseType: !19, size: 16, offset: 1632)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !567, file: !568, line: 93, baseType: !19, size: 16, offset: 1648)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !567, file: !568, line: 94, baseType: !19, size: 16, offset: 1664)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !567, file: !568, line: 94, baseType: !19, size: 16, offset: 1680)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !567, file: !568, line: 94, baseType: !19, size: 16, offset: 1696)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !567, file: !568, line: 94, baseType: !19, size: 16, offset: 1712)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !567, file: !568, line: 96, baseType: !4, size: 32, offset: 1728)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !567, file: !568, line: 96, baseType: !4, size: 32, offset: 1760)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !567, file: !568, line: 96, baseType: !4, size: 32, offset: 1792)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !567, file: !568, line: 96, baseType: !4, size: 32, offset: 1824)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !567, file: !568, line: 98, baseType: !4, size: 32, offset: 1856)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !567, file: !568, line: 98, baseType: !4, size: 32, offset: 1888)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !567, file: !568, line: 98, baseType: !4, size: 32, offset: 1920)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !567, file: !568, line: 98, baseType: !4, size: 32, offset: 1952)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !567, file: !568, line: 99, baseType: !4, size: 32, offset: 1984)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !567, file: !568, line: 99, baseType: !4, size: 32, offset: 2016)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !567, file: !568, line: 100, baseType: !4, size: 32, offset: 2048)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !567, file: !568, line: 100, baseType: !4, size: 32, offset: 2080)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !567, file: !568, line: 103, baseType: !19, size: 16, offset: 2112)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !567, file: !568, line: 103, baseType: !19, size: 16, offset: 2128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !567, file: !568, line: 103, baseType: !19, size: 16, offset: 2144)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !567, file: !568, line: 103, baseType: !19, size: 16, offset: 2160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !567, file: !568, line: 106, baseType: !4, size: 32, offset: 2176)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !567, file: !568, line: 106, baseType: !4, size: 32, offset: 2208)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !567, file: !568, line: 106, baseType: !4, size: 32, offset: 2240)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !567, file: !568, line: 106, baseType: !4, size: 32, offset: 2272)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !567, file: !568, line: 107, baseType: !19, size: 16, offset: 2304)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !567, file: !568, line: 107, baseType: !19, size: 16, offset: 2320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !567, file: !568, line: 107, baseType: !19, size: 16, offset: 2336)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !567, file: !568, line: 107, baseType: !19, size: 16, offset: 2352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !567, file: !568, line: 108, baseType: !4, size: 32, offset: 2368)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !567, file: !568, line: 108, baseType: !4, size: 32, offset: 2400)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !567, file: !568, line: 109, baseType: !4, size: 32, offset: 2432)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !567, file: !568, line: 109, baseType: !4, size: 32, offset: 2464)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !567, file: !568, line: 110, baseType: !4, size: 32, offset: 2496)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !567, file: !568, line: 110, baseType: !4, size: 32, offset: 2528)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !567, file: !568, line: 110, baseType: !4, size: 32, offset: 2560)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !567, file: !568, line: 111, baseType: !19, size: 16, offset: 2592)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !567, file: !568, line: 111, baseType: !19, size: 16, offset: 2608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !567, file: !568, line: 112, baseType: !19, size: 16, offset: 2624)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !567, file: !568, line: 112, baseType: !19, size: 16, offset: 2640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !567, file: !568, line: 112, baseType: !19, size: 16, offset: 2656)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !568, line: 115, baseType: !19, size: 16, offset: 2672)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !567, file: !568, line: 118, baseType: !638, size: 64, offset: 2688)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !567, file: !568, line: 118, baseType: !638, size: 64, offset: 2752)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !567, file: !568, line: 121, baseType: !316, size: 64, offset: 2816)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !567, file: !568, line: 122, baseType: !286, size: 1152, offset: 2880)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !567, file: !568, line: 123, baseType: !19, size: 16, offset: 4032)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !567, file: !568, line: 123, baseType: !19, size: 16, offset: 4048)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !567, file: !568, line: 123, baseType: !645, size: 32, offset: 4064)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !549)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !567, file: !568, line: 126, baseType: !647, size: 64, offset: 4096)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !60, line: 159, size: 448, elements: !649)
!649 = !{!650, !652, !653, !654, !655, !658}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !648, file: !60, line: 161, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !549)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !648, file: !60, line: 162, baseType: !651, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !648, file: !60, line: 163, baseType: !645, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !648, file: !60, line: 164, baseType: !645, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !648, file: !60, line: 165, baseType: !656, size: 128, offset: 192)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 128, elements: !549)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !648, file: !60, line: 166, baseType: !659, size: 128, offset: 320)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 128, elements: !549)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !60, line: 46, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !567, file: !568, line: 129, baseType: !663, size: 64, offset: 4160)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !56, line: 47, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !559, file: !560, line: 1223, baseType: !558, size: 64, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !559, file: !560, line: 1225, baseType: !117, size: 128, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !559, file: !560, line: 1226, baseType: !668, size: 64, offset: 1344)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !560, line: 69, size: 320, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !560, line: 70, baseType: !668, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !669, file: !560, line: 70, baseType: !668, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !669, file: !560, line: 71, baseType: !52, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !669, file: !560, line: 71, baseType: !52, size: 32, offset: 160)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !560, line: 72, baseType: !5, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !669, file: !560, line: 73, baseType: !19, size: 16, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !669, file: !560, line: 73, baseType: !19, size: 16, offset: 240)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !669, file: !560, line: 74, baseType: !295, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !559, file: !560, line: 1227, baseType: !295, size: 64, offset: 1408)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !559, file: !560, line: 1229, baseType: !29, size: 96, offset: 1472)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !559, file: !560, line: 1230, baseType: !29, size: 96, offset: 1568)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !559, file: !560, line: 1231, baseType: !29, size: 96, offset: 1664)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !559, file: !560, line: 1231, baseType: !29, size: 96, offset: 1760)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !559, file: !560, line: 1233, baseType: !52, size: 32, offset: 1856)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !559, file: !560, line: 1234, baseType: !5, size: 32, offset: 1888)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !559, file: !560, line: 1235, baseType: !52, size: 32, offset: 1920)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !559, file: !560, line: 1237, baseType: !19, size: 16, offset: 1952)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !559, file: !560, line: 1239, baseType: !41, size: 8, offset: 1968)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !559, file: !560, line: 1240, baseType: !260, size: 8, offset: 1976)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !559, file: !560, line: 1242, baseType: !663, size: 64, offset: 1984)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !559, file: !560, line: 1244, baseType: !692, size: 64, offset: 2048)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !560, line: 59, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !559, file: !560, line: 1246, baseType: !695, size: 64, offset: 2112)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !560, line: 1067, size: 5184, elements: !697)
!697 = !{!698, !728, !729, !744, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !766, !906, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !955, !956, !957, !958, !959, !960, !961, !962, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !1018}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !696, file: !560, line: 1068, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !560, line: 934, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !560, line: 925, size: 576, elements: !702)
!702 = !{!703, !720, !721, !722, !723, !724, !727}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !701, file: !560, line: 926, baseType: !704, size: 320)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !560, line: 830, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !560, line: 813, size: 320, elements: !706)
!706 = !{!707, !710, !713, !714, !717, !718, !719}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !705, file: !560, line: 814, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !560, line: 51, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !705, file: !560, line: 815, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !560, line: 815, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !705, file: !560, line: 818, baseType: !64, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !705, file: !560, line: 819, baseType: !715, size: 32, offset: 192)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 32, elements: !243)
!716 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !560, line: 822, baseType: !5, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !705, file: !560, line: 826, baseType: !5, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !705, file: !560, line: 829, baseType: !5, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !701, file: !560, line: 928, baseType: !19, size: 16, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !560, line: 928, baseType: !19, size: 16, offset: 336)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !701, file: !560, line: 929, baseType: !5, size: 32, offset: 352)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !701, file: !560, line: 930, baseType: !657, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !701, file: !560, line: 931, baseType: !725, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !560, line: 931, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !701, file: !560, line: 933, baseType: !64, size: 64, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !696, file: !560, line: 1069, baseType: !699, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !696, file: !560, line: 1070, baseType: !730, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !560, line: 916, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !560, line: 891, size: 704, elements: !733)
!733 = !{!734, !735, !736, !738, !739, !740, !741, !742, !743}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !732, file: !560, line: 892, baseType: !704, size: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !732, file: !560, line: 896, baseType: !5, size: 32, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !732, file: !560, line: 900, baseType: !737, size: 96, offset: 352)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !30)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !732, file: !560, line: 903, baseType: !4, size: 32, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !732, file: !560, line: 906, baseType: !5, size: 32, offset: 480)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !732, file: !560, line: 909, baseType: !4, size: 32, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !732, file: !560, line: 912, baseType: !4, size: 32, offset: 544)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !732, file: !560, line: 914, baseType: !295, size: 64, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !732, file: !560, line: 915, baseType: !64, size: 64, offset: 640)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !696, file: !560, line: 1071, baseType: !745, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !560, line: 920, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !560, line: 918, size: 320, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !747, file: !560, line: 919, baseType: !704, size: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !696, file: !560, line: 1075, baseType: !4, size: 32, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !696, file: !560, line: 1077, baseType: !4, size: 32, offset: 288)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !696, file: !560, line: 1078, baseType: !4, size: 32, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !696, file: !560, line: 1079, baseType: !19, size: 16, offset: 352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !696, file: !560, line: 1082, baseType: !19, size: 16, offset: 368)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !696, file: !560, line: 1085, baseType: !41, size: 8, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !696, file: !560, line: 1086, baseType: !41, size: 8, offset: 392)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !696, file: !560, line: 1087, baseType: !41, size: 8, offset: 400)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !696, file: !560, line: 1088, baseType: !41, size: 8, offset: 408)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !696, file: !560, line: 1090, baseType: !4, size: 32, offset: 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !696, file: !560, line: 1093, baseType: !19, size: 16, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !696, file: !560, line: 1096, baseType: !41, size: 8, offset: 464)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !696, file: !560, line: 1098, baseType: !763, size: 40, offset: 472)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 40, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 5)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !696, file: !560, line: 1101, baseType: !767, size: 832, offset: 512)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !560, line: 836, size: 832, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !902, !903, !904, !905}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !767, file: !560, line: 837, baseType: !704, size: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !767, file: !560, line: 839, baseType: !19, size: 16, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !767, file: !560, line: 839, baseType: !19, size: 16, offset: 336)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !767, file: !560, line: 842, baseType: !19, size: 16, offset: 352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !767, file: !560, line: 842, baseType: !19, size: 16, offset: 368)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !767, file: !560, line: 843, baseType: !645, size: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !767, file: !560, line: 845, baseType: !5, size: 32, offset: 416)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !767, file: !560, line: 847, baseType: !64, size: 64, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !767, file: !560, line: 848, baseType: !778, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !554, line: 77, size: 15424, elements: !780)
!780 = !{!781, !782, !783, !786, !787, !791, !853, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !891, !892, !896}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !779, file: !554, line: 78, baseType: !59, size: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !779, file: !554, line: 80, baseType: !79, size: 8192, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !779, file: !554, line: 82, baseType: !784, size: 64, offset: 9152)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !554, line: 43, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !779, file: !554, line: 83, baseType: !660, size: 64, offset: 9216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !779, file: !554, line: 86, baseType: !788, size: 64, offset: 9280)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !790, line: 85, flags: DIFlagFwdDecl)
!790 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !779, file: !554, line: 87, baseType: !792, size: 64, offset: 9344)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !794, line: 110, size: 1152, elements: !795)
!794 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!795 = !{!796, !797, !798, !799, !800, !801, !802, !804, !805, !806, !815, !816, !817, !818, !820, !849, !850, !851, !852}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !793, file: !794, line: 111, baseType: !792, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !793, file: !794, line: 111, baseType: !792, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !793, file: !794, line: 114, baseType: !5, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !793, file: !794, line: 114, baseType: !5, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !793, file: !794, line: 115, baseType: !19, size: 16, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !793, file: !794, line: 115, baseType: !19, size: 16, offset: 208)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !793, file: !794, line: 118, baseType: !803, size: 64, offset: 256)
