; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_iterators.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_iterators.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ViewContext = type { %struct.Scene*, %struct.Object*, %struct.Object*, %struct.ARegion*, %struct.View3D*, %struct.RegionView3D*, %struct.BMEditMesh*, [2 x i32] }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque

!78 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!79 = !{!80, !81, !82, !83}
!80 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!83 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 109, baseType: !5, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91}
!86 = !DIEnumerator(name: "V3D_PROJ_RET_OK", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_NEAR", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_ZERO", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_BB", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_WIN", value: 4, isUnsigned: true)
!91 = !DIEnumerator(name: "V3D_PROJ_RET_OVERFLOW", value: 5, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !93, line: 187, baseType: !5, size: 32, elements: !94)
!93 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!95 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!98 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!99 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!100 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!101 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!102 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!103 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!104 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!105 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!106 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!107 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!108 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!109 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!110 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!111 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!112 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!113 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!114 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!115 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!116 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!117 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !119, line: 304, baseType: !5, size: 32, elements: !120)
!119 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !{!121, !122, !123, !124}
!121 = !DIEnumerator(name: "ME_VERT_TMP_TAG", value: 4, isUnsigned: true)
!122 = !DIEnumerator(name: "ME_HIDE", value: 16, isUnsigned: true)
!123 = !DIEnumerator(name: "ME_VERT_MERGED", value: 64, isUnsigned: true)
!124 = !DIEnumerator(name: "ME_VERT_PBVH_UPDATE", value: 128, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 260, baseType: !5, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133}
!127 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!129 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!130 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!131 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!132 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!133 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!134 = !{!135, !282, !379, !292, !381}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaBall", file: !137, line: 95, baseType: !138)
!137 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meta_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaBall", file: !137, line: 64, size: 1984, elements: !139)
!139 = !{!140, !212, !216, !217, !218, !220, !223, !227, !228, !229, !230, !231, !232, !237, !238, !239, !240, !241, !242}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !137, line: 65, baseType: !141, size: 960)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !142, line: 130, baseType: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !142, line: 117, size: 960, elements: !144)
!144 = !{!145, !147, !148, !150, !170, !174, !176, !178, !179, !180}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !142, line: 118, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !142, line: 118, baseType: !146, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !143, file: !142, line: 119, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !143, file: !142, line: 120, baseType: !151, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !142, line: 136, size: 17600, elements: !153)
!153 = !{!154, !155, !157, !160, !165, !166, !167}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !142, line: 137, baseType: !141, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !152, file: !142, line: 138, baseType: !156, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !152, file: !142, line: 139, baseType: !158, size: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !142, line: 43, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !142, line: 140, baseType: !161, size: 8192, offset: 1088)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 8192, elements: !163)
!162 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!163 = !{!164}
!164 = !DISubrange(count: 1024)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !152, file: !142, line: 141, baseType: !161, size: 8192, offset: 9280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !152, file: !142, line: 148, baseType: !151, size: 64, offset: 17472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !152, file: !142, line: 150, baseType: !168, size: 64, offset: 17536)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !142, line: 45, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !142, line: 121, baseType: !171, size: 528, offset: 256)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 528, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 66)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !142, line: 126, baseType: !175, size: 16, offset: 784)
!175 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !143, file: !142, line: 127, baseType: !177, size: 32, offset: 800)
!177 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !143, file: !142, line: 128, baseType: !177, size: 32, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !143, file: !142, line: 128, baseType: !177, size: 32, offset: 864)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !143, file: !142, line: 129, baseType: !181, size: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !142, line: 75, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !142, line: 62, size: 1024, elements: !184)
!184 = !{!185, !187, !188, !189, !190, !191, !195, !196, !210, !211}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !183, file: !142, line: 63, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !183, file: !142, line: 63, baseType: !186, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !183, file: !142, line: 64, baseType: !162, size: 8, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !183, file: !142, line: 64, baseType: !162, size: 8, offset: 136)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !183, file: !142, line: 65, baseType: !175, size: 16, offset: 144)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !142, line: 66, baseType: !192, size: 512, offset: 160)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 512, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !183, file: !142, line: 67, baseType: !177, size: 32, offset: 672)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !142, line: 69, baseType: !197, size: 256, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !142, line: 60, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !142, line: 48, size: 256, elements: !199)
!199 = !{!200, !201, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !198, file: !142, line: 49, baseType: !146, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !198, file: !142, line: 58, baseType: !202, size: 128, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !203, line: 71, baseType: !204)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !203, line: 69, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !204, file: !203, line: 70, baseType: !146, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !204, file: !203, line: 70, baseType: !146, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !198, file: !142, line: 59, baseType: !177, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !198, file: !142, line: 59, baseType: !177, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !183, file: !142, line: 70, baseType: !177, size: 32, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !183, file: !142, line: 74, baseType: !177, size: 32, offset: 992)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !138, file: !137, line: 66, baseType: !213, size: 64, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !215, line: 48, flags: DIFlagFwdDecl)
!215 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !138, file: !137, line: 68, baseType: !202, size: 128, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !138, file: !137, line: 69, baseType: !202, size: 128, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "editelems", scope: !138, file: !137, line: 70, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !138, file: !137, line: 71, baseType: !221, size: 64, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !215, line: 44, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !138, file: !137, line: 74, baseType: !224, size: 64, offset: 1408)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !215, line: 46, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !138, file: !137, line: 76, baseType: !162, size: 8, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag2", scope: !138, file: !137, line: 76, baseType: !162, size: 8, offset: 1480)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !138, file: !137, line: 77, baseType: !175, size: 16, offset: 1488)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !138, file: !137, line: 78, baseType: !175, size: 16, offset: 1504)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !138, file: !137, line: 78, baseType: !175, size: 16, offset: 1520)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !138, file: !137, line: 81, baseType: !233, size: 96, offset: 1536)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 96, elements: !235)
!234 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!235 = !{!236}
!236 = !DISubrange(count: 3)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !138, file: !137, line: 82, baseType: !233, size: 96, offset: 1632)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !138, file: !137, line: 83, baseType: !233, size: 96, offset: 1728)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "wiresize", scope: !138, file: !137, line: 85, baseType: !234, size: 32, offset: 1824)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rendersize", scope: !138, file: !137, line: 85, baseType: !234, size: 32, offset: 1856)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "thresh", scope: !138, file: !137, line: 90, baseType: !234, size: 32, offset: 1888)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lastelem", scope: !138, file: !137, line: 94, baseType: !243, size: 64, offset: 1920)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaElem", file: !137, line: 62, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaElem", file: !137, line: 44, size: 832, elements: !246)
!246 = !{!247, !249, !250, !261, !262, !263, !264, !265, !266, !267, !268, !272, !273, !274, !275, !276, !277, !278, !279, !281}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !137, line: 45, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !137, line: 45, baseType: !248, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !245, file: !137, line: 47, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !253, line: 97, size: 832, elements: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = !{!255, !259, !260}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !252, file: !253, line: 98, baseType: !256, size: 768)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 768, elements: !257)
!257 = !{!258, !236}
!258 = !DISubrange(count: 8)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !253, line: 99, baseType: !177, size: 32, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !252, file: !253, line: 99, baseType: !177, size: 32, offset: 800)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !137, line: 49, baseType: !175, size: 16, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !137, line: 49, baseType: !175, size: 16, offset: 208)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "selcol1", scope: !245, file: !137, line: 49, baseType: !175, size: 16, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "selcol2", scope: !245, file: !137, line: 49, baseType: !175, size: 16, offset: 240)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !245, file: !137, line: 50, baseType: !234, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !245, file: !137, line: 50, baseType: !234, size: 32, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !245, file: !137, line: 50, baseType: !234, size: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !245, file: !137, line: 51, baseType: !269, size: 128, offset: 352)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 128, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 4)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "expx", scope: !245, file: !137, line: 52, baseType: !234, size: 32, offset: 480)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "expy", scope: !245, file: !137, line: 53, baseType: !234, size: 32, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "expz", scope: !245, file: !137, line: 54, baseType: !234, size: 32, offset: 544)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !245, file: !137, line: 55, baseType: !234, size: 32, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rad2", scope: !245, file: !137, line: 56, baseType: !234, size: 32, offset: 608)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !245, file: !137, line: 57, baseType: !234, size: 32, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !137, line: 58, baseType: !234, size: 32, offset: 672)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !245, file: !137, line: 60, baseType: !280, size: 64, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !245, file: !137, line: 60, baseType: !280, size: 64, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !93, line: 114, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !93, line: 78, size: 2048, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !332, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !284, file: !93, line: 79, baseType: !141, size: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !284, file: !93, line: 80, baseType: !213, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !284, file: !93, line: 82, baseType: !202, size: 128, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !284, file: !93, line: 83, baseType: !202, size: 128, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !284, file: !93, line: 84, baseType: !219, size: 64, offset: 1280)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !284, file: !93, line: 92, baseType: !292, size: 64, offset: 1344)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !93, line: 76, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !93, line: 48, size: 2624, elements: !295)
!295 = !{!296, !298, !299, !300, !301, !302, !303, !304, !305, !306, !309, !310, !311, !312, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !93, line: 49, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !294, file: !93, line: 49, baseType: !297, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !294, file: !93, line: 50, baseType: !181, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !294, file: !93, line: 51, baseType: !297, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !294, file: !93, line: 52, baseType: !202, size: 128, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !93, line: 53, baseType: !192, size: 512, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !294, file: !93, line: 55, baseType: !234, size: 32, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !294, file: !93, line: 56, baseType: !233, size: 96, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !294, file: !93, line: 57, baseType: !233, size: 96, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !294, file: !93, line: 58, baseType: !307, size: 288, offset: 1120)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 288, elements: !308)
!308 = !{!236, !236}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !294, file: !93, line: 60, baseType: !177, size: 32, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !294, file: !93, line: 62, baseType: !233, size: 96, offset: 1440)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !294, file: !93, line: 63, baseType: !233, size: 96, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !294, file: !93, line: 64, baseType: !313, size: 512, offset: 1632)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 512, elements: !314)
!314 = !{!271, !271}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !294, file: !93, line: 65, baseType: !234, size: 32, offset: 2144)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !294, file: !93, line: 67, baseType: !234, size: 32, offset: 2176)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !294, file: !93, line: 67, baseType: !234, size: 32, offset: 2208)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !294, file: !93, line: 68, baseType: !234, size: 32, offset: 2240)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !294, file: !93, line: 68, baseType: !234, size: 32, offset: 2272)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !294, file: !93, line: 68, baseType: !234, size: 32, offset: 2304)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !294, file: !93, line: 69, baseType: !234, size: 32, offset: 2336)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !294, file: !93, line: 69, baseType: !234, size: 32, offset: 2368)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !294, file: !93, line: 70, baseType: !234, size: 32, offset: 2400)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !294, file: !93, line: 70, baseType: !234, size: 32, offset: 2432)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !294, file: !93, line: 72, baseType: !233, size: 96, offset: 2464)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !294, file: !93, line: 73, baseType: !177, size: 32, offset: 2560)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !294, file: !93, line: 74, baseType: !175, size: 16, offset: 2592)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !294, file: !93, line: 75, baseType: !329, size: 16, offset: 2608)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 16, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 1)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !284, file: !93, line: 93, baseType: !333, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !335, line: 56, size: 1472, elements: !336)
!335 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !335, line: 57, baseType: !333, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !335, line: 57, baseType: !333, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !334, file: !335, line: 58, baseType: !186, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !334, file: !335, line: 59, baseType: !333, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !334, file: !335, line: 62, baseType: !146, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !335, line: 64, baseType: !192, size: 512, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !334, file: !335, line: 65, baseType: !234, size: 32, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !334, file: !335, line: 70, baseType: !233, size: 96, offset: 864)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !334, file: !335, line: 71, baseType: !233, size: 96, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !335, line: 75, baseType: !177, size: 32, offset: 1056)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !334, file: !335, line: 76, baseType: !177, size: 32, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !334, file: !335, line: 78, baseType: !234, size: 32, offset: 1120)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !334, file: !335, line: 78, baseType: !234, size: 32, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !334, file: !335, line: 79, baseType: !234, size: 32, offset: 1184)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !334, file: !335, line: 79, baseType: !234, size: 32, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !334, file: !335, line: 79, baseType: !234, size: 32, offset: 1248)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !334, file: !335, line: 80, baseType: !234, size: 32, offset: 1280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !334, file: !335, line: 80, baseType: !234, size: 32, offset: 1312)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !334, file: !335, line: 81, baseType: !234, size: 32, offset: 1344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !334, file: !335, line: 81, baseType: !234, size: 32, offset: 1376)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !334, file: !335, line: 83, baseType: !234, size: 32, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !334, file: !335, line: 85, baseType: !175, size: 16, offset: 1440)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !284, file: !93, line: 95, baseType: !146, size: 64, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !93, line: 97, baseType: !177, size: 32, offset: 1536)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !284, file: !93, line: 98, baseType: !177, size: 32, offset: 1568)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !284, file: !93, line: 99, baseType: !177, size: 32, offset: 1600)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !284, file: !93, line: 100, baseType: !177, size: 32, offset: 1632)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !284, file: !93, line: 101, baseType: !175, size: 16, offset: 1664)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !284, file: !93, line: 102, baseType: !175, size: 16, offset: 1680)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !284, file: !93, line: 104, baseType: !5, size: 32, offset: 1696)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !284, file: !93, line: 105, baseType: !5, size: 32, offset: 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !284, file: !93, line: 105, baseType: !5, size: 32, offset: 1760)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !284, file: !93, line: 108, baseType: !175, size: 16, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !284, file: !93, line: 108, baseType: !175, size: 16, offset: 1808)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !284, file: !93, line: 109, baseType: !175, size: 16, offset: 1824)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !284, file: !93, line: 109, baseType: !175, size: 16, offset: 1840)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !284, file: !93, line: 110, baseType: !177, size: 32, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !284, file: !93, line: 110, baseType: !177, size: 32, offset: 1888)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !284, file: !93, line: 111, baseType: !177, size: 32, offset: 1920)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !284, file: !93, line: 111, baseType: !177, size: 32, offset: 1952)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !284, file: !93, line: 112, baseType: !177, size: 32, offset: 1984)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !284, file: !93, line: 112, baseType: !177, size: 32, offset: 2016)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBone", file: !335, line: 86, baseType: !334)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !383, line: 133, baseType: !384)
!383 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !383, line: 58, size: 11008, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !393, !394, !400, !409, !502, !508, !515, !523, !534, !547, !560, !569, !578, !590, !598, !600, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !384, file: !383, line: 59, baseType: !141, size: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !384, file: !383, line: 60, baseType: !213, size: 64, offset: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !384, file: !383, line: 62, baseType: !251, size: 64, offset: 1024)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !384, file: !383, line: 64, baseType: !221, size: 64, offset: 1088)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !384, file: !383, line: 65, baseType: !391, size: 64, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !215, line: 45, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !384, file: !383, line: 66, baseType: !224, size: 64, offset: 1216)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !384, file: !383, line: 67, baseType: !395, size: 64, offset: 1280)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !119, line: 154, size: 64, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !396, file: !119, line: 155, baseType: !177, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !396, file: !119, line: 156, baseType: !177, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !384, file: !383, line: 71, baseType: !401, size: 64, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !119, line: 79, size: 96, elements: !403)
!403 = !{!404, !405, !406, !407, !408}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !402, file: !119, line: 81, baseType: !177, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !402, file: !119, line: 82, baseType: !177, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !402, file: !119, line: 83, baseType: !175, size: 16, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !119, line: 84, baseType: !162, size: 8, offset: 80)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !119, line: 84, baseType: !162, size: 8, offset: 88)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !384, file: !383, line: 72, baseType: !410, size: 64, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !119, line: 93, size: 128, elements: !412)
!412 = !{!413, !497, !498, !499, !500, !501}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !411, file: !119, line: 94, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !416, line: 77, size: 15424, elements: !417)
!416 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!417 = !{!418, !419, !420, !423, !426, !429, !432, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !451, !452, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !486, !487, !491}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !415, file: !416, line: 78, baseType: !141, size: 960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !416, line: 80, baseType: !161, size: 8192, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !415, file: !416, line: 82, baseType: !421, size: 64, offset: 9152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !416, line: 43, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !415, file: !416, line: 83, baseType: !424, size: 64, offset: 9216)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !142, line: 46, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !415, file: !416, line: 86, baseType: !427, size: 64, offset: 9280)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !416, line: 41, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !415, file: !416, line: 87, baseType: !430, size: 64, offset: 9344)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !416, line: 44, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !415, file: !416, line: 89, baseType: !433, size: 512, offset: 9408)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 512, elements: !434)
!434 = !{!258}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !415, file: !416, line: 90, baseType: !175, size: 16, offset: 9920)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !415, file: !416, line: 90, baseType: !175, size: 16, offset: 9936)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !415, file: !416, line: 92, baseType: !175, size: 16, offset: 9952)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !416, line: 92, baseType: !175, size: 16, offset: 9968)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !415, file: !416, line: 93, baseType: !175, size: 16, offset: 9984)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !416, line: 93, baseType: !175, size: 16, offset: 10000)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !415, file: !416, line: 94, baseType: !177, size: 32, offset: 10016)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !415, file: !416, line: 97, baseType: !175, size: 16, offset: 10048)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !415, file: !416, line: 97, baseType: !175, size: 16, offset: 10064)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !415, file: !416, line: 98, baseType: !175, size: 16, offset: 10080)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !415, file: !416, line: 98, baseType: !175, size: 16, offset: 10096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !415, file: !416, line: 99, baseType: !175, size: 16, offset: 10112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !415, file: !416, line: 99, baseType: !175, size: 16, offset: 10128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !415, file: !416, line: 100, baseType: !5, size: 32, offset: 10144)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !415, file: !416, line: 101, baseType: !450, size: 64, offset: 10176)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !415, file: !416, line: 103, baseType: !168, size: 64, offset: 10240)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !415, file: !416, line: 104, baseType: !453, size: 64, offset: 10304)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !142, line: 159, size: 448, elements: !455)
!455 = !{!456, !460, !461, !463, !464, !466}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !454, file: !142, line: 161, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 2)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !454, file: !142, line: 162, baseType: !457, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !454, file: !142, line: 163, baseType: !462, size: 32, offset: 128)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 32, elements: !458)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !454, file: !142, line: 164, baseType: !462, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !454, file: !142, line: 165, baseType: !465, size: 128, offset: 192)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 128, elements: !458)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !454, file: !142, line: 166, baseType: !467, size: 128, offset: 320)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 128, elements: !458)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !415, file: !416, line: 107, baseType: !234, size: 32, offset: 10368)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !415, file: !416, line: 108, baseType: !177, size: 32, offset: 10400)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !415, file: !416, line: 109, baseType: !175, size: 16, offset: 10432)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !415, file: !416, line: 110, baseType: !175, size: 16, offset: 10448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !415, file: !416, line: 113, baseType: !177, size: 32, offset: 10464)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !415, file: !416, line: 113, baseType: !177, size: 32, offset: 10496)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !415, file: !416, line: 114, baseType: !162, size: 8, offset: 10528)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !415, file: !416, line: 114, baseType: !162, size: 8, offset: 10536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !415, file: !416, line: 115, baseType: !175, size: 16, offset: 10544)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !415, file: !416, line: 116, baseType: !269, size: 128, offset: 10560)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !415, file: !416, line: 119, baseType: !234, size: 32, offset: 10688)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !415, file: !416, line: 119, baseType: !234, size: 32, offset: 10720)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !415, file: !416, line: 122, baseType: !481, size: 512, offset: 10752)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !482, line: 182, baseType: !483)
!482 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !482, line: 180, size: 512, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !482, line: 181, baseType: !192, size: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !415, file: !416, line: 123, baseType: !162, size: 8, offset: 11264)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !416, line: 125, baseType: !488, size: 56, offset: 11272)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 56, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 7)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !415, file: !416, line: 126, baseType: !492, size: 4096, offset: 11328)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 4096, elements: !434)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !416, line: 69, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !416, line: 67, size: 512, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !416, line: 68, baseType: !192, size: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !411, file: !119, line: 95, baseType: !162, size: 8, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !411, file: !119, line: 95, baseType: !162, size: 8, offset: 72)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !411, file: !119, line: 96, baseType: !175, size: 16, offset: 80)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !411, file: !119, line: 96, baseType: !175, size: 16, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !411, file: !119, line: 96, baseType: !175, size: 16, offset: 112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !384, file: !383, line: 73, baseType: !503, size: 64, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !119, line: 88, size: 64, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !504, file: !119, line: 89, baseType: !5, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !504, file: !119, line: 90, baseType: !5, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !384, file: !383, line: 74, baseType: !509, size: 64, offset: 1536)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !119, line: 109, size: 96, elements: !511)
!511 = !{!512, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !510, file: !119, line: 110, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 64, elements: !458)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !119, line: 111, baseType: !177, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !384, file: !383, line: 75, baseType: !516, size: 64, offset: 1600)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !119, line: 129, size: 32, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !517, file: !119, line: 130, baseType: !162, size: 8)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !517, file: !119, line: 130, baseType: !162, size: 8, offset: 8)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !517, file: !119, line: 130, baseType: !162, size: 8, offset: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !517, file: !119, line: 130, baseType: !162, size: 8, offset: 24)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !384, file: !383, line: 80, baseType: !524, size: 64, offset: 1664)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !119, line: 42, size: 160, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !525, file: !119, line: 43, baseType: !5, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !525, file: !119, line: 43, baseType: !5, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !525, file: !119, line: 43, baseType: !5, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !525, file: !119, line: 43, baseType: !5, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !525, file: !119, line: 44, baseType: !175, size: 16, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !525, file: !119, line: 45, baseType: !162, size: 8, offset: 144)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !525, file: !119, line: 45, baseType: !162, size: 8, offset: 152)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !384, file: !383, line: 81, baseType: !535, size: 64, offset: 1728)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !119, line: 160, size: 384, elements: !537)
!537 = !{!538, !541, !542, !543, !544, !545, !546}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !536, file: !119, line: 161, baseType: !539, size: 256)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 256, elements: !540)
!540 = !{!271, !459}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !536, file: !119, line: 162, baseType: !414, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !119, line: 163, baseType: !162, size: 8, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !536, file: !119, line: 163, baseType: !162, size: 8, offset: 328)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !536, file: !119, line: 164, baseType: !175, size: 16, offset: 336)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !536, file: !119, line: 164, baseType: !175, size: 16, offset: 352)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !536, file: !119, line: 164, baseType: !175, size: 16, offset: 368)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !384, file: !383, line: 82, baseType: !548, size: 64, offset: 1792)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !383, line: 136, size: 512, elements: !550)
!550 = !{!551, !552, !553, !555, !556, !557, !558, !559}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !549, file: !383, line: 137, baseType: !146, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !549, file: !383, line: 138, baseType: !539, size: 256, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !549, file: !383, line: 139, baseType: !554, size: 128, offset: 320)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !270)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !549, file: !383, line: 140, baseType: !162, size: 8, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !549, file: !383, line: 140, baseType: !162, size: 8, offset: 456)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !549, file: !383, line: 141, baseType: !175, size: 16, offset: 464)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !549, file: !383, line: 141, baseType: !175, size: 16, offset: 480)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !549, file: !383, line: 141, baseType: !175, size: 16, offset: 496)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !384, file: !383, line: 83, baseType: !561, size: 64, offset: 1856)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !119, line: 65, size: 160, elements: !563)
!563 = !{!564, !565, !567, !568}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !562, file: !119, line: 66, baseType: !233, size: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !562, file: !119, line: 67, baseType: !566, size: 48, offset: 96)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 48, elements: !235)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !119, line: 68, baseType: !162, size: 8, offset: 144)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !562, file: !119, line: 68, baseType: !162, size: 8, offset: 152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !384, file: !383, line: 84, baseType: !570, size: 64, offset: 1920)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !119, line: 48, size: 96, elements: !572)
!572 = !{!573, !574, !575, !576, !577}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !571, file: !119, line: 49, baseType: !5, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !571, file: !119, line: 49, baseType: !5, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !571, file: !119, line: 50, baseType: !162, size: 8, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !571, file: !119, line: 50, baseType: !162, size: 8, offset: 72)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !119, line: 51, baseType: !175, size: 16, offset: 80)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !384, file: !383, line: 85, baseType: !579, size: 64, offset: 1984)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !119, line: 59, size: 128, elements: !581)
!581 = !{!582, !588, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !580, file: !119, line: 60, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !119, line: 54, size: 64, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !584, file: !119, line: 55, baseType: !177, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !584, file: !119, line: 56, baseType: !234, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !580, file: !119, line: 61, baseType: !177, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !580, file: !119, line: 62, baseType: !177, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !384, file: !383, line: 89, baseType: !591, size: 64, offset: 2048)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !119, line: 74, size: 32, elements: !593)
!593 = !{!594, !595, !596, !597}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !592, file: !119, line: 75, baseType: !162, size: 8)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !592, file: !119, line: 75, baseType: !162, size: 8, offset: 8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !592, file: !119, line: 75, baseType: !162, size: 8, offset: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !592, file: !119, line: 75, baseType: !162, size: 8, offset: 24)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !384, file: !383, line: 90, baseType: !599, size: 64, offset: 2112)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !384, file: !383, line: 93, baseType: !601, size: 64, offset: 2176)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !603, line: 54, size: 896, elements: !604)
!603 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!604 = !{!605, !799, !800, !801, !804, !805, !2482, !2483, !2486, !2488, !2489, !2490, !2491, !2492, !2493, !2494}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !602, file: !603, line: 55, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !78, line: 186, size: 8064, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !622, !623, !624, !625, !686, !690, !694, !695, !696, !697, !698, !699, !700, !701, !755, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !607, file: !78, line: 187, baseType: !177, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !607, file: !78, line: 187, baseType: !177, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !607, file: !78, line: 187, baseType: !177, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !607, file: !78, line: 187, baseType: !177, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !607, file: !78, line: 188, baseType: !177, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !607, file: !78, line: 188, baseType: !177, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !607, file: !78, line: 188, baseType: !177, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !607, file: !78, line: 193, baseType: !162, size: 8, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !607, file: !78, line: 197, baseType: !162, size: 8, offset: 232)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !607, file: !78, line: 201, baseType: !619, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !621, line: 71, flags: DIFlagFwdDecl)
!621 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !607, file: !78, line: 201, baseType: !619, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !607, file: !78, line: 201, baseType: !619, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !607, file: !78, line: 201, baseType: !619, size: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !607, file: !78, line: 208, baseType: !626, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !78, line: 103, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !78, line: 90, size: 448, elements: !630)
!630 = !{!631, !640, !645, !646, !647}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !629, file: !78, line: 91, baseType: !632, size: 128)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !78, line: 82, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !78, line: 64, size: 128, elements: !634)
!634 = !{!635, !636, !637, !638, !639}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !633, file: !78, line: 65, baseType: !146, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !633, file: !78, line: 66, baseType: !177, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !633, file: !78, line: 73, baseType: !162, size: 8, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !633, file: !78, line: 74, baseType: !162, size: 8, offset: 104)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !633, file: !78, line: 80, baseType: !162, size: 8, offset: 112)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !629, file: !78, line: 92, baseType: !641, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !78, line: 180, size: 16, elements: !643)
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !642, file: !78, line: 181, baseType: !175, size: 16)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !629, file: !78, line: 94, baseType: !233, size: 96, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !629, file: !78, line: 95, baseType: !233, size: 96, offset: 288)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !629, file: !78, line: 102, baseType: !648, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !78, line: 110, size: 640, elements: !650)
!650 = !{!651, !652, !653, !655, !656, !679, !685}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !649, file: !78, line: 111, baseType: !632, size: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !649, file: !78, line: 112, baseType: !641, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !649, file: !78, line: 114, baseType: !654, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !649, file: !78, line: 114, baseType: !654, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !649, file: !78, line: 118, baseType: !657, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !78, line: 125, size: 576, elements: !659)
!659 = !{!660, !661, !662, !663, !675, !676, !677, !678}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !658, file: !78, line: 126, baseType: !632, size: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !658, file: !78, line: 129, baseType: !654, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !658, file: !78, line: 130, baseType: !648, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !658, file: !78, line: 131, baseType: !664, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !78, line: 164, size: 448, elements: !666)
!666 = !{!667, !668, !669, !672, !673, !674}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !665, file: !78, line: 165, baseType: !632, size: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !665, file: !78, line: 166, baseType: !641, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !665, file: !78, line: 172, baseType: !670, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !78, line: 140, baseType: !658)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !665, file: !78, line: 174, baseType: !177, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !665, file: !78, line: 175, baseType: !233, size: 96, offset: 288)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !665, file: !78, line: 176, baseType: !175, size: 16, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !658, file: !78, line: 135, baseType: !657, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !658, file: !78, line: 135, baseType: !657, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !658, file: !78, line: 139, baseType: !657, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !658, file: !78, line: 139, baseType: !657, size: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !649, file: !78, line: 122, baseType: !680, size: 128, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !78, line: 108, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !78, line: 106, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !681, file: !78, line: 107, baseType: !648, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !681, file: !78, line: 107, baseType: !648, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !649, file: !78, line: 122, baseType: !680, size: 128, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !607, file: !78, line: 209, baseType: !687, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !78, line: 123, baseType: !649)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !607, file: !78, line: 210, baseType: !691, size: 64, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !78, line: 178, baseType: !665)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !607, file: !78, line: 213, baseType: !177, size: 32, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !607, file: !78, line: 214, baseType: !177, size: 32, offset: 736)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !607, file: !78, line: 215, baseType: !177, size: 32, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !607, file: !78, line: 218, baseType: !619, size: 64, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !607, file: !78, line: 218, baseType: !619, size: 64, offset: 896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !607, file: !78, line: 218, baseType: !619, size: 64, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !607, file: !78, line: 220, baseType: !177, size: 32, offset: 1024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !607, file: !78, line: 221, baseType: !702, size: 64, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !32, line: 190, size: 10496, elements: !704)
!704 = !{!705, !741, !742, !748, !751, !752, !754}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !703, file: !32, line: 191, baseType: !706, size: 5120)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 5120, elements: !739)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !32, line: 147, size: 320, elements: !708)
!708 = !{!709, !712, !714, !724, !725}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !707, file: !32, line: 148, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !707, file: !32, line: 149, baseType: !713, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !32, line: 112, baseType: !31)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !707, file: !32, line: 150, baseType: !715, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !32, line: 142, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !32, line: 138, size: 32, elements: !717)
!717 = !{!718, !720, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !716, file: !32, line: 139, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !32, line: 122, baseType: !42)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !716, file: !32, line: 140, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !32, line: 136, baseType: !48)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !716, file: !32, line: 141, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !32, line: 130, baseType: !54)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !707, file: !32, line: 152, baseType: !177, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !32, line: 162, baseType: !726, size: 128, offset: 192)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !707, file: !32, line: 155, size: 128, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !726, file: !32, line: 156, baseType: !177, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !726, file: !32, line: 157, baseType: !234, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !726, file: !32, line: 158, baseType: !146, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !726, file: !32, line: 159, baseType: !233, size: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !726, file: !32, line: 160, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !726, file: !32, line: 161, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !737, line: 48, baseType: !738)
!737 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !215, line: 51, flags: DIFlagFwdDecl)
!739 = !{!740}
!740 = !DISubrange(count: 16)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !703, file: !32, line: 192, baseType: !706, size: 5120, offset: 5120)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !703, file: !32, line: 193, baseType: !743, size: 64, offset: 10240)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !746, !702}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !78, line: 246, baseType: !607)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !703, file: !32, line: 194, baseType: !749, size: 64, offset: 10304)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !32, line: 194, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !703, file: !32, line: 195, baseType: !177, size: 32, offset: 10368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !703, file: !32, line: 196, baseType: !753, size: 32, offset: 10400)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !32, line: 188, baseType: !62)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !703, file: !32, line: 197, baseType: !177, size: 32, offset: 10432)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !607, file: !78, line: 223, baseType: !756, size: 1600, offset: 1152)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !621, line: 73, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !621, line: 64, size: 1600, elements: !758)
!758 = !{!759, !774, !778, !779, !780, !781, !782}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !757, file: !621, line: 65, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !621, line: 53, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !621, line: 42, size: 832, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !762, file: !621, line: 43, baseType: !177, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !762, file: !621, line: 44, baseType: !177, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !621, line: 45, baseType: !177, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !762, file: !621, line: 46, baseType: !177, size: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !762, file: !621, line: 47, baseType: !177, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !762, file: !621, line: 48, baseType: !177, size: 32, offset: 160)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !762, file: !621, line: 49, baseType: !177, size: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !762, file: !621, line: 50, baseType: !177, size: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !621, line: 51, baseType: !192, size: 512, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !762, file: !621, line: 52, baseType: !146, size: 64, offset: 768)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !757, file: !621, line: 66, baseType: !775, size: 1312, offset: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 1312, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 41)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !757, file: !621, line: 69, baseType: !177, size: 32, offset: 1376)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !757, file: !621, line: 69, baseType: !177, size: 32, offset: 1408)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !757, file: !621, line: 70, baseType: !177, size: 32, offset: 1440)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !757, file: !621, line: 71, baseType: !619, size: 64, offset: 1472)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !757, file: !621, line: 72, baseType: !783, size: 64, offset: 1536)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !621, line: 59, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !621, line: 57, size: 8192, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !785, file: !621, line: 58, baseType: !161, size: 8192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !607, file: !78, line: 223, baseType: !756, size: 1600, offset: 2752)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !607, file: !78, line: 223, baseType: !756, size: 1600, offset: 4352)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !607, file: !78, line: 223, baseType: !756, size: 1600, offset: 5952)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !607, file: !78, line: 233, baseType: !175, size: 16, offset: 7552)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !607, file: !78, line: 236, baseType: !177, size: 32, offset: 7584)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !607, file: !78, line: 238, baseType: !177, size: 32, offset: 7616)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !607, file: !78, line: 238, baseType: !177, size: 32, offset: 7648)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !607, file: !78, line: 239, baseType: !202, size: 128, offset: 7680)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !607, file: !78, line: 241, baseType: !692, size: 64, offset: 7808)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !607, file: !78, line: 243, baseType: !202, size: 128, offset: 7872)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !607, file: !78, line: 245, baseType: !146, size: 64, offset: 8000)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !602, file: !603, line: 58, baseType: !601, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !602, file: !603, line: 59, baseType: !177, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !602, file: !603, line: 63, baseType: !802, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 192, elements: !235)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !602, file: !603, line: 64, baseType: !177, size: 32, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !602, file: !603, line: 67, baseType: !806, size: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !826, !829, !831, !832, !834, !835, !836, !837, !843, !848, !849, !853, !854, !855, !856, !857, !861, !865, !869, !873, !877, !881, !885, !889, !893, !897, !901, !905, !909, !910, !911, !912, !913, !914, !918, !919, !920, !921, !925, !926, !927, !928, !929, !934, !935, !936, !937, !938, !942, !943, !944, !945, !946, !953, !964, !969, !975, !985, !990, !1001, !1008, !1015, !1019, !1023, !1027, !1032, !1033, !1034, !2402, !2408, !2409, !2410, !2414, !2415, !2424, !2439, !2443, !2451, !2455, !2459, !2463, !2471, !2481}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !807, file: !4, line: 180, baseType: !756, size: 1600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !807, file: !4, line: 180, baseType: !756, size: 1600, offset: 1600)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !807, file: !4, line: 180, baseType: !756, size: 1600, offset: 3200)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !807, file: !4, line: 180, baseType: !756, size: 1600, offset: 4800)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !807, file: !4, line: 180, baseType: !756, size: 1600, offset: 6400)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !807, file: !4, line: 181, baseType: !177, size: 32, offset: 8000)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !807, file: !4, line: 181, baseType: !177, size: 32, offset: 8032)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !807, file: !4, line: 181, baseType: !177, size: 32, offset: 8064)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !807, file: !4, line: 181, baseType: !177, size: 32, offset: 8096)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !807, file: !4, line: 181, baseType: !177, size: 32, offset: 8128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !807, file: !4, line: 182, baseType: !177, size: 32, offset: 8160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !807, file: !4, line: 183, baseType: !177, size: 32, offset: 8192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !807, file: !4, line: 184, baseType: !822, size: 64, offset: 8256)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !823, line: 124, baseType: !824)
!823 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !823, line: 124, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !807, file: !4, line: 185, baseType: !827, size: 64, offset: 8320)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !4, line: 186, baseType: !830, size: 32, offset: 8384)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !807, file: !4, line: 187, baseType: !234, size: 32, offset: 8416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !807, file: !4, line: 188, baseType: !833, size: 32, offset: 8448)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !807, file: !4, line: 189, baseType: !177, size: 32, offset: 8480)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !807, file: !4, line: 190, baseType: !224, size: 64, offset: 8512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !807, file: !4, line: 193, baseType: !162, size: 8, offset: 8576)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !807, file: !4, line: 196, baseType: !838, size: 64, offset: 8640)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !841}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !807)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !807, file: !4, line: 199, baseType: !844, size: 64, offset: 8704)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !841, !847}
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !807, file: !4, line: 202, baseType: !838, size: 64, offset: 8768)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !807, file: !4, line: 207, baseType: !850, size: 64, offset: 8832)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!177, !841}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !807, file: !4, line: 208, baseType: !850, size: 64, offset: 8896)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !807, file: !4, line: 209, baseType: !850, size: 64, offset: 8960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !807, file: !4, line: 210, baseType: !850, size: 64, offset: 9024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !807, file: !4, line: 211, baseType: !850, size: 64, offset: 9088)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !807, file: !4, line: 218, baseType: !858, size: 64, offset: 9152)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !841, !177, !561}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !807, file: !4, line: 219, baseType: !862, size: 64, offset: 9216)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !841, !177, !570}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !807, file: !4, line: 220, baseType: !866, size: 64, offset: 9280)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !841, !177, !524}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !807, file: !4, line: 227, baseType: !870, size: 64, offset: 9344)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!561, !841}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !807, file: !4, line: 228, baseType: !874, size: 64, offset: 9408)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!570, !841}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !807, file: !4, line: 229, baseType: !878, size: 64, offset: 9472)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!524, !841}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !807, file: !4, line: 230, baseType: !882, size: 64, offset: 9536)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!503, !841}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !807, file: !4, line: 231, baseType: !886, size: 64, offset: 9600)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!401, !841}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !807, file: !4, line: 236, baseType: !890, size: 64, offset: 9664)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !841, !561}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !807, file: !4, line: 237, baseType: !894, size: 64, offset: 9728)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !841, !570}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !807, file: !4, line: 238, baseType: !898, size: 64, offset: 9792)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !841, !524}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !807, file: !4, line: 239, baseType: !902, size: 64, offset: 9856)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !841, !503}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !807, file: !4, line: 240, baseType: !906, size: 64, offset: 9920)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !841, !401}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !807, file: !4, line: 245, baseType: !870, size: 64, offset: 9984)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !807, file: !4, line: 246, baseType: !874, size: 64, offset: 10048)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !807, file: !4, line: 247, baseType: !878, size: 64, offset: 10112)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !807, file: !4, line: 248, baseType: !882, size: 64, offset: 10176)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !807, file: !4, line: 249, baseType: !886, size: 64, offset: 10240)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !807, file: !4, line: 255, baseType: !915, size: 64, offset: 10304)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!146, !841, !177, !177}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !807, file: !4, line: 256, baseType: !915, size: 64, offset: 10368)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !807, file: !4, line: 257, baseType: !915, size: 64, offset: 10432)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !807, file: !4, line: 258, baseType: !915, size: 64, offset: 10496)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !807, file: !4, line: 264, baseType: !922, size: 64, offset: 10560)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!146, !841, !177}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !807, file: !4, line: 265, baseType: !922, size: 64, offset: 10624)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !807, file: !4, line: 266, baseType: !922, size: 64, offset: 10688)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !807, file: !4, line: 267, baseType: !922, size: 64, offset: 10752)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !807, file: !4, line: 268, baseType: !922, size: 64, offset: 10816)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !807, file: !4, line: 272, baseType: !930, size: 64, offset: 10880)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!933, !841}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !807, file: !4, line: 273, baseType: !930, size: 64, offset: 10944)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !807, file: !4, line: 274, baseType: !930, size: 64, offset: 11008)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !807, file: !4, line: 275, baseType: !930, size: 64, offset: 11072)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !807, file: !4, line: 276, baseType: !930, size: 64, offset: 11136)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !807, file: !4, line: 279, baseType: !939, size: 64, offset: 11200)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !841, !177, !933, !177}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !807, file: !4, line: 280, baseType: !939, size: 64, offset: 11264)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !807, file: !4, line: 281, baseType: !939, size: 64, offset: 11328)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !807, file: !4, line: 284, baseType: !850, size: 64, offset: 11392)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !807, file: !4, line: 285, baseType: !850, size: 64, offset: 11456)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !807, file: !4, line: 286, baseType: !947, size: 64, offset: 11520)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!950, !841}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !807, file: !4, line: 287, baseType: !954, size: 64, offset: 11584)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!957, !841}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !960)
!960 = !{!961, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !959, file: !4, line: 118, baseType: !962, size: 128)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 128, elements: !270)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !959, file: !4, line: 119, baseType: !962, size: 128, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !807, file: !4, line: 288, baseType: !965, size: 64, offset: 11648)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!968, !841}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !807, file: !4, line: 289, baseType: !970, size: 64, offset: 11712)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !841, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !807, file: !4, line: 290, baseType: !976, size: 64, offset: 11776)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!979, !841}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !981, file: !4, line: 124, baseType: !175, size: 16)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !981, file: !4, line: 125, baseType: !162, size: 8, offset: 16)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !807, file: !4, line: 291, baseType: !986, size: 64, offset: 11840)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!989, !841}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !807, file: !4, line: 299, baseType: !991, size: 64, offset: 11904)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !841, !994, !146, !1000}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !146, !177, !997, !997, !998}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
