; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_core.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }

!98 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 260, baseType: !5, size: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107}
!101 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!104 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!105 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!106 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!107 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 63, baseType: !5, size: 32, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "_FLAG_JF", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "_FLAG_MF", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "_FLAG_MV", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "_FLAG_OVERLAP", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "_FLAG_WALK", value: 8, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 62, baseType: !5, size: 32, elements: !118)
!117 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_error.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!119 = !DIEnumerator(name: "BMERR_SELF_INTERSECTING", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "BMERR_DISSOLVEDISK_FAILED", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "BMERR_CONNECTVERT_FAILED", value: 3, isUnsigned: true)
!122 = !DIEnumerator(name: "BMERR_WALKER_FAILED", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "BMERR_DISSOLVEFACES_FAILED", value: 5, isUnsigned: true)
!124 = !DIEnumerator(name: "BMERR_TESSELLATION", value: 6, isUnsigned: true)
!125 = !DIEnumerator(name: "BMERR_NONMANIFOLD", value: 7, isUnsigned: true)
!126 = !DIEnumerator(name: "BMERR_INVALID_SELECTION", value: 8, isUnsigned: true)
!127 = !DIEnumerator(name: "BMERR_MESH_ERROR", value: 9, isUnsigned: true)
!128 = !DIEnumerator(name: "BMERR_CONVEX_HULL_FAILED", value: 10, isUnsigned: true)
!129 = !DIEnumerator(name: "BMERR_TOTAL", value: 11, isUnsigned: true)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !131, line: 57, baseType: !5, size: 32, elements: !132)
!131 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!133 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!136 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!137 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!138 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!139 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!140 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!141 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!142 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!143 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!144 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!145 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!146 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!147 = !{!148, !149, !152, !153, !155, !157, !222, !224, !206, !167, !226, !231, !154, !237, !238, !242, !246}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!151 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !156, line: 90, baseType: !151)
!156 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !49, line: 123, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !49, line: 110, size: 640, elements: !160)
!160 = !{!161, !171, !177, !191, !192, !215, !221}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !159, file: !49, line: 111, baseType: !162, size: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !49, line: 82, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !49, line: 64, size: 128, elements: !164)
!164 = !{!165, !166, !168, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !49, line: 65, baseType: !148, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !163, file: !49, line: 66, baseType: !167, size: 32, offset: 64)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !163, file: !49, line: 73, baseType: !154, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !163, file: !49, line: 74, baseType: !154, size: 8, offset: 104)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !163, file: !49, line: 80, baseType: !154, size: 8, offset: 112)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !159, file: !49, line: 112, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !49, line: 180, size: 16, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !173, file: !49, line: 181, baseType: !176, size: 16)
!176 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !159, file: !49, line: 114, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !49, line: 90, size: 448, elements: !180)
!180 = !{!181, !182, !183, !188, !189}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !179, file: !49, line: 91, baseType: !162, size: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !179, file: !49, line: 92, baseType: !172, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !179, file: !49, line: 94, baseType: !184, size: 96, offset: 192)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 96, elements: !186)
!185 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !179, file: !49, line: 95, baseType: !184, size: 96, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !179, file: !49, line: 102, baseType: !190, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !159, file: !49, line: 114, baseType: !178, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !159, file: !49, line: 118, baseType: !193, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !49, line: 125, size: 576, elements: !195)
!195 = !{!196, !197, !198, !199, !211, !212, !213, !214}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !194, file: !49, line: 126, baseType: !162, size: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !194, file: !49, line: 129, baseType: !178, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !194, file: !49, line: 130, baseType: !190, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !194, file: !49, line: 131, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !49, line: 164, size: 448, elements: !202)
!202 = !{!203, !204, !205, !208, !209, !210}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !201, file: !49, line: 165, baseType: !162, size: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !201, file: !49, line: 166, baseType: !172, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !201, file: !49, line: 172, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !49, line: 140, baseType: !194)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !201, file: !49, line: 174, baseType: !167, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !201, file: !49, line: 175, baseType: !184, size: 96, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !201, file: !49, line: 176, baseType: !176, size: 16, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !194, file: !49, line: 135, baseType: !193, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !194, file: !49, line: 135, baseType: !193, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !49, line: 139, baseType: !193, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !49, line: 139, baseType: !193, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !159, file: !49, line: 122, baseType: !216, size: 128, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !49, line: 108, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !49, line: 106, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !49, line: 107, baseType: !190, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !217, file: !49, line: 107, baseType: !190, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !159, file: !49, line: 122, baseType: !216, size: 128, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !49, line: 103, baseType: !179)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !156, line: 87, baseType: !225)
!225 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !49, line: 154, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !49, line: 152, size: 128, elements: !229)
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !228, file: !49, line: 153, baseType: !162, size: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElemF", file: !49, line: 149, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElemF", file: !49, line: 143, size: 192, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !233, file: !49, line: 144, baseType: !162, size: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !233, file: !49, line: 148, baseType: !172, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !131, line: 79, baseType: !130)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !131, line: 158, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !148}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !131, line: 159, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!148, !148}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !49, line: 178, baseType: !201)
!248 = !{i32 7, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!252 = distinct !DISubprogram(name: "BM_vert_create", scope: !1, file: !1, line: 60, type: !253, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!253 = !DISubroutineType(types: !254)
!254 = !{!222, !255, !394, !396, !398}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !49, line: 246, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !49, line: 186, size: 8064, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !271, !272, !273, !274, !276, !278, !280, !281, !282, !283, !284, !285, !286, !287, !338, !377, !378, !379, !380, !381, !382, !383, !384, !391, !392, !393}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !257, file: !49, line: 187, baseType: !167, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !257, file: !49, line: 187, baseType: !167, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !257, file: !49, line: 187, baseType: !167, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !257, file: !49, line: 187, baseType: !167, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !257, file: !49, line: 188, baseType: !167, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !257, file: !49, line: 188, baseType: !167, size: 32, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !257, file: !49, line: 188, baseType: !167, size: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !257, file: !49, line: 193, baseType: !154, size: 8, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !257, file: !49, line: 197, baseType: !154, size: 8, offset: 232)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !257, file: !49, line: 201, baseType: !269, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !56, line: 71, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !257, file: !49, line: 201, baseType: !269, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !257, file: !49, line: 201, baseType: !269, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !257, file: !49, line: 201, baseType: !269, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !257, file: !49, line: 208, baseType: !275, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !257, file: !49, line: 209, baseType: !277, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !257, file: !49, line: 210, baseType: !279, size: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !257, file: !49, line: 213, baseType: !167, size: 32, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !257, file: !49, line: 214, baseType: !167, size: 32, offset: 736)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !257, file: !49, line: 215, baseType: !167, size: 32, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !257, file: !49, line: 218, baseType: !269, size: 64, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !257, file: !49, line: 218, baseType: !269, size: 64, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !257, file: !49, line: 218, baseType: !269, size: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !257, file: !49, line: 220, baseType: !167, size: 32, offset: 1024)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !257, file: !49, line: 221, baseType: !288, size: 64, offset: 1088)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !290)
!290 = !{!291, !326, !327, !331, !334, !335, !337}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !289, file: !4, line: 191, baseType: !292, size: 5120)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 5120, elements: !324)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !294)
!294 = !{!295, !298, !300, !310, !311}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !293, file: !4, line: 148, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !293, file: !4, line: 149, baseType: !299, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !293, file: !4, line: 150, baseType: !301, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !303)
!303 = !{!304, !306, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !302, file: !4, line: 139, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !302, file: !4, line: 140, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !302, file: !4, line: 141, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !293, file: !4, line: 152, baseType: !167, size: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !4, line: 162, baseType: !312, size: 128, offset: 192)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !4, line: 155, size: 128, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !312, file: !4, line: 156, baseType: !167, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !312, file: !4, line: 157, baseType: !185, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !312, file: !4, line: 158, baseType: !148, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !312, file: !4, line: 159, baseType: !184, size: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !312, file: !4, line: 160, baseType: !152, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !312, file: !4, line: 161, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !322, line: 48, baseType: !323)
!322 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !322, line: 48, flags: DIFlagFwdDecl)
!324 = !{!325}
!325 = !DISubrange(count: 16)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !289, file: !4, line: 192, baseType: !292, size: 5120, offset: 5120)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !289, file: !4, line: 193, baseType: !328, size: 64, offset: 10240)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !255, !288}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !289, file: !4, line: 194, baseType: !332, size: 64, offset: 10304)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !4, line: 195, baseType: !167, size: 32, offset: 10368)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !289, file: !4, line: 196, baseType: !336, size: 32, offset: 10400)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !289, file: !4, line: 197, baseType: !167, size: 32, offset: 10432)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !257, file: !49, line: 223, baseType: !339, size: 1600, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !56, line: 73, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !56, line: 64, size: 1600, elements: !341)
!341 = !{!342, !360, !364, !365, !366, !367, !368}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !340, file: !56, line: 65, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !56, line: 53, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !56, line: 42, size: 832, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !359}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !56, line: 43, baseType: !167, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !345, file: !56, line: 44, baseType: !167, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !345, file: !56, line: 45, baseType: !167, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !345, file: !56, line: 46, baseType: !167, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !345, file: !56, line: 47, baseType: !167, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !345, file: !56, line: 48, baseType: !167, size: 32, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !345, file: !56, line: 49, baseType: !167, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !345, file: !56, line: 50, baseType: !167, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !345, file: !56, line: 51, baseType: !356, size: 512, offset: 256)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 512, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !56, line: 52, baseType: !148, size: 64, offset: 768)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !340, file: !56, line: 66, baseType: !361, size: 1312, offset: 64)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1312, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 41)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !340, file: !56, line: 69, baseType: !167, size: 32, offset: 1376)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !340, file: !56, line: 69, baseType: !167, size: 32, offset: 1408)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !340, file: !56, line: 70, baseType: !167, size: 32, offset: 1440)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !340, file: !56, line: 71, baseType: !269, size: 64, offset: 1472)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !340, file: !56, line: 72, baseType: !369, size: 64, offset: 1536)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !56, line: 59, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !56, line: 57, size: 8192, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !371, file: !56, line: 58, baseType: !374, size: 8192)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 8192, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 1024)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !257, file: !49, line: 223, baseType: !339, size: 1600, offset: 2752)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !257, file: !49, line: 223, baseType: !339, size: 1600, offset: 4352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !257, file: !49, line: 223, baseType: !339, size: 1600, offset: 5952)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !257, file: !49, line: 233, baseType: !176, size: 16, offset: 7552)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !257, file: !49, line: 236, baseType: !167, size: 32, offset: 7584)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !257, file: !49, line: 238, baseType: !167, size: 32, offset: 7616)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !257, file: !49, line: 238, baseType: !167, size: 32, offset: 7648)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !257, file: !49, line: 239, baseType: !385, size: 128, offset: 7680)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !386, line: 71, baseType: !387)
!386 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !386, line: 69, size: 128, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !387, file: !386, line: 70, baseType: !148, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !387, file: !386, line: 70, baseType: !148, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !257, file: !49, line: 241, baseType: !246, size: 64, offset: 7808)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !257, file: !49, line: 243, baseType: !385, size: 128, offset: 7872)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !257, file: !49, line: 245, baseType: !148, size: 64, offset: 8000)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMCreateFlag", file: !43, line: 41, baseType: !42)
!400 = !{}
!401 = !DILocalVariable(name: "bm", arg: 1, scope: !252, file: !1, line: 60, type: !255)
!402 = !DILocation(line: 60, column: 31, scope: !252)
!403 = !DILocalVariable(name: "co", arg: 2, scope: !252, file: !1, line: 60, type: !394)
!404 = !DILocation(line: 60, column: 47, scope: !252)
!405 = !DILocalVariable(name: "v_example", arg: 3, scope: !252, file: !1, line: 61, type: !396)
!406 = !DILocation(line: 61, column: 38, scope: !252)
!407 = !DILocalVariable(name: "create_flag", arg: 4, scope: !252, file: !1, line: 61, type: !398)
!408 = !DILocation(line: 61, column: 69, scope: !252)
!409 = !DILocalVariable(name: "v", scope: !252, file: !1, line: 63, type: !222)
!410 = !DILocation(line: 63, column: 10, scope: !252)
!411 = !DILocation(line: 63, column: 32, scope: !252)
!412 = !DILocation(line: 63, column: 36, scope: !252)
!413 = !DILocation(line: 63, column: 14, scope: !252)
!414 = !DILocation(line: 69, column: 2, scope: !252)
!415 = !DILocation(line: 69, column: 5, scope: !252)
!416 = !DILocation(line: 69, column: 10, scope: !252)
!417 = !DILocation(line: 69, column: 15, scope: !252)
!418 = !DILocation(line: 74, column: 2, scope: !252)
!419 = !DILocation(line: 77, column: 2, scope: !252)
!420 = !DILocation(line: 77, column: 5, scope: !252)
!421 = !DILocation(line: 77, column: 10, scope: !252)
!422 = !DILocation(line: 77, column: 16, scope: !252)
!423 = !DILocation(line: 78, column: 2, scope: !252)
!424 = !DILocation(line: 78, column: 5, scope: !252)
!425 = !DILocation(line: 78, column: 10, scope: !252)
!426 = !DILocation(line: 78, column: 16, scope: !252)
!427 = !DILocation(line: 79, column: 2, scope: !252)
!428 = !DILocation(line: 79, column: 5, scope: !252)
!429 = !DILocation(line: 79, column: 10, scope: !252)
!430 = !DILocation(line: 79, column: 19, scope: !252)
!431 = !DILocation(line: 82, column: 14, scope: !252)
!432 = !DILocation(line: 82, column: 18, scope: !252)
!433 = !DILocation(line: 82, column: 53, scope: !252)
!434 = !DILocation(line: 82, column: 57, scope: !252)
!435 = !DILocation(line: 82, column: 34, scope: !252)
!436 = !DILocation(line: 82, column: 2, scope: !252)
!437 = !DILocation(line: 82, column: 5, scope: !252)
!438 = !DILocation(line: 82, column: 12, scope: !252)
!439 = !DILocation(line: 85, column: 6, scope: !440)
!440 = distinct !DILexicalBlock(scope: !252, file: !1, line: 85, column: 6)
!441 = !DILocation(line: 85, column: 6, scope: !252)
!442 = !DILocation(line: 86, column: 14, scope: !443)
!443 = distinct !DILexicalBlock(scope: !440, file: !1, line: 85, column: 10)
!444 = !DILocation(line: 86, column: 17, scope: !443)
!445 = !DILocation(line: 86, column: 21, scope: !443)
!446 = !DILocation(line: 86, column: 3, scope: !443)
!447 = !DILocation(line: 87, column: 2, scope: !443)
!448 = !DILocation(line: 89, column: 11, scope: !449)
!449 = distinct !DILexicalBlock(scope: !440, file: !1, line: 88, column: 7)
!450 = !DILocation(line: 89, column: 14, scope: !449)
!451 = !DILocation(line: 89, column: 3, scope: !449)
!452 = !DILocation(line: 91, column: 10, scope: !252)
!453 = !DILocation(line: 91, column: 13, scope: !252)
!454 = !DILocation(line: 91, column: 2, scope: !252)
!455 = !DILocation(line: 93, column: 2, scope: !252)
!456 = !DILocation(line: 93, column: 5, scope: !252)
!457 = !DILocation(line: 93, column: 7, scope: !252)
!458 = !DILocation(line: 101, column: 2, scope: !252)
!459 = !DILocation(line: 101, column: 6, scope: !252)
!460 = !DILocation(line: 101, column: 23, scope: !252)
!461 = !DILocation(line: 102, column: 2, scope: !252)
!462 = !DILocation(line: 102, column: 6, scope: !252)
!463 = !DILocation(line: 102, column: 23, scope: !252)
!464 = !DILocation(line: 104, column: 2, scope: !252)
!465 = !DILocation(line: 104, column: 6, scope: !252)
!466 = !DILocation(line: 104, column: 13, scope: !252)
!467 = !DILocation(line: 106, column: 8, scope: !468)
!468 = distinct !DILexicalBlock(scope: !252, file: !1, line: 106, column: 6)
!469 = !DILocation(line: 106, column: 20, scope: !468)
!470 = !DILocation(line: 106, column: 6, scope: !252)
!471 = !DILocation(line: 107, column: 7, scope: !472)
!472 = distinct !DILexicalBlock(scope: !473, file: !1, line: 107, column: 7)
!473 = distinct !DILexicalBlock(scope: !468, file: !1, line: 106, column: 42)
!474 = !DILocation(line: 107, column: 7, scope: !473)
!475 = !DILocalVariable(name: "keyi", scope: !476, file: !1, line: 108, type: !477)
!476 = distinct !DILexicalBlock(scope: !472, file: !1, line: 107, column: 18)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!478 = !DILocation(line: 108, column: 9, scope: !476)
!479 = !DILocation(line: 110, column: 23, scope: !476)
!480 = !DILocation(line: 110, column: 27, scope: !476)
!481 = !DILocation(line: 110, column: 31, scope: !476)
!482 = !DILocation(line: 110, column: 42, scope: !476)
!483 = !DILocation(line: 110, column: 4, scope: !476)
!484 = !DILocation(line: 113, column: 33, scope: !476)
!485 = !DILocation(line: 113, column: 37, scope: !476)
!486 = !DILocation(line: 113, column: 44, scope: !476)
!487 = !DILocation(line: 113, column: 47, scope: !476)
!488 = !DILocation(line: 113, column: 52, scope: !476)
!489 = !DILocation(line: 113, column: 11, scope: !476)
!490 = !DILocation(line: 113, column: 9, scope: !476)
!491 = !DILocation(line: 114, column: 8, scope: !492)
!492 = distinct !DILexicalBlock(scope: !476, file: !1, line: 114, column: 8)
!493 = !DILocation(line: 114, column: 8, scope: !476)
!494 = !DILocation(line: 115, column: 6, scope: !495)
!495 = distinct !DILexicalBlock(scope: !492, file: !1, line: 114, column: 14)
!496 = !DILocation(line: 115, column: 11, scope: !495)
!497 = !DILocation(line: 116, column: 4, scope: !495)
!498 = !DILocation(line: 117, column: 3, scope: !476)
!499 = !DILocation(line: 119, column: 34, scope: !500)
!500 = distinct !DILexicalBlock(scope: !472, file: !1, line: 118, column: 8)
!501 = !DILocation(line: 119, column: 38, scope: !500)
!502 = !DILocation(line: 119, column: 46, scope: !500)
!503 = !DILocation(line: 119, column: 49, scope: !500)
!504 = !DILocation(line: 119, column: 54, scope: !500)
!505 = !DILocation(line: 119, column: 4, scope: !500)
!506 = !DILocation(line: 121, column: 2, scope: !473)
!507 = !DILocation(line: 123, column: 2, scope: !252)
!508 = !DILocation(line: 125, column: 9, scope: !252)
!509 = !DILocation(line: 125, column: 2, scope: !252)
!510 = distinct !DISubprogram(name: "_bm_elem_index_set", scope: !511, file: !511, line: 114, type: !512, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !400)
!511 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!512 = !DISubroutineType(types: !513)
!513 = !{null, !514, !515}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!516 = !DILocalVariable(name: "head", arg: 1, scope: !510, file: !511, line: 114, type: !514)
!517 = !DILocation(line: 114, column: 46, scope: !510)
!518 = !DILocalVariable(name: "index", arg: 2, scope: !510, file: !511, line: 114, type: !515)
!519 = !DILocation(line: 114, column: 62, scope: !510)
!520 = !DILocation(line: 116, column: 16, scope: !510)
!521 = !DILocation(line: 116, column: 2, scope: !510)
!522 = !DILocation(line: 116, column: 8, scope: !510)
!523 = !DILocation(line: 116, column: 14, scope: !510)
!524 = !DILocation(line: 117, column: 1, scope: !510)
!525 = distinct !DISubprogram(name: "copy_v3_v3", scope: !526, file: !526, line: 64, type: !527, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !400)
!526 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!527 = !DISubroutineType(types: !528)
!528 = !{null, !529, !394}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!530 = !DILocalVariable(name: "r", arg: 1, scope: !525, file: !526, line: 64, type: !529)
!531 = !DILocation(line: 64, column: 31, scope: !525)
!532 = !DILocalVariable(name: "a", arg: 2, scope: !525, file: !526, line: 64, type: !394)
!533 = !DILocation(line: 64, column: 49, scope: !525)
!534 = !DILocation(line: 66, column: 9, scope: !525)
!535 = !DILocation(line: 66, column: 2, scope: !525)
!536 = !DILocation(line: 66, column: 7, scope: !525)
!537 = !DILocation(line: 67, column: 9, scope: !525)
!538 = !DILocation(line: 67, column: 2, scope: !525)
!539 = !DILocation(line: 67, column: 7, scope: !525)
!540 = !DILocation(line: 68, column: 9, scope: !525)
!541 = !DILocation(line: 68, column: 2, scope: !525)
!542 = !DILocation(line: 68, column: 7, scope: !525)
!543 = !DILocation(line: 69, column: 1, scope: !525)
!544 = distinct !DISubprogram(name: "zero_v3", scope: !526, file: !526, line: 43, type: !545, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !400)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !529}
!547 = !DILocalVariable(name: "r", arg: 1, scope: !544, file: !526, line: 43, type: !529)
!548 = !DILocation(line: 43, column: 28, scope: !544)
!549 = !DILocation(line: 45, column: 2, scope: !544)
!550 = !DILocation(line: 45, column: 7, scope: !544)
!551 = !DILocation(line: 46, column: 2, scope: !544)
!552 = !DILocation(line: 46, column: 7, scope: !544)
!553 = !DILocation(line: 47, column: 2, scope: !544)
!554 = !DILocation(line: 47, column: 7, scope: !544)
!555 = !DILocation(line: 48, column: 1, scope: !544)
!556 = distinct !DISubprogram(name: "BM_edge_create", scope: !1, file: !1, line: 134, type: !557, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!557 = !DISubroutineType(types: !558)
!558 = !{!157, !255, !222, !222, !559, !398}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!561 = !DILocalVariable(name: "bm", arg: 1, scope: !556, file: !1, line: 134, type: !255)
!562 = !DILocation(line: 134, column: 31, scope: !556)
!563 = !DILocalVariable(name: "v1", arg: 2, scope: !556, file: !1, line: 134, type: !222)
!564 = !DILocation(line: 134, column: 43, scope: !556)
!565 = !DILocalVariable(name: "v2", arg: 3, scope: !556, file: !1, line: 134, type: !222)
!566 = !DILocation(line: 134, column: 55, scope: !556)
!567 = !DILocalVariable(name: "e_example", arg: 4, scope: !556, file: !1, line: 135, type: !559)
!568 = !DILocation(line: 135, column: 38, scope: !556)
!569 = !DILocalVariable(name: "create_flag", arg: 5, scope: !556, file: !1, line: 135, type: !398)
!570 = !DILocation(line: 135, column: 69, scope: !556)
!571 = !DILocalVariable(name: "e", scope: !556, file: !1, line: 137, type: !157)
!572 = !DILocation(line: 137, column: 10, scope: !556)
!573 = !DILocation(line: 144, column: 7, scope: !574)
!574 = distinct !DILexicalBlock(scope: !556, file: !1, line: 144, column: 6)
!575 = !DILocation(line: 144, column: 19, scope: !574)
!576 = !DILocation(line: 144, column: 42, scope: !574)
!577 = !DILocation(line: 144, column: 65, scope: !574)
!578 = !DILocation(line: 144, column: 69, scope: !574)
!579 = !DILocation(line: 144, column: 50, scope: !574)
!580 = !DILocation(line: 144, column: 48, scope: !574)
!581 = !DILocation(line: 144, column: 6, scope: !556)
!582 = !DILocation(line: 145, column: 10, scope: !574)
!583 = !DILocation(line: 145, column: 3, scope: !574)
!584 = !DILocation(line: 147, column: 24, scope: !556)
!585 = !DILocation(line: 147, column: 28, scope: !556)
!586 = !DILocation(line: 147, column: 6, scope: !556)
!587 = !DILocation(line: 147, column: 4, scope: !556)
!588 = !DILocation(line: 151, column: 2, scope: !556)
!589 = !DILocation(line: 151, column: 5, scope: !556)
!590 = !DILocation(line: 151, column: 10, scope: !556)
!591 = !DILocation(line: 151, column: 15, scope: !556)
!592 = !DILocation(line: 156, column: 2, scope: !556)
!593 = !DILocation(line: 159, column: 2, scope: !556)
!594 = !DILocation(line: 159, column: 5, scope: !556)
!595 = !DILocation(line: 159, column: 10, scope: !556)
!596 = !DILocation(line: 159, column: 16, scope: !556)
!597 = !DILocation(line: 160, column: 2, scope: !556)
!598 = !DILocation(line: 160, column: 5, scope: !556)
!599 = !DILocation(line: 160, column: 10, scope: !556)
!600 = !DILocation(line: 160, column: 16, scope: !556)
!601 = !DILocation(line: 161, column: 2, scope: !556)
!602 = !DILocation(line: 161, column: 5, scope: !556)
!603 = !DILocation(line: 161, column: 10, scope: !556)
!604 = !DILocation(line: 161, column: 19, scope: !556)
!605 = !DILocation(line: 164, column: 14, scope: !556)
!606 = !DILocation(line: 164, column: 18, scope: !556)
!607 = !DILocation(line: 164, column: 53, scope: !556)
!608 = !DILocation(line: 164, column: 57, scope: !556)
!609 = !DILocation(line: 164, column: 34, scope: !556)
!610 = !DILocation(line: 164, column: 2, scope: !556)
!611 = !DILocation(line: 164, column: 5, scope: !556)
!612 = !DILocation(line: 164, column: 12, scope: !556)
!613 = !DILocation(line: 166, column: 10, scope: !556)
!614 = !DILocation(line: 166, column: 2, scope: !556)
!615 = !DILocation(line: 166, column: 5, scope: !556)
!616 = !DILocation(line: 166, column: 8, scope: !556)
!617 = !DILocation(line: 167, column: 10, scope: !556)
!618 = !DILocation(line: 167, column: 2, scope: !556)
!619 = !DILocation(line: 167, column: 5, scope: !556)
!620 = !DILocation(line: 167, column: 8, scope: !556)
!621 = !DILocation(line: 168, column: 2, scope: !556)
!622 = !DILocation(line: 168, column: 5, scope: !556)
!623 = !DILocation(line: 168, column: 7, scope: !556)
!624 = !DILocation(line: 170, column: 10, scope: !556)
!625 = !DILocation(line: 170, column: 13, scope: !556)
!626 = !DILocation(line: 170, column: 2, scope: !556)
!627 = !DILocation(line: 174, column: 25, scope: !556)
!628 = !DILocation(line: 174, column: 28, scope: !556)
!629 = !DILocation(line: 174, column: 31, scope: !556)
!630 = !DILocation(line: 174, column: 2, scope: !556)
!631 = !DILocation(line: 175, column: 25, scope: !556)
!632 = !DILocation(line: 175, column: 28, scope: !556)
!633 = !DILocation(line: 175, column: 31, scope: !556)
!634 = !DILocation(line: 175, column: 2, scope: !556)
!635 = !DILocation(line: 178, column: 2, scope: !556)
!636 = !DILocation(line: 178, column: 6, scope: !556)
!637 = !DILocation(line: 178, column: 23, scope: !556)
!638 = !DILocation(line: 179, column: 2, scope: !556)
!639 = !DILocation(line: 179, column: 6, scope: !556)
!640 = !DILocation(line: 179, column: 23, scope: !556)
!641 = !DILocation(line: 181, column: 2, scope: !556)
!642 = !DILocation(line: 181, column: 6, scope: !556)
!643 = !DILocation(line: 181, column: 13, scope: !556)
!644 = !DILocation(line: 183, column: 8, scope: !645)
!645 = distinct !DILexicalBlock(scope: !556, file: !1, line: 183, column: 6)
!646 = !DILocation(line: 183, column: 20, scope: !645)
!647 = !DILocation(line: 183, column: 6, scope: !556)
!648 = !DILocation(line: 184, column: 7, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 184, column: 7)
!650 = distinct !DILexicalBlock(scope: !645, file: !1, line: 183, column: 42)
!651 = !DILocation(line: 184, column: 7, scope: !650)
!652 = !DILocation(line: 185, column: 23, scope: !653)
!653 = distinct !DILexicalBlock(scope: !649, file: !1, line: 184, column: 18)
!654 = !DILocation(line: 185, column: 27, scope: !653)
!655 = !DILocation(line: 185, column: 31, scope: !653)
!656 = !DILocation(line: 185, column: 42, scope: !653)
!657 = !DILocation(line: 185, column: 4, scope: !653)
!658 = !DILocation(line: 186, column: 3, scope: !653)
!659 = !DILocation(line: 188, column: 34, scope: !660)
!660 = distinct !DILexicalBlock(scope: !649, file: !1, line: 187, column: 8)
!661 = !DILocation(line: 188, column: 38, scope: !660)
!662 = !DILocation(line: 188, column: 46, scope: !660)
!663 = !DILocation(line: 188, column: 49, scope: !660)
!664 = !DILocation(line: 188, column: 54, scope: !660)
!665 = !DILocation(line: 188, column: 4, scope: !660)
!666 = !DILocation(line: 190, column: 2, scope: !650)
!667 = !DILocation(line: 192, column: 2, scope: !556)
!668 = !DILocation(line: 194, column: 9, scope: !556)
!669 = !DILocation(line: 194, column: 2, scope: !556)
!670 = !DILocation(line: 195, column: 1, scope: !556)
!671 = distinct !DISubprogram(name: "BM_face_copy", scope: !1, file: !1, line: 269, type: !672, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!672 = !DISubroutineType(types: !673)
!673 = !{!246, !255, !255, !246, !674, !674}
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!676 = !DILocalVariable(name: "bm_dst", arg: 1, scope: !671, file: !1, line: 269, type: !255)
!677 = !DILocation(line: 269, column: 29, scope: !671)
!678 = !DILocalVariable(name: "bm_src", arg: 2, scope: !671, file: !1, line: 269, type: !255)
!679 = !DILocation(line: 269, column: 44, scope: !671)
!680 = !DILocalVariable(name: "f", arg: 3, scope: !671, file: !1, line: 269, type: !246)
!681 = !DILocation(line: 269, column: 60, scope: !671)
!682 = !DILocalVariable(name: "copy_verts", arg: 4, scope: !671, file: !1, line: 270, type: !674)
!683 = !DILocation(line: 270, column: 33, scope: !671)
!684 = !DILocalVariable(name: "copy_edges", arg: 5, scope: !671, file: !1, line: 270, type: !674)
!685 = !DILocation(line: 270, column: 56, scope: !671)
!686 = !DILocalVariable(name: "verts", scope: !671, file: !1, line: 272, type: !275)
!687 = !DILocation(line: 272, column: 11, scope: !671)
!688 = !DILocation(line: 272, column: 19, scope: !671)
!689 = !DILocalVariable(name: "edges", scope: !671, file: !1, line: 273, type: !277)
!690 = !DILocation(line: 273, column: 11, scope: !671)
!691 = !DILocation(line: 273, column: 19, scope: !671)
!692 = !DILocalVariable(name: "l_iter", scope: !671, file: !1, line: 274, type: !206)
!693 = !DILocation(line: 274, column: 10, scope: !671)
!694 = !DILocalVariable(name: "l_first", scope: !671, file: !1, line: 275, type: !206)
!695 = !DILocation(line: 275, column: 10, scope: !671)
!696 = !DILocalVariable(name: "l_copy", scope: !671, file: !1, line: 276, type: !206)
!697 = !DILocation(line: 276, column: 10, scope: !671)
!698 = !DILocalVariable(name: "f_copy", scope: !671, file: !1, line: 277, type: !246)
!699 = !DILocation(line: 277, column: 10, scope: !671)
!700 = !DILocalVariable(name: "i", scope: !671, file: !1, line: 278, type: !167)
!701 = !DILocation(line: 278, column: 6, scope: !671)
!702 = !DILocation(line: 282, column: 21, scope: !671)
!703 = !DILocation(line: 282, column: 19, scope: !671)
!704 = !DILocation(line: 282, column: 9, scope: !671)
!705 = !DILocation(line: 283, column: 4, scope: !671)
!706 = !DILocation(line: 284, column: 2, scope: !671)
!707 = !DILocation(line: 285, column: 7, scope: !708)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 285, column: 7)
!709 = distinct !DILexicalBlock(scope: !671, file: !1, line: 284, column: 5)
!710 = !DILocation(line: 285, column: 7, scope: !709)
!711 = !DILocation(line: 286, column: 30, scope: !712)
!712 = distinct !DILexicalBlock(scope: !708, file: !1, line: 285, column: 19)
!713 = !DILocation(line: 286, column: 38, scope: !712)
!714 = !DILocation(line: 286, column: 46, scope: !712)
!715 = !DILocation(line: 286, column: 49, scope: !712)
!716 = !DILocation(line: 286, column: 53, scope: !712)
!717 = !DILocation(line: 286, column: 61, scope: !712)
!718 = !DILocation(line: 286, column: 15, scope: !712)
!719 = !DILocation(line: 286, column: 4, scope: !712)
!720 = !DILocation(line: 286, column: 10, scope: !712)
!721 = !DILocation(line: 286, column: 13, scope: !712)
!722 = !DILocation(line: 287, column: 3, scope: !712)
!723 = !DILocation(line: 289, column: 15, scope: !724)
!724 = distinct !DILexicalBlock(scope: !708, file: !1, line: 288, column: 8)
!725 = !DILocation(line: 289, column: 23, scope: !724)
!726 = !DILocation(line: 289, column: 4, scope: !724)
!727 = !DILocation(line: 289, column: 10, scope: !724)
!728 = !DILocation(line: 289, column: 13, scope: !724)
!729 = !DILocation(line: 291, column: 4, scope: !709)
!730 = !DILocation(line: 292, column: 2, scope: !709)
!731 = !DILocation(line: 292, column: 21, scope: !671)
!732 = !DILocation(line: 292, column: 29, scope: !671)
!733 = !DILocation(line: 292, column: 19, scope: !671)
!734 = !DILocation(line: 292, column: 38, scope: !671)
!735 = !DILocation(line: 292, column: 35, scope: !671)
!736 = distinct !{!736, !706, !737}
!737 = !DILocation(line: 292, column: 45, scope: !671)
!738 = !DILocation(line: 294, column: 21, scope: !671)
!739 = !DILocation(line: 294, column: 19, scope: !671)
!740 = !DILocation(line: 294, column: 9, scope: !671)
!741 = !DILocation(line: 295, column: 4, scope: !671)
!742 = !DILocation(line: 296, column: 2, scope: !671)
!743 = !DILocation(line: 297, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !1, line: 297, column: 7)
!745 = distinct !DILexicalBlock(scope: !671, file: !1, line: 296, column: 5)
!746 = !DILocation(line: 297, column: 7, scope: !745)
!747 = !DILocalVariable(name: "v1", scope: !748, file: !1, line: 298, type: !222)
!748 = distinct !DILexicalBlock(scope: !744, file: !1, line: 297, column: 19)
!749 = !DILocation(line: 298, column: 12, scope: !748)
!750 = !DILocalVariable(name: "v2", scope: !748, file: !1, line: 298, type: !222)
!751 = !DILocation(line: 298, column: 17, scope: !748)
!752 = !DILocation(line: 300, column: 8, scope: !753)
!753 = distinct !DILexicalBlock(scope: !748, file: !1, line: 300, column: 8)
!754 = !DILocation(line: 300, column: 16, scope: !753)
!755 = !DILocation(line: 300, column: 19, scope: !753)
!756 = !DILocation(line: 300, column: 25, scope: !753)
!757 = !DILocation(line: 300, column: 31, scope: !753)
!758 = !DILocation(line: 300, column: 22, scope: !753)
!759 = !DILocation(line: 300, column: 8, scope: !748)
!760 = !DILocation(line: 301, column: 10, scope: !761)
!761 = distinct !DILexicalBlock(scope: !753, file: !1, line: 300, column: 35)
!762 = !DILocation(line: 301, column: 16, scope: !761)
!763 = !DILocation(line: 301, column: 8, scope: !761)
!764 = !DILocation(line: 302, column: 10, scope: !761)
!765 = !DILocation(line: 302, column: 17, scope: !761)
!766 = !DILocation(line: 302, column: 19, scope: !761)
!767 = !DILocation(line: 302, column: 26, scope: !761)
!768 = !DILocation(line: 302, column: 29, scope: !761)
!769 = !DILocation(line: 302, column: 24, scope: !761)
!770 = !DILocation(line: 302, column: 8, scope: !761)
!771 = !DILocation(line: 303, column: 4, scope: !761)
!772 = !DILocation(line: 305, column: 10, scope: !773)
!773 = distinct !DILexicalBlock(scope: !753, file: !1, line: 304, column: 9)
!774 = !DILocation(line: 305, column: 16, scope: !773)
!775 = !DILocation(line: 305, column: 8, scope: !773)
!776 = !DILocation(line: 306, column: 10, scope: !773)
!777 = !DILocation(line: 306, column: 17, scope: !773)
!778 = !DILocation(line: 306, column: 19, scope: !773)
!779 = !DILocation(line: 306, column: 26, scope: !773)
!780 = !DILocation(line: 306, column: 29, scope: !773)
!781 = !DILocation(line: 306, column: 24, scope: !773)
!782 = !DILocation(line: 306, column: 8, scope: !773)
!783 = !DILocation(line: 309, column: 30, scope: !748)
!784 = !DILocation(line: 309, column: 38, scope: !748)
!785 = !DILocation(line: 309, column: 42, scope: !748)
!786 = !DILocation(line: 309, column: 46, scope: !748)
!787 = !DILocation(line: 309, column: 54, scope: !748)
!788 = !DILocation(line: 309, column: 15, scope: !748)
!789 = !DILocation(line: 309, column: 4, scope: !748)
!790 = !DILocation(line: 309, column: 10, scope: !748)
!791 = !DILocation(line: 309, column: 13, scope: !748)
!792 = !DILocation(line: 310, column: 3, scope: !748)
!793 = !DILocation(line: 312, column: 15, scope: !794)
!794 = distinct !DILexicalBlock(scope: !744, file: !1, line: 311, column: 8)
!795 = !DILocation(line: 312, column: 23, scope: !794)
!796 = !DILocation(line: 312, column: 4, scope: !794)
!797 = !DILocation(line: 312, column: 10, scope: !794)
!798 = !DILocation(line: 312, column: 13, scope: !794)
!799 = !DILocation(line: 314, column: 4, scope: !745)
!800 = !DILocation(line: 315, column: 2, scope: !745)
!801 = !DILocation(line: 315, column: 21, scope: !671)
!802 = !DILocation(line: 315, column: 29, scope: !671)
!803 = !DILocation(line: 315, column: 19, scope: !671)
!804 = !DILocation(line: 315, column: 38, scope: !671)
!805 = !DILocation(line: 315, column: 35, scope: !671)
!806 = distinct !{!806, !742, !807}
!807 = !DILocation(line: 315, column: 45, scope: !671)
!808 = !DILocation(line: 317, column: 26, scope: !671)
!809 = !DILocation(line: 317, column: 34, scope: !671)
!810 = !DILocation(line: 317, column: 41, scope: !671)
!811 = !DILocation(line: 317, column: 48, scope: !671)
!812 = !DILocation(line: 317, column: 51, scope: !671)
!813 = !DILocation(line: 317, column: 11, scope: !671)
!814 = !DILocation(line: 317, column: 9, scope: !671)
!815 = !DILocation(line: 319, column: 21, scope: !671)
!816 = !DILocation(line: 319, column: 29, scope: !671)
!817 = !DILocation(line: 319, column: 37, scope: !671)
!818 = !DILocation(line: 319, column: 40, scope: !671)
!819 = !DILocation(line: 319, column: 2, scope: !671)
!820 = !DILocation(line: 321, column: 21, scope: !671)
!821 = !DILocation(line: 321, column: 19, scope: !671)
!822 = !DILocation(line: 321, column: 9, scope: !671)
!823 = !DILocation(line: 322, column: 11, scope: !671)
!824 = !DILocation(line: 322, column: 9, scope: !671)
!825 = !DILocation(line: 323, column: 2, scope: !671)
!826 = !DILocation(line: 324, column: 22, scope: !827)
!827 = distinct !DILexicalBlock(scope: !671, file: !1, line: 323, column: 5)
!828 = !DILocation(line: 324, column: 30, scope: !827)
!829 = !DILocation(line: 324, column: 38, scope: !827)
!830 = !DILocation(line: 324, column: 46, scope: !827)
!831 = !DILocation(line: 324, column: 3, scope: !827)
!832 = !DILocation(line: 325, column: 12, scope: !827)
!833 = !DILocation(line: 325, column: 20, scope: !827)
!834 = !DILocation(line: 325, column: 10, scope: !827)
!835 = !DILocation(line: 326, column: 2, scope: !827)
!836 = !DILocation(line: 326, column: 21, scope: !671)
!837 = !DILocation(line: 326, column: 29, scope: !671)
!838 = !DILocation(line: 326, column: 19, scope: !671)
!839 = !DILocation(line: 326, column: 38, scope: !671)
!840 = !DILocation(line: 326, column: 35, scope: !671)
!841 = distinct !{!841, !825, !842}
!842 = !DILocation(line: 326, column: 45, scope: !671)
!843 = !DILocation(line: 328, column: 9, scope: !671)
!844 = !DILocation(line: 328, column: 2, scope: !671)
!845 = distinct !DISubprogram(name: "BM_face_create", scope: !1, file: !1, line: 392, type: !846, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!846 = !DISubroutineType(types: !847)
!847 = !{!246, !255, !275, !277, !515, !848, !398}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!850 = !DILocalVariable(name: "bm", arg: 1, scope: !845, file: !1, line: 392, type: !255)
!851 = !DILocation(line: 392, column: 31, scope: !845)
!852 = !DILocalVariable(name: "verts", arg: 2, scope: !845, file: !1, line: 392, type: !275)
!853 = !DILocation(line: 392, column: 44, scope: !845)
!854 = !DILocalVariable(name: "edges", arg: 3, scope: !845, file: !1, line: 392, type: !277)
!855 = !DILocation(line: 392, column: 60, scope: !845)
!856 = !DILocalVariable(name: "len", arg: 4, scope: !845, file: !1, line: 392, type: !515)
!857 = !DILocation(line: 392, column: 77, scope: !845)
!858 = !DILocalVariable(name: "f_example", arg: 5, scope: !845, file: !1, line: 393, type: !848)
!859 = !DILocation(line: 393, column: 38, scope: !845)
!860 = !DILocalVariable(name: "create_flag", arg: 6, scope: !845, file: !1, line: 393, type: !398)
!861 = !DILocation(line: 393, column: 69, scope: !845)
!862 = !DILocalVariable(name: "f", scope: !845, file: !1, line: 395, type: !246)
!863 = !DILocation(line: 395, column: 10, scope: !845)
!864 = !DILocalVariable(name: "l", scope: !845, file: !1, line: 396, type: !206)
!865 = !DILocation(line: 396, column: 10, scope: !845)
!866 = !DILocalVariable(name: "startl", scope: !845, file: !1, line: 396, type: !206)
!867 = !DILocation(line: 396, column: 14, scope: !845)
!868 = !DILocalVariable(name: "lastl", scope: !845, file: !1, line: 396, type: !206)
!869 = !DILocation(line: 396, column: 23, scope: !845)
!870 = !DILocalVariable(name: "i", scope: !845, file: !1, line: 397, type: !167)
!871 = !DILocation(line: 397, column: 6, scope: !845)
!872 = !DILocation(line: 402, column: 6, scope: !873)
!873 = distinct !DILexicalBlock(scope: !845, file: !1, line: 402, column: 6)
!874 = !DILocation(line: 402, column: 10, scope: !873)
!875 = !DILocation(line: 402, column: 6, scope: !845)
!876 = !DILocation(line: 404, column: 3, scope: !877)
!877 = distinct !DILexicalBlock(scope: !873, file: !1, line: 402, column: 16)
!878 = !DILocation(line: 407, column: 6, scope: !879)
!879 = distinct !DILexicalBlock(scope: !845, file: !1, line: 407, column: 6)
!880 = !DILocation(line: 407, column: 18, scope: !879)
!881 = !DILocation(line: 407, column: 6, scope: !845)
!882 = !DILocalVariable(name: "is_overlap", scope: !883, file: !1, line: 409, type: !674)
!883 = distinct !DILexicalBlock(scope: !879, file: !1, line: 407, column: 41)
!884 = !DILocation(line: 409, column: 14, scope: !883)
!885 = !DILocation(line: 409, column: 42, scope: !883)
!886 = !DILocation(line: 409, column: 49, scope: !883)
!887 = !DILocation(line: 409, column: 27, scope: !883)
!888 = !DILocation(line: 410, column: 7, scope: !889)
!889 = distinct !DILexicalBlock(scope: !883, file: !1, line: 410, column: 7)
!890 = !DILocation(line: 410, column: 7, scope: !883)
!891 = !DILocation(line: 411, column: 11, scope: !892)
!892 = distinct !DILexicalBlock(scope: !889, file: !1, line: 410, column: 19)
!893 = !DILocation(line: 411, column: 4, scope: !892)
!894 = !DILocation(line: 416, column: 2, scope: !883)
!895 = !DILocation(line: 418, column: 31, scope: !845)
!896 = !DILocation(line: 418, column: 6, scope: !845)
!897 = !DILocation(line: 418, column: 4, scope: !845)
!898 = !DILocation(line: 420, column: 40, scope: !845)
!899 = !DILocation(line: 420, column: 44, scope: !845)
!900 = !DILocation(line: 420, column: 47, scope: !845)
!901 = !DILocation(line: 420, column: 57, scope: !845)
!902 = !DILocation(line: 420, column: 67, scope: !845)
!903 = !DILocation(line: 420, column: 19, scope: !845)
!904 = !DILocation(line: 420, column: 17, scope: !845)
!905 = !DILocation(line: 420, column: 9, scope: !845)
!906 = !DILocation(line: 422, column: 14, scope: !845)
!907 = !DILocation(line: 422, column: 2, scope: !845)
!908 = !DILocation(line: 422, column: 10, scope: !845)
!909 = !DILocation(line: 422, column: 12, scope: !845)
!910 = !DILocation(line: 423, column: 14, scope: !845)
!911 = !DILocation(line: 423, column: 2, scope: !845)
!912 = !DILocation(line: 423, column: 10, scope: !845)
!913 = !DILocation(line: 423, column: 12, scope: !845)
!914 = !DILocation(line: 424, column: 9, scope: !915)
!915 = distinct !DILexicalBlock(scope: !845, file: !1, line: 424, column: 2)
!916 = !DILocation(line: 424, column: 7, scope: !915)
!917 = !DILocation(line: 424, column: 14, scope: !918)
!918 = distinct !DILexicalBlock(scope: !915, file: !1, line: 424, column: 2)
!919 = !DILocation(line: 424, column: 18, scope: !918)
!920 = !DILocation(line: 424, column: 16, scope: !918)
!921 = !DILocation(line: 424, column: 2, scope: !915)
!922 = !DILocation(line: 425, column: 22, scope: !923)
!923 = distinct !DILexicalBlock(scope: !918, file: !1, line: 424, column: 28)
!924 = !DILocation(line: 425, column: 26, scope: !923)
!925 = !DILocation(line: 425, column: 32, scope: !923)
!926 = !DILocation(line: 425, column: 36, scope: !923)
!927 = !DILocation(line: 425, column: 42, scope: !923)
!928 = !DILocation(line: 425, column: 46, scope: !923)
!929 = !DILocation(line: 425, column: 49, scope: !923)
!930 = !DILocation(line: 425, column: 55, scope: !923)
!931 = !DILocation(line: 425, column: 59, scope: !923)
!932 = !DILocation(line: 425, column: 62, scope: !923)
!933 = !DILocation(line: 425, column: 7, scope: !923)
!934 = !DILocation(line: 425, column: 5, scope: !923)
!935 = !DILocation(line: 427, column: 10, scope: !923)
!936 = !DILocation(line: 427, column: 3, scope: !923)
!937 = !DILocation(line: 427, column: 6, scope: !923)
!938 = !DILocation(line: 427, column: 8, scope: !923)
!939 = !DILocation(line: 428, column: 23, scope: !923)
!940 = !DILocation(line: 428, column: 29, scope: !923)
!941 = !DILocation(line: 428, column: 33, scope: !923)
!942 = !DILocation(line: 428, column: 3, scope: !923)
!943 = !DILocation(line: 430, column: 13, scope: !923)
!944 = !DILocation(line: 430, column: 3, scope: !923)
!945 = !DILocation(line: 430, column: 6, scope: !923)
!946 = !DILocation(line: 430, column: 11, scope: !923)
!947 = !DILocation(line: 431, column: 17, scope: !923)
!948 = !DILocation(line: 431, column: 3, scope: !923)
!949 = !DILocation(line: 431, column: 10, scope: !923)
!950 = !DILocation(line: 431, column: 15, scope: !923)
!951 = !DILocation(line: 432, column: 11, scope: !923)
!952 = !DILocation(line: 432, column: 9, scope: !923)
!953 = !DILocation(line: 433, column: 2, scope: !923)
!954 = !DILocation(line: 424, column: 24, scope: !918)
!955 = !DILocation(line: 424, column: 2, scope: !918)
!956 = distinct !{!956, !921, !957}
!957 = !DILocation(line: 433, column: 2, scope: !915)
!958 = !DILocation(line: 435, column: 17, scope: !845)
!959 = !DILocation(line: 435, column: 2, scope: !845)
!960 = !DILocation(line: 435, column: 10, scope: !845)
!961 = !DILocation(line: 435, column: 15, scope: !845)
!962 = !DILocation(line: 436, column: 16, scope: !845)
!963 = !DILocation(line: 436, column: 2, scope: !845)
!964 = !DILocation(line: 436, column: 9, scope: !845)
!965 = !DILocation(line: 436, column: 14, scope: !845)
!966 = !DILocation(line: 438, column: 11, scope: !845)
!967 = !DILocation(line: 438, column: 2, scope: !845)
!968 = !DILocation(line: 438, column: 5, scope: !845)
!969 = !DILocation(line: 438, column: 9, scope: !845)
!970 = !DILocation(line: 440, column: 8, scope: !971)
!971 = distinct !DILexicalBlock(scope: !845, file: !1, line: 440, column: 6)
!972 = !DILocation(line: 440, column: 20, scope: !971)
!973 = !DILocation(line: 440, column: 6, scope: !845)
!974 = !DILocation(line: 441, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !1, line: 441, column: 7)
!976 = distinct !DILexicalBlock(scope: !971, file: !1, line: 440, column: 42)
!977 = !DILocation(line: 441, column: 7, scope: !976)
!978 = !DILocation(line: 442, column: 23, scope: !979)
!979 = distinct !DILexicalBlock(scope: !975, file: !1, line: 441, column: 18)
!980 = !DILocation(line: 442, column: 27, scope: !979)
!981 = !DILocation(line: 442, column: 31, scope: !979)
!982 = !DILocation(line: 442, column: 42, scope: !979)
!983 = !DILocation(line: 442, column: 4, scope: !979)
!984 = !DILocation(line: 443, column: 3, scope: !979)
!985 = !DILocation(line: 445, column: 34, scope: !986)
!986 = distinct !DILexicalBlock(scope: !975, file: !1, line: 444, column: 8)
!987 = !DILocation(line: 445, column: 38, scope: !986)
!988 = !DILocation(line: 445, column: 46, scope: !986)
!989 = !DILocation(line: 445, column: 49, scope: !986)
!990 = !DILocation(line: 445, column: 54, scope: !986)
!991 = !DILocation(line: 445, column: 4, scope: !986)
!992 = !DILocation(line: 447, column: 2, scope: !976)
!993 = !DILocation(line: 449, column: 2, scope: !845)
!994 = !DILocation(line: 451, column: 9, scope: !845)
!995 = !DILocation(line: 451, column: 2, scope: !845)
!996 = !DILocation(line: 452, column: 1, scope: !845)
!997 = distinct !DISubprogram(name: "bm_face_create__internal", scope: !1, file: !1, line: 337, type: !998, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !400)
!998 = !DISubroutineType(types: !999)
!999 = !{!246, !255}
!1000 = !DILocalVariable(name: "bm", arg: 1, scope: !997, file: !1, line: 337, type: !255)
!1001 = !DILocation(line: 337, column: 52, scope: !997)
!1002 = !DILocalVariable(name: "f", scope: !997, file: !1, line: 339, type: !246)
!1003 = !DILocation(line: 339, column: 10, scope: !997)
!1004 = !DILocation(line: 341, column: 24, scope: !997)
!1005 = !DILocation(line: 341, column: 28, scope: !997)
!1006 = !DILocation(line: 341, column: 6, scope: !997)
!1007 = !DILocation(line: 341, column: 4, scope: !997)
!1008 = !DILocation(line: 345, column: 2, scope: !997)
!1009 = !DILocation(line: 345, column: 5, scope: !997)
!1010 = !DILocation(line: 345, column: 10, scope: !997)
!1011 = !DILocation(line: 345, column: 15, scope: !997)
!1012 = !DILocation(line: 349, column: 2, scope: !997)
!1013 = !DILocation(line: 352, column: 2, scope: !997)
!1014 = !DILocation(line: 352, column: 5, scope: !997)
!1015 = !DILocation(line: 352, column: 10, scope: !997)
!1016 = !DILocation(line: 352, column: 16, scope: !997)
!1017 = !DILocation(line: 353, column: 2, scope: !997)
!1018 = !DILocation(line: 353, column: 5, scope: !997)
!1019 = !DILocation(line: 353, column: 10, scope: !997)
!1020 = !DILocation(line: 353, column: 16, scope: !997)
!1021 = !DILocation(line: 354, column: 2, scope: !997)
!1022 = !DILocation(line: 354, column: 5, scope: !997)
!1023 = !DILocation(line: 354, column: 10, scope: !997)
!1024 = !DILocation(line: 354, column: 19, scope: !997)
!1025 = !DILocation(line: 357, column: 14, scope: !997)
!1026 = !DILocation(line: 357, column: 18, scope: !997)
!1027 = !DILocation(line: 357, column: 53, scope: !997)
!1028 = !DILocation(line: 357, column: 57, scope: !997)
!1029 = !DILocation(line: 357, column: 34, scope: !997)
!1030 = !DILocation(line: 357, column: 2, scope: !997)
!1031 = !DILocation(line: 357, column: 5, scope: !997)
!1032 = !DILocation(line: 357, column: 12, scope: !997)
!1033 = !DILocation(line: 362, column: 2, scope: !997)
!1034 = !DILocation(line: 362, column: 5, scope: !997)
!1035 = !DILocation(line: 362, column: 13, scope: !997)
!1036 = !DILocation(line: 364, column: 2, scope: !997)
!1037 = !DILocation(line: 364, column: 5, scope: !997)
!1038 = !DILocation(line: 364, column: 9, scope: !997)
!1039 = !DILocation(line: 365, column: 10, scope: !997)
!1040 = !DILocation(line: 365, column: 13, scope: !997)
!1041 = !DILocation(line: 365, column: 2, scope: !997)
!1042 = !DILocation(line: 366, column: 2, scope: !997)
!1043 = !DILocation(line: 366, column: 5, scope: !997)
!1044 = !DILocation(line: 366, column: 12, scope: !997)
!1045 = !DILocation(line: 371, column: 2, scope: !997)
!1046 = !DILocation(line: 371, column: 6, scope: !997)
!1047 = !DILocation(line: 371, column: 23, scope: !997)
!1048 = !DILocation(line: 372, column: 2, scope: !997)
!1049 = !DILocation(line: 372, column: 6, scope: !997)
!1050 = !DILocation(line: 372, column: 23, scope: !997)
!1051 = !DILocation(line: 374, column: 2, scope: !997)
!1052 = !DILocation(line: 374, column: 6, scope: !997)
!1053 = !DILocation(line: 374, column: 13, scope: !997)
!1054 = !DILocation(line: 380, column: 9, scope: !997)
!1055 = !DILocation(line: 380, column: 2, scope: !997)
!1056 = distinct !DISubprogram(name: "bm_face_boundary_add", scope: !1, file: !1, line: 247, type: !1057, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!206, !255, !246, !222, !157, !398}
!1059 = !DILocalVariable(name: "bm", arg: 1, scope: !1056, file: !1, line: 247, type: !255)
!1060 = !DILocation(line: 247, column: 44, scope: !1056)
!1061 = !DILocalVariable(name: "f", arg: 2, scope: !1056, file: !1, line: 247, type: !246)
!1062 = !DILocation(line: 247, column: 56, scope: !1056)
!1063 = !DILocalVariable(name: "startv", arg: 3, scope: !1056, file: !1, line: 247, type: !222)
!1064 = !DILocation(line: 247, column: 67, scope: !1056)
!1065 = !DILocalVariable(name: "starte", arg: 4, scope: !1056, file: !1, line: 247, type: !157)
!1066 = !DILocation(line: 247, column: 83, scope: !1056)
!1067 = !DILocalVariable(name: "create_flag", arg: 5, scope: !1056, file: !1, line: 248, type: !398)
!1068 = !DILocation(line: 248, column: 57, scope: !1056)
!1069 = !DILocalVariable(name: "l", scope: !1056, file: !1, line: 253, type: !206)
!1070 = !DILocation(line: 253, column: 10, scope: !1056)
!1071 = !DILocation(line: 253, column: 29, scope: !1056)
!1072 = !DILocation(line: 253, column: 33, scope: !1056)
!1073 = !DILocation(line: 253, column: 41, scope: !1056)
!1074 = !DILocation(line: 253, column: 49, scope: !1056)
!1075 = !DILocation(line: 253, column: 52, scope: !1056)
!1076 = !DILocation(line: 253, column: 60, scope: !1056)
!1077 = !DILocation(line: 253, column: 63, scope: !1056)
!1078 = !DILocation(line: 253, column: 14, scope: !1056)
!1079 = !DILocation(line: 255, column: 22, scope: !1056)
!1080 = !DILocation(line: 255, column: 30, scope: !1056)
!1081 = !DILocation(line: 255, column: 2, scope: !1056)
!1082 = !DILocation(line: 261, column: 15, scope: !1056)
!1083 = !DILocation(line: 261, column: 2, scope: !1056)
!1084 = !DILocation(line: 261, column: 5, scope: !1056)
!1085 = !DILocation(line: 261, column: 13, scope: !1056)
!1086 = !DILocation(line: 264, column: 9, scope: !1056)
!1087 = !DILocation(line: 264, column: 2, scope: !1056)
!1088 = !DILocation(line: 264, column: 5, scope: !1056)
!1089 = !DILocation(line: 264, column: 7, scope: !1056)
!1090 = !DILocation(line: 266, column: 9, scope: !1056)
!1091 = !DILocation(line: 266, column: 2, scope: !1056)
!1092 = distinct !DISubprogram(name: "bm_loop_create", scope: !1, file: !1, line: 197, type: !1093, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!206, !255, !222, !157, !246, !1095, !398}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!1097 = !DILocalVariable(name: "bm", arg: 1, scope: !1092, file: !1, line: 197, type: !255)
!1098 = !DILocation(line: 197, column: 38, scope: !1092)
!1099 = !DILocalVariable(name: "v", arg: 2, scope: !1092, file: !1, line: 197, type: !222)
!1100 = !DILocation(line: 197, column: 50, scope: !1092)
!1101 = !DILocalVariable(name: "e", arg: 3, scope: !1092, file: !1, line: 197, type: !157)
!1102 = !DILocation(line: 197, column: 61, scope: !1092)
!1103 = !DILocalVariable(name: "f", arg: 4, scope: !1092, file: !1, line: 197, type: !246)
!1104 = !DILocation(line: 197, column: 72, scope: !1092)
!1105 = !DILocalVariable(name: "l_example", arg: 5, scope: !1092, file: !1, line: 198, type: !1095)
!1106 = !DILocation(line: 198, column: 45, scope: !1092)
!1107 = !DILocalVariable(name: "create_flag", arg: 6, scope: !1092, file: !1, line: 198, type: !398)
!1108 = !DILocation(line: 198, column: 76, scope: !1092)
!1109 = !DILocalVariable(name: "l", scope: !1092, file: !1, line: 200, type: !206)
!1110 = !DILocation(line: 200, column: 10, scope: !1092)
!1111 = !DILocation(line: 202, column: 24, scope: !1092)
!1112 = !DILocation(line: 202, column: 28, scope: !1092)
!1113 = !DILocation(line: 202, column: 6, scope: !1092)
!1114 = !DILocation(line: 202, column: 4, scope: !1092)
!1115 = !DILocation(line: 208, column: 2, scope: !1092)
!1116 = !DILocation(line: 208, column: 5, scope: !1092)
!1117 = !DILocation(line: 208, column: 10, scope: !1092)
!1118 = !DILocation(line: 208, column: 15, scope: !1092)
!1119 = !DILocation(line: 213, column: 2, scope: !1092)
!1120 = !DILocation(line: 216, column: 2, scope: !1092)
!1121 = !DILocation(line: 216, column: 5, scope: !1092)
!1122 = !DILocation(line: 216, column: 10, scope: !1092)
!1123 = !DILocation(line: 216, column: 16, scope: !1092)
!1124 = !DILocation(line: 217, column: 2, scope: !1092)
!1125 = !DILocation(line: 217, column: 5, scope: !1092)
!1126 = !DILocation(line: 217, column: 10, scope: !1092)
!1127 = !DILocation(line: 217, column: 16, scope: !1092)
!1128 = !DILocation(line: 218, column: 2, scope: !1092)
!1129 = !DILocation(line: 218, column: 5, scope: !1092)
!1130 = !DILocation(line: 218, column: 10, scope: !1092)
!1131 = !DILocation(line: 218, column: 19, scope: !1092)
!1132 = !DILocation(line: 220, column: 9, scope: !1092)
!1133 = !DILocation(line: 220, column: 2, scope: !1092)
!1134 = !DILocation(line: 220, column: 5, scope: !1092)
!1135 = !DILocation(line: 220, column: 7, scope: !1092)
!1136 = !DILocation(line: 221, column: 9, scope: !1092)
!1137 = !DILocation(line: 221, column: 2, scope: !1092)
!1138 = !DILocation(line: 221, column: 5, scope: !1092)
!1139 = !DILocation(line: 221, column: 7, scope: !1092)
!1140 = !DILocation(line: 222, column: 9, scope: !1092)
!1141 = !DILocation(line: 222, column: 2, scope: !1092)
!1142 = !DILocation(line: 222, column: 5, scope: !1092)
!1143 = !DILocation(line: 222, column: 7, scope: !1092)
!1144 = !DILocation(line: 224, column: 2, scope: !1092)
!1145 = !DILocation(line: 224, column: 5, scope: !1092)
!1146 = !DILocation(line: 224, column: 17, scope: !1092)
!1147 = !DILocation(line: 225, column: 2, scope: !1092)
!1148 = !DILocation(line: 225, column: 5, scope: !1092)
!1149 = !DILocation(line: 225, column: 17, scope: !1092)
!1150 = !DILocation(line: 226, column: 2, scope: !1092)
!1151 = !DILocation(line: 226, column: 5, scope: !1092)
!1152 = !DILocation(line: 226, column: 10, scope: !1092)
!1153 = !DILocation(line: 227, column: 2, scope: !1092)
!1154 = !DILocation(line: 227, column: 5, scope: !1092)
!1155 = !DILocation(line: 227, column: 10, scope: !1092)
!1156 = !DILocation(line: 231, column: 2, scope: !1092)
!1157 = !DILocation(line: 231, column: 6, scope: !1092)
!1158 = !DILocation(line: 231, column: 23, scope: !1092)
!1159 = !DILocation(line: 233, column: 2, scope: !1092)
!1160 = !DILocation(line: 233, column: 6, scope: !1092)
!1161 = !DILocation(line: 233, column: 13, scope: !1092)
!1162 = !DILocation(line: 235, column: 8, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 235, column: 6)
!1164 = !DILocation(line: 235, column: 20, scope: !1163)
!1165 = !DILocation(line: 235, column: 6, scope: !1092)
!1166 = !DILocation(line: 236, column: 7, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 236, column: 7)
!1168 = distinct !DILexicalBlock(scope: !1163, file: !1, line: 235, column: 42)
!1169 = !DILocation(line: 236, column: 7, scope: !1168)
!1170 = !DILocation(line: 237, column: 32, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1167, file: !1, line: 236, column: 18)
!1172 = !DILocation(line: 237, column: 36, scope: !1171)
!1173 = !DILocation(line: 237, column: 44, scope: !1171)
!1174 = !DILocation(line: 237, column: 48, scope: !1171)
!1175 = !DILocation(line: 237, column: 55, scope: !1171)
!1176 = !DILocation(line: 237, column: 66, scope: !1171)
!1177 = !DILocation(line: 237, column: 71, scope: !1171)
!1178 = !DILocation(line: 237, column: 78, scope: !1171)
!1179 = !DILocation(line: 237, column: 81, scope: !1171)
!1180 = !DILocation(line: 237, column: 86, scope: !1171)
!1181 = !DILocation(line: 237, column: 4, scope: !1171)
!1182 = !DILocation(line: 238, column: 3, scope: !1171)
!1183 = !DILocation(line: 240, column: 34, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1167, file: !1, line: 239, column: 8)
!1185 = !DILocation(line: 240, column: 38, scope: !1184)
!1186 = !DILocation(line: 240, column: 46, scope: !1184)
!1187 = !DILocation(line: 240, column: 49, scope: !1184)
!1188 = !DILocation(line: 240, column: 54, scope: !1184)
!1189 = !DILocation(line: 240, column: 4, scope: !1184)
!1190 = !DILocation(line: 242, column: 2, scope: !1168)
!1191 = !DILocation(line: 244, column: 9, scope: !1092)
!1192 = !DILocation(line: 244, column: 2, scope: !1092)
!1193 = distinct !DISubprogram(name: "BM_face_create_verts", scope: !1, file: !1, line: 457, type: !1194, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!246, !255, !275, !515, !848, !398, !674}
!1196 = !DILocalVariable(name: "bm", arg: 1, scope: !1193, file: !1, line: 457, type: !255)
!1197 = !DILocation(line: 457, column: 37, scope: !1193)
!1198 = !DILocalVariable(name: "vert_arr", arg: 2, scope: !1193, file: !1, line: 457, type: !275)
!1199 = !DILocation(line: 457, column: 50, scope: !1193)
!1200 = !DILocalVariable(name: "len", arg: 3, scope: !1193, file: !1, line: 457, type: !515)
!1201 = !DILocation(line: 457, column: 70, scope: !1193)
!1202 = !DILocalVariable(name: "f_example", arg: 4, scope: !1193, file: !1, line: 458, type: !848)
!1203 = !DILocation(line: 458, column: 44, scope: !1193)
!1204 = !DILocalVariable(name: "create_flag", arg: 5, scope: !1193, file: !1, line: 458, type: !398)
!1205 = !DILocation(line: 458, column: 75, scope: !1193)
!1206 = !DILocalVariable(name: "create_edges", arg: 6, scope: !1193, file: !1, line: 458, type: !674)
!1207 = !DILocation(line: 458, column: 99, scope: !1193)
!1208 = !DILocalVariable(name: "edge_arr", scope: !1193, file: !1, line: 460, type: !277)
!1209 = !DILocation(line: 460, column: 11, scope: !1193)
!1210 = !DILocation(line: 460, column: 22, scope: !1193)
!1211 = !DILocalVariable(name: "i", scope: !1193, file: !1, line: 461, type: !167)
!1212 = !DILocation(line: 461, column: 6, scope: !1193)
!1213 = !DILocalVariable(name: "i_prev", scope: !1193, file: !1, line: 461, type: !167)
!1214 = !DILocation(line: 461, column: 9, scope: !1193)
!1215 = !DILocation(line: 461, column: 18, scope: !1193)
!1216 = !DILocation(line: 461, column: 22, scope: !1193)
!1217 = !DILocation(line: 463, column: 6, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1193, file: !1, line: 463, column: 6)
!1219 = !DILocation(line: 463, column: 6, scope: !1193)
!1220 = !DILocation(line: 464, column: 10, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !1, line: 464, column: 3)
!1222 = distinct !DILexicalBlock(scope: !1218, file: !1, line: 463, column: 20)
!1223 = !DILocation(line: 464, column: 8, scope: !1221)
!1224 = !DILocation(line: 464, column: 15, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1221, file: !1, line: 464, column: 3)
!1226 = !DILocation(line: 464, column: 19, scope: !1225)
!1227 = !DILocation(line: 464, column: 17, scope: !1225)
!1228 = !DILocation(line: 464, column: 3, scope: !1221)
!1229 = !DILocation(line: 465, column: 38, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1225, file: !1, line: 464, column: 29)
!1231 = !DILocation(line: 465, column: 42, scope: !1230)
!1232 = !DILocation(line: 465, column: 51, scope: !1230)
!1233 = !DILocation(line: 465, column: 60, scope: !1230)
!1234 = !DILocation(line: 465, column: 69, scope: !1230)
!1235 = !DILocation(line: 465, column: 23, scope: !1230)
!1236 = !DILocation(line: 465, column: 4, scope: !1230)
!1237 = !DILocation(line: 465, column: 13, scope: !1230)
!1238 = !DILocation(line: 465, column: 21, scope: !1230)
!1239 = !DILocation(line: 466, column: 13, scope: !1230)
!1240 = !DILocation(line: 466, column: 11, scope: !1230)
!1241 = !DILocation(line: 467, column: 3, scope: !1230)
!1242 = !DILocation(line: 464, column: 25, scope: !1225)
!1243 = !DILocation(line: 464, column: 3, scope: !1225)
!1244 = distinct !{!1244, !1228, !1245}
!1245 = !DILocation(line: 467, column: 3, scope: !1221)
!1246 = !DILocation(line: 468, column: 2, scope: !1222)
!1247 = !DILocation(line: 470, column: 10, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 470, column: 3)
!1249 = distinct !DILexicalBlock(scope: !1218, file: !1, line: 469, column: 7)
!1250 = !DILocation(line: 470, column: 8, scope: !1248)
!1251 = !DILocation(line: 470, column: 15, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1248, file: !1, line: 470, column: 3)
!1253 = !DILocation(line: 470, column: 19, scope: !1252)
!1254 = !DILocation(line: 470, column: 17, scope: !1252)
!1255 = !DILocation(line: 470, column: 3, scope: !1248)
!1256 = !DILocation(line: 471, column: 38, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1252, file: !1, line: 470, column: 29)
!1258 = !DILocation(line: 471, column: 47, scope: !1257)
!1259 = !DILocation(line: 471, column: 56, scope: !1257)
!1260 = !DILocation(line: 471, column: 65, scope: !1257)
!1261 = !DILocation(line: 471, column: 23, scope: !1257)
!1262 = !DILocation(line: 471, column: 4, scope: !1257)
!1263 = !DILocation(line: 471, column: 13, scope: !1257)
!1264 = !DILocation(line: 471, column: 21, scope: !1257)
!1265 = !DILocation(line: 472, column: 8, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1257, file: !1, line: 472, column: 8)
!1267 = !DILocation(line: 472, column: 17, scope: !1266)
!1268 = !DILocation(line: 472, column: 25, scope: !1266)
!1269 = !DILocation(line: 472, column: 8, scope: !1257)
!1270 = !DILocation(line: 473, column: 5, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1266, file: !1, line: 472, column: 34)
!1272 = !DILocation(line: 475, column: 13, scope: !1257)
!1273 = !DILocation(line: 475, column: 11, scope: !1257)
!1274 = !DILocation(line: 476, column: 3, scope: !1257)
!1275 = !DILocation(line: 470, column: 25, scope: !1252)
!1276 = !DILocation(line: 470, column: 3, scope: !1252)
!1277 = distinct !{!1277, !1255, !1278}
!1278 = !DILocation(line: 476, column: 3, scope: !1248)
!1279 = !DILocation(line: 479, column: 24, scope: !1193)
!1280 = !DILocation(line: 479, column: 28, scope: !1193)
!1281 = !DILocation(line: 479, column: 38, scope: !1193)
!1282 = !DILocation(line: 479, column: 48, scope: !1193)
!1283 = !DILocation(line: 479, column: 53, scope: !1193)
!1284 = !DILocation(line: 479, column: 64, scope: !1193)
!1285 = !DILocation(line: 479, column: 9, scope: !1193)
!1286 = !DILocation(line: 479, column: 2, scope: !1193)
!1287 = !DILocation(line: 480, column: 1, scope: !1193)
!1288 = distinct !DISubprogram(name: "BM_face_edges_kill", scope: !1, file: !1, line: 710, type: !1289, scopeLine: 711, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{null, !255, !246}
!1291 = !DILocalVariable(name: "bm", arg: 1, scope: !1288, file: !1, line: 710, type: !255)
!1292 = !DILocation(line: 710, column: 32, scope: !1288)
!1293 = !DILocalVariable(name: "f", arg: 2, scope: !1288, file: !1, line: 710, type: !246)
!1294 = !DILocation(line: 710, column: 44, scope: !1288)
!1295 = !DILocalVariable(name: "edges", scope: !1288, file: !1, line: 712, type: !277)
!1296 = !DILocation(line: 712, column: 11, scope: !1288)
!1297 = !DILocation(line: 712, column: 19, scope: !1288)
!1298 = !DILocalVariable(name: "l_iter", scope: !1288, file: !1, line: 713, type: !206)
!1299 = !DILocation(line: 713, column: 10, scope: !1288)
!1300 = !DILocalVariable(name: "l_first", scope: !1288, file: !1, line: 714, type: !206)
!1301 = !DILocation(line: 714, column: 10, scope: !1288)
!1302 = !DILocalVariable(name: "i", scope: !1288, file: !1, line: 715, type: !167)
!1303 = !DILocation(line: 715, column: 6, scope: !1288)
!1304 = !DILocation(line: 717, column: 21, scope: !1288)
!1305 = !DILocation(line: 717, column: 19, scope: !1288)
!1306 = !DILocation(line: 717, column: 9, scope: !1288)
!1307 = !DILocation(line: 718, column: 2, scope: !1288)
!1308 = !DILocation(line: 719, column: 16, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1288, file: !1, line: 718, column: 5)
!1310 = !DILocation(line: 719, column: 24, scope: !1309)
!1311 = !DILocation(line: 719, column: 3, scope: !1309)
!1312 = !DILocation(line: 719, column: 10, scope: !1309)
!1313 = !DILocation(line: 719, column: 14, scope: !1309)
!1314 = !DILocation(line: 720, column: 2, scope: !1309)
!1315 = !DILocation(line: 720, column: 21, scope: !1288)
!1316 = !DILocation(line: 720, column: 29, scope: !1288)
!1317 = !DILocation(line: 720, column: 19, scope: !1288)
!1318 = !DILocation(line: 720, column: 38, scope: !1288)
!1319 = !DILocation(line: 720, column: 35, scope: !1288)
!1320 = distinct !{!1320, !1307, !1321}
!1321 = !DILocation(line: 720, column: 45, scope: !1288)
!1322 = !DILocation(line: 722, column: 9, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1288, file: !1, line: 722, column: 2)
!1324 = !DILocation(line: 722, column: 7, scope: !1323)
!1325 = !DILocation(line: 722, column: 14, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1323, file: !1, line: 722, column: 2)
!1327 = !DILocation(line: 722, column: 18, scope: !1326)
!1328 = !DILocation(line: 722, column: 21, scope: !1326)
!1329 = !DILocation(line: 722, column: 16, scope: !1326)
!1330 = !DILocation(line: 722, column: 2, scope: !1323)
!1331 = !DILocation(line: 723, column: 16, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1326, file: !1, line: 722, column: 31)
!1333 = !DILocation(line: 723, column: 20, scope: !1332)
!1334 = !DILocation(line: 723, column: 26, scope: !1332)
!1335 = !DILocation(line: 723, column: 3, scope: !1332)
!1336 = !DILocation(line: 724, column: 2, scope: !1332)
!1337 = !DILocation(line: 722, column: 27, scope: !1326)
!1338 = !DILocation(line: 722, column: 2, scope: !1326)
!1339 = distinct !{!1339, !1330, !1340}
!1340 = !DILocation(line: 724, column: 2, scope: !1323)
!1341 = !DILocation(line: 725, column: 1, scope: !1288)
!1342 = distinct !DISubprogram(name: "BM_edge_kill", scope: !1, file: !1, line: 792, type: !1343, scopeLine: 793, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{null, !255, !157}
!1345 = !DILocalVariable(name: "bm", arg: 1, scope: !1342, file: !1, line: 792, type: !255)
!1346 = !DILocation(line: 792, column: 26, scope: !1342)
!1347 = !DILocalVariable(name: "e", arg: 2, scope: !1342, file: !1, line: 792, type: !157)
!1348 = !DILocation(line: 792, column: 38, scope: !1342)
!1349 = !DILocation(line: 795, column: 25, scope: !1342)
!1350 = !DILocation(line: 795, column: 28, scope: !1342)
!1351 = !DILocation(line: 795, column: 31, scope: !1342)
!1352 = !DILocation(line: 795, column: 2, scope: !1342)
!1353 = !DILocation(line: 796, column: 25, scope: !1342)
!1354 = !DILocation(line: 796, column: 28, scope: !1342)
!1355 = !DILocation(line: 796, column: 31, scope: !1342)
!1356 = !DILocation(line: 796, column: 2, scope: !1342)
!1357 = !DILocation(line: 798, column: 6, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1342, file: !1, line: 798, column: 6)
!1359 = !DILocation(line: 798, column: 9, scope: !1358)
!1360 = !DILocation(line: 798, column: 6, scope: !1342)
!1361 = !DILocalVariable(name: "l", scope: !1362, file: !1, line: 799, type: !206)
!1362 = distinct !DILexicalBlock(scope: !1358, file: !1, line: 798, column: 12)
!1363 = !DILocation(line: 799, column: 11, scope: !1362)
!1364 = !DILocation(line: 799, column: 15, scope: !1362)
!1365 = !DILocation(line: 799, column: 18, scope: !1362)
!1366 = !DILocalVariable(name: "lnext", scope: !1362, file: !1, line: 799, type: !206)
!1367 = !DILocation(line: 799, column: 22, scope: !1362)
!1368 = !DILocalVariable(name: "startl", scope: !1362, file: !1, line: 799, type: !206)
!1369 = !DILocation(line: 799, column: 30, scope: !1362)
!1370 = !DILocation(line: 799, column: 39, scope: !1362)
!1371 = !DILocation(line: 799, column: 42, scope: !1362)
!1372 = !DILocation(line: 801, column: 3, scope: !1362)
!1373 = !DILocation(line: 802, column: 12, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1362, file: !1, line: 801, column: 6)
!1375 = !DILocation(line: 802, column: 15, scope: !1374)
!1376 = !DILocation(line: 802, column: 10, scope: !1374)
!1377 = !DILocation(line: 803, column: 8, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 803, column: 8)
!1379 = !DILocation(line: 803, column: 15, scope: !1378)
!1380 = !DILocation(line: 803, column: 20, scope: !1378)
!1381 = !DILocation(line: 803, column: 23, scope: !1378)
!1382 = !DILocation(line: 803, column: 17, scope: !1378)
!1383 = !DILocation(line: 803, column: 8, scope: !1374)
!1384 = !DILocation(line: 804, column: 18, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1378, file: !1, line: 803, column: 26)
!1386 = !DILocation(line: 804, column: 22, scope: !1385)
!1387 = !DILocation(line: 804, column: 25, scope: !1385)
!1388 = !DILocation(line: 804, column: 5, scope: !1385)
!1389 = !DILocation(line: 805, column: 5, scope: !1385)
!1390 = !DILocation(line: 808, column: 17, scope: !1374)
!1391 = !DILocation(line: 808, column: 21, scope: !1374)
!1392 = !DILocation(line: 808, column: 24, scope: !1374)
!1393 = !DILocation(line: 808, column: 4, scope: !1374)
!1394 = !DILocation(line: 810, column: 8, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 810, column: 8)
!1396 = !DILocation(line: 810, column: 13, scope: !1395)
!1397 = !DILocation(line: 810, column: 10, scope: !1395)
!1398 = !DILocation(line: 810, column: 8, scope: !1374)
!1399 = !DILocation(line: 811, column: 5, scope: !1395)
!1400 = !DILocation(line: 812, column: 8, scope: !1374)
!1401 = !DILocation(line: 812, column: 6, scope: !1374)
!1402 = !DILocation(line: 813, column: 3, scope: !1374)
!1403 = !DILocation(line: 813, column: 12, scope: !1362)
!1404 = !DILocation(line: 813, column: 17, scope: !1362)
!1405 = !DILocation(line: 813, column: 14, scope: !1362)
!1406 = distinct !{!1406, !1372, !1407}
!1407 = !DILocation(line: 813, column: 23, scope: !1362)
!1408 = !DILocation(line: 814, column: 2, scope: !1362)
!1409 = !DILocation(line: 816, column: 20, scope: !1342)
!1410 = !DILocation(line: 816, column: 24, scope: !1342)
!1411 = !DILocation(line: 816, column: 2, scope: !1342)
!1412 = !DILocation(line: 817, column: 1, scope: !1342)
!1413 = distinct !DISubprogram(name: "BM_face_verts_kill", scope: !1, file: !1, line: 731, type: !1289, scopeLine: 732, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1414 = !DILocalVariable(name: "bm", arg: 1, scope: !1413, file: !1, line: 731, type: !255)
!1415 = !DILocation(line: 731, column: 32, scope: !1413)
!1416 = !DILocalVariable(name: "f", arg: 2, scope: !1413, file: !1, line: 731, type: !246)
!1417 = !DILocation(line: 731, column: 44, scope: !1413)
!1418 = !DILocalVariable(name: "verts", scope: !1413, file: !1, line: 733, type: !275)
!1419 = !DILocation(line: 733, column: 11, scope: !1413)
!1420 = !DILocation(line: 733, column: 19, scope: !1413)
!1421 = !DILocalVariable(name: "l_iter", scope: !1413, file: !1, line: 734, type: !206)
!1422 = !DILocation(line: 734, column: 10, scope: !1413)
!1423 = !DILocalVariable(name: "l_first", scope: !1413, file: !1, line: 735, type: !206)
!1424 = !DILocation(line: 735, column: 10, scope: !1413)
!1425 = !DILocalVariable(name: "i", scope: !1413, file: !1, line: 736, type: !167)
!1426 = !DILocation(line: 736, column: 6, scope: !1413)
!1427 = !DILocation(line: 738, column: 21, scope: !1413)
!1428 = !DILocation(line: 738, column: 19, scope: !1413)
!1429 = !DILocation(line: 738, column: 9, scope: !1413)
!1430 = !DILocation(line: 739, column: 2, scope: !1413)
!1431 = !DILocation(line: 740, column: 16, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1413, file: !1, line: 739, column: 5)
!1433 = !DILocation(line: 740, column: 24, scope: !1432)
!1434 = !DILocation(line: 740, column: 3, scope: !1432)
!1435 = !DILocation(line: 740, column: 10, scope: !1432)
!1436 = !DILocation(line: 740, column: 14, scope: !1432)
!1437 = !DILocation(line: 741, column: 2, scope: !1432)
!1438 = !DILocation(line: 741, column: 21, scope: !1413)
!1439 = !DILocation(line: 741, column: 29, scope: !1413)
!1440 = !DILocation(line: 741, column: 19, scope: !1413)
!1441 = !DILocation(line: 741, column: 38, scope: !1413)
!1442 = !DILocation(line: 741, column: 35, scope: !1413)
!1443 = distinct !{!1443, !1430, !1444}
!1444 = !DILocation(line: 741, column: 45, scope: !1413)
!1445 = !DILocation(line: 743, column: 9, scope: !1446)
!1446 = distinct !DILexicalBlock(scope: !1413, file: !1, line: 743, column: 2)
!1447 = !DILocation(line: 743, column: 7, scope: !1446)
!1448 = !DILocation(line: 743, column: 14, scope: !1449)
!1449 = distinct !DILexicalBlock(scope: !1446, file: !1, line: 743, column: 2)
!1450 = !DILocation(line: 743, column: 18, scope: !1449)
!1451 = !DILocation(line: 743, column: 21, scope: !1449)
!1452 = !DILocation(line: 743, column: 16, scope: !1449)
!1453 = !DILocation(line: 743, column: 2, scope: !1446)
!1454 = !DILocation(line: 744, column: 16, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1449, file: !1, line: 743, column: 31)
!1456 = !DILocation(line: 744, column: 20, scope: !1455)
!1457 = !DILocation(line: 744, column: 26, scope: !1455)
!1458 = !DILocation(line: 744, column: 3, scope: !1455)
!1459 = !DILocation(line: 745, column: 2, scope: !1455)
!1460 = !DILocation(line: 743, column: 27, scope: !1449)
!1461 = !DILocation(line: 743, column: 2, scope: !1449)
!1462 = distinct !{!1462, !1453, !1463}
!1463 = !DILocation(line: 745, column: 2, scope: !1446)
!1464 = !DILocation(line: 746, column: 1, scope: !1413)
!1465 = distinct !DISubprogram(name: "BM_vert_kill", scope: !1, file: !1, line: 822, type: !1466, scopeLine: 823, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{null, !255, !222}
!1468 = !DILocalVariable(name: "bm", arg: 1, scope: !1465, file: !1, line: 822, type: !255)
!1469 = !DILocation(line: 822, column: 26, scope: !1465)
!1470 = !DILocalVariable(name: "v", arg: 2, scope: !1465, file: !1, line: 822, type: !222)
!1471 = !DILocation(line: 822, column: 38, scope: !1465)
!1472 = !DILocation(line: 824, column: 6, scope: !1473)
!1473 = distinct !DILexicalBlock(scope: !1465, file: !1, line: 824, column: 6)
!1474 = !DILocation(line: 824, column: 9, scope: !1473)
!1475 = !DILocation(line: 824, column: 6, scope: !1465)
!1476 = !DILocalVariable(name: "e", scope: !1477, file: !1, line: 825, type: !157)
!1477 = distinct !DILexicalBlock(scope: !1473, file: !1, line: 824, column: 12)
!1478 = !DILocation(line: 825, column: 11, scope: !1477)
!1479 = !DILocalVariable(name: "e_next", scope: !1477, file: !1, line: 825, type: !157)
!1480 = !DILocation(line: 825, column: 15, scope: !1477)
!1481 = !DILocation(line: 827, column: 7, scope: !1477)
!1482 = !DILocation(line: 827, column: 10, scope: !1477)
!1483 = !DILocation(line: 827, column: 5, scope: !1477)
!1484 = !DILocation(line: 828, column: 3, scope: !1477)
!1485 = !DILocation(line: 828, column: 10, scope: !1477)
!1486 = !DILocation(line: 828, column: 13, scope: !1477)
!1487 = !DILocation(line: 829, column: 34, scope: !1488)
!1488 = distinct !DILexicalBlock(scope: !1477, file: !1, line: 828, column: 16)
!1489 = !DILocation(line: 829, column: 37, scope: !1488)
!1490 = !DILocation(line: 829, column: 13, scope: !1488)
!1491 = !DILocation(line: 829, column: 11, scope: !1488)
!1492 = !DILocation(line: 830, column: 17, scope: !1488)
!1493 = !DILocation(line: 830, column: 21, scope: !1488)
!1494 = !DILocation(line: 830, column: 4, scope: !1488)
!1495 = !DILocation(line: 831, column: 8, scope: !1488)
!1496 = !DILocation(line: 831, column: 6, scope: !1488)
!1497 = distinct !{!1497, !1484, !1498}
!1498 = !DILocation(line: 832, column: 3, scope: !1477)
!1499 = !DILocation(line: 833, column: 2, scope: !1477)
!1500 = !DILocation(line: 835, column: 20, scope: !1465)
!1501 = !DILocation(line: 835, column: 24, scope: !1465)
!1502 = !DILocation(line: 835, column: 2, scope: !1465)
!1503 = !DILocation(line: 836, column: 1, scope: !1465)
!1504 = distinct !DISubprogram(name: "BM_face_kill", scope: !1, file: !1, line: 751, type: !1289, scopeLine: 752, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !400)
!1505 = !DILocalVariable(name: "bm", arg: 1, scope: !1504, file: !1, line: 751, type: !255)
!1506 = !DILocation(line: 751, column: 26, scope: !1504)
!1507 = !DILocalVariable(name: "f", arg: 2, scope: !1504, file: !1, line: 751, type: !246)
!1508 = !DILocation(line: 751, column: 38, scope: !1504)
!1509 = !DILocation(line: 757, column: 2, scope: !1504)
