; ModuleID = 'blender/source/blender/render/intern/source/texture_ocean.c'
source_filename = "blender/source/blender/render/intern/source/texture_ocean.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !61, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/texture_ocean.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !57}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierType", file: !4, line: 35, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!7 = !DIEnumerator(name: "eModifierType_None", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "eModifierType_Subsurf", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "eModifierType_Lattice", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "eModifierType_Curve", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "eModifierType_Build", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "eModifierType_Mirror", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "eModifierType_Decimate", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "eModifierType_Wave", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "eModifierType_Armature", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "eModifierType_Hook", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "eModifierType_Softbody", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "eModifierType_Boolean", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "eModifierType_Array", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "eModifierType_EdgeSplit", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "eModifierType_Displace", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!26 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!27 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!28 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!29 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!30 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!31 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!32 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!33 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!34 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!35 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!36 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!37 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!38 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!39 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!40 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!41 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!42 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!43 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!44 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!45 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!46 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!47 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!48 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!49 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!50 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!51 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!52 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!53 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!54 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!55 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!56 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 934, baseType: !5, size: 32, elements: !58)
!58 = !{!59, !60}
!59 = !DIEnumerator(name: "MOD_OCEAN_GENERATE_FOAM", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "MOD_OCEAN_GENERATE_NORMALS", value: 2, isUnsigned: true)
!61 = !{!62, !1578}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !4, line: 110, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !4, line: 99, size: 896, elements: !65)
!65 = !{!66, !68, !69, !71, !72, !73, !74, !79, !1577}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !4, line: 100, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !64, file: !4, line: 100, baseType: !67, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !4, line: 102, baseType: !70, size: 32, offset: 128)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !64, file: !4, line: 102, baseType: !70, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !64, file: !4, line: 103, baseType: !70, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !64, file: !4, line: 103, baseType: !70, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !4, line: 104, baseType: !75, size: 512, offset: 256)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !77)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !{!78}
!78 = !DISubrange(count: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !64, file: !4, line: 107, baseType: !80, size: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !82, line: 1216, size: 39680, elements: !83)
!82 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !{!84, !151, !155, !447, !960, !961, !962, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !989, !1204, !1207, !1450, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1473, !1474, !1475, !1476, !1477, !1485, !1551, !1558, !1559, !1566, !1569, !1570, !1571, !1572, !1573, !1574}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 1217, baseType: !85, size: 960)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !86, line: 130, baseType: !87)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !86, line: 117, size: 960, elements: !88)
!88 = !{!89, !91, !92, !94, !113, !117, !119, !120, !121, !122}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !86, line: 118, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !86, line: 118, baseType: !90, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !87, file: !86, line: 119, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !87, file: !86, line: 120, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !86, line: 136, size: 17600, elements: !97)
!97 = !{!98, !99, !101, !104, !108, !109, !110}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !96, file: !86, line: 137, baseType: !85, size: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !96, file: !86, line: 138, baseType: !100, size: 64, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !96, file: !86, line: 139, baseType: !102, size: 64, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !86, line: 43, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !86, line: 140, baseType: !105, size: 8192, offset: 1088)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8192, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !96, file: !86, line: 141, baseType: !105, size: 8192, offset: 9280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !96, file: !86, line: 148, baseType: !95, size: 64, offset: 17472)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !96, file: !86, line: 150, baseType: !111, size: 64, offset: 17536)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !86, line: 45, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !86, line: 121, baseType: !114, size: 528, offset: 256)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 528, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 66)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !86, line: 126, baseType: !118, size: 16, offset: 784)
!118 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !87, file: !86, line: 127, baseType: !70, size: 32, offset: 800)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !87, file: !86, line: 128, baseType: !70, size: 32, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !87, file: !86, line: 128, baseType: !70, size: 32, offset: 864)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !87, file: !86, line: 129, baseType: !123, size: 64, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !86, line: 75, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !86, line: 62, size: 1024, elements: !126)
!126 = !{!127, !129, !130, !131, !132, !133, !134, !135, !149, !150}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !86, line: 63, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !86, line: 63, baseType: !128, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !86, line: 64, baseType: !76, size: 8, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !125, file: !86, line: 64, baseType: !76, size: 8, offset: 136)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !86, line: 65, baseType: !118, size: 16, offset: 144)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !86, line: 66, baseType: !75, size: 512, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !125, file: !86, line: 67, baseType: !70, size: 32, offset: 672)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !86, line: 69, baseType: !136, size: 256, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !86, line: 60, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !86, line: 48, size: 256, elements: !138)
!138 = !{!139, !140, !147, !148}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !137, file: !86, line: 49, baseType: !90, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !137, file: !86, line: 58, baseType: !141, size: 128, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !142, line: 71, baseType: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !142, line: 69, size: 128, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !143, file: !142, line: 70, baseType: !90, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !143, file: !142, line: 70, baseType: !90, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !137, file: !86, line: 59, baseType: !70, size: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !137, file: !86, line: 59, baseType: !70, size: 32, offset: 224)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !125, file: !86, line: 70, baseType: !70, size: 32, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !125, file: !86, line: 74, baseType: !70, size: 32, offset: 992)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !81, file: !82, line: 1218, baseType: !152, size: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !154, line: 45, flags: DIFlagFwdDecl)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !81, file: !82, line: 1220, baseType: !156, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !158, line: 115, size: 11392, elements: !159)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !{!160, !161, !162, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !179, !191, !205, !206, !249, !250, !253, !254, !270, !271, !272, !273, !274, !275, !276, !280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !296, !297, !298, !299, !300, !301, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !361, !362, !363, !364, !365, !366, !367, !368, !369, !372, !375, !378, !379, !380, !381, !382, !385, !388, !391, !392, !398, !399, !400, !401, !402, !403, !405, !408, !411, !415, !435, !436}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !157, file: !158, line: 116, baseType: !85, size: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !157, file: !158, line: 117, baseType: !152, size: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !157, file: !158, line: 119, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !158, line: 57, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !158, line: 121, baseType: !118, size: 16, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !157, file: !158, line: 121, baseType: !118, size: 16, offset: 1104)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !157, file: !158, line: 122, baseType: !70, size: 32, offset: 1120)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !157, file: !158, line: 122, baseType: !70, size: 32, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !157, file: !158, line: 122, baseType: !70, size: 32, offset: 1184)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !157, file: !158, line: 123, baseType: !75, size: 512, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !157, file: !158, line: 124, baseType: !156, size: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !157, file: !158, line: 124, baseType: !156, size: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !157, file: !158, line: 127, baseType: !156, size: 64, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !157, file: !158, line: 127, baseType: !156, size: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !157, file: !158, line: 127, baseType: !156, size: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !157, file: !158, line: 128, baseType: !177, size: 64, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !154, line: 46, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !157, file: !158, line: 130, baseType: !180, size: 64, offset: 2112)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !158, line: 97, size: 832, elements: !182)
!182 = !{!183, !189, !190}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !181, file: !158, line: 98, baseType: !184, size: 768)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 768, elements: !186)
!185 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!186 = !{!187, !188}
!187 = !DISubrange(count: 8)
!188 = !DISubrange(count: 3)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !158, line: 99, baseType: !70, size: 32, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !181, file: !158, line: 99, baseType: !70, size: 32, offset: 800)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !157, file: !158, line: 131, baseType: !192, size: 64, offset: 2176)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !194, line: 486, size: 1600, elements: !195)
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !193, file: !194, line: 487, baseType: !85, size: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !193, file: !194, line: 489, baseType: !141, size: 128, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !193, file: !194, line: 490, baseType: !141, size: 128, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !193, file: !194, line: 491, baseType: !141, size: 128, offset: 1216)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !193, file: !194, line: 492, baseType: !141, size: 128, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !193, file: !194, line: 494, baseType: !70, size: 32, offset: 1472)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !193, file: !194, line: 495, baseType: !70, size: 32, offset: 1504)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !193, file: !194, line: 497, baseType: !70, size: 32, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !193, file: !194, line: 498, baseType: !70, size: 32, offset: 1568)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !157, file: !158, line: 132, baseType: !192, size: 64, offset: 2240)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !157, file: !158, line: 133, baseType: !207, size: 64, offset: 2304)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !194, line: 334, size: 1728, elements: !209)
!209 = !{!210, !211, !214, !215, !216, !217, !218, !219, !222, !223, !224, !225, !226, !227, !228, !248}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !208, file: !194, line: 335, baseType: !141, size: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !208, file: !194, line: 336, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !194, line: 47, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !194, line: 338, baseType: !118, size: 16, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !208, file: !194, line: 338, baseType: !118, size: 16, offset: 208)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !208, file: !194, line: 339, baseType: !5, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !208, file: !194, line: 340, baseType: !70, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !208, file: !194, line: 342, baseType: !185, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !208, file: !194, line: 343, baseType: !220, size: 96, offset: 320)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 96, elements: !221)
!221 = !{!188}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !208, file: !194, line: 344, baseType: !220, size: 96, offset: 416)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !208, file: !194, line: 347, baseType: !141, size: 128, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !208, file: !194, line: 349, baseType: !70, size: 32, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !208, file: !194, line: 350, baseType: !70, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !208, file: !194, line: 351, baseType: !90, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !208, file: !194, line: 352, baseType: !90, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !208, file: !194, line: 354, baseType: !229, size: 384, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !194, line: 116, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !194, line: 94, size: 384, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !230, file: !194, line: 96, baseType: !70, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !230, file: !194, line: 96, baseType: !70, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !230, file: !194, line: 97, baseType: !70, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !230, file: !194, line: 97, baseType: !70, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !230, file: !194, line: 99, baseType: !118, size: 16, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !230, file: !194, line: 100, baseType: !118, size: 16, offset: 144)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !230, file: !194, line: 102, baseType: !118, size: 16, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !230, file: !194, line: 105, baseType: !118, size: 16, offset: 176)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !230, file: !194, line: 108, baseType: !118, size: 16, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !230, file: !194, line: 109, baseType: !118, size: 16, offset: 208)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !230, file: !194, line: 111, baseType: !118, size: 16, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !230, file: !194, line: 112, baseType: !118, size: 16, offset: 240)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !230, file: !194, line: 114, baseType: !70, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !230, file: !194, line: 114, baseType: !70, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !230, file: !194, line: 115, baseType: !70, size: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !230, file: !194, line: 115, baseType: !70, size: 32, offset: 352)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !208, file: !194, line: 355, baseType: !75, size: 512, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !158, line: 134, baseType: !90, size: 64, offset: 2368)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !157, file: !158, line: 136, baseType: !251, size: 64, offset: 2432)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !158, line: 58, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !157, file: !158, line: 138, baseType: !229, size: 384, offset: 2496)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !157, file: !158, line: 139, baseType: !255, size: 64, offset: 2880)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !194, line: 80, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !194, line: 72, size: 192, elements: !258)
!258 = !{!259, !266, !267, !268, !269}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !257, file: !194, line: 73, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !194, line: 59, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !194, line: 56, size: 128, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !262, file: !194, line: 57, baseType: !220, size: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !194, line: 58, baseType: !70, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !257, file: !194, line: 74, baseType: !70, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !257, file: !194, line: 76, baseType: !70, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !257, file: !194, line: 77, baseType: !70, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !194, line: 79, baseType: !70, size: 32, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !157, file: !158, line: 141, baseType: !141, size: 128, offset: 2944)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !157, file: !158, line: 142, baseType: !141, size: 128, offset: 3072)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !157, file: !158, line: 143, baseType: !141, size: 128, offset: 3200)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !157, file: !158, line: 144, baseType: !141, size: 128, offset: 3328)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !157, file: !158, line: 146, baseType: !70, size: 32, offset: 3456)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !157, file: !158, line: 147, baseType: !70, size: 32, offset: 3488)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !157, file: !158, line: 150, baseType: !277, size: 64, offset: 3520)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !158, line: 50, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !157, file: !158, line: 151, baseType: !281, size: 64, offset: 3584)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !157, file: !158, line: 152, baseType: !70, size: 32, offset: 3648)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !157, file: !158, line: 153, baseType: !70, size: 32, offset: 3680)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !157, file: !158, line: 156, baseType: !220, size: 96, offset: 3712)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !157, file: !158, line: 156, baseType: !220, size: 96, offset: 3808)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !157, file: !158, line: 156, baseType: !220, size: 96, offset: 3904)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !158, line: 157, baseType: !220, size: 96, offset: 4000)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !157, file: !158, line: 158, baseType: !220, size: 96, offset: 4096)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !157, file: !158, line: 159, baseType: !220, size: 96, offset: 4192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !157, file: !158, line: 160, baseType: !220, size: 96, offset: 4288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !157, file: !158, line: 160, baseType: !220, size: 96, offset: 4384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !157, file: !158, line: 161, baseType: !293, size: 128, offset: 4480)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 128, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 4)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !157, file: !158, line: 161, baseType: !293, size: 128, offset: 4608)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !157, file: !158, line: 162, baseType: !220, size: 96, offset: 4736)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !157, file: !158, line: 162, baseType: !220, size: 96, offset: 4832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !157, file: !158, line: 163, baseType: !185, size: 32, offset: 4928)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !157, file: !158, line: 163, baseType: !185, size: 32, offset: 4960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !157, file: !158, line: 164, baseType: !302, size: 512, offset: 4992)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 512, elements: !303)
!303 = !{!295, !295}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !157, file: !158, line: 165, baseType: !302, size: 512, offset: 5504)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !157, file: !158, line: 166, baseType: !302, size: 512, offset: 6016)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !157, file: !158, line: 167, baseType: !302, size: 512, offset: 6528)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !157, file: !158, line: 176, baseType: !302, size: 512, offset: 7040)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !157, file: !158, line: 178, baseType: !5, size: 32, offset: 7552)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !157, file: !158, line: 180, baseType: !118, size: 16, offset: 7584)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !157, file: !158, line: 181, baseType: !118, size: 16, offset: 7600)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !157, file: !158, line: 183, baseType: !118, size: 16, offset: 7616)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !157, file: !158, line: 183, baseType: !118, size: 16, offset: 7632)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !157, file: !158, line: 184, baseType: !118, size: 16, offset: 7648)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !157, file: !158, line: 184, baseType: !118, size: 16, offset: 7664)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !157, file: !158, line: 185, baseType: !118, size: 16, offset: 7680)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !157, file: !158, line: 186, baseType: !118, size: 16, offset: 7696)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !157, file: !158, line: 187, baseType: !118, size: 16, offset: 7712)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !157, file: !158, line: 188, baseType: !76, size: 8, offset: 7728)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !157, file: !158, line: 189, baseType: !76, size: 8, offset: 7736)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !157, file: !158, line: 192, baseType: !70, size: 32, offset: 7744)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !157, file: !158, line: 192, baseType: !70, size: 32, offset: 7776)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !157, file: !158, line: 192, baseType: !70, size: 32, offset: 7808)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !157, file: !158, line: 192, baseType: !70, size: 32, offset: 7840)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !157, file: !158, line: 194, baseType: !70, size: 32, offset: 7872)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !157, file: !158, line: 202, baseType: !185, size: 32, offset: 7904)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !157, file: !158, line: 202, baseType: !185, size: 32, offset: 7936)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !157, file: !158, line: 202, baseType: !185, size: 32, offset: 7968)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !157, file: !158, line: 211, baseType: !185, size: 32, offset: 8000)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !157, file: !158, line: 212, baseType: !185, size: 32, offset: 8032)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !157, file: !158, line: 213, baseType: !185, size: 32, offset: 8064)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !157, file: !158, line: 214, baseType: !185, size: 32, offset: 8096)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !157, file: !158, line: 215, baseType: !185, size: 32, offset: 8128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !157, file: !158, line: 216, baseType: !185, size: 32, offset: 8160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !157, file: !158, line: 219, baseType: !185, size: 32, offset: 8192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !157, file: !158, line: 220, baseType: !185, size: 32, offset: 8224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !157, file: !158, line: 221, baseType: !185, size: 32, offset: 8256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !157, file: !158, line: 224, baseType: !338, size: 16, offset: 8288)
!338 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !157, file: !158, line: 224, baseType: !338, size: 16, offset: 8304)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !157, file: !158, line: 226, baseType: !118, size: 16, offset: 8320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !157, file: !158, line: 228, baseType: !76, size: 8, offset: 8336)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !157, file: !158, line: 229, baseType: !76, size: 8, offset: 8344)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !157, file: !158, line: 231, baseType: !118, size: 16, offset: 8352)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !157, file: !158, line: 232, baseType: !76, size: 8, offset: 8368)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !157, file: !158, line: 233, baseType: !76, size: 8, offset: 8376)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !157, file: !158, line: 234, baseType: !185, size: 32, offset: 8384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !157, file: !158, line: 235, baseType: !185, size: 32, offset: 8416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !157, file: !158, line: 237, baseType: !141, size: 128, offset: 8448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !157, file: !158, line: 238, baseType: !141, size: 128, offset: 8576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !157, file: !158, line: 239, baseType: !141, size: 128, offset: 8704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !157, file: !158, line: 240, baseType: !141, size: 128, offset: 8832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !157, file: !158, line: 242, baseType: !185, size: 32, offset: 8960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !157, file: !158, line: 244, baseType: !118, size: 16, offset: 8992)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !157, file: !158, line: 245, baseType: !338, size: 16, offset: 9008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !157, file: !158, line: 246, baseType: !293, size: 128, offset: 9024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !157, file: !158, line: 248, baseType: !70, size: 32, offset: 9152)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !157, file: !158, line: 249, baseType: !70, size: 32, offset: 9184)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !157, file: !158, line: 251, baseType: !359, size: 64, offset: 9216)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !158, line: 251, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !157, file: !158, line: 253, baseType: !76, size: 8, offset: 9280)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !157, file: !158, line: 254, baseType: !76, size: 8, offset: 9288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !157, file: !158, line: 255, baseType: !118, size: 16, offset: 9296)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !157, file: !158, line: 256, baseType: !220, size: 96, offset: 9312)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !157, file: !158, line: 258, baseType: !141, size: 128, offset: 9408)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !157, file: !158, line: 259, baseType: !141, size: 128, offset: 9536)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !157, file: !158, line: 260, baseType: !141, size: 128, offset: 9664)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !157, file: !158, line: 261, baseType: !141, size: 128, offset: 9792)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !157, file: !158, line: 263, baseType: !370, size: 64, offset: 9920)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !158, line: 52, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !157, file: !158, line: 264, baseType: !373, size: 64, offset: 9984)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !158, line: 53, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !157, file: !158, line: 265, baseType: !376, size: 64, offset: 10048)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !194, line: 46, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !157, file: !158, line: 267, baseType: !76, size: 8, offset: 10112)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !157, file: !158, line: 268, baseType: !76, size: 8, offset: 10120)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !157, file: !158, line: 269, baseType: !118, size: 16, offset: 10128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !157, file: !158, line: 270, baseType: !185, size: 32, offset: 10144)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !157, file: !158, line: 272, baseType: !383, size: 64, offset: 10176)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !4, line: 732, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !157, file: !158, line: 275, baseType: !386, size: 64, offset: 10240)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !158, line: 275, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !157, file: !158, line: 277, baseType: !389, size: 64, offset: 10304)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 592, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !157, file: !158, line: 277, baseType: !389, size: 64, offset: 10368)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !157, file: !158, line: 278, baseType: !393, size: 64, offset: 10432)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !394, line: 27, baseType: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !396, line: 45, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!397 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !157, file: !158, line: 279, baseType: !393, size: 64, offset: 10496)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !157, file: !158, line: 280, baseType: !5, size: 32, offset: 10560)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !157, file: !158, line: 281, baseType: !5, size: 32, offset: 10592)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !157, file: !158, line: 283, baseType: !141, size: 128, offset: 10624)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !157, file: !158, line: 284, baseType: !141, size: 128, offset: 10752)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !157, file: !158, line: 285, baseType: !404, size: 64, offset: 10880)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !157, file: !158, line: 287, baseType: !406, size: 64, offset: 10944)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !158, line: 59, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !157, file: !158, line: 288, baseType: !409, size: 64, offset: 11008)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !158, line: 288, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !157, file: !158, line: 290, baseType: !412, size: 64, offset: 11072)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 2)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !157, file: !158, line: 291, baseType: !416, size: 64, offset: 11136)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !418, line: 65, baseType: !419)
!418 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !418, line: 50, size: 320, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !419, file: !418, line: 51, baseType: !80, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !419, file: !418, line: 53, baseType: !70, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !419, file: !418, line: 54, baseType: !70, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !419, file: !418, line: 55, baseType: !70, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !419, file: !418, line: 55, baseType: !70, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !419, file: !418, line: 56, baseType: !76, size: 8, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !419, file: !418, line: 56, baseType: !76, size: 8, offset: 200)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !419, file: !418, line: 57, baseType: !76, size: 8, offset: 208)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !419, file: !418, line: 57, baseType: !76, size: 8, offset: 216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !419, file: !418, line: 59, baseType: !118, size: 16, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !419, file: !418, line: 59, baseType: !118, size: 16, offset: 240)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !419, file: !418, line: 59, baseType: !118, size: 16, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !418, line: 61, baseType: !118, size: 16, offset: 272)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !419, file: !418, line: 63, baseType: !70, size: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !157, file: !158, line: 293, baseType: !141, size: 128, offset: 11200)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !157, file: !158, line: 294, baseType: !437, size: 64, offset: 11328)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !158, line: 113, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !158, line: 108, size: 256, elements: !440)
!440 = !{!441, !443, !444, !445, !446}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !158, line: 109, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !439, file: !158, line: 109, baseType: !442, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !439, file: !158, line: 110, baseType: !156, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !439, file: !158, line: 111, baseType: !70, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !439, file: !158, line: 112, baseType: !185, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !81, file: !82, line: 1221, baseType: !448, size: 64, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !450, line: 52, size: 4224, elements: !451)
!450 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !521, !522, !523, !955, !956, !957, !958, !959}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !449, file: !450, line: 53, baseType: !85, size: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !449, file: !450, line: 54, baseType: !152, size: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !449, file: !450, line: 56, baseType: !118, size: 16, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !449, file: !450, line: 56, baseType: !118, size: 16, offset: 1040)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !449, file: !450, line: 57, baseType: !118, size: 16, offset: 1056)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !449, file: !450, line: 57, baseType: !118, size: 16, offset: 1072)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !449, file: !450, line: 59, baseType: !185, size: 32, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !449, file: !450, line: 59, baseType: !185, size: 32, offset: 1120)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !449, file: !450, line: 59, baseType: !185, size: 32, offset: 1152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !449, file: !450, line: 60, baseType: !185, size: 32, offset: 1184)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !449, file: !450, line: 60, baseType: !185, size: 32, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !449, file: !450, line: 60, baseType: !185, size: 32, offset: 1248)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !449, file: !450, line: 61, baseType: !185, size: 32, offset: 1280)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !449, file: !450, line: 61, baseType: !185, size: 32, offset: 1312)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !449, file: !450, line: 61, baseType: !185, size: 32, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !449, file: !450, line: 68, baseType: !185, size: 32, offset: 1376)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !449, file: !450, line: 68, baseType: !185, size: 32, offset: 1408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !449, file: !450, line: 68, baseType: !185, size: 32, offset: 1440)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !449, file: !450, line: 69, baseType: !185, size: 32, offset: 1472)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !449, file: !450, line: 69, baseType: !185, size: 32, offset: 1504)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !449, file: !450, line: 74, baseType: !185, size: 32, offset: 1536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !449, file: !450, line: 79, baseType: !185, size: 32, offset: 1568)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !449, file: !450, line: 81, baseType: !118, size: 16, offset: 1600)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !449, file: !450, line: 91, baseType: !118, size: 16, offset: 1616)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !449, file: !450, line: 92, baseType: !118, size: 16, offset: 1632)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !449, file: !450, line: 93, baseType: !118, size: 16, offset: 1648)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !449, file: !450, line: 94, baseType: !118, size: 16, offset: 1664)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !449, file: !450, line: 94, baseType: !118, size: 16, offset: 1680)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !449, file: !450, line: 94, baseType: !118, size: 16, offset: 1696)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !449, file: !450, line: 94, baseType: !118, size: 16, offset: 1712)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !449, file: !450, line: 96, baseType: !185, size: 32, offset: 1728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !449, file: !450, line: 96, baseType: !185, size: 32, offset: 1760)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !449, file: !450, line: 96, baseType: !185, size: 32, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !449, file: !450, line: 96, baseType: !185, size: 32, offset: 1824)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !449, file: !450, line: 98, baseType: !185, size: 32, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !449, file: !450, line: 98, baseType: !185, size: 32, offset: 1888)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !449, file: !450, line: 98, baseType: !185, size: 32, offset: 1920)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !449, file: !450, line: 98, baseType: !185, size: 32, offset: 1952)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !449, file: !450, line: 99, baseType: !185, size: 32, offset: 1984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !449, file: !450, line: 99, baseType: !185, size: 32, offset: 2016)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !449, file: !450, line: 100, baseType: !185, size: 32, offset: 2048)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !449, file: !450, line: 100, baseType: !185, size: 32, offset: 2080)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !449, file: !450, line: 103, baseType: !118, size: 16, offset: 2112)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !449, file: !450, line: 103, baseType: !118, size: 16, offset: 2128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !449, file: !450, line: 103, baseType: !118, size: 16, offset: 2144)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !449, file: !450, line: 103, baseType: !118, size: 16, offset: 2160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !449, file: !450, line: 106, baseType: !185, size: 32, offset: 2176)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !449, file: !450, line: 106, baseType: !185, size: 32, offset: 2208)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !449, file: !450, line: 106, baseType: !185, size: 32, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !449, file: !450, line: 106, baseType: !185, size: 32, offset: 2272)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !449, file: !450, line: 107, baseType: !118, size: 16, offset: 2304)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !449, file: !450, line: 107, baseType: !118, size: 16, offset: 2320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !449, file: !450, line: 107, baseType: !118, size: 16, offset: 2336)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !449, file: !450, line: 107, baseType: !118, size: 16, offset: 2352)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !449, file: !450, line: 108, baseType: !185, size: 32, offset: 2368)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !449, file: !450, line: 108, baseType: !185, size: 32, offset: 2400)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !449, file: !450, line: 109, baseType: !185, size: 32, offset: 2432)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !449, file: !450, line: 109, baseType: !185, size: 32, offset: 2464)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !449, file: !450, line: 110, baseType: !185, size: 32, offset: 2496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !449, file: !450, line: 110, baseType: !185, size: 32, offset: 2528)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !449, file: !450, line: 110, baseType: !185, size: 32, offset: 2560)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !449, file: !450, line: 111, baseType: !118, size: 16, offset: 2592)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !449, file: !450, line: 111, baseType: !118, size: 16, offset: 2608)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !449, file: !450, line: 112, baseType: !118, size: 16, offset: 2624)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !449, file: !450, line: 112, baseType: !118, size: 16, offset: 2640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !449, file: !450, line: 112, baseType: !118, size: 16, offset: 2656)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !449, file: !450, line: 115, baseType: !118, size: 16, offset: 2672)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !449, file: !450, line: 118, baseType: !520, size: 64, offset: 2688)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !449, file: !450, line: 118, baseType: !520, size: 64, offset: 2752)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !449, file: !450, line: 121, baseType: !177, size: 64, offset: 2816)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !449, file: !450, line: 122, baseType: !524, size: 1152, offset: 2880)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 1152, elements: !953)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !154, line: 57, size: 2496, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !526, file: !154, line: 59, baseType: !118, size: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !526, file: !154, line: 59, baseType: !118, size: 16, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !526, file: !154, line: 59, baseType: !118, size: 16, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !526, file: !154, line: 59, baseType: !118, size: 16, offset: 48)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !526, file: !154, line: 60, baseType: !156, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !526, file: !154, line: 61, baseType: !534, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !154, line: 202, size: 3328, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !592, !593, !733, !759, !787, !788, !863, !884, !892, !893}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !535, file: !154, line: 203, baseType: !85, size: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !535, file: !154, line: 204, baseType: !152, size: 64, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !535, file: !154, line: 206, baseType: !185, size: 32, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !535, file: !154, line: 206, baseType: !185, size: 32, offset: 1056)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !535, file: !154, line: 207, baseType: !185, size: 32, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !535, file: !154, line: 207, baseType: !185, size: 32, offset: 1120)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !535, file: !154, line: 207, baseType: !185, size: 32, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !535, file: !154, line: 207, baseType: !185, size: 32, offset: 1184)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !535, file: !154, line: 207, baseType: !185, size: 32, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !535, file: !154, line: 207, baseType: !185, size: 32, offset: 1248)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !535, file: !154, line: 208, baseType: !185, size: 32, offset: 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !535, file: !154, line: 208, baseType: !185, size: 32, offset: 1312)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !535, file: !154, line: 211, baseType: !185, size: 32, offset: 1344)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !535, file: !154, line: 211, baseType: !185, size: 32, offset: 1376)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !535, file: !154, line: 211, baseType: !185, size: 32, offset: 1408)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !535, file: !154, line: 211, baseType: !185, size: 32, offset: 1440)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !535, file: !154, line: 211, baseType: !185, size: 32, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !535, file: !154, line: 214, baseType: !185, size: 32, offset: 1504)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !535, file: !154, line: 214, baseType: !185, size: 32, offset: 1536)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !535, file: !154, line: 217, baseType: !185, size: 32, offset: 1568)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !535, file: !154, line: 218, baseType: !185, size: 32, offset: 1600)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !535, file: !154, line: 219, baseType: !185, size: 32, offset: 1632)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !535, file: !154, line: 220, baseType: !185, size: 32, offset: 1664)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !535, file: !154, line: 221, baseType: !185, size: 32, offset: 1696)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !535, file: !154, line: 222, baseType: !118, size: 16, offset: 1728)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !535, file: !154, line: 222, baseType: !118, size: 16, offset: 1744)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !535, file: !154, line: 224, baseType: !118, size: 16, offset: 1760)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !535, file: !154, line: 224, baseType: !118, size: 16, offset: 1776)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !535, file: !154, line: 227, baseType: !118, size: 16, offset: 1792)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !535, file: !154, line: 227, baseType: !118, size: 16, offset: 1808)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !535, file: !154, line: 229, baseType: !118, size: 16, offset: 1824)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !535, file: !154, line: 229, baseType: !118, size: 16, offset: 1840)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !535, file: !154, line: 230, baseType: !118, size: 16, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !535, file: !154, line: 230, baseType: !118, size: 16, offset: 1872)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !535, file: !154, line: 232, baseType: !185, size: 32, offset: 1888)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !535, file: !154, line: 232, baseType: !185, size: 32, offset: 1920)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !535, file: !154, line: 232, baseType: !185, size: 32, offset: 1952)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !535, file: !154, line: 232, baseType: !185, size: 32, offset: 1984)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !535, file: !154, line: 233, baseType: !70, size: 32, offset: 2016)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !535, file: !154, line: 234, baseType: !70, size: 32, offset: 2048)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !535, file: !154, line: 235, baseType: !118, size: 16, offset: 2080)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !535, file: !154, line: 235, baseType: !118, size: 16, offset: 2096)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !535, file: !154, line: 236, baseType: !118, size: 16, offset: 2112)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !535, file: !154, line: 239, baseType: !118, size: 16, offset: 2128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !535, file: !154, line: 240, baseType: !70, size: 32, offset: 2144)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !535, file: !154, line: 241, baseType: !70, size: 32, offset: 2176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !535, file: !154, line: 241, baseType: !70, size: 32, offset: 2208)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !535, file: !154, line: 241, baseType: !70, size: 32, offset: 2240)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !535, file: !154, line: 243, baseType: !185, size: 32, offset: 2272)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !535, file: !154, line: 243, baseType: !185, size: 32, offset: 2304)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !535, file: !154, line: 244, baseType: !185, size: 32, offset: 2336)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !535, file: !154, line: 246, baseType: !419, size: 320, offset: 2368)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !535, file: !154, line: 248, baseType: !590, size: 64, offset: 2688)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !154, line: 248, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !535, file: !154, line: 249, baseType: !177, size: 64, offset: 2752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !535, file: !154, line: 250, baseType: !594, size: 64, offset: 2816)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !418, line: 77, size: 15424, elements: !596)
!596 = !{!597, !598, !599, !602, !605, !608, !670, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !689, !690, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !722, !723, !727}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !595, file: !418, line: 78, baseType: !85, size: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !595, file: !418, line: 80, baseType: !105, size: 8192, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !595, file: !418, line: 82, baseType: !600, size: 64, offset: 9152)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !418, line: 43, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !595, file: !418, line: 83, baseType: !603, size: 64, offset: 9216)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !86, line: 46, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !595, file: !418, line: 86, baseType: !606, size: 64, offset: 9280)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !418, line: 41, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !595, file: !418, line: 87, baseType: !609, size: 64, offset: 9344)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !611, line: 110, size: 1152, elements: !612)
!611 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !{!613, !614, !615, !616, !617, !618, !619, !621, !622, !623, !632, !633, !634, !635, !637, !666, !667, !668, !669}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !611, line: 111, baseType: !609, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !611, line: 111, baseType: !609, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !610, file: !611, line: 114, baseType: !70, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !610, file: !611, line: 114, baseType: !70, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !610, file: !611, line: 115, baseType: !118, size: 16, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !610, file: !611, line: 115, baseType: !118, size: 16, offset: 208)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !610, file: !611, line: 118, baseType: !620, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !610, file: !611, line: 120, baseType: !520, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !610, file: !611, line: 122, baseType: !520, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !610, file: !611, line: 125, baseType: !624, size: 128, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !625, line: 89, baseType: !626)
!625 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !625, line: 86, size: 128, elements: !627)
!627 = !{!628, !629, !630, !631}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !626, file: !625, line: 87, baseType: !70, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !626, file: !625, line: 87, baseType: !70, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !626, file: !625, line: 88, baseType: !70, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !626, file: !625, line: 88, baseType: !70, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !610, file: !611, line: 127, baseType: !70, size: 32, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !610, file: !611, line: 127, baseType: !70, size: 32, offset: 608)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !610, file: !611, line: 130, baseType: !141, size: 128, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !610, file: !611, line: 133, baseType: !636, size: 128, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !624)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !610, file: !611, line: 134, baseType: !638, size: 64, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !611, line: 108, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !611, line: 85, size: 1600, elements: !642)
!642 = !{!643, !645, !646, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !641, file: !611, line: 86, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !641, file: !611, line: 86, baseType: !644, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !641, file: !611, line: 89, baseType: !647, size: 592, offset: 128)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 592, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 74)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !641, file: !611, line: 90, baseType: !5, size: 32, offset: 736)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !641, file: !611, line: 90, baseType: !5, size: 32, offset: 768)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !641, file: !611, line: 90, baseType: !5, size: 32, offset: 800)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !641, file: !611, line: 91, baseType: !70, size: 32, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !641, file: !611, line: 91, baseType: !70, size: 32, offset: 864)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !641, file: !611, line: 91, baseType: !70, size: 32, offset: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !641, file: !611, line: 93, baseType: !278, size: 64, offset: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !641, file: !611, line: 94, baseType: !376, size: 64, offset: 1024)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !641, file: !611, line: 96, baseType: !520, size: 64, offset: 1088)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !641, file: !611, line: 97, baseType: !520, size: 64, offset: 1152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !641, file: !611, line: 98, baseType: !520, size: 64, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !641, file: !611, line: 99, baseType: !620, size: 64, offset: 1280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !641, file: !611, line: 101, baseType: !70, size: 32, offset: 1344)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !641, file: !611, line: 101, baseType: !70, size: 32, offset: 1376)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !641, file: !611, line: 104, baseType: !90, size: 64, offset: 1408)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !641, file: !611, line: 106, baseType: !141, size: 128, offset: 1472)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !610, file: !611, line: 137, baseType: !70, size: 32, offset: 960)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !610, file: !611, line: 140, baseType: !70, size: 32, offset: 992)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !610, file: !611, line: 143, baseType: !70, size: 32, offset: 1024)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !610, file: !611, line: 146, baseType: !281, size: 64, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !595, file: !418, line: 89, baseType: !671, size: 512, offset: 9408)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 512, elements: !672)
!672 = !{!187}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !595, file: !418, line: 90, baseType: !118, size: 16, offset: 9920)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !595, file: !418, line: 90, baseType: !118, size: 16, offset: 9936)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !595, file: !418, line: 92, baseType: !118, size: 16, offset: 9952)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !418, line: 92, baseType: !118, size: 16, offset: 9968)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !595, file: !418, line: 93, baseType: !118, size: 16, offset: 9984)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !595, file: !418, line: 93, baseType: !118, size: 16, offset: 10000)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !595, file: !418, line: 94, baseType: !70, size: 32, offset: 10016)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !595, file: !418, line: 97, baseType: !118, size: 16, offset: 10048)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !595, file: !418, line: 97, baseType: !118, size: 16, offset: 10064)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !595, file: !418, line: 98, baseType: !118, size: 16, offset: 10080)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !595, file: !418, line: 98, baseType: !118, size: 16, offset: 10096)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !595, file: !418, line: 99, baseType: !118, size: 16, offset: 10112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !595, file: !418, line: 99, baseType: !118, size: 16, offset: 10128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !595, file: !418, line: 100, baseType: !5, size: 32, offset: 10144)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !595, file: !418, line: 101, baseType: !688, size: 64, offset: 10176)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !595, file: !418, line: 103, baseType: !111, size: 64, offset: 10240)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !595, file: !418, line: 104, baseType: !691, size: 64, offset: 10304)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !86, line: 159, size: 448, elements: !693)
!693 = !{!694, !696, !697, !699, !700, !702}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !692, file: !86, line: 161, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !413)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !692, file: !86, line: 162, baseType: !695, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !692, file: !86, line: 163, baseType: !698, size: 32, offset: 128)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, elements: !413)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !692, file: !86, line: 164, baseType: !698, size: 32, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !692, file: !86, line: 165, baseType: !701, size: 128, offset: 192)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 128, elements: !413)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !692, file: !86, line: 166, baseType: !703, size: 128, offset: 320)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 128, elements: !413)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !595, file: !418, line: 107, baseType: !185, size: 32, offset: 10368)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !595, file: !418, line: 108, baseType: !70, size: 32, offset: 10400)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !595, file: !418, line: 109, baseType: !118, size: 16, offset: 10432)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !595, file: !418, line: 110, baseType: !118, size: 16, offset: 10448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !595, file: !418, line: 113, baseType: !70, size: 32, offset: 10464)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !595, file: !418, line: 113, baseType: !70, size: 32, offset: 10496)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !595, file: !418, line: 114, baseType: !76, size: 8, offset: 10528)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !595, file: !418, line: 114, baseType: !76, size: 8, offset: 10536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !595, file: !418, line: 115, baseType: !118, size: 16, offset: 10544)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !595, file: !418, line: 116, baseType: !293, size: 128, offset: 10560)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !595, file: !418, line: 119, baseType: !185, size: 32, offset: 10688)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !595, file: !418, line: 119, baseType: !185, size: 32, offset: 10720)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !595, file: !418, line: 122, baseType: !717, size: 512, offset: 10752)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !718, line: 182, baseType: !719)
!718 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !718, line: 180, size: 512, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !718, line: 181, baseType: !75, size: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !595, file: !418, line: 123, baseType: !76, size: 8, offset: 11264)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !595, file: !418, line: 125, baseType: !724, size: 56, offset: 11272)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 56, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 7)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !595, file: !418, line: 126, baseType: !728, size: 4096, offset: 11328)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 4096, elements: !672)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !418, line: 69, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !418, line: 67, size: 512, elements: !731)
!731 = !{!732}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !418, line: 68, baseType: !75, size: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !535, file: !154, line: 251, baseType: !734, size: 64, offset: 2880)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !154, line: 113, size: 6208, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !746}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !735, file: !154, line: 114, baseType: !118, size: 16)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !735, file: !154, line: 114, baseType: !118, size: 16, offset: 16)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !735, file: !154, line: 115, baseType: !76, size: 8, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !735, file: !154, line: 115, baseType: !76, size: 8, offset: 40)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !735, file: !154, line: 116, baseType: !76, size: 8, offset: 48)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !735, file: !154, line: 117, baseType: !743, size: 8, offset: 56)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 1)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !735, file: !154, line: 119, baseType: !747, size: 6144, offset: 64)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 6144, elements: !757)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !154, line: 109, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !154, line: 106, size: 192, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !749, file: !154, line: 107, baseType: !185, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !749, file: !154, line: 107, baseType: !185, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !749, file: !154, line: 107, baseType: !185, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !749, file: !154, line: 107, baseType: !185, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !749, file: !154, line: 107, baseType: !185, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !749, file: !154, line: 108, baseType: !70, size: 32, offset: 160)
!757 = !{!758}
!758 = !DISubrange(count: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !535, file: !154, line: 252, baseType: !760, size: 64, offset: 2944)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !154, line: 122, size: 1600, elements: !762)
!762 = !{!763, !764, !765, !771, !772, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !761, file: !154, line: 123, baseType: !156, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !761, file: !154, line: 124, baseType: !594, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !761, file: !154, line: 125, baseType: !766, size: 384, offset: 128)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 384, elements: !769)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !718, line: 136, flags: DIFlagFwdDecl)
!769 = !{!770}
!770 = !DISubrange(count: 6)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !761, file: !154, line: 126, baseType: !302, size: 512, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !761, file: !154, line: 127, baseType: !773, size: 288, offset: 1024)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 288, elements: !774)
!774 = !{!188, !188}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !154, line: 128, baseType: !118, size: 16, offset: 1312)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !761, file: !154, line: 128, baseType: !118, size: 16, offset: 1328)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !761, file: !154, line: 129, baseType: !185, size: 32, offset: 1344)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !761, file: !154, line: 129, baseType: !185, size: 32, offset: 1376)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !761, file: !154, line: 130, baseType: !185, size: 32, offset: 1408)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !761, file: !154, line: 131, baseType: !5, size: 32, offset: 1440)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !761, file: !154, line: 132, baseType: !118, size: 16, offset: 1472)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !761, file: !154, line: 132, baseType: !118, size: 16, offset: 1488)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !761, file: !154, line: 133, baseType: !70, size: 32, offset: 1504)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !761, file: !154, line: 133, baseType: !70, size: 32, offset: 1536)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !761, file: !154, line: 134, baseType: !118, size: 16, offset: 1568)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !761, file: !154, line: 134, baseType: !118, size: 16, offset: 1584)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !535, file: !154, line: 253, baseType: !691, size: 64, offset: 3008)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !535, file: !154, line: 254, baseType: !789, size: 64, offset: 3072)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !154, line: 137, size: 832, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !812, !813, !814, !815, !816, !817}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !790, file: !154, line: 138, baseType: !118, size: 16)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !790, file: !154, line: 140, baseType: !118, size: 16, offset: 16)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !790, file: !154, line: 141, baseType: !185, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !790, file: !154, line: 142, baseType: !185, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !790, file: !154, line: 143, baseType: !118, size: 16, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !790, file: !154, line: 144, baseType: !118, size: 16, offset: 112)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !790, file: !154, line: 145, baseType: !70, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !790, file: !154, line: 147, baseType: !70, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !790, file: !154, line: 149, baseType: !156, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !790, file: !154, line: 150, baseType: !70, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !790, file: !154, line: 151, baseType: !118, size: 16, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !790, file: !154, line: 152, baseType: !118, size: 16, offset: 304)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !790, file: !154, line: 154, baseType: !90, size: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !790, file: !154, line: 155, baseType: !520, size: 64, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !790, file: !154, line: 157, baseType: !185, size: 32, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !790, file: !154, line: 158, baseType: !118, size: 16, offset: 480)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !790, file: !154, line: 159, baseType: !118, size: 16, offset: 496)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !790, file: !154, line: 160, baseType: !118, size: 16, offset: 512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !790, file: !154, line: 161, baseType: !811, size: 48, offset: 528)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 48, elements: !221)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !790, file: !154, line: 162, baseType: !185, size: 32, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !790, file: !154, line: 164, baseType: !185, size: 32, offset: 608)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !790, file: !154, line: 164, baseType: !185, size: 32, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !790, file: !154, line: 164, baseType: !185, size: 32, offset: 672)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !790, file: !154, line: 165, baseType: !734, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !790, file: !154, line: 167, baseType: !818, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !718, line: 72, size: 3072, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !833, !834, !859, !860, !861, !862}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !718, line: 73, baseType: !70, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !819, file: !718, line: 73, baseType: !70, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !819, file: !718, line: 74, baseType: !70, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !819, file: !718, line: 75, baseType: !70, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !819, file: !718, line: 77, baseType: !826, size: 128, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !625, line: 95, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !625, line: 92, size: 128, elements: !828)
!828 = !{!829, !830, !831, !832}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !827, file: !625, line: 93, baseType: !185, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !827, file: !625, line: 93, baseType: !185, size: 32, offset: 32)
