; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_render_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_render_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_render_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47, !56}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !57, line: 67, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!65 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!66 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!67 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!68 = !{!69, !114, !135, !1142, !48, !1232, !1259, !98, !1162, !204, !102, !1261, !1262, !97, !1263, !1237, !75, !106, !282}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !71, line: 108, baseType: !72)
!71 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !71, line: 85, size: 1600, elements: !73)
!73 = !{!74, !76, !77, !82, !83, !84, !85, !86, !87, !88, !92, !96, !99, !100, !101, !103, !104, !105, !107}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !71, line: 86, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !72, file: !71, line: 86, baseType: !75, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !71, line: 89, baseType: !78, size: 592, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 592, elements: !80)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81}
!81 = !DISubrange(count: 74)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !72, file: !71, line: 90, baseType: !7, size: 32, offset: 736)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !72, file: !71, line: 90, baseType: !7, size: 32, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !72, file: !71, line: 90, baseType: !7, size: 32, offset: 800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !72, file: !71, line: 91, baseType: !48, size: 32, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !72, file: !71, line: 91, baseType: !48, size: 32, offset: 864)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !72, file: !71, line: 91, baseType: !48, size: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !72, file: !71, line: 93, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !91, line: 179, flags: DIFlagFwdDecl)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !72, file: !71, line: 94, baseType: !93, size: 64, offset: 1024)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !95, line: 43, flags: DIFlagFwdDecl)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !72, file: !71, line: 96, baseType: !97, size: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !72, file: !71, line: 97, baseType: !97, size: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !72, file: !71, line: 98, baseType: !97, size: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !72, file: !71, line: 99, baseType: !102, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !72, file: !71, line: 101, baseType: !48, size: 32, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !72, file: !71, line: 101, baseType: !48, size: 32, offset: 1376)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !72, file: !71, line: 104, baseType: !106, size: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !72, file: !71, line: 106, baseType: !108, size: 128, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !109, line: 71, baseType: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !109, line: 69, size: 128, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !110, file: !109, line: 70, baseType: !106, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !110, file: !109, line: 70, baseType: !106, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderPass", file: !71, line: 76, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderPass", file: !71, line: 68, size: 960, elements: !117)
!117 = !{!118, !120, !121, !122, !123, !127, !131, !132, !133, !134}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !71, line: 69, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !116, file: !71, line: 69, baseType: !119, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "passtype", scope: !116, file: !71, line: 70, baseType: !48, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !116, file: !71, line: 70, baseType: !48, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !71, line: 71, baseType: !124, size: 512, offset: 192)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 512, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "chan_id", scope: !116, file: !71, line: 72, baseType: !128, size: 64, offset: 704)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 64, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !116, file: !71, line: 73, baseType: !97, size: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !116, file: !71, line: 74, baseType: !48, size: 32, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !116, file: !71, line: 74, baseType: !48, size: 32, offset: 864)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "debug_type", scope: !116, file: !71, line: 75, baseType: !48, size: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !138, line: 157, size: 1344, elements: !139)
!138 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!139 = !{!140, !142, !143, !144, !147, !148, !149, !150, !151, !152, !154, !156, !404, !405, !409, !410, !1126, !1127, !1132, !1137, !1138, !1140, !1141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !138, line: 158, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !138, line: 158, baseType: !141, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !137, file: !138, line: 161, baseType: !48, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !137, file: !138, line: 164, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !137, file: !138, line: 166, baseType: !48, size: 32, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !138, line: 169, baseType: !145, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !137, file: !138, line: 171, baseType: !145, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !137, file: !138, line: 173, baseType: !48, size: 32, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !137, file: !138, line: 175, baseType: !145, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !138, line: 178, baseType: !153, size: 32, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !137, file: !138, line: 180, baseType: !155, size: 32, offset: 608)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !137, file: !138, line: 182, baseType: !157, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !138, line: 73, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!48, !161, !102}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !163)
!163 = !{!164, !168, !403}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !6, line: 58, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !6, line: 56, size: 64, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !6, line: 57, baseType: !106, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !6, line: 60, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !138, line: 339, size: 1600, elements: !171)
!171 = !{!172, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !199, !205, !385, !390, !396, !402}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !170, file: !138, line: 341, baseType: !173, size: 320)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !138, line: 135, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !138, line: 130, size: 320, elements: !175)
!175 = !{!176, !177, !178, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !138, line: 131, baseType: !106, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !174, file: !138, line: 131, baseType: !106, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !174, file: !138, line: 133, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !138, line: 46, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !174, file: !138, line: 134, baseType: !108, size: 128, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !170, file: !138, line: 344, baseType: !145, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !170, file: !138, line: 348, baseType: !106, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !170, file: !138, line: 349, baseType: !106, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !170, file: !138, line: 352, baseType: !48, size: 32, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !138, line: 355, baseType: !145, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !170, file: !138, line: 357, baseType: !145, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !170, file: !138, line: 359, baseType: !145, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !170, file: !138, line: 361, baseType: !48, size: 32, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !170, file: !138, line: 364, baseType: !135, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !170, file: !138, line: 367, baseType: !135, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !170, file: !138, line: 370, baseType: !169, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !170, file: !138, line: 376, baseType: !169, size: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !170, file: !138, line: 379, baseType: !195, size: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !138, line: 70, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!169, !161}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !170, file: !138, line: 382, baseType: !200, size: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !138, line: 71, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !161}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !170, file: !138, line: 385, baseType: !206, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!169, !210, !336, !106, !145, !347, !351, !381}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !212, line: 53, size: 15232, elements: !213)
!212 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!213 = !{!214, !215, !216, !220, !222, !223, !224, !225, !231, !235, !236, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !330, !333}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !212, line: 54, baseType: !210, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !211, file: !212, line: 54, baseType: !210, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !212, line: 55, baseType: !217, size: 8192, offset: 128)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8192, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !211, file: !212, line: 56, baseType: !221, size: 16, offset: 8320)
!221 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !211, file: !212, line: 56, baseType: !221, size: 16, offset: 8336)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !211, file: !212, line: 57, baseType: !221, size: 16, offset: 8352)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !211, file: !212, line: 57, baseType: !221, size: 16, offset: 8368)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !211, file: !212, line: 58, baseType: !226, size: 64, offset: 8384)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !227, line: 27, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !229, line: 45, baseType: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!230 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !211, file: !212, line: 59, baseType: !232, size: 128, offset: 8448)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !211, file: !212, line: 60, baseType: !221, size: 16, offset: 8576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !211, file: !212, line: 62, baseType: !237, size: 64, offset: 8640)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !239, line: 136, size: 17600, elements: !240)
!239 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !{!241, !281, !283, !286, !287, !288, !289}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !238, file: !239, line: 137, baseType: !242, size: 960)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !239, line: 130, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !239, line: 117, size: 960, elements: !244)
!244 = !{!245, !246, !247, !249, !250, !254, !255, !256, !257, !258}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !239, line: 118, baseType: !106, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !239, line: 118, baseType: !106, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !243, file: !239, line: 119, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !243, file: !239, line: 120, baseType: !237, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !239, line: 121, baseType: !251, size: 528, offset: 256)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 528, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 66)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !239, line: 126, baseType: !221, size: 16, offset: 784)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !243, file: !239, line: 127, baseType: !48, size: 32, offset: 800)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !243, file: !239, line: 128, baseType: !48, size: 32, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !243, file: !239, line: 128, baseType: !48, size: 32, offset: 864)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !243, file: !239, line: 129, baseType: !259, size: 64, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !239, line: 75, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !239, line: 62, size: 1024, elements: !262)
!262 = !{!263, !265, !266, !267, !268, !269, !270, !271, !279, !280}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !239, line: 63, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !261, file: !239, line: 63, baseType: !264, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !239, line: 64, baseType: !79, size: 8, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !261, file: !239, line: 64, baseType: !79, size: 8, offset: 136)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !239, line: 65, baseType: !221, size: 16, offset: 144)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !239, line: 66, baseType: !124, size: 512, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !261, file: !239, line: 67, baseType: !48, size: 32, offset: 672)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !239, line: 69, baseType: !272, size: 256, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !239, line: 60, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !239, line: 48, size: 256, elements: !274)
!274 = !{!275, !276, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !273, file: !239, line: 49, baseType: !106, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !273, file: !239, line: 58, baseType: !108, size: 128, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !273, file: !239, line: 59, baseType: !48, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !273, file: !239, line: 59, baseType: !48, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !261, file: !239, line: 70, baseType: !48, size: 32, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !261, file: !239, line: 74, baseType: !48, size: 32, offset: 992)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !238, file: !239, line: 138, baseType: !282, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !238, file: !239, line: 139, baseType: !284, size: 64, offset: 1024)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !239, line: 43, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !239, line: 140, baseType: !217, size: 8192, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !238, file: !239, line: 141, baseType: !217, size: 8192, offset: 9280)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !238, file: !239, line: 148, baseType: !237, size: 64, offset: 17472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !238, file: !239, line: 150, baseType: !290, size: 64, offset: 17536)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !239, line: 45, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !211, file: !212, line: 63, baseType: !108, size: 128, offset: 8704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !211, file: !212, line: 64, baseType: !108, size: 128, offset: 8832)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !211, file: !212, line: 65, baseType: !108, size: 128, offset: 8960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !211, file: !212, line: 66, baseType: !108, size: 128, offset: 9088)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !211, file: !212, line: 67, baseType: !108, size: 128, offset: 9216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !211, file: !212, line: 68, baseType: !108, size: 128, offset: 9344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !211, file: !212, line: 69, baseType: !108, size: 128, offset: 9472)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !211, file: !212, line: 70, baseType: !108, size: 128, offset: 9600)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !211, file: !212, line: 71, baseType: !108, size: 128, offset: 9728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !211, file: !212, line: 72, baseType: !108, size: 128, offset: 9856)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !211, file: !212, line: 73, baseType: !108, size: 128, offset: 9984)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !211, file: !212, line: 74, baseType: !108, size: 128, offset: 10112)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !211, file: !212, line: 75, baseType: !108, size: 128, offset: 10240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !211, file: !212, line: 76, baseType: !108, size: 128, offset: 10368)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !211, file: !212, line: 77, baseType: !108, size: 128, offset: 10496)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !211, file: !212, line: 78, baseType: !108, size: 128, offset: 10624)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !211, file: !212, line: 79, baseType: !108, size: 128, offset: 10752)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !211, file: !212, line: 80, baseType: !108, size: 128, offset: 10880)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !211, file: !212, line: 81, baseType: !108, size: 128, offset: 11008)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !211, file: !212, line: 82, baseType: !108, size: 128, offset: 11136)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !211, file: !212, line: 83, baseType: !108, size: 128, offset: 11264)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !211, file: !212, line: 84, baseType: !108, size: 128, offset: 11392)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !211, file: !212, line: 85, baseType: !108, size: 128, offset: 11520)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !211, file: !212, line: 86, baseType: !108, size: 128, offset: 11648)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !211, file: !212, line: 87, baseType: !108, size: 128, offset: 11776)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !211, file: !212, line: 88, baseType: !108, size: 128, offset: 11904)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !211, file: !212, line: 89, baseType: !108, size: 128, offset: 12032)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !211, file: !212, line: 90, baseType: !108, size: 128, offset: 12160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !211, file: !212, line: 91, baseType: !108, size: 128, offset: 12288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !211, file: !212, line: 92, baseType: !108, size: 128, offset: 12416)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !211, file: !212, line: 93, baseType: !108, size: 128, offset: 12544)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !211, file: !212, line: 94, baseType: !108, size: 128, offset: 12672)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !211, file: !212, line: 95, baseType: !108, size: 128, offset: 12800)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !211, file: !212, line: 96, baseType: !108, size: 128, offset: 12928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !211, file: !212, line: 98, baseType: !327, size: 2048, offset: 13056)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 2048, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !211, file: !212, line: 101, baseType: !331, size: 64, offset: 15104)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !212, line: 49, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !211, file: !212, line: 103, baseType: !334, size: 64, offset: 15168)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !212, line: 51, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !57, line: 106, size: 320, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !337, file: !57, line: 107, baseType: !108, size: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !337, file: !57, line: 108, baseType: !48, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !337, file: !57, line: 109, baseType: !48, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !337, file: !57, line: 110, baseType: !48, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !337, file: !57, line: 110, baseType: !48, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !337, file: !57, line: 111, baseType: !345, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !57, line: 56, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!48, !161, !106, !102}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!48, !355, !161, !357, !371}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !138, line: 137, size: 640, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !380}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !358, file: !138, line: 139, baseType: !173, size: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !358, file: !138, line: 142, baseType: !145, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !358, file: !138, line: 144, baseType: !48, size: 32, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !358, file: !138, line: 147, baseType: !145, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !358, file: !138, line: 150, baseType: !365, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !355, !336, !369, !371}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !162)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !374)
!374 = !{!375, !376, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !373, file: !6, line: 339, baseType: !106, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !373, file: !6, line: 342, baseType: !357, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !373, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !373, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !373, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !358, file: !138, line: 154, baseType: !135, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !106}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !170, file: !138, line: 386, baseType: !386, size: 64, offset: 1280)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !210, !169}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !170, file: !138, line: 387, baseType: !391, size: 64, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!395, !369}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !170, file: !138, line: 390, baseType: !397, size: 64, offset: 1408)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !138, line: 69, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!264, !161, !401}
!401 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !170, file: !138, line: 393, baseType: !108, size: 128, offset: 1472)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !6, line: 61, baseType: !106, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !137, file: !138, line: 184, baseType: !7, size: 32, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !137, file: !138, line: 186, baseType: !406, size: 96, offset: 736)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 3)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !137, file: !138, line: 187, baseType: !7, size: 32, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !137, file: !138, line: 190, baseType: !411, size: 64, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !138, line: 64, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !210, !415, !161}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !91, line: 1216, size: 39680, elements: !417)
!417 = !{!418, !419, !422, !425, !428, !429, !430, !442, !443, !445, !446, !447, !448, !449, !450, !451, !452, !453, !457, !460, !463, !689, !692, !993, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1015, !1016, !1017, !1018, !1019, !1027, !1094, !1101, !1104, !1111, !1114, !1115, !1116, !1117, !1118, !1123}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !91, line: 1217, baseType: !242, size: 960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !416, file: !91, line: 1218, baseType: !420, size: 64, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !91, line: 58, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !416, file: !91, line: 1220, baseType: !423, size: 64, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !91, line: 50, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !416, file: !91, line: 1221, baseType: !426, size: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !91, line: 52, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !416, file: !91, line: 1223, baseType: !415, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !91, line: 1225, baseType: !108, size: 128, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !416, file: !91, line: 1226, baseType: !431, size: 64, offset: 1344)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !91, line: 69, size: 320, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !432, file: !91, line: 70, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !432, file: !91, line: 70, baseType: !431, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !432, file: !91, line: 71, baseType: !7, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !432, file: !91, line: 71, baseType: !7, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !91, line: 72, baseType: !48, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !432, file: !91, line: 73, baseType: !221, size: 16, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !432, file: !91, line: 73, baseType: !221, size: 16, offset: 240)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !432, file: !91, line: 74, baseType: !423, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !416, file: !91, line: 1227, baseType: !423, size: 64, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !416, file: !91, line: 1229, baseType: !444, size: 96, offset: 1472)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 96, elements: !407)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !416, file: !91, line: 1230, baseType: !444, size: 96, offset: 1568)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !416, file: !91, line: 1231, baseType: !444, size: 96, offset: 1664)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !416, file: !91, line: 1231, baseType: !444, size: 96, offset: 1760)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !416, file: !91, line: 1233, baseType: !7, size: 32, offset: 1856)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !416, file: !91, line: 1234, baseType: !48, size: 32, offset: 1888)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !416, file: !91, line: 1235, baseType: !7, size: 32, offset: 1920)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !91, line: 1237, baseType: !221, size: 16, offset: 1952)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !416, file: !91, line: 1239, baseType: !79, size: 8, offset: 1968)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !91, line: 1240, baseType: !454, size: 8, offset: 1976)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 1)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !416, file: !91, line: 1242, baseType: !458, size: 64, offset: 1984)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !91, line: 57, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !416, file: !91, line: 1244, baseType: !461, size: 64, offset: 2048)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !91, line: 59, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !416, file: !91, line: 1246, baseType: !464, size: 64, offset: 2112)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !91, line: 1067, size: 5184, elements: !466)
!466 = !{!467, !499, !500, !515, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !537, !558, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !672}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !465, file: !91, line: 1068, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !91, line: 934, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !91, line: 925, size: 576, elements: !471)
!471 = !{!472, !490, !491, !492, !493, !495, !498}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !470, file: !91, line: 926, baseType: !473, size: 320)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !91, line: 830, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !91, line: 813, size: 320, elements: !475)
!475 = !{!476, !479, !482, !483, !487, !488, !489}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !474, file: !91, line: 814, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !91, line: 51, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !474, file: !91, line: 815, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !91, line: 815, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !474, file: !91, line: 818, baseType: !106, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !474, file: !91, line: 819, baseType: !484, size: 32, offset: 192)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 32, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 4)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !91, line: 822, baseType: !48, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !474, file: !91, line: 826, baseType: !48, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !474, file: !91, line: 829, baseType: !48, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !470, file: !91, line: 928, baseType: !221, size: 16, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !470, file: !91, line: 928, baseType: !221, size: 16, offset: 336)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !470, file: !91, line: 929, baseType: !48, size: 32, offset: 352)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !470, file: !91, line: 930, baseType: !494, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !470, file: !91, line: 931, baseType: !496, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !91, line: 931, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !470, file: !91, line: 933, baseType: !106, size: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !465, file: !91, line: 1069, baseType: !468, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !465, file: !91, line: 1070, baseType: !501, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !91, line: 916, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !91, line: 891, size: 704, elements: !504)
!504 = !{!505, !506, !507, !509, !510, !511, !512, !513, !514}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !503, file: !91, line: 892, baseType: !473, size: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !503, file: !91, line: 896, baseType: !48, size: 32, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !503, file: !91, line: 900, baseType: !508, size: 96, offset: 352)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !407)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !503, file: !91, line: 903, baseType: !98, size: 32, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !503, file: !91, line: 906, baseType: !48, size: 32, offset: 480)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !503, file: !91, line: 909, baseType: !98, size: 32, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !503, file: !91, line: 912, baseType: !98, size: 32, offset: 544)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !503, file: !91, line: 914, baseType: !423, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !503, file: !91, line: 915, baseType: !106, size: 64, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !465, file: !91, line: 1071, baseType: !516, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !91, line: 920, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !91, line: 918, size: 320, elements: !519)
!519 = !{!520}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !518, file: !91, line: 919, baseType: !473, size: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !465, file: !91, line: 1075, baseType: !98, size: 32, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !465, file: !91, line: 1077, baseType: !98, size: 32, offset: 288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !465, file: !91, line: 1078, baseType: !98, size: 32, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !465, file: !91, line: 1079, baseType: !221, size: 16, offset: 352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !465, file: !91, line: 1082, baseType: !221, size: 16, offset: 368)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !465, file: !91, line: 1085, baseType: !79, size: 8, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !465, file: !91, line: 1086, baseType: !79, size: 8, offset: 392)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !465, file: !91, line: 1087, baseType: !79, size: 8, offset: 400)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !465, file: !91, line: 1088, baseType: !79, size: 8, offset: 408)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !465, file: !91, line: 1090, baseType: !98, size: 32, offset: 416)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !465, file: !91, line: 1093, baseType: !221, size: 16, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !465, file: !91, line: 1096, baseType: !79, size: 8, offset: 464)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !91, line: 1098, baseType: !534, size: 40, offset: 472)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 40, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 5)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !465, file: !91, line: 1101, baseType: !538, size: 832, offset: 512)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !91, line: 836, size: 832, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !549, !550, !551, !554, !555, !556, !557}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !538, file: !91, line: 837, baseType: !473, size: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !91, line: 839, baseType: !221, size: 16, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !538, file: !91, line: 839, baseType: !221, size: 16, offset: 336)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !538, file: !91, line: 842, baseType: !221, size: 16, offset: 352)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !538, file: !91, line: 842, baseType: !221, size: 16, offset: 368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !538, file: !91, line: 843, baseType: !546, size: 32, offset: 384)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 32, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 2)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !538, file: !91, line: 845, baseType: !48, size: 32, offset: 416)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !538, file: !91, line: 847, baseType: !106, size: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !538, file: !91, line: 848, baseType: !552, size: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !91, line: 54, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !538, file: !91, line: 849, baseType: !552, size: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !538, file: !91, line: 850, baseType: !552, size: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !538, file: !91, line: 851, baseType: !444, size: 96, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !538, file: !91, line: 852, baseType: !98, size: 32, offset: 800)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !465, file: !91, line: 1104, baseType: !559, size: 1344, offset: 1344)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !91, line: 867, size: 1344, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !559, file: !91, line: 868, baseType: !221, size: 16)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !559, file: !91, line: 869, baseType: !221, size: 16, offset: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !559, file: !91, line: 870, baseType: !221, size: 16, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !559, file: !91, line: 871, baseType: !221, size: 16, offset: 48)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !559, file: !91, line: 873, baseType: !566, size: 896, offset: 64)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 896, elements: !576)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !91, line: 864, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !91, line: 859, size: 128, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !568, file: !91, line: 860, baseType: !221, size: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !568, file: !91, line: 861, baseType: !221, size: 16, offset: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !568, file: !91, line: 861, baseType: !221, size: 16, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !568, file: !91, line: 861, baseType: !221, size: 16, offset: 48)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !91, line: 862, baseType: !48, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !568, file: !91, line: 863, baseType: !98, size: 32, offset: 96)
!576 = !{!577}
!577 = !DISubrange(count: 7)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !559, file: !91, line: 874, baseType: !106, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !559, file: !91, line: 876, baseType: !98, size: 32, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !559, file: !91, line: 876, baseType: !98, size: 32, offset: 1056)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !559, file: !91, line: 878, baseType: !48, size: 32, offset: 1088)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !559, file: !91, line: 879, baseType: !48, size: 32, offset: 1120)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !559, file: !91, line: 881, baseType: !48, size: 32, offset: 1152)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !559, file: !91, line: 881, baseType: !48, size: 32, offset: 1184)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !559, file: !91, line: 883, baseType: !415, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !559, file: !91, line: 884, baseType: !423, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !465, file: !91, line: 1107, baseType: !98, size: 32, offset: 2688)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !465, file: !91, line: 1110, baseType: !98, size: 32, offset: 2720)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !465, file: !91, line: 1113, baseType: !221, size: 16, offset: 2752)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !465, file: !91, line: 1113, baseType: !221, size: 16, offset: 2768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !465, file: !91, line: 1116, baseType: !79, size: 8, offset: 2784)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !465, file: !91, line: 1117, baseType: !454, size: 8, offset: 2792)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !465, file: !91, line: 1120, baseType: !221, size: 16, offset: 2800)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !465, file: !91, line: 1121, baseType: !98, size: 32, offset: 2816)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !465, file: !91, line: 1122, baseType: !98, size: 32, offset: 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !465, file: !91, line: 1123, baseType: !98, size: 32, offset: 2880)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !465, file: !91, line: 1124, baseType: !98, size: 32, offset: 2912)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !465, file: !91, line: 1125, baseType: !98, size: 32, offset: 2944)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !465, file: !91, line: 1126, baseType: !98, size: 32, offset: 2976)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !465, file: !91, line: 1127, baseType: !98, size: 32, offset: 3008)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !465, file: !91, line: 1128, baseType: !98, size: 32, offset: 3040)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !465, file: !91, line: 1129, baseType: !98, size: 32, offset: 3072)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !465, file: !91, line: 1130, baseType: !98, size: 32, offset: 3104)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !465, file: !91, line: 1131, baseType: !221, size: 16, offset: 3136)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !465, file: !91, line: 1132, baseType: !79, size: 8, offset: 3152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !465, file: !91, line: 1133, baseType: !79, size: 8, offset: 3160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !465, file: !91, line: 1134, baseType: !608, size: 24, offset: 3168)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 24, elements: !407)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !465, file: !91, line: 1135, baseType: !79, size: 8, offset: 3192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !465, file: !91, line: 1138, baseType: !423, size: 64, offset: 3200)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !465, file: !91, line: 1139, baseType: !79, size: 8, offset: 3264)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !465, file: !91, line: 1140, baseType: !79, size: 8, offset: 3272)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !465, file: !91, line: 1141, baseType: !79, size: 8, offset: 3280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !465, file: !91, line: 1142, baseType: !79, size: 8, offset: 3288)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !465, file: !91, line: 1143, baseType: !79, size: 8, offset: 3296)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !465, file: !91, line: 1144, baseType: !128, size: 64, offset: 3304)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !465, file: !91, line: 1145, baseType: !128, size: 64, offset: 3368)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !465, file: !91, line: 1148, baseType: !79, size: 8, offset: 3432)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !465, file: !91, line: 1149, baseType: !79, size: 8, offset: 3440)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !465, file: !91, line: 1152, baseType: !79, size: 8, offset: 3448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !465, file: !91, line: 1152, baseType: !79, size: 8, offset: 3456)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !465, file: !91, line: 1153, baseType: !79, size: 8, offset: 3464)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !465, file: !91, line: 1154, baseType: !221, size: 16, offset: 3472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !465, file: !91, line: 1154, baseType: !221, size: 16, offset: 3488)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !465, file: !91, line: 1155, baseType: !221, size: 16, offset: 3504)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !465, file: !91, line: 1155, baseType: !221, size: 16, offset: 3520)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !465, file: !91, line: 1156, baseType: !79, size: 8, offset: 3536)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !465, file: !91, line: 1157, baseType: !79, size: 8, offset: 3544)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !465, file: !91, line: 1159, baseType: !79, size: 8, offset: 3552)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !465, file: !91, line: 1160, baseType: !79, size: 8, offset: 3560)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !465, file: !91, line: 1161, baseType: !79, size: 8, offset: 3568)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !465, file: !91, line: 1162, baseType: !79, size: 8, offset: 3576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !465, file: !91, line: 1165, baseType: !48, size: 32, offset: 3584)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !465, file: !91, line: 1166, baseType: !48, size: 32, offset: 3616)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !465, file: !91, line: 1167, baseType: !48, size: 32, offset: 3648)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !465, file: !91, line: 1168, baseType: !48, size: 32, offset: 3680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !465, file: !91, line: 1171, baseType: !221, size: 16, offset: 3712)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !465, file: !91, line: 1171, baseType: !221, size: 16, offset: 3728)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !465, file: !91, line: 1172, baseType: !48, size: 32, offset: 3744)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !465, file: !91, line: 1173, baseType: !98, size: 32, offset: 3776)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !465, file: !91, line: 1174, baseType: !98, size: 32, offset: 3808)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !465, file: !91, line: 1177, baseType: !643, size: 1024, offset: 3840)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !91, line: 963, size: 1024, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !654, !655, !656, !657, !658, !660, !661, !662, !663, !664, !665, !666, !667, !670, !671}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !643, file: !91, line: 965, baseType: !48, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !643, file: !91, line: 968, baseType: !98, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !643, file: !91, line: 971, baseType: !98, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !643, file: !91, line: 974, baseType: !98, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !643, file: !91, line: 977, baseType: !444, size: 96, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !643, file: !91, line: 979, baseType: !444, size: 96, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !643, file: !91, line: 982, baseType: !48, size: 32, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !643, file: !91, line: 987, baseType: !653, size: 64, offset: 352)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !547)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !643, file: !91, line: 989, baseType: !98, size: 32, offset: 416)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !643, file: !91, line: 994, baseType: !48, size: 32, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !643, file: !91, line: 995, baseType: !48, size: 32, offset: 480)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !643, file: !91, line: 997, baseType: !79, size: 8, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !643, file: !91, line: 998, baseType: !659, size: 56, offset: 520)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 56, elements: !576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !643, file: !91, line: 1000, baseType: !98, size: 32, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !643, file: !91, line: 1003, baseType: !653, size: 64, offset: 608)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !643, file: !91, line: 1006, baseType: !48, size: 32, offset: 672)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !643, file: !91, line: 1009, baseType: !98, size: 32, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !643, file: !91, line: 1012, baseType: !653, size: 64, offset: 736)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !643, file: !91, line: 1015, baseType: !653, size: 64, offset: 800)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !643, file: !91, line: 1018, baseType: !48, size: 32, offset: 864)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !643, file: !91, line: 1019, baseType: !668, size: 64, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !91, line: 63, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !643, file: !91, line: 1023, baseType: !98, size: 32, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !643, file: !91, line: 1024, baseType: !48, size: 32, offset: 992)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !465, file: !91, line: 1179, baseType: !673, size: 320, offset: 4864)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !91, line: 1043, size: 320, elements: !674)
!674 = !{!675, !676, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !673, file: !91, line: 1044, baseType: !79, size: 8)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !673, file: !91, line: 1045, baseType: !677, size: 16, offset: 8)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 16, elements: !547)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !673, file: !91, line: 1048, baseType: !79, size: 8, offset: 24)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !673, file: !91, line: 1049, baseType: !98, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !673, file: !91, line: 1049, baseType: !98, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !673, file: !91, line: 1052, baseType: !98, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !673, file: !91, line: 1052, baseType: !98, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !673, file: !91, line: 1053, baseType: !79, size: 8, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !673, file: !91, line: 1054, baseType: !608, size: 24, offset: 168)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !673, file: !91, line: 1057, baseType: !98, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !673, file: !91, line: 1057, baseType: !98, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !673, file: !91, line: 1060, baseType: !98, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !673, file: !91, line: 1060, baseType: !98, size: 32, offset: 288)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !416, file: !91, line: 1247, baseType: !690, size: 64, offset: 2176)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !91, line: 60, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !416, file: !91, line: 1251, baseType: !693, size: 31872, offset: 2240)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !91, line: 403, size: 31872, elements: !694)
!694 = !{!695, !779, !799, !808, !828, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !942, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !969, !970, !971, !975, !991, !992}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !693, file: !91, line: 404, baseType: !696, size: 1984)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !91, line: 259, size: 1984, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !715, !774}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !696, file: !91, line: 260, baseType: !79, size: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !696, file: !91, line: 263, baseType: !79, size: 8, offset: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !696, file: !91, line: 266, baseType: !79, size: 8, offset: 16)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !696, file: !91, line: 267, baseType: !79, size: 8, offset: 24)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !696, file: !91, line: 269, baseType: !79, size: 8, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !696, file: !91, line: 270, baseType: !79, size: 8, offset: 40)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !696, file: !91, line: 276, baseType: !79, size: 8, offset: 48)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !696, file: !91, line: 279, baseType: !79, size: 8, offset: 56)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !696, file: !91, line: 280, baseType: !221, size: 16, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !696, file: !91, line: 280, baseType: !221, size: 16, offset: 80)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !696, file: !91, line: 281, baseType: !98, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !696, file: !91, line: 284, baseType: !79, size: 8, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !696, file: !91, line: 285, baseType: !79, size: 8, offset: 136)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !696, file: !91, line: 287, baseType: !712, size: 48, offset: 144)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 6)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !696, file: !91, line: 290, baseType: !716, size: 1280, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !717, line: 174, baseType: !718)
!717 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !717, line: 166, size: 1280, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !773}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !718, file: !717, line: 167, baseType: !48, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !718, file: !717, line: 167, baseType: !48, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !718, file: !717, line: 168, baseType: !124, size: 512, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !718, file: !717, line: 169, baseType: !124, size: 512, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !718, file: !717, line: 170, baseType: !98, size: 32, offset: 1088)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !718, file: !717, line: 171, baseType: !98, size: 32, offset: 1120)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !718, file: !717, line: 172, baseType: !727, size: 64, offset: 1152)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !717, line: 72, size: 3072, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !743, !744, !769, !770, !771, !772}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !728, file: !717, line: 73, baseType: !48, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !728, file: !717, line: 73, baseType: !48, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !728, file: !717, line: 74, baseType: !48, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !728, file: !717, line: 75, baseType: !48, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !728, file: !717, line: 77, baseType: !735, size: 128, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !736, line: 95, baseType: !737)
!736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !736, line: 92, size: 128, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !737, file: !736, line: 93, baseType: !98, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !737, file: !736, line: 93, baseType: !98, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !737, file: !736, line: 94, baseType: !98, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !737, file: !736, line: 94, baseType: !98, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !728, file: !717, line: 77, baseType: !735, size: 128, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !728, file: !717, line: 79, baseType: !745, size: 2304, offset: 384)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 2304, elements: !485)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !717, line: 67, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !717, line: 55, size: 576, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !765, !766, !767, !768}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !747, file: !717, line: 56, baseType: !221, size: 16)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !747, file: !717, line: 56, baseType: !221, size: 16, offset: 16)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !747, file: !717, line: 58, baseType: !98, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !747, file: !717, line: 59, baseType: !98, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !747, file: !717, line: 59, baseType: !98, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !747, file: !717, line: 60, baseType: !653, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !747, file: !717, line: 60, baseType: !653, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !747, file: !717, line: 61, baseType: !757, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !717, line: 47, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !717, line: 44, size: 96, elements: !760)
!760 = !{!761, !762, !763, !764}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !759, file: !717, line: 45, baseType: !98, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !759, file: !717, line: 45, baseType: !98, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !717, line: 46, baseType: !221, size: 16, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !759, file: !717, line: 46, baseType: !221, size: 16, offset: 80)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !747, file: !717, line: 62, baseType: !757, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !747, file: !717, line: 64, baseType: !757, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !747, file: !717, line: 65, baseType: !653, size: 64, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !747, file: !717, line: 66, baseType: !653, size: 64, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !728, file: !717, line: 80, baseType: !444, size: 96, offset: 2688)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !728, file: !717, line: 80, baseType: !444, size: 96, offset: 2784)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !728, file: !717, line: 81, baseType: !444, size: 96, offset: 2880)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !728, file: !717, line: 83, baseType: !444, size: 96, offset: 2976)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !718, file: !717, line: 173, baseType: !106, size: 64, offset: 1216)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !696, file: !91, line: 291, baseType: !775, size: 512, offset: 1472)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !717, line: 178, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !717, line: 176, size: 512, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !776, file: !717, line: 177, baseType: !124, size: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !693, file: !91, line: 406, baseType: !780, size: 64, offset: 1984)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !91, line: 80, size: 1472, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !781, file: !91, line: 81, baseType: !106, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !781, file: !91, line: 82, baseType: !106, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !781, file: !91, line: 83, baseType: !7, size: 32, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !781, file: !91, line: 84, baseType: !7, size: 32, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !781, file: !91, line: 86, baseType: !7, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !781, file: !91, line: 87, baseType: !7, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !781, file: !91, line: 88, baseType: !7, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !781, file: !91, line: 89, baseType: !7, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !781, file: !91, line: 90, baseType: !7, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !781, file: !91, line: 91, baseType: !7, size: 32, offset: 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !781, file: !91, line: 92, baseType: !7, size: 32, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !781, file: !91, line: 93, baseType: !7, size: 32, offset: 416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !781, file: !91, line: 95, baseType: !796, size: 1024, offset: 448)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 1024, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !693, file: !91, line: 407, baseType: !800, size: 64, offset: 2048)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !91, line: 98, size: 1216, elements: !802)
!802 = !{!803, !804, !805, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !801, file: !91, line: 100, baseType: !106, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !801, file: !91, line: 101, baseType: !106, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !801, file: !91, line: 103, baseType: !7, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !801, file: !91, line: 104, baseType: !7, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !801, file: !91, line: 106, baseType: !796, size: 1024, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !693, file: !91, line: 408, baseType: !809, size: 512, offset: 2112)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !91, line: 109, size: 512, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !809, file: !91, line: 111, baseType: !48, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !809, file: !91, line: 112, baseType: !48, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !809, file: !91, line: 115, baseType: !48, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !809, file: !91, line: 116, baseType: !48, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !809, file: !91, line: 117, baseType: !48, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !809, file: !91, line: 118, baseType: !48, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !809, file: !91, line: 119, baseType: !48, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !809, file: !91, line: 120, baseType: !48, size: 32, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !809, file: !91, line: 121, baseType: !48, size: 32, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !809, file: !91, line: 122, baseType: !48, size: 32, offset: 288)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !809, file: !91, line: 125, baseType: !48, size: 32, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !809, file: !91, line: 126, baseType: !48, size: 32, offset: 352)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !809, file: !91, line: 127, baseType: !221, size: 16, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !809, file: !91, line: 128, baseType: !221, size: 16, offset: 400)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !809, file: !91, line: 129, baseType: !48, size: 32, offset: 416)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !809, file: !91, line: 130, baseType: !48, size: 32, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !809, file: !91, line: 131, baseType: !48, size: 32, offset: 480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !693, file: !91, line: 409, baseType: !829, size: 576, offset: 2624)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !91, line: 134, size: 576, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !829, file: !91, line: 135, baseType: !48, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !829, file: !91, line: 136, baseType: !48, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !829, file: !91, line: 137, baseType: !48, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !829, file: !91, line: 138, baseType: !48, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !829, file: !91, line: 139, baseType: !48, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !829, file: !91, line: 140, baseType: !48, size: 32, offset: 160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !829, file: !91, line: 141, baseType: !48, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !829, file: !91, line: 142, baseType: !48, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !829, file: !91, line: 143, baseType: !98, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !829, file: !91, line: 144, baseType: !48, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !829, file: !91, line: 145, baseType: !48, size: 32, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !829, file: !91, line: 147, baseType: !48, size: 32, offset: 352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !829, file: !91, line: 148, baseType: !48, size: 32, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !829, file: !91, line: 149, baseType: !48, size: 32, offset: 416)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !829, file: !91, line: 150, baseType: !48, size: 32, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !829, file: !91, line: 151, baseType: !48, size: 32, offset: 480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !829, file: !91, line: 152, baseType: !259, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !693, file: !91, line: 411, baseType: !48, size: 32, offset: 3200)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !693, file: !91, line: 411, baseType: !48, size: 32, offset: 3232)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !693, file: !91, line: 411, baseType: !48, size: 32, offset: 3264)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "subframe", scope: !693, file: !91, line: 412, baseType: !98, size: 32, offset: 3296)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "psfra", scope: !693, file: !91, line: 413, baseType: !48, size: 32, offset: 3328)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pefra", scope: !693, file: !91, line: 413, baseType: !48, size: 32, offset: 3360)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !693, file: !91, line: 415, baseType: !48, size: 32, offset: 3392)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "framapto", scope: !693, file: !91, line: 415, baseType: !48, size: 32, offset: 3424)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !693, file: !91, line: 416, baseType: !221, size: 16, offset: 3456)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !693, file: !91, line: 416, baseType: !221, size: 16, offset: 3472)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "framelen", scope: !693, file: !91, line: 418, baseType: !98, size: 32, offset: 3488)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "blurfac", scope: !693, file: !91, line: 418, baseType: !98, size: 32, offset: 3520)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "edgeR", scope: !693, file: !91, line: 421, baseType: !98, size: 32, offset: 3552)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "edgeG", scope: !693, file: !91, line: 421, baseType: !98, size: 32, offset: 3584)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "edgeB", scope: !693, file: !91, line: 421, baseType: !98, size: 32, offset: 3616)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fullscreen", scope: !693, file: !91, line: 425, baseType: !221, size: 16, offset: 3648)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !693, file: !91, line: 425, baseType: !221, size: 16, offset: 3664)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !693, file: !91, line: 425, baseType: !221, size: 16, offset: 3680)
