; ModuleID = 'blender/source/blender/blenlib/intern/DLRB_tree.c'
source_filename = "blender/source/blender/blenlib/intern/DLRB_tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DLRBT_Tree = type { i8*, i8*, i8* }
%struct.ListBase = type { i8*, i8* }
%struct.DLRBT_Node = type { %struct.DLRBT_Node*, %struct.DLRBT_Node*, %struct.DLRBT_Node*, %struct.DLRBT_Node*, %struct.DLRBT_Node*, i8 }
%struct.Link = type { %struct.Link*, %struct.Link* }

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [11 x i8] c"DLRBT_Tree\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.DLRBT_Tree* @BLI_dlrbTree_new() #0 !dbg !42 {
entry:
  %0 = load i8* (i64, i8*)*, i8* (i64, i8*)** @MEM_callocN, align 8, !dbg !53
  %call = call i8* %0(i64 24, i8* getelementptr inbounds ([11 x i8], [11 x i8]* @.str, i64 0, i64 0)), !dbg !53
  %1 = bitcast i8* %call to %struct.DLRBT_Tree*, !dbg !53
  ret %struct.DLRBT_Tree* %1, !dbg !54
}

; Function Attrs: noinline nounwind uwtable
define dso_local void @BLI_dlrbTree_init(%struct.DLRBT_Tree* %tree) #0 !dbg !55 {
entry:
  %tree.addr = alloca %struct.DLRBT_Tree*, align 8
  store %struct.DLRBT_Tree* %tree, %struct.DLRBT_Tree** %tree.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/DLRB_tree.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDLRBT_Colors", file: !4, line: 60, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenlib/BLI_dlrbTree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "DLRBT_BLACK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "DLRBT_RED", value: 1, isUnsigned: true)
!9 = !{!10, !11, !18, !25}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !13, line: 71, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !13, line: 69, size: 128, elements: !15)
!15 = !{!16, !17}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !14, file: !13, line: 70, baseType: !10, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !14, file: !13, line: 70, baseType: !10, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Link", file: !13, line: 59, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Link", file: !13, line: 57, size: 128, elements: !21)
!21 = !{!22, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !13, line: 58, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !20, file: !13, line: 58, baseType: !23, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "DLRBT_Node", file: !4, line: 57, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DLRBT_Node", file: !4, line: 47, size: 384, elements: !29)
!29 = !{!30, !32, !33, !34, !35, !36}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !4, line: 49, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !28, file: !4, line: 49, baseType: !31, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !28, file: !4, line: 52, baseType: !31, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !28, file: !4, line: 52, baseType: !31, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !28, file: !4, line: 53, baseType: !31, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tree_col", scope: !28, file: !4, line: 55, baseType: !37, size: 8, offset: 320)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{i32 7, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!42 = distinct !DISubprogram(name: "BLI_dlrbTree_new", scope: !1, file: !1, line: 40, type: !43, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !52)
!43 = !DISubroutineType(types: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "DLRBT_Tree", file: !4, line: 74, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DLRBT_Tree", file: !4, line: 68, size: 192, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !47, file: !4, line: 70, baseType: !10, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !47, file: !4, line: 70, baseType: !10, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !47, file: !4, line: 73, baseType: !10, size: 64, offset: 128)
!52 = !{}
!53 = !DILocation(line: 43, column: 9, scope: !42)
!54 = !DILocation(line: 43, column: 2, scope: !42)
!55 = distinct !DISubprogram(name: "BLI_dlrbTree_init", scope: !1, file: !1, line: 47, type: !56, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !52)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !45}
!58 = !DILocalVariable(name: "tree", arg: 1, scope: !55, file: !1, line: 47, type: !45)
!59 = !DILocation(line: 47, column: 36, scope: !55)
!60 = !DILocation(line: 49, column: 6, scope: !61)
!61 = distinct !DILexicalBlock(scope: !55, file: !1, line: 49, column: 6)
!62 = !DILocation(line: 49, column: 11, scope: !61)
!63 = !DILocation(line: 49, column: 6, scope: !55)
!64 = !DILocation(line: 50, column: 3, scope: !61)
!65 = !DILocation(line: 52, column: 29, scope: !55)
!66 = !DILocation(line: 52, column: 35, scope: !55)
!67 = !DILocation(line: 52, column: 40, scope: !55)
!68 = !DILocation(line: 52, column: 16, scope: !55)
!69 = !DILocation(line: 52, column: 22, scope: !55)
!70 = !DILocation(line: 52, column: 27, scope: !55)
!71 = !DILocation(line: 52, column: 2, scope: !55)
!72 = !DILocation(line: 52, column: 8, scope: !55)
!73 = !DILocation(line: 52, column: 14, scope: !55)
!74 = !DILocation(line: 53, column: 1, scope: !55)
!75 = distinct !DISubprogram(name: "BLI_dlrbTree_free", scope: !1, file: !1, line: 71, type: !56, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !52)
!76 = !DILocalVariable(name: "tree", arg: 1, scope: !75, file: !1, line: 71, type: !45)
!77 = !DILocation(line: 71, column: 36, scope: !75)
!78 = !DILocation(line: 73, column: 6, scope: !79)
!79 = distinct !DILexicalBlock(scope: !75, file: !1, line: 73, column: 6)
!80 = !DILocation(line: 73, column: 11, scope: !79)
!81 = !DILocation(line: 73, column: 6, scope: !75)
!82 = !DILocation(line: 74, column: 3, scope: !79)
!83 = !DILocation(line: 79, column: 6, scope: !84)
!84 = distinct !DILexicalBlock(scope: !75, file: !1, line: 79, column: 6)
!85 = !DILocation(line: 79, column: 12, scope: !84)
!86 = !DILocation(line: 79, column: 6, scope: !75)
!87 = !DILocation(line: 81, column: 29, scope: !88)
!88 = distinct !DILexicalBlock(scope: !84, file: !1, line: 79, column: 19)
!89 = !DILocation(line: 81, column: 17, scope: !88)
!90 = !DILocation(line: 81, column: 3, scope: !88)
!91 = !DILocation(line: 82, column: 2, scope: !88)
!92 = !DILocation(line: 85, column: 29, scope: !93)
!93 = distinct !DILexicalBlock(scope: !84, file: !1, line: 83, column: 7)
!94 = !DILocation(line: 85, column: 35, scope: !93)
!95 = !DILocation(line: 85, column: 3, scope: !93)
!96 = !DILocation(line: 89, column: 29, scope: !75)
!97 = !DILocation(line: 89, column: 35, scope: !75)
!98 = !DILocation(line: 89, column: 40, scope: !75)
!99 = !DILocation(line: 89, column: 16, scope: !75)
!100 = !DILocation(line: 89, column: 22, scope: !75)
!101 = !DILocation(line: 89, column: 27, scope: !75)
!102 = !DILocation(line: 89, column: 2, scope: !75)
!103 = !DILocation(line: 89, column: 8, scope: !75)
!104 = !DILocation(line: 89, column: 14, scope: !75)
!105 = !DILocation(line: 90, column: 1, scope: !75)
!106 = distinct !DISubprogram(name: "recursive_tree_free_nodes", scope: !1, file: !1, line: 56, type: !107, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !52)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !26}
!109 = !DILocalVariable(name: "node", arg: 1, scope: !106, file: !1, line: 56, type: !26)
!110 = !DILocation(line: 56, column: 51, scope: !106)
!111 = !DILocation(line: 59, column: 6, scope: !112)
!112 = distinct !DILexicalBlock(scope: !106, file: !1, line: 59, column: 6)
!113 = !DILocation(line: 59, column: 11, scope: !112)
!114 = !DILocation(line: 59, column: 6, scope: !106)
!115 = !DILocation(line: 60, column: 3, scope: !112)
