; ModuleID = 'blender/source/blender/nodes/intern/node_exec.c'
source_filename = "blender/source/blender/nodes/intern/node_exec.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.bNodeSocket = type { %struct.bNodeSocket*, %struct.bNodeSocket*, %struct.bNodeSocket*, %struct.IDProperty*, [64 x i8], [64 x i8], i8*, i16, i16, i16, i16, %struct.bNodeSocketType*, [64 x i8], float, float, i8*, i16, i16, i32, i8*, i32, i32, %struct.bNodeSocket*, %struct.bNodeLink*, %struct.bNodeStack }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/nodes/intern/node_exec.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !4, line: 69, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !18, line: 135, baseType: !19, size: 32, elements: !20)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29}
!21 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!22 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!23 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!24 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!25 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!26 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!27 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!28 = !DIEnumerator(name: "SOCK_INT", value: 6)
!29 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !{i32 7, !"Dwarf Version", i32 4}
!33 = !{i32 2, !"Debug Info Version", i32 3}
!34 = !{i32 1, !"wchar_size", i32 4}
!35 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!36 = distinct !DISubprogram(name: "node_exec_socket_use_stack", scope: !1, file: !1, line: 48, type: !37, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1725)
!37 = !DISubroutineType(types: !38)
!38 = !{!19, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !18, line: 132, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !18, line: 87, size: 2816, elements: !42)
!42 = !{!43, !45, !46, !47, !82, !83, !84, !85, !86, !87, !88, !89, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !18, line: 88, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !41, file: !18, line: 88, baseType: !44, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !41, file: !18, line: 88, baseType: !44, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !41, file: !18, line: 90, baseType: !48, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !50, line: 75, baseType: !51)
!50 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !50, line: 62, size: 1024, elements: !52)
!52 = !{!53, !55, !56, !58, !59, !61, !65, !66, !80, !81}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !50, line: 63, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !51, file: !50, line: 63, baseType: !54, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !50, line: 64, baseType: !57, size: 8, offset: 128)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !51, file: !50, line: 64, baseType: !57, size: 8, offset: 136)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !51, file: !50, line: 65, baseType: !60, size: 16, offset: 144)
!60 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !50, line: 66, baseType: !62, size: 512, offset: 160)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !51, file: !50, line: 67, baseType: !19, size: 32, offset: 672)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !51, file: !50, line: 69, baseType: !67, size: 256, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !50, line: 60, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !50, line: 48, size: 256, elements: !69)
!69 = !{!70, !71, !78, !79}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !68, file: !50, line: 49, baseType: !31, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !68, file: !50, line: 58, baseType: !72, size: 128, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !73, line: 71, baseType: !74)
!73 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !73, line: 69, size: 128, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !74, file: !73, line: 70, baseType: !31, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !74, file: !73, line: 70, baseType: !31, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !68, file: !50, line: 59, baseType: !19, size: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !68, file: !50, line: 59, baseType: !19, size: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !51, file: !50, line: 70, baseType: !19, size: 32, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !51, file: !50, line: 74, baseType: !19, size: 32, offset: 992)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !41, file: !18, line: 92, baseType: !62, size: 512, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !18, line: 94, baseType: !62, size: 512, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !41, file: !18, line: 99, baseType: !31, size: 64, offset: 1280)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !18, line: 101, baseType: !60, size: 16, offset: 1344)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !41, file: !18, line: 101, baseType: !60, size: 16, offset: 1360)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !41, file: !18, line: 102, baseType: !60, size: 16, offset: 1376)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !41, file: !18, line: 103, baseType: !60, size: 16, offset: 1392)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !41, file: !18, line: 104, baseType: !90, size: 64, offset: 1408)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !92, line: 114, size: 1600, elements: !93)
!92 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !{!94, !95, !117, !123, !127, !131, !1698, !1702, !1703, !1707, !1708, !1709, !1710}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !91, file: !92, line: 115, baseType: !62, size: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !91, file: !92, line: 117, baseType: !96, size: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99, !102, !104, !104, !115}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !101, line: 44, flags: DIFlagFwdDecl)
!101 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !92, line: 73, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !101, line: 55, size: 192, elements: !106)
!106 = !{!107, !111, !114}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !101, line: 58, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !105, file: !101, line: 56, size: 64, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !101, line: 57, baseType: !31, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !101, line: 60, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !18, line: 335, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !101, line: 61, baseType: !31, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !91, file: !92, line: 118, baseType: !118, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !99, !104, !104, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !91, file: !92, line: 120, baseType: !124, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !99, !102, !104}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !91, file: !92, line: 121, baseType: !128, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !99, !104, !121}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !91, file: !92, line: 122, baseType: !132, size: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135, !44, !112}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !18, line: 328, size: 3456, elements: !137)
!137 = !{!138, !174, !178, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1681, !1685, !1689, !1693, !1694, !1695, !1696, !1697}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !136, file: !18, line: 329, baseType: !139, size: 960)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !50, line: 130, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !50, line: 117, size: 960, elements: !141)
!141 = !{!142, !143, !144, !146, !165, !169, !170, !171, !172, !173}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !50, line: 118, baseType: !31, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !50, line: 118, baseType: !31, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !140, file: !50, line: 119, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !140, file: !50, line: 120, baseType: !147, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !50, line: 136, size: 17600, elements: !149)
!149 = !{!150, !151, !153, !156, !160, !161, !162}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !148, file: !50, line: 137, baseType: !139, size: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !148, file: !50, line: 138, baseType: !152, size: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !148, file: !50, line: 139, baseType: !154, size: 64, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !50, line: 43, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !50, line: 140, baseType: !157, size: 8192, offset: 1088)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !148, file: !50, line: 141, baseType: !157, size: 8192, offset: 9280)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !148, file: !50, line: 148, baseType: !147, size: 64, offset: 17472)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !148, file: !50, line: 150, baseType: !163, size: 64, offset: 17536)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !50, line: 45, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !50, line: 121, baseType: !166, size: 528, offset: 256)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 528, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 66)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !50, line: 126, baseType: !60, size: 16, offset: 784)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !140, file: !50, line: 127, baseType: !19, size: 32, offset: 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !140, file: !50, line: 128, baseType: !19, size: 32, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !140, file: !50, line: 128, baseType: !19, size: 32, offset: 864)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !140, file: !50, line: 129, baseType: !48, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !136, file: !18, line: 330, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !177, line: 45, flags: DIFlagFwdDecl)
!177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !136, file: !18, line: 332, baseType: !179, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !92, line: 283, size: 4096, elements: !181)
!181 = !{!182, !183, !184, !185, !189, !190, !194, !493, !1602, !1606, !1612, !1616, !1617, !1618, !1619, !1636, !1637}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !92, line: 284, baseType: !19, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !180, file: !92, line: 285, baseType: !62, size: 512, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !180, file: !92, line: 287, baseType: !62, size: 512, offset: 544)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !180, file: !92, line: 288, baseType: !186, size: 2048, offset: 1056)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !180, file: !92, line: 289, baseType: !19, size: 32, offset: 3104)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !180, file: !92, line: 292, baseType: !191, size: 64, offset: 3136)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !135}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !180, file: !92, line: 293, baseType: !195, size: 64, offset: 3200)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !135, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !18, line: 167, size: 3712, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !485, !486, !487, !488, !489, !490}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !18, line: 168, baseType: !198, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !18, line: 168, baseType: !198, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !199, file: !18, line: 168, baseType: !198, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !199, file: !18, line: 170, baseType: !48, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !199, file: !18, line: 172, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !92, line: 144, size: 6016, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !244, !245, !246, !260, !264, !268, !269, !276, !281, !285, !286, !287, !288, !292, !293, !297, !301, !305, !309, !313, !317, !321, !322, !340, !345, !392, !412}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !92, line: 145, baseType: !31, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !207, file: !92, line: 145, baseType: !31, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !207, file: !92, line: 146, baseType: !60, size: 16, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !207, file: !92, line: 148, baseType: !62, size: 512, offset: 144)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !92, line: 149, baseType: !19, size: 32, offset: 672)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !207, file: !92, line: 151, baseType: !62, size: 512, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !207, file: !92, line: 152, baseType: !186, size: 2048, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !207, file: !92, line: 153, baseType: !19, size: 32, offset: 3264)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !207, file: !92, line: 155, baseType: !122, size: 32, offset: 3296)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !207, file: !92, line: 155, baseType: !122, size: 32, offset: 3328)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !207, file: !92, line: 155, baseType: !122, size: 32, offset: 3360)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !207, file: !92, line: 156, baseType: !122, size: 32, offset: 3392)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !207, file: !92, line: 156, baseType: !122, size: 32, offset: 3424)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !207, file: !92, line: 156, baseType: !122, size: 32, offset: 3456)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !207, file: !92, line: 157, baseType: !60, size: 16, offset: 3488)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !207, file: !92, line: 157, baseType: !60, size: 16, offset: 3504)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !207, file: !92, line: 157, baseType: !60, size: 16, offset: 3520)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !207, file: !92, line: 160, baseType: !227, size: 64, offset: 3584)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !92, line: 109, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !92, line: 98, size: 1408, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !92, line: 99, baseType: !19, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !229, file: !92, line: 99, baseType: !19, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !92, line: 100, baseType: !62, size: 512, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !229, file: !92, line: 101, baseType: !122, size: 32, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !229, file: !92, line: 101, baseType: !122, size: 32, offset: 608)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !229, file: !92, line: 101, baseType: !122, size: 32, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !229, file: !92, line: 101, baseType: !122, size: 32, offset: 672)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !229, file: !92, line: 102, baseType: !122, size: 32, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !229, file: !92, line: 102, baseType: !122, size: 32, offset: 736)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !229, file: !92, line: 103, baseType: !19, size: 32, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !92, line: 104, baseType: !19, size: 32, offset: 800)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !229, file: !92, line: 107, baseType: !44, size: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !229, file: !92, line: 108, baseType: !62, size: 512, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !207, file: !92, line: 160, baseType: !227, size: 64, offset: 3648)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !207, file: !92, line: 162, baseType: !62, size: 512, offset: 3712)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !207, file: !92, line: 165, baseType: !247, size: 64, offset: 4224)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250, !252, !254, !135, !198, !256}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !92, line: 81, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !18, line: 43, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !18, line: 274, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !18, line: 271, size: 32, elements: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !257, file: !18, line: 273, baseType: !5, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !207, file: !92, line: 168, baseType: !261, size: 64, offset: 4288)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !250, !135, !198}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !207, file: !92, line: 171, baseType: !265, size: 64, offset: 4352)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !102, !99, !104}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !207, file: !92, line: 173, baseType: !265, size: 64, offset: 4416)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !207, file: !92, line: 176, baseType: !270, size: 64, offset: 4480)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !254, !273, !198, !19, !19}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !275, line: 136, flags: DIFlagFwdDecl)
!275 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !207, file: !92, line: 179, baseType: !277, size: 64, offset: 4544)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !135, !198, !280, !19}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !207, file: !92, line: 181, baseType: !282, size: 64, offset: 4608)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!19, !198, !19, !19}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !207, file: !92, line: 183, baseType: !282, size: 64, offset: 4672)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !207, file: !92, line: 185, baseType: !282, size: 64, offset: 4736)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !207, file: !92, line: 188, baseType: !195, size: 64, offset: 4800)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !207, file: !92, line: 190, baseType: !289, size: 64, offset: 4864)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !135, !198, !145}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !207, file: !92, line: 193, baseType: !195, size: 64, offset: 4928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !207, file: !92, line: 195, baseType: !294, size: 64, offset: 4992)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !198}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !207, file: !92, line: 197, baseType: !298, size: 64, offset: 5056)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !135, !198, !198}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !207, file: !92, line: 200, baseType: !302, size: 64, offset: 5120)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !250, !104}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !207, file: !92, line: 201, baseType: !306, size: 64, offset: 5184)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !104}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !207, file: !92, line: 202, baseType: !310, size: 64, offset: 5248)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !104, !198}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !207, file: !92, line: 205, baseType: !314, size: 64, offset: 5312)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!19, !206, !135}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !207, file: !92, line: 207, baseType: !318, size: 64, offset: 5376)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!19, !198, !135}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !207, file: !92, line: 210, baseType: !195, size: 64, offset: 5440)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !207, file: !92, line: 213, baseType: !323, size: 64, offset: 5504)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !92, line: 135, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!31, !327, !198, !256}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !329, line: 54, size: 64, elements: !330)
!329 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !328, file: !329, line: 55, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !92, line: 500, size: 64, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !333, file: !92, line: 502, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !338, line: 48, baseType: !339)
!338 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !338, line: 48, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !207, file: !92, line: 214, baseType: !341, size: 64, offset: 5568)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !92, line: 136, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !31}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !207, file: !92, line: 215, baseType: !346, size: 64, offset: 5632)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !92, line: 137, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !31, !19, !198, !350, !371, !371}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !329, line: 58, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !351, file: !329, line: 59, baseType: !31, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !351, file: !329, line: 60, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !18, line: 289, size: 192, elements: !357)
!357 = !{!358, !365, !368, !369, !370}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !356, file: !18, line: 290, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !18, line: 286, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !18, line: 280, size: 64, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !360, file: !18, line: 281, baseType: !256, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !360, file: !18, line: 284, baseType: !60, size: 16, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !360, file: !18, line: 285, baseType: !60, size: 16, offset: 48)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !356, file: !18, line: 292, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !356, file: !18, line: 293, baseType: !60, size: 16, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !356, file: !18, line: 293, baseType: !60, size: 16, offset: 144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !356, file: !18, line: 294, baseType: !19, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !18, line: 62, size: 384, elements: !374)
!374 = !{!375, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !373, file: !18, line: 63, baseType: !376, size: 128)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 4)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !373, file: !18, line: 64, baseType: !122, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !373, file: !18, line: 64, baseType: !122, size: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !373, file: !18, line: 65, baseType: !31, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !373, file: !18, line: 66, baseType: !60, size: 16, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !373, file: !18, line: 67, baseType: !60, size: 16, offset: 272)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !373, file: !18, line: 68, baseType: !60, size: 16, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !373, file: !18, line: 69, baseType: !60, size: 16, offset: 304)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !373, file: !18, line: 70, baseType: !60, size: 16, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !373, file: !18, line: 71, baseType: !60, size: 16, offset: 336)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !373, file: !18, line: 72, baseType: !389, size: 32, offset: 352)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 2)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !207, file: !92, line: 217, baseType: !393, size: 64, offset: 5696)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !92, line: 138, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!19, !397, !198, !350, !399, !399}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !92, line: 64, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !4, line: 106, size: 384, elements: !401)
!401 = !{!402, !404, !405, !406, !409, !410, !411}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !4, line: 107, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !4, line: 80, baseType: !3)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !4, line: 108, baseType: !115, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !400, file: !4, line: 109, baseType: !376, size: 128, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !400, file: !4, line: 110, baseType: !407, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !4, line: 55, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !400, file: !4, line: 111, baseType: !367, size: 8, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !400, file: !4, line: 112, baseType: !367, size: 8, offset: 328)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !400, file: !4, line: 113, baseType: !60, size: 16, offset: 336)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !207, file: !92, line: 220, baseType: !413, size: 256, offset: 5760)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !101, line: 436, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !101, line: 430, size: 256, elements: !415)
!415 = !{!416, !417, !420, !436}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !414, file: !101, line: 431, baseType: !31, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !414, file: !101, line: 432, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !101, line: 417, baseType: !113)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !414, file: !101, line: 433, baseType: !421, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !101, line: 408, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!19, !99, !104, !425, !427}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !101, line: 38, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !101, line: 348, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !101, line: 337, size: 256, elements: !430)
!430 = !{!431, !432, !433, !434, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !429, file: !101, line: 339, baseType: !31, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !429, file: !101, line: 342, baseType: !425, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !429, file: !101, line: 345, baseType: !19, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !429, file: !101, line: 347, baseType: !19, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !429, file: !101, line: 347, baseType: !19, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !414, file: !101, line: 434, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !101, line: 409, baseType: !342)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !199, file: !18, line: 173, baseType: !62, size: 512, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !18, line: 175, baseType: !62, size: 512, offset: 832)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !199, file: !18, line: 176, baseType: !19, size: 32, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !18, line: 177, baseType: !60, size: 16, offset: 1376)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !199, file: !18, line: 177, baseType: !60, size: 16, offset: 1392)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !199, file: !18, line: 178, baseType: !60, size: 16, offset: 1408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !199, file: !18, line: 178, baseType: !60, size: 16, offset: 1424)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !199, file: !18, line: 179, baseType: !60, size: 16, offset: 1440)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !199, file: !18, line: 179, baseType: !60, size: 16, offset: 1456)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !199, file: !18, line: 180, baseType: !60, size: 16, offset: 1472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !199, file: !18, line: 181, baseType: !60, size: 16, offset: 1488)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !199, file: !18, line: 182, baseType: !450, size: 96, offset: 1504)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 96, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 3)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !199, file: !18, line: 184, baseType: !72, size: 128, offset: 1600)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !199, file: !18, line: 184, baseType: !72, size: 128, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !199, file: !18, line: 185, baseType: !198, size: 64, offset: 1856)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !199, file: !18, line: 186, baseType: !145, size: 64, offset: 1920)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !199, file: !18, line: 187, baseType: !31, size: 64, offset: 1984)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !199, file: !18, line: 188, baseType: !198, size: 64, offset: 2048)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !199, file: !18, line: 189, baseType: !72, size: 128, offset: 2112)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !199, file: !18, line: 191, baseType: !122, size: 32, offset: 2240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !199, file: !18, line: 191, baseType: !122, size: 32, offset: 2272)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !199, file: !18, line: 192, baseType: !122, size: 32, offset: 2304)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !199, file: !18, line: 192, baseType: !122, size: 32, offset: 2336)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !199, file: !18, line: 193, baseType: !122, size: 32, offset: 2368)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !199, file: !18, line: 194, baseType: !122, size: 32, offset: 2400)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !199, file: !18, line: 194, baseType: !122, size: 32, offset: 2432)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !199, file: !18, line: 196, baseType: !19, size: 32, offset: 2464)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !199, file: !18, line: 198, baseType: !62, size: 512, offset: 2496)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !199, file: !18, line: 199, baseType: !60, size: 16, offset: 3008)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !199, file: !18, line: 199, baseType: !60, size: 16, offset: 3024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !199, file: !18, line: 200, baseType: !122, size: 32, offset: 3040)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !199, file: !18, line: 200, baseType: !122, size: 32, offset: 3072)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !199, file: !18, line: 202, baseType: !60, size: 16, offset: 3104)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !199, file: !18, line: 202, baseType: !60, size: 16, offset: 3120)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !199, file: !18, line: 203, baseType: !31, size: 64, offset: 3136)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !199, file: !18, line: 204, baseType: !477, size: 128, offset: 3200)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !478, line: 95, baseType: !479)
!478 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !478, line: 92, size: 128, elements: !480)
!480 = !{!481, !482, !483, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !479, file: !478, line: 93, baseType: !122, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !479, file: !478, line: 93, baseType: !122, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !479, file: !478, line: 94, baseType: !122, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !479, file: !478, line: 94, baseType: !122, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !199, file: !18, line: 205, baseType: !477, size: 128, offset: 3328)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !199, file: !18, line: 206, baseType: !477, size: 128, offset: 3456)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !199, file: !18, line: 215, baseType: !60, size: 16, offset: 3584)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !199, file: !18, line: 215, baseType: !60, size: 16, offset: 3600)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !199, file: !18, line: 216, baseType: !19, size: 32, offset: 3616)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !199, file: !18, line: 217, baseType: !491, size: 64, offset: 3648)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !18, line: 51, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !180, file: !92, line: 294, baseType: !494, size: 64, offset: 3264)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497, !31, !1598}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !499, line: 1216, size: 39680, elements: !500)
!499 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!500 = !{!501, !502, !503, !506, !969, !970, !971, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !998, !1212, !1215, !1465, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1487, !1488, !1489, !1490, !1491, !1499, !1565, !1572, !1575, !1582, !1585, !1591, !1592, !1593, !1594, !1595}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !498, file: !499, line: 1217, baseType: !139, size: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !498, file: !499, line: 1218, baseType: !175, size: 64, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !498, file: !499, line: 1220, baseType: !504, size: 64, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !177, line: 49, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !498, file: !499, line: 1221, baseType: !507, size: 64, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !509, line: 52, size: 4224, elements: !510)
!509 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !583, !964, !965, !966, !967, !968}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !508, file: !509, line: 53, baseType: !139, size: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !508, file: !509, line: 54, baseType: !175, size: 64, offset: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !508, file: !509, line: 56, baseType: !60, size: 16, offset: 1024)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !508, file: !509, line: 56, baseType: !60, size: 16, offset: 1040)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !508, file: !509, line: 57, baseType: !60, size: 16, offset: 1056)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !508, file: !509, line: 57, baseType: !60, size: 16, offset: 1072)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !508, file: !509, line: 59, baseType: !122, size: 32, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !508, file: !509, line: 59, baseType: !122, size: 32, offset: 1120)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !508, file: !509, line: 59, baseType: !122, size: 32, offset: 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !508, file: !509, line: 60, baseType: !122, size: 32, offset: 1184)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !508, file: !509, line: 60, baseType: !122, size: 32, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !508, file: !509, line: 60, baseType: !122, size: 32, offset: 1248)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !508, file: !509, line: 61, baseType: !122, size: 32, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !508, file: !509, line: 61, baseType: !122, size: 32, offset: 1312)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !508, file: !509, line: 61, baseType: !122, size: 32, offset: 1344)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !508, file: !509, line: 68, baseType: !122, size: 32, offset: 1376)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !508, file: !509, line: 68, baseType: !122, size: 32, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !508, file: !509, line: 68, baseType: !122, size: 32, offset: 1440)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !508, file: !509, line: 69, baseType: !122, size: 32, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !508, file: !509, line: 69, baseType: !122, size: 32, offset: 1504)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !508, file: !509, line: 74, baseType: !122, size: 32, offset: 1536)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !508, file: !509, line: 79, baseType: !122, size: 32, offset: 1568)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !508, file: !509, line: 81, baseType: !60, size: 16, offset: 1600)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !508, file: !509, line: 91, baseType: !60, size: 16, offset: 1616)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !508, file: !509, line: 92, baseType: !60, size: 16, offset: 1632)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !508, file: !509, line: 93, baseType: !60, size: 16, offset: 1648)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !508, file: !509, line: 94, baseType: !60, size: 16, offset: 1664)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !508, file: !509, line: 94, baseType: !60, size: 16, offset: 1680)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !508, file: !509, line: 94, baseType: !60, size: 16, offset: 1696)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !508, file: !509, line: 94, baseType: !60, size: 16, offset: 1712)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !508, file: !509, line: 96, baseType: !122, size: 32, offset: 1728)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !508, file: !509, line: 96, baseType: !122, size: 32, offset: 1760)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !508, file: !509, line: 96, baseType: !122, size: 32, offset: 1792)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !508, file: !509, line: 96, baseType: !122, size: 32, offset: 1824)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !508, file: !509, line: 98, baseType: !122, size: 32, offset: 1856)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !508, file: !509, line: 98, baseType: !122, size: 32, offset: 1888)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !508, file: !509, line: 98, baseType: !122, size: 32, offset: 1920)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !508, file: !509, line: 98, baseType: !122, size: 32, offset: 1952)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !508, file: !509, line: 99, baseType: !122, size: 32, offset: 1984)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !508, file: !509, line: 99, baseType: !122, size: 32, offset: 2016)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !508, file: !509, line: 100, baseType: !122, size: 32, offset: 2048)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !508, file: !509, line: 100, baseType: !122, size: 32, offset: 2080)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !508, file: !509, line: 103, baseType: !60, size: 16, offset: 2112)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !508, file: !509, line: 103, baseType: !60, size: 16, offset: 2128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !508, file: !509, line: 103, baseType: !60, size: 16, offset: 2144)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !508, file: !509, line: 103, baseType: !60, size: 16, offset: 2160)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !508, file: !509, line: 106, baseType: !122, size: 32, offset: 2176)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !508, file: !509, line: 106, baseType: !122, size: 32, offset: 2208)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !508, file: !509, line: 106, baseType: !122, size: 32, offset: 2240)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !508, file: !509, line: 106, baseType: !122, size: 32, offset: 2272)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !508, file: !509, line: 107, baseType: !60, size: 16, offset: 2304)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !508, file: !509, line: 107, baseType: !60, size: 16, offset: 2320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !508, file: !509, line: 107, baseType: !60, size: 16, offset: 2336)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !508, file: !509, line: 107, baseType: !60, size: 16, offset: 2352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !508, file: !509, line: 108, baseType: !122, size: 32, offset: 2368)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !508, file: !509, line: 108, baseType: !122, size: 32, offset: 2400)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !508, file: !509, line: 109, baseType: !122, size: 32, offset: 2432)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !508, file: !509, line: 109, baseType: !122, size: 32, offset: 2464)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !508, file: !509, line: 110, baseType: !122, size: 32, offset: 2496)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !508, file: !509, line: 110, baseType: !122, size: 32, offset: 2528)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !508, file: !509, line: 110, baseType: !122, size: 32, offset: 2560)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !508, file: !509, line: 111, baseType: !60, size: 16, offset: 2592)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !508, file: !509, line: 111, baseType: !60, size: 16, offset: 2608)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !508, file: !509, line: 112, baseType: !60, size: 16, offset: 2624)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !508, file: !509, line: 112, baseType: !60, size: 16, offset: 2640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !508, file: !509, line: 112, baseType: !60, size: 16, offset: 2656)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !508, file: !509, line: 115, baseType: !60, size: 16, offset: 2672)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !508, file: !509, line: 118, baseType: !121, size: 64, offset: 2688)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !508, file: !509, line: 118, baseType: !121, size: 64, offset: 2752)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !508, file: !509, line: 121, baseType: !581, size: 64, offset: 2816)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !177, line: 46, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !508, file: !509, line: 122, baseType: !584, size: 1152, offset: 2880)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1152, elements: !962)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !177, line: 57, size: 2496, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !586, file: !177, line: 59, baseType: !60, size: 16)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !586, file: !177, line: 59, baseType: !60, size: 16, offset: 16)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !586, file: !177, line: 59, baseType: !60, size: 16, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !586, file: !177, line: 59, baseType: !60, size: 16, offset: 48)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !586, file: !177, line: 60, baseType: !504, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !586, file: !177, line: 61, baseType: !594, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !177, line: 202, size: 3328, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !666, !667, !668, !748, !774, !802, !803, !872, !893, !901, !902}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !595, file: !177, line: 203, baseType: !139, size: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !595, file: !177, line: 204, baseType: !175, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !595, file: !177, line: 206, baseType: !122, size: 32, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !595, file: !177, line: 206, baseType: !122, size: 32, offset: 1056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !595, file: !177, line: 207, baseType: !122, size: 32, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !595, file: !177, line: 207, baseType: !122, size: 32, offset: 1120)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !595, file: !177, line: 207, baseType: !122, size: 32, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !595, file: !177, line: 207, baseType: !122, size: 32, offset: 1184)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !595, file: !177, line: 207, baseType: !122, size: 32, offset: 1216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !595, file: !177, line: 207, baseType: !122, size: 32, offset: 1248)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !595, file: !177, line: 208, baseType: !122, size: 32, offset: 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !595, file: !177, line: 208, baseType: !122, size: 32, offset: 1312)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !595, file: !177, line: 211, baseType: !122, size: 32, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !595, file: !177, line: 211, baseType: !122, size: 32, offset: 1376)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !595, file: !177, line: 211, baseType: !122, size: 32, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !595, file: !177, line: 211, baseType: !122, size: 32, offset: 1440)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !595, file: !177, line: 211, baseType: !122, size: 32, offset: 1472)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !595, file: !177, line: 214, baseType: !122, size: 32, offset: 1504)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !595, file: !177, line: 214, baseType: !122, size: 32, offset: 1536)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !595, file: !177, line: 217, baseType: !122, size: 32, offset: 1568)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !595, file: !177, line: 218, baseType: !122, size: 32, offset: 1600)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !595, file: !177, line: 219, baseType: !122, size: 32, offset: 1632)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !595, file: !177, line: 220, baseType: !122, size: 32, offset: 1664)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !595, file: !177, line: 221, baseType: !122, size: 32, offset: 1696)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !595, file: !177, line: 222, baseType: !60, size: 16, offset: 1728)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !595, file: !177, line: 222, baseType: !60, size: 16, offset: 1744)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !595, file: !177, line: 224, baseType: !60, size: 16, offset: 1760)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !595, file: !177, line: 224, baseType: !60, size: 16, offset: 1776)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !595, file: !177, line: 227, baseType: !60, size: 16, offset: 1792)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !595, file: !177, line: 227, baseType: !60, size: 16, offset: 1808)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !595, file: !177, line: 229, baseType: !60, size: 16, offset: 1824)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !177, line: 229, baseType: !60, size: 16, offset: 1840)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !595, file: !177, line: 230, baseType: !60, size: 16, offset: 1856)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !595, file: !177, line: 230, baseType: !60, size: 16, offset: 1872)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !595, file: !177, line: 232, baseType: !122, size: 32, offset: 1888)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !595, file: !177, line: 232, baseType: !122, size: 32, offset: 1920)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !595, file: !177, line: 232, baseType: !122, size: 32, offset: 1952)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !595, file: !177, line: 232, baseType: !122, size: 32, offset: 1984)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !595, file: !177, line: 233, baseType: !19, size: 32, offset: 2016)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !595, file: !177, line: 234, baseType: !19, size: 32, offset: 2048)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !595, file: !177, line: 235, baseType: !60, size: 16, offset: 2080)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !595, file: !177, line: 235, baseType: !60, size: 16, offset: 2096)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !595, file: !177, line: 236, baseType: !60, size: 16, offset: 2112)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !595, file: !177, line: 239, baseType: !60, size: 16, offset: 2128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !595, file: !177, line: 240, baseType: !19, size: 32, offset: 2144)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !595, file: !177, line: 241, baseType: !19, size: 32, offset: 2176)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !595, file: !177, line: 241, baseType: !19, size: 32, offset: 2208)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !595, file: !177, line: 241, baseType: !19, size: 32, offset: 2240)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !595, file: !177, line: 243, baseType: !122, size: 32, offset: 2272)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !595, file: !177, line: 243, baseType: !122, size: 32, offset: 2304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !595, file: !177, line: 244, baseType: !122, size: 32, offset: 2336)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !595, file: !177, line: 246, baseType: !649, size: 320, offset: 2368)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !650, line: 50, size: 320, elements: !651)
!650 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !649, file: !650, line: 51, baseType: !497, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !649, file: !650, line: 53, baseType: !19, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !649, file: !650, line: 54, baseType: !19, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !649, file: !650, line: 55, baseType: !19, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !649, file: !650, line: 55, baseType: !19, size: 32, offset: 160)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !649, file: !650, line: 56, baseType: !57, size: 8, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !649, file: !650, line: 56, baseType: !57, size: 8, offset: 200)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !649, file: !650, line: 57, baseType: !57, size: 8, offset: 208)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !649, file: !650, line: 57, baseType: !57, size: 8, offset: 216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !649, file: !650, line: 59, baseType: !60, size: 16, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !649, file: !650, line: 59, baseType: !60, size: 16, offset: 240)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !649, file: !650, line: 59, baseType: !60, size: 16, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !649, file: !650, line: 61, baseType: !60, size: 16, offset: 272)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !649, file: !650, line: 63, baseType: !19, size: 32, offset: 288)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !595, file: !177, line: 248, baseType: !135, size: 64, offset: 2688)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !595, file: !177, line: 249, baseType: !581, size: 64, offset: 2752)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !595, file: !177, line: 250, baseType: !669, size: 64, offset: 2816)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !650, line: 77, size: 15424, elements: !671)
!671 = !{!672, !673, !674, !677, !680, !683, !686, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !706, !707, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !737, !738, !742}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !670, file: !650, line: 78, baseType: !139, size: 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !670, file: !650, line: 80, baseType: !157, size: 8192, offset: 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !670, file: !650, line: 82, baseType: !675, size: 64, offset: 9152)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !650, line: 43, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !670, file: !650, line: 83, baseType: !678, size: 64, offset: 9216)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !50, line: 46, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !670, file: !650, line: 86, baseType: !681, size: 64, offset: 9280)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !650, line: 41, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !670, file: !650, line: 87, baseType: !684, size: 64, offset: 9344)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !650, line: 44, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !670, file: !650, line: 89, baseType: !687, size: 512, offset: 9408)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 512, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 8)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !670, file: !650, line: 90, baseType: !60, size: 16, offset: 9920)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !670, file: !650, line: 90, baseType: !60, size: 16, offset: 9936)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !670, file: !650, line: 92, baseType: !60, size: 16, offset: 9952)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !670, file: !650, line: 92, baseType: !60, size: 16, offset: 9968)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !670, file: !650, line: 93, baseType: !60, size: 16, offset: 9984)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !650, line: 93, baseType: !60, size: 16, offset: 10000)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !670, file: !650, line: 94, baseType: !19, size: 32, offset: 10016)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !670, file: !650, line: 97, baseType: !60, size: 16, offset: 10048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !670, file: !650, line: 97, baseType: !60, size: 16, offset: 10064)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !670, file: !650, line: 98, baseType: !60, size: 16, offset: 10080)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !670, file: !650, line: 98, baseType: !60, size: 16, offset: 10096)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !670, file: !650, line: 99, baseType: !60, size: 16, offset: 10112)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !670, file: !650, line: 99, baseType: !60, size: 16, offset: 10128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !670, file: !650, line: 100, baseType: !5, size: 32, offset: 10144)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !670, file: !650, line: 101, baseType: !705, size: 64, offset: 10176)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !670, file: !650, line: 103, baseType: !163, size: 64, offset: 10240)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !670, file: !650, line: 104, baseType: !708, size: 64, offset: 10304)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !50, line: 159, size: 448, elements: !710)
!710 = !{!711, !713, !714, !715, !716, !718}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !709, file: !50, line: 161, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !390)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !709, file: !50, line: 162, baseType: !712, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !709, file: !50, line: 163, baseType: !389, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !709, file: !50, line: 164, baseType: !389, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !709, file: !50, line: 165, baseType: !717, size: 128, offset: 192)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !390)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !709, file: !50, line: 166, baseType: !719, size: 128, offset: 320)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 128, elements: !390)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !670, file: !650, line: 107, baseType: !122, size: 32, offset: 10368)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !670, file: !650, line: 108, baseType: !19, size: 32, offset: 10400)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !670, file: !650, line: 109, baseType: !60, size: 16, offset: 10432)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !670, file: !650, line: 110, baseType: !60, size: 16, offset: 10448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !670, file: !650, line: 113, baseType: !19, size: 32, offset: 10464)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !670, file: !650, line: 113, baseType: !19, size: 32, offset: 10496)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !670, file: !650, line: 114, baseType: !57, size: 8, offset: 10528)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !670, file: !650, line: 114, baseType: !57, size: 8, offset: 10536)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !670, file: !650, line: 115, baseType: !60, size: 16, offset: 10544)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !670, file: !650, line: 116, baseType: !376, size: 128, offset: 10560)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !670, file: !650, line: 119, baseType: !122, size: 32, offset: 10688)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !670, file: !650, line: 119, baseType: !122, size: 32, offset: 10720)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !670, file: !650, line: 122, baseType: !733, size: 512, offset: 10752)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !275, line: 182, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !275, line: 180, size: 512, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !275, line: 181, baseType: !62, size: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !670, file: !650, line: 123, baseType: !57, size: 8, offset: 11264)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !670, file: !650, line: 125, baseType: !739, size: 56, offset: 11272)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 56, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 7)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !670, file: !650, line: 126, baseType: !743, size: 4096, offset: 11328)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 4096, elements: !688)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !650, line: 69, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !650, line: 67, size: 512, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !745, file: !650, line: 68, baseType: !62, size: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !595, file: !177, line: 251, baseType: !749, size: 64, offset: 2880)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !177, line: 113, size: 6208, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !761}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !750, file: !177, line: 114, baseType: !60, size: 16)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !750, file: !177, line: 114, baseType: !60, size: 16, offset: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !750, file: !177, line: 115, baseType: !57, size: 8, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !750, file: !177, line: 115, baseType: !57, size: 8, offset: 40)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !750, file: !177, line: 116, baseType: !57, size: 8, offset: 48)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !750, file: !177, line: 117, baseType: !758, size: 8, offset: 56)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 1)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !750, file: !177, line: 119, baseType: !762, size: 6144, offset: 64)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 6144, elements: !772)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !177, line: 109, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !177, line: 106, size: 192, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !764, file: !177, line: 107, baseType: !122, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !764, file: !177, line: 107, baseType: !122, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !764, file: !177, line: 107, baseType: !122, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !764, file: !177, line: 107, baseType: !122, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !764, file: !177, line: 107, baseType: !122, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !764, file: !177, line: 108, baseType: !19, size: 32, offset: 160)
!772 = !{!773}
!773 = !DISubrange(count: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !595, file: !177, line: 252, baseType: !775, size: 64, offset: 2944)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !177, line: 122, size: 1600, elements: !777)
!777 = !{!778, !779, !780, !784, !787, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !776, file: !177, line: 123, baseType: !504, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !776, file: !177, line: 124, baseType: !669, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !776, file: !177, line: 125, baseType: !781, size: 384, offset: 128)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 384, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 6)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !776, file: !177, line: 126, baseType: !785, size: 512, offset: 512)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 512, elements: !786)
!786 = !{!378, !378}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !776, file: !177, line: 127, baseType: !788, size: 288, offset: 1024)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 288, elements: !789)
!789 = !{!452, !452}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !776, file: !177, line: 128, baseType: !60, size: 16, offset: 1312)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !776, file: !177, line: 128, baseType: !60, size: 16, offset: 1328)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !776, file: !177, line: 129, baseType: !122, size: 32, offset: 1344)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !776, file: !177, line: 129, baseType: !122, size: 32, offset: 1376)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !776, file: !177, line: 130, baseType: !122, size: 32, offset: 1408)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !776, file: !177, line: 131, baseType: !5, size: 32, offset: 1440)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !776, file: !177, line: 132, baseType: !60, size: 16, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !776, file: !177, line: 132, baseType: !60, size: 16, offset: 1488)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !776, file: !177, line: 133, baseType: !19, size: 32, offset: 1504)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !776, file: !177, line: 133, baseType: !19, size: 32, offset: 1536)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !776, file: !177, line: 134, baseType: !60, size: 16, offset: 1568)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !776, file: !177, line: 134, baseType: !60, size: 16, offset: 1584)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !595, file: !177, line: 253, baseType: !708, size: 64, offset: 3008)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !595, file: !177, line: 254, baseType: !804, size: 64, offset: 3072)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !177, line: 137, size: 832, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !827, !828, !829, !830, !831, !832}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !177, line: 138, baseType: !60, size: 16)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !805, file: !177, line: 140, baseType: !60, size: 16, offset: 16)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !805, file: !177, line: 141, baseType: !122, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !805, file: !177, line: 142, baseType: !122, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !805, file: !177, line: 143, baseType: !60, size: 16, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !805, file: !177, line: 144, baseType: !60, size: 16, offset: 112)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !805, file: !177, line: 145, baseType: !19, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !805, file: !177, line: 147, baseType: !19, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !805, file: !177, line: 149, baseType: !504, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !805, file: !177, line: 150, baseType: !19, size: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !805, file: !177, line: 151, baseType: !60, size: 16, offset: 288)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !805, file: !177, line: 152, baseType: !60, size: 16, offset: 304)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !805, file: !177, line: 154, baseType: !31, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !805, file: !177, line: 155, baseType: !121, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !805, file: !177, line: 157, baseType: !122, size: 32, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !805, file: !177, line: 158, baseType: !60, size: 16, offset: 480)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !805, file: !177, line: 159, baseType: !60, size: 16, offset: 496)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !805, file: !177, line: 160, baseType: !60, size: 16, offset: 512)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !805, file: !177, line: 161, baseType: !826, size: 48, offset: 528)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 48, elements: !451)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !805, file: !177, line: 162, baseType: !122, size: 32, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !805, file: !177, line: 164, baseType: !122, size: 32, offset: 608)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !805, file: !177, line: 164, baseType: !122, size: 32, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !805, file: !177, line: 164, baseType: !122, size: 32, offset: 672)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !805, file: !177, line: 165, baseType: !749, size: 64, offset: 704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !805, file: !177, line: 167, baseType: !833, size: 64, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !275, line: 72, size: 3072, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !868, !869, !870, !871}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !834, file: !275, line: 73, baseType: !19, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !834, file: !275, line: 73, baseType: !19, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !834, file: !275, line: 74, baseType: !19, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !834, file: !275, line: 75, baseType: !19, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !834, file: !275, line: 77, baseType: !477, size: 128, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !834, file: !275, line: 77, baseType: !477, size: 128, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !834, file: !275, line: 79, baseType: !843, size: 2304, offset: 384)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 2304, elements: !377)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !275, line: 67, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !275, line: 55, size: 576, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !854, !855, !864, !865, !866, !867}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !845, file: !275, line: 56, baseType: !60, size: 16)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !845, file: !275, line: 56, baseType: !60, size: 16, offset: 16)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !845, file: !275, line: 58, baseType: !122, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !845, file: !275, line: 59, baseType: !122, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !845, file: !275, line: 59, baseType: !122, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !845, file: !275, line: 60, baseType: !853, size: 64, offset: 128)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !390)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !845, file: !275, line: 60, baseType: !853, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !845, file: !275, line: 61, baseType: !856, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !275, line: 47, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !275, line: 44, size: 96, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !858, file: !275, line: 45, baseType: !122, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !858, file: !275, line: 45, baseType: !122, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !858, file: !275, line: 46, baseType: !60, size: 16, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !858, file: !275, line: 46, baseType: !60, size: 16, offset: 80)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !845, file: !275, line: 62, baseType: !856, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !845, file: !275, line: 64, baseType: !856, size: 64, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !845, file: !275, line: 65, baseType: !853, size: 64, offset: 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !845, file: !275, line: 66, baseType: !853, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !834, file: !275, line: 80, baseType: !450, size: 96, offset: 2688)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !834, file: !275, line: 80, baseType: !450, size: 96, offset: 2784)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !834, file: !275, line: 81, baseType: !450, size: 96, offset: 2880)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !834, file: !275, line: 83, baseType: !450, size: 96, offset: 2976)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !595, file: !177, line: 255, baseType: !873, size: 64, offset: 3136)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !177, line: 170, size: 8704, elements: !875)
!875 = !{!876, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !874, file: !177, line: 171, baseType: !877, size: 96)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !451)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !874, file: !177, line: 172, baseType: !19, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !874, file: !177, line: 173, baseType: !60, size: 16, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !874, file: !177, line: 174, baseType: !60, size: 16, offset: 144)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !874, file: !177, line: 175, baseType: !60, size: 16, offset: 160)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !874, file: !177, line: 176, baseType: !60, size: 16, offset: 176)
