; ModuleID = 'blender/source/blender/editors/mesh/editmesh_extrude.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_extrude.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!160 = !DIEnumerator(name: "eModifierMode_Editmode", value: 4)
!161 = !DIEnumerator(name: "eModifierMode_OnCage", value: 8)
!162 = !DIEnumerator(name: "eModifierMode_Expanded", value: 16)
!163 = !DIEnumerator(name: "eModifierMode_Virtual", value: 32)
!164 = !DIEnumerator(name: "eModifierMode_ApplyOnSpline", value: 64)
!165 = !DIEnumerator(name: "eModifierMode_DisableTemporary", value: -2147483648)
!166 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 278, baseType: !5, size: 32, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175}
!168 = !DIEnumerator(name: "MOD_MIR_CLIPPING", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "MOD_MIR_MIRROR_U", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "MOD_MIR_MIRROR_V", value: 4, isUnsigned: true)
!171 = !DIEnumerator(name: "MOD_MIR_AXIS_X", value: 8, isUnsigned: true)
!172 = !DIEnumerator(name: "MOD_MIR_AXIS_Y", value: 16, isUnsigned: true)
!173 = !DIEnumerator(name: "MOD_MIR_AXIS_Z", value: 32, isUnsigned: true)
!174 = !DIEnumerator(name: "MOD_MIR_VGROUP", value: 64, isUnsigned: true)
!175 = !DIEnumerator(name: "MOD_MIR_NO_MERGE", value: 128, isUnsigned: true)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !177, line: 57, baseType: !5, size: 32, elements: !178)
!177 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192}
!179 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!180 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!181 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!182 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!183 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!184 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!185 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!186 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!187 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!188 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!189 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!190 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!191 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!192 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!193 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !88, line: 67, baseType: !5, size: 32, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203}
!195 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!196 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!197 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!198 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!199 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!200 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!201 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!202 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!203 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !205, line: 119, baseType: !5, size: 32, elements: !206)
!205 = !DIFile(filename: "blender/source/blender/editors/include/ED_view3d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!206 = !{!207, !208, !209, !210, !211}
!207 = !DIEnumerator(name: "V3D_PROJ_TEST_NOP", value: 0, isUnsigned: true)
!208 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_BB", value: 1, isUnsigned: true)
!209 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_WIN", value: 2, isUnsigned: true)
!210 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_NEAR", value: 4, isUnsigned: true)
!211 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_ZERO", value: 8, isUnsigned: true)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !205, line: 109, baseType: !5, size: 32, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219}
!214 = !DIEnumerator(name: "V3D_PROJ_RET_OK", value: 0, isUnsigned: true)
!215 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_NEAR", value: 1, isUnsigned: true)
!216 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_ZERO", value: 2, isUnsigned: true)
!217 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_BB", value: 3, isUnsigned: true)
!218 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_WIN", value: 4, isUnsigned: true)
!219 = !DIEnumerator(name: "V3D_PROJ_RET_OVERFLOW", value: 5, isUnsigned: true)
!220 = !{!221, !222, !287, !231, !1838, !1839, !1840, !1844, !1846, !244}
!221 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !75, line: 178, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !75, line: 164, size: 448, elements: !225)
!225 = !{!226, !237, !243, !284, !285, !286}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !224, file: !75, line: 165, baseType: !227, size: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !75, line: 82, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !75, line: 64, size: 128, elements: !229)
!229 = !{!230, !232, !233, !235, !236}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !75, line: 65, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !228, file: !75, line: 66, baseType: !156, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !228, file: !75, line: 73, baseType: !234, size: 8, offset: 96)
!234 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !228, file: !75, line: 74, baseType: !234, size: 8, offset: 104)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !228, file: !75, line: 80, baseType: !234, size: 8, offset: 112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !224, file: !75, line: 166, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !75, line: 180, size: 16, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !239, file: !75, line: 181, baseType: !242, size: 16)
!242 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !224, file: !75, line: 172, baseType: !244, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !75, line: 140, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !75, line: 125, size: 576, elements: !247)
!247 = !{!248, !249, !277, !278, !280, !281, !282, !283}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !246, file: !75, line: 126, baseType: !227, size: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !246, file: !75, line: 129, baseType: !250, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !75, line: 90, size: 448, elements: !252)
!252 = !{!253, !254, !255, !259, !260}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !251, file: !75, line: 91, baseType: !227, size: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !251, file: !75, line: 92, baseType: !238, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !251, file: !75, line: 94, baseType: !256, size: 96, offset: 192)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 96, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !251, file: !75, line: 95, baseType: !256, size: 96, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !251, file: !75, line: 102, baseType: !261, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !75, line: 110, size: 640, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !270, !276}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !262, file: !75, line: 111, baseType: !227, size: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !262, file: !75, line: 112, baseType: !238, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !262, file: !75, line: 114, baseType: !250, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !262, file: !75, line: 114, baseType: !250, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !262, file: !75, line: 118, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !262, file: !75, line: 122, baseType: !271, size: 128, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !75, line: 108, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !75, line: 106, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !75, line: 107, baseType: !261, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !75, line: 107, baseType: !261, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !262, file: !75, line: 122, baseType: !271, size: 128, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !246, file: !75, line: 130, baseType: !261, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !246, file: !75, line: 131, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !246, file: !75, line: 135, baseType: !269, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !246, file: !75, line: 135, baseType: !269, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !75, line: 139, baseType: !269, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !246, file: !75, line: 139, baseType: !269, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !224, file: !75, line: 174, baseType: !156, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !224, file: !75, line: 175, baseType: !256, size: 96, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !224, file: !75, line: 176, baseType: !242, size: 16, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "MirrorModifierData", file: !103, line: 275, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MirrorModifierData", file: !103, line: 268, size: 1024, elements: !290)
!290 = !{!291, !1834, !1835, !1836, !1837}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !289, file: !103, line: 269, baseType: !292, size: 896)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !103, line: 110, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !103, line: 99, size: 896, elements: !294)
!294 = !{!295, !297, !298, !299, !300, !301, !302, !306, !1833}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !103, line: 100, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !293, file: !103, line: 100, baseType: !296, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !293, file: !103, line: 102, baseType: !156, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !293, file: !103, line: 102, baseType: !156, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !293, file: !103, line: 103, baseType: !156, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !103, line: 103, baseType: !156, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !103, line: 104, baseType: !303, size: 512, offset: 256)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 512, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !293, file: !103, line: 107, baseType: !307, size: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !309, line: 1216, size: 39680, elements: !310)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !{!311, !376, !380, !668, !671, !672, !673, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !699, !772, !1200, !1416, !1419, !1707, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1729, !1730, !1731, !1732, !1733, !1741, !1808, !1815, !1816, !1823, !1824, !1825, !1826, !1827, !1828, !1829}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !309, line: 1217, baseType: !312, size: 960)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !313, line: 130, baseType: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !313, line: 117, size: 960, elements: !315)
!315 = !{!316, !317, !318, !320, !339, !343, !344, !345, !346, !347}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !313, line: 118, baseType: !231, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !314, file: !313, line: 118, baseType: !231, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !314, file: !313, line: 119, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !314, file: !313, line: 120, baseType: !321, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !313, line: 136, size: 17600, elements: !323)
!323 = !{!324, !325, !327, !330, !334, !335, !336}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !322, file: !313, line: 137, baseType: !312, size: 960)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !322, file: !313, line: 138, baseType: !326, size: 64, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !322, file: !313, line: 139, baseType: !328, size: 64, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !313, line: 43, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !313, line: 140, baseType: !331, size: 8192, offset: 1088)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 8192, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !322, file: !313, line: 141, baseType: !331, size: 8192, offset: 9280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !322, file: !313, line: 148, baseType: !321, size: 64, offset: 17472)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !322, file: !313, line: 150, baseType: !337, size: 64, offset: 17536)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !313, line: 45, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !313, line: 121, baseType: !340, size: 528, offset: 256)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 528, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 66)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !314, file: !313, line: 126, baseType: !242, size: 16, offset: 784)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !314, file: !313, line: 127, baseType: !156, size: 32, offset: 800)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !314, file: !313, line: 128, baseType: !156, size: 32, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !314, file: !313, line: 128, baseType: !156, size: 32, offset: 864)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !314, file: !313, line: 129, baseType: !348, size: 64, offset: 896)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !313, line: 75, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !313, line: 62, size: 1024, elements: !351)
!351 = !{!352, !354, !355, !356, !357, !358, !359, !360, !374, !375}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !313, line: 63, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !313, line: 63, baseType: !353, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !313, line: 64, baseType: !234, size: 8, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !350, file: !313, line: 64, baseType: !234, size: 8, offset: 136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !313, line: 65, baseType: !242, size: 16, offset: 144)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !313, line: 66, baseType: !303, size: 512, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !350, file: !313, line: 67, baseType: !156, size: 32, offset: 672)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !313, line: 69, baseType: !361, size: 256, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !313, line: 60, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !313, line: 48, size: 256, elements: !363)
!363 = !{!364, !365, !372, !373}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !362, file: !313, line: 49, baseType: !231, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !362, file: !313, line: 58, baseType: !366, size: 128, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !367, line: 71, baseType: !368)
!367 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !367, line: 69, size: 128, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !368, file: !367, line: 70, baseType: !231, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !368, file: !367, line: 70, baseType: !231, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !362, file: !313, line: 59, baseType: !156, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !362, file: !313, line: 59, baseType: !156, size: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !350, file: !313, line: 70, baseType: !156, size: 32, offset: 960)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !350, file: !313, line: 74, baseType: !156, size: 32, offset: 992)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !308, file: !309, line: 1218, baseType: !377, size: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !379, line: 45, flags: DIFlagFwdDecl)
!379 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!380 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !308, file: !309, line: 1220, baseType: !381, size: 64, offset: 1024)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !383, line: 115, size: 11392, elements: !384)
!383 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!384 = !{!385, !386, !387, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !404, !414, !428, !429, !470, !471, !474, !475, !491, !492, !493, !494, !495, !496, !497, !501, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !517, !518, !519, !520, !521, !522, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !582, !583, !584, !585, !586, !587, !588, !589, !590, !593, !596, !599, !600, !601, !602, !603, !606, !609, !612, !613, !619, !620, !621, !622, !623, !624, !626, !629, !632, !636, !656, !657}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !382, file: !383, line: 116, baseType: !312, size: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !382, file: !383, line: 117, baseType: !377, size: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !382, file: !383, line: 119, baseType: !388, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !383, line: 57, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !382, file: !383, line: 121, baseType: !242, size: 16, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !382, file: !383, line: 121, baseType: !242, size: 16, offset: 1104)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !382, file: !383, line: 122, baseType: !156, size: 32, offset: 1120)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !382, file: !383, line: 122, baseType: !156, size: 32, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !382, file: !383, line: 122, baseType: !156, size: 32, offset: 1184)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !382, file: !383, line: 123, baseType: !303, size: 512, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !382, file: !383, line: 124, baseType: !381, size: 64, offset: 1728)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !382, file: !383, line: 124, baseType: !381, size: 64, offset: 1792)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !382, file: !383, line: 127, baseType: !381, size: 64, offset: 1856)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !382, file: !383, line: 127, baseType: !381, size: 64, offset: 1920)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !382, file: !383, line: 127, baseType: !381, size: 64, offset: 1984)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !382, file: !383, line: 128, baseType: !402, size: 64, offset: 2048)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !379, line: 46, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !382, file: !383, line: 130, baseType: !405, size: 64, offset: 2112)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !383, line: 97, size: 832, elements: !407)
!407 = !{!408, !412, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !406, file: !383, line: 98, baseType: !409, size: 768)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 768, elements: !410)
!410 = !{!411, !258}
!411 = !DISubrange(count: 8)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !383, line: 99, baseType: !156, size: 32, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !406, file: !383, line: 99, baseType: !156, size: 32, offset: 800)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !382, file: !383, line: 131, baseType: !415, size: 64, offset: 2176)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !417, line: 486, size: 1600, elements: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !417, line: 487, baseType: !312, size: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !416, file: !417, line: 489, baseType: !366, size: 128, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !416, file: !417, line: 490, baseType: !366, size: 128, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !416, file: !417, line: 491, baseType: !366, size: 128, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !416, file: !417, line: 492, baseType: !366, size: 128, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !417, line: 494, baseType: !156, size: 32, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !416, file: !417, line: 495, baseType: !156, size: 32, offset: 1504)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !416, file: !417, line: 497, baseType: !156, size: 32, offset: 1536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !417, line: 498, baseType: !156, size: 32, offset: 1568)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !382, file: !383, line: 132, baseType: !415, size: 64, offset: 2240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !382, file: !383, line: 133, baseType: !430, size: 64, offset: 2304)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !417, line: 334, size: 1728, elements: !432)
!432 = !{!433, !434, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !469}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !431, file: !417, line: 335, baseType: !366, size: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !431, file: !417, line: 336, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !417, line: 47, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !417, line: 338, baseType: !242, size: 16, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !431, file: !417, line: 338, baseType: !242, size: 16, offset: 208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !431, file: !417, line: 339, baseType: !5, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !431, file: !417, line: 340, baseType: !156, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !431, file: !417, line: 342, baseType: !221, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !431, file: !417, line: 343, baseType: !256, size: 96, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !431, file: !417, line: 344, baseType: !256, size: 96, offset: 416)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !431, file: !417, line: 347, baseType: !366, size: 128, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !431, file: !417, line: 349, baseType: !156, size: 32, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !431, file: !417, line: 350, baseType: !156, size: 32, offset: 672)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !431, file: !417, line: 351, baseType: !231, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !431, file: !417, line: 352, baseType: !231, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !431, file: !417, line: 354, baseType: !450, size: 384, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !417, line: 116, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !417, line: 94, size: 384, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !451, file: !417, line: 96, baseType: !156, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !451, file: !417, line: 96, baseType: !156, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !451, file: !417, line: 97, baseType: !156, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !451, file: !417, line: 97, baseType: !156, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !451, file: !417, line: 99, baseType: !242, size: 16, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !451, file: !417, line: 100, baseType: !242, size: 16, offset: 144)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !451, file: !417, line: 102, baseType: !242, size: 16, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !451, file: !417, line: 105, baseType: !242, size: 16, offset: 176)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !451, file: !417, line: 108, baseType: !242, size: 16, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !451, file: !417, line: 109, baseType: !242, size: 16, offset: 208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !451, file: !417, line: 111, baseType: !242, size: 16, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !451, file: !417, line: 112, baseType: !242, size: 16, offset: 240)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !451, file: !417, line: 114, baseType: !156, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !451, file: !417, line: 114, baseType: !156, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !451, file: !417, line: 115, baseType: !156, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !451, file: !417, line: 115, baseType: !156, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !431, file: !417, line: 355, baseType: !303, size: 512, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !383, line: 134, baseType: !231, size: 64, offset: 2368)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !382, file: !383, line: 136, baseType: !472, size: 64, offset: 2432)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !383, line: 58, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !382, file: !383, line: 138, baseType: !450, size: 384, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !382, file: !383, line: 139, baseType: !476, size: 64, offset: 2880)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !417, line: 80, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !417, line: 72, size: 192, elements: !479)
!479 = !{!480, !487, !488, !489, !490}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !478, file: !417, line: 73, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !417, line: 59, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !417, line: 56, size: 128, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !483, file: !417, line: 57, baseType: !256, size: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !417, line: 58, baseType: !156, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !478, file: !417, line: 74, baseType: !156, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !478, file: !417, line: 76, baseType: !156, size: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !478, file: !417, line: 77, baseType: !156, size: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !417, line: 79, baseType: !156, size: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !382, file: !383, line: 141, baseType: !366, size: 128, offset: 2944)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !382, file: !383, line: 142, baseType: !366, size: 128, offset: 3072)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !382, file: !383, line: 143, baseType: !366, size: 128, offset: 3200)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !382, file: !383, line: 144, baseType: !366, size: 128, offset: 3328)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !382, file: !383, line: 146, baseType: !156, size: 32, offset: 3456)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !382, file: !383, line: 147, baseType: !156, size: 32, offset: 3488)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !382, file: !383, line: 150, baseType: !498, size: 64, offset: 3520)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !383, line: 50, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !382, file: !383, line: 151, baseType: !502, size: 64, offset: 3584)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !382, file: !383, line: 152, baseType: !156, size: 32, offset: 3648)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !382, file: !383, line: 153, baseType: !156, size: 32, offset: 3680)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !382, file: !383, line: 156, baseType: !256, size: 96, offset: 3712)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !382, file: !383, line: 156, baseType: !256, size: 96, offset: 3808)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !382, file: !383, line: 156, baseType: !256, size: 96, offset: 3904)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !382, file: !383, line: 157, baseType: !256, size: 96, offset: 4000)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !382, file: !383, line: 158, baseType: !256, size: 96, offset: 4096)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !382, file: !383, line: 159, baseType: !256, size: 96, offset: 4192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !382, file: !383, line: 160, baseType: !256, size: 96, offset: 4288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !382, file: !383, line: 160, baseType: !256, size: 96, offset: 4384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !382, file: !383, line: 161, baseType: !514, size: 128, offset: 4480)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 4)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !382, file: !383, line: 161, baseType: !514, size: 128, offset: 4608)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !382, file: !383, line: 162, baseType: !256, size: 96, offset: 4736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !382, file: !383, line: 162, baseType: !256, size: 96, offset: 4832)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !382, file: !383, line: 163, baseType: !221, size: 32, offset: 4928)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !382, file: !383, line: 163, baseType: !221, size: 32, offset: 4960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !382, file: !383, line: 164, baseType: !523, size: 512, offset: 4992)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 512, elements: !524)
!524 = !{!516, !516}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !382, file: !383, line: 165, baseType: !523, size: 512, offset: 5504)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !382, file: !383, line: 166, baseType: !523, size: 512, offset: 6016)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !382, file: !383, line: 167, baseType: !523, size: 512, offset: 6528)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !382, file: !383, line: 176, baseType: !523, size: 512, offset: 7040)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !382, file: !383, line: 178, baseType: !5, size: 32, offset: 7552)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !382, file: !383, line: 180, baseType: !242, size: 16, offset: 7584)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !382, file: !383, line: 181, baseType: !242, size: 16, offset: 7600)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !382, file: !383, line: 183, baseType: !242, size: 16, offset: 7616)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !382, file: !383, line: 183, baseType: !242, size: 16, offset: 7632)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !382, file: !383, line: 184, baseType: !242, size: 16, offset: 7648)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !382, file: !383, line: 184, baseType: !242, size: 16, offset: 7664)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !382, file: !383, line: 185, baseType: !242, size: 16, offset: 7680)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !382, file: !383, line: 186, baseType: !242, size: 16, offset: 7696)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !382, file: !383, line: 187, baseType: !242, size: 16, offset: 7712)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !382, file: !383, line: 188, baseType: !234, size: 8, offset: 7728)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !382, file: !383, line: 189, baseType: !234, size: 8, offset: 7736)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !382, file: !383, line: 192, baseType: !156, size: 32, offset: 7744)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !382, file: !383, line: 192, baseType: !156, size: 32, offset: 7776)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !382, file: !383, line: 192, baseType: !156, size: 32, offset: 7808)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !382, file: !383, line: 192, baseType: !156, size: 32, offset: 7840)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !382, file: !383, line: 194, baseType: !156, size: 32, offset: 7872)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !382, file: !383, line: 202, baseType: !221, size: 32, offset: 7904)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !382, file: !383, line: 202, baseType: !221, size: 32, offset: 7936)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !382, file: !383, line: 202, baseType: !221, size: 32, offset: 7968)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !382, file: !383, line: 211, baseType: !221, size: 32, offset: 8000)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !382, file: !383, line: 212, baseType: !221, size: 32, offset: 8032)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !382, file: !383, line: 213, baseType: !221, size: 32, offset: 8064)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !382, file: !383, line: 214, baseType: !221, size: 32, offset: 8096)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !382, file: !383, line: 215, baseType: !221, size: 32, offset: 8128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !382, file: !383, line: 216, baseType: !221, size: 32, offset: 8160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !382, file: !383, line: 219, baseType: !221, size: 32, offset: 8192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !382, file: !383, line: 220, baseType: !221, size: 32, offset: 8224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !382, file: !383, line: 221, baseType: !221, size: 32, offset: 8256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !382, file: !383, line: 224, baseType: !559, size: 16, offset: 8288)
!559 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !382, file: !383, line: 224, baseType: !559, size: 16, offset: 8304)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !382, file: !383, line: 226, baseType: !242, size: 16, offset: 8320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !382, file: !383, line: 228, baseType: !234, size: 8, offset: 8336)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !382, file: !383, line: 229, baseType: !234, size: 8, offset: 8344)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !382, file: !383, line: 231, baseType: !242, size: 16, offset: 8352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !382, file: !383, line: 232, baseType: !234, size: 8, offset: 8368)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !382, file: !383, line: 233, baseType: !234, size: 8, offset: 8376)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !382, file: !383, line: 234, baseType: !221, size: 32, offset: 8384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !382, file: !383, line: 235, baseType: !221, size: 32, offset: 8416)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !382, file: !383, line: 237, baseType: !366, size: 128, offset: 8448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !382, file: !383, line: 238, baseType: !366, size: 128, offset: 8576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !382, file: !383, line: 239, baseType: !366, size: 128, offset: 8704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !382, file: !383, line: 240, baseType: !366, size: 128, offset: 8832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !382, file: !383, line: 242, baseType: !221, size: 32, offset: 8960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !382, file: !383, line: 244, baseType: !242, size: 16, offset: 8992)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !382, file: !383, line: 245, baseType: !559, size: 16, offset: 9008)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !382, file: !383, line: 246, baseType: !514, size: 128, offset: 9024)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !382, file: !383, line: 248, baseType: !156, size: 32, offset: 9152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !382, file: !383, line: 249, baseType: !156, size: 32, offset: 9184)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !382, file: !383, line: 251, baseType: !580, size: 64, offset: 9216)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !383, line: 251, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !382, file: !383, line: 253, baseType: !234, size: 8, offset: 9280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !382, file: !383, line: 254, baseType: !234, size: 8, offset: 9288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !382, file: !383, line: 255, baseType: !242, size: 16, offset: 9296)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !382, file: !383, line: 256, baseType: !256, size: 96, offset: 9312)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !382, file: !383, line: 258, baseType: !366, size: 128, offset: 9408)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !382, file: !383, line: 259, baseType: !366, size: 128, offset: 9536)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !382, file: !383, line: 260, baseType: !366, size: 128, offset: 9664)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !382, file: !383, line: 261, baseType: !366, size: 128, offset: 9792)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !382, file: !383, line: 263, baseType: !591, size: 64, offset: 9920)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !383, line: 52, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !382, file: !383, line: 264, baseType: !594, size: 64, offset: 9984)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !383, line: 53, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !382, file: !383, line: 265, baseType: !597, size: 64, offset: 10048)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !417, line: 46, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !382, file: !383, line: 267, baseType: !234, size: 8, offset: 10112)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !382, file: !383, line: 268, baseType: !234, size: 8, offset: 10120)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !382, file: !383, line: 269, baseType: !242, size: 16, offset: 10128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !382, file: !383, line: 270, baseType: !221, size: 32, offset: 10144)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !382, file: !383, line: 272, baseType: !604, size: 64, offset: 10176)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !103, line: 732, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !382, file: !383, line: 275, baseType: !607, size: 64, offset: 10240)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !383, line: 275, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !382, file: !383, line: 277, baseType: !610, size: 64, offset: 10304)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !103, line: 592, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !382, file: !383, line: 277, baseType: !610, size: 64, offset: 10368)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !382, file: !383, line: 278, baseType: !614, size: 64, offset: 10432)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !615, line: 27, baseType: !616)
!615 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !617, line: 45, baseType: !618)
!617 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!618 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !382, file: !383, line: 279, baseType: !614, size: 64, offset: 10496)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !382, file: !383, line: 280, baseType: !5, size: 32, offset: 10560)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !382, file: !383, line: 281, baseType: !5, size: 32, offset: 10592)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !382, file: !383, line: 283, baseType: !366, size: 128, offset: 10624)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !382, file: !383, line: 284, baseType: !366, size: 128, offset: 10752)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !382, file: !383, line: 285, baseType: !625, size: 64, offset: 10880)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !382, file: !383, line: 287, baseType: !627, size: 64, offset: 10944)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !383, line: 59, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !382, file: !383, line: 288, baseType: !630, size: 64, offset: 11008)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !383, line: 288, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !382, file: !383, line: 290, baseType: !633, size: 64, offset: 11072)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 64, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 2)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !382, file: !383, line: 291, baseType: !637, size: 64, offset: 11136)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !639, line: 65, baseType: !640)
!639 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !639, line: 50, size: 320, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !640, file: !639, line: 51, baseType: !307, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !640, file: !639, line: 53, baseType: !156, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !640, file: !639, line: 54, baseType: !156, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !640, file: !639, line: 55, baseType: !156, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !640, file: !639, line: 55, baseType: !156, size: 32, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !640, file: !639, line: 56, baseType: !234, size: 8, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !640, file: !639, line: 56, baseType: !234, size: 8, offset: 200)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !640, file: !639, line: 57, baseType: !234, size: 8, offset: 208)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !640, file: !639, line: 57, baseType: !234, size: 8, offset: 216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !640, file: !639, line: 59, baseType: !242, size: 16, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !640, file: !639, line: 59, baseType: !242, size: 16, offset: 240)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !640, file: !639, line: 59, baseType: !242, size: 16, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !640, file: !639, line: 61, baseType: !242, size: 16, offset: 272)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !640, file: !639, line: 63, baseType: !156, size: 32, offset: 288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !382, file: !383, line: 293, baseType: !366, size: 128, offset: 11200)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !382, file: !383, line: 294, baseType: !658, size: 64, offset: 11328)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !383, line: 113, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !383, line: 108, size: 256, elements: !661)
!661 = !{!662, !664, !665, !666, !667}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !383, line: 109, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !383, line: 109, baseType: !663, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !660, file: !383, line: 110, baseType: !381, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !660, file: !383, line: 111, baseType: !156, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !660, file: !383, line: 112, baseType: !221, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !308, file: !309, line: 1221, baseType: !669, size: 64, offset: 1088)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !309, line: 52, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 1223, baseType: !307, size: 64, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !308, file: !309, line: 1225, baseType: !366, size: 128, offset: 1216)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !308, file: !309, line: 1226, baseType: !674, size: 64, offset: 1344)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !309, line: 69, size: 320, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !309, line: 70, baseType: !674, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !675, file: !309, line: 70, baseType: !674, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !675, file: !309, line: 71, baseType: !5, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !675, file: !309, line: 71, baseType: !5, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !675, file: !309, line: 72, baseType: !156, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !675, file: !309, line: 73, baseType: !242, size: 16, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !675, file: !309, line: 73, baseType: !242, size: 16, offset: 240)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !675, file: !309, line: 74, baseType: !381, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !308, file: !309, line: 1227, baseType: !381, size: 64, offset: 1408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !308, file: !309, line: 1229, baseType: !256, size: 96, offset: 1472)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !308, file: !309, line: 1230, baseType: !256, size: 96, offset: 1568)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !308, file: !309, line: 1231, baseType: !256, size: 96, offset: 1664)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !308, file: !309, line: 1231, baseType: !256, size: 96, offset: 1760)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !308, file: !309, line: 1233, baseType: !5, size: 32, offset: 1856)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !308, file: !309, line: 1234, baseType: !156, size: 32, offset: 1888)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !308, file: !309, line: 1235, baseType: !5, size: 32, offset: 1920)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !308, file: !309, line: 1237, baseType: !242, size: 16, offset: 1952)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !308, file: !309, line: 1239, baseType: !234, size: 8, offset: 1968)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !308, file: !309, line: 1240, baseType: !696, size: 8, offset: 1976)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 8, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 1)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !308, file: !309, line: 1242, baseType: !700, size: 64, offset: 1984)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !702, line: 328, size: 3456, elements: !703)
!702 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!703 = !{!704, !705, !706, !709, !710, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !738, !739, !740, !743, !748, !749, !752, !756, !760, !764, !768, !769, !770, !771}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !701, file: !702, line: 329, baseType: !312, size: 960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !701, file: !702, line: 330, baseType: !377, size: 64, offset: 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !701, file: !702, line: 332, baseType: !707, size: 64, offset: 1024)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !702, line: 332, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !701, file: !702, line: 333, baseType: !303, size: 512, offset: 1088)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !701, file: !702, line: 335, baseType: !711, size: 64, offset: 1600)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !701, file: !702, line: 337, baseType: !472, size: 64, offset: 1664)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !701, file: !702, line: 338, baseType: !633, size: 64, offset: 1728)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !701, file: !702, line: 340, baseType: !366, size: 128, offset: 1792)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !701, file: !702, line: 340, baseType: !366, size: 128, offset: 1920)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !701, file: !702, line: 342, baseType: !156, size: 32, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !701, file: !702, line: 342, baseType: !156, size: 32, offset: 2080)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !701, file: !702, line: 343, baseType: !156, size: 32, offset: 2112)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !701, file: !702, line: 345, baseType: !156, size: 32, offset: 2144)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !701, file: !702, line: 346, baseType: !156, size: 32, offset: 2176)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !701, file: !702, line: 347, baseType: !242, size: 16, offset: 2208)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !701, file: !702, line: 348, baseType: !242, size: 16, offset: 2224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !701, file: !702, line: 349, baseType: !156, size: 32, offset: 2240)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !701, file: !702, line: 351, baseType: !156, size: 32, offset: 2272)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !701, file: !702, line: 353, baseType: !242, size: 16, offset: 2304)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !701, file: !702, line: 354, baseType: !242, size: 16, offset: 2320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !701, file: !702, line: 355, baseType: !156, size: 32, offset: 2336)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !701, file: !702, line: 357, baseType: !730, size: 128, offset: 2368)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !731, line: 95, baseType: !732)
!731 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !731, line: 92, size: 128, elements: !733)
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !732, file: !731, line: 93, baseType: !221, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !732, file: !731, line: 93, baseType: !221, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !732, file: !731, line: 94, baseType: !221, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !732, file: !731, line: 94, baseType: !221, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !701, file: !702, line: 363, baseType: !366, size: 128, offset: 2496)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !701, file: !702, line: 363, baseType: !366, size: 128, offset: 2624)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !701, file: !702, line: 368, baseType: !741, size: 64, offset: 2752)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !702, line: 48, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !701, file: !702, line: 372, baseType: !744, size: 32, offset: 2816)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !702, line: 274, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !702, line: 271, size: 32, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !745, file: !702, line: 273, baseType: !5, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !702, line: 373, baseType: !156, size: 32, offset: 2848)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !701, file: !702, line: 382, baseType: !750, size: 64, offset: 2880)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !702, line: 46, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !701, file: !702, line: 385, baseType: !753, size: 64, offset: 2944)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !231, !221}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !701, file: !702, line: 386, baseType: !757, size: 64, offset: 3008)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !231, !502}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !701, file: !702, line: 387, baseType: !761, size: 64, offset: 3072)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!156, !231}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !701, file: !702, line: 388, baseType: !765, size: 64, offset: 3136)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !231}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !701, file: !702, line: 389, baseType: !231, size: 64, offset: 3200)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !701, file: !702, line: 389, baseType: !231, size: 64, offset: 3264)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !701, file: !702, line: 389, baseType: !231, size: 64, offset: 3328)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !701, file: !702, line: 389, baseType: !231, size: 64, offset: 3392)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !308, file: !309, line: 1244, baseType: !773, size: 64, offset: 2048)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !775, line: 200, size: 17024, elements: !776)
!775 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!776 = !{!777, !778, !779, !780, !1193, !1194, !1195, !1196, !1197, !1198, !1199}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !774, file: !775, line: 201, baseType: !625, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !774, file: !775, line: 202, baseType: !366, size: 128, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !774, file: !775, line: 203, baseType: !366, size: 128, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !774, file: !775, line: 206, baseType: !781, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !775, line: 190, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !775, line: 126, size: 2816, elements: !784)
!784 = !{!785, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !883, !884, !885, !886, !1164, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1192}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !775, line: 127, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !783, file: !775, line: 127, baseType: !786, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !783, file: !775, line: 128, baseType: !231, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !783, file: !775, line: 129, baseType: !231, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !775, line: 130, baseType: !303, size: 512, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !783, file: !775, line: 132, baseType: !156, size: 32, offset: 768)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !775, line: 132, baseType: !156, size: 32, offset: 800)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !783, file: !775, line: 133, baseType: !156, size: 32, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !783, file: !775, line: 134, baseType: !156, size: 32, offset: 864)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !783, file: !775, line: 134, baseType: !156, size: 32, offset: 896)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !783, file: !775, line: 134, baseType: !156, size: 32, offset: 928)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !783, file: !775, line: 135, baseType: !156, size: 32, offset: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !783, file: !775, line: 135, baseType: !156, size: 32, offset: 992)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !783, file: !775, line: 136, baseType: !156, size: 32, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !783, file: !775, line: 136, baseType: !156, size: 32, offset: 1056)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !783, file: !775, line: 137, baseType: !156, size: 32, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !783, file: !775, line: 137, baseType: !156, size: 32, offset: 1120)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !783, file: !775, line: 138, baseType: !221, size: 32, offset: 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !783, file: !775, line: 139, baseType: !221, size: 32, offset: 1184)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !783, file: !775, line: 139, baseType: !221, size: 32, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !783, file: !775, line: 141, baseType: !242, size: 16, offset: 1248)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !783, file: !775, line: 142, baseType: !242, size: 16, offset: 1264)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !783, file: !775, line: 143, baseType: !156, size: 32, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !783, file: !775, line: 144, baseType: !156, size: 32, offset: 1312)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !783, file: !775, line: 146, baseType: !811, size: 64, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !775, line: 114, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !775, line: 99, size: 7232, elements: !814)
!814 = !{!815, !817, !818, !819, !820, !821, !822, !833, !837, !851, !860, !867, !877}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !813, file: !775, line: 100, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !813, file: !775, line: 100, baseType: !816, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !813, file: !775, line: 101, baseType: !156, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !813, file: !775, line: 101, baseType: !156, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !813, file: !775, line: 102, baseType: !156, size: 32, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !813, file: !775, line: 102, baseType: !156, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !813, file: !775, line: 103, baseType: !823, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !775, line: 59, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !775, line: 56, size: 2112, elements: !826)
!826 = !{!827, !831, !832}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !825, file: !775, line: 57, baseType: !828, size: 2048)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 2048, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !825, file: !775, line: 58, baseType: !156, size: 32, offset: 2048)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !825, file: !775, line: 58, baseType: !156, size: 32, offset: 2080)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !813, file: !775, line: 106, baseType: !834, size: 6144, offset: 320)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 6144, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !813, file: !775, line: 107, baseType: !838, size: 64, offset: 6464)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !775, line: 97, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !775, line: 83, size: 8320, elements: !841)
!841 = !{!842, !843, !844, !847, !848, !849, !850}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !840, file: !775, line: 84, baseType: !834, size: 6144)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !840, file: !775, line: 87, baseType: !828, size: 2048, offset: 6144)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !840, file: !775, line: 88, baseType: !845, size: 64, offset: 8192)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !639, line: 41, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !840, file: !775, line: 90, baseType: !242, size: 16, offset: 8256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !840, file: !775, line: 92, baseType: !242, size: 16, offset: 8272)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !840, file: !775, line: 93, baseType: !242, size: 16, offset: 8288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !840, file: !775, line: 95, baseType: !242, size: 16, offset: 8304)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !813, file: !775, line: 108, baseType: !852, size: 64, offset: 6528)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !775, line: 66, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !775, line: 61, size: 128, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !854, file: !775, line: 62, baseType: !156, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !854, file: !775, line: 63, baseType: !156, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !854, file: !775, line: 64, baseType: !156, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !854, file: !775, line: 65, baseType: !156, size: 32, offset: 96)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !813, file: !775, line: 109, baseType: !861, size: 64, offset: 6592)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !775, line: 71, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !775, line: 68, size: 64, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !863, file: !775, line: 69, baseType: !156, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !863, file: !775, line: 70, baseType: !156, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !813, file: !775, line: 110, baseType: !868, size: 64, offset: 6656)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !775, line: 81, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !775, line: 73, size: 352, elements: !871)
!871 = !{!872, !873, !874, !875, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !870, file: !775, line: 74, baseType: !256, size: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !870, file: !775, line: 75, baseType: !256, size: 96, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !870, file: !775, line: 76, baseType: !256, size: 96, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !870, file: !775, line: 77, baseType: !156, size: 32, offset: 288)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !870, file: !775, line: 78, baseType: !156, size: 32, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !813, file: !775, line: 113, baseType: !878, size: 512, offset: 6720)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !879, line: 182, baseType: !880)
!879 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !879, line: 180, size: 512, elements: !881)
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !880, file: !879, line: 181, baseType: !303, size: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !783, file: !775, line: 148, baseType: !402, size: 64, offset: 1408)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !783, file: !775, line: 151, baseType: !307, size: 64, offset: 1472)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !783, file: !775, line: 152, baseType: !381, size: 64, offset: 1536)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !783, file: !775, line: 153, baseType: !887, size: 64, offset: 1600)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !889, line: 64, size: 19136, elements: !890)
!889 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!890 = !{!891, !892, !893, !894, !895, !896, !898, !899, !900, !901, !904, !905, !1150, !1151, !1159, !1160, !1161, !1162, !1163}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !888, file: !889, line: 65, baseType: !312, size: 960)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !888, file: !889, line: 66, baseType: !377, size: 64, offset: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !888, file: !889, line: 68, baseType: !331, size: 8192, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !888, file: !889, line: 70, baseType: !156, size: 32, offset: 9216)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !888, file: !889, line: 71, baseType: !156, size: 32, offset: 9248)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !888, file: !889, line: 72, baseType: !897, size: 64, offset: 9280)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 64, elements: !634)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !888, file: !889, line: 74, baseType: !221, size: 32, offset: 9344)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !888, file: !889, line: 74, baseType: !221, size: 32, offset: 9376)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !888, file: !889, line: 76, baseType: !845, size: 64, offset: 9408)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !888, file: !889, line: 77, baseType: !902, size: 64, offset: 9472)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !889, line: 77, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !888, file: !889, line: 78, baseType: !472, size: 64, offset: 9536)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !888, file: !889, line: 80, baseType: !906, size: 2624, offset: 9600)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !907, line: 340, size: 2624, elements: !908)
!907 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!908 = !{!909, !937, !955, !956, !957, !972, !1030, !1031, !1130, !1131, !1132, !1133, !1139}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !906, file: !907, line: 341, baseType: !910, size: 576)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !907, line: 251, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !907, line: 207, size: 576, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !911, file: !907, line: 208, baseType: !156, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !911, file: !907, line: 211, baseType: !242, size: 16, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !911, file: !907, line: 212, baseType: !242, size: 16, offset: 48)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !911, file: !907, line: 213, baseType: !221, size: 32, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !911, file: !907, line: 214, baseType: !242, size: 16, offset: 96)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !911, file: !907, line: 215, baseType: !242, size: 16, offset: 112)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !911, file: !907, line: 216, baseType: !242, size: 16, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !911, file: !907, line: 217, baseType: !242, size: 16, offset: 144)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !911, file: !907, line: 218, baseType: !242, size: 16, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !911, file: !907, line: 219, baseType: !242, size: 16, offset: 176)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !911, file: !907, line: 220, baseType: !221, size: 32, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !911, file: !907, line: 222, baseType: !242, size: 16, offset: 224)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !911, file: !907, line: 225, baseType: !242, size: 16, offset: 240)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !911, file: !907, line: 228, baseType: !156, size: 32, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !911, file: !907, line: 229, baseType: !156, size: 32, offset: 288)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !911, file: !907, line: 233, baseType: !156, size: 32, offset: 320)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !911, file: !907, line: 236, baseType: !242, size: 16, offset: 352)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !911, file: !907, line: 236, baseType: !242, size: 16, offset: 368)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !911, file: !907, line: 241, baseType: !221, size: 32, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !911, file: !907, line: 244, baseType: !156, size: 32, offset: 416)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !911, file: !907, line: 244, baseType: !156, size: 32, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !911, file: !907, line: 245, baseType: !221, size: 32, offset: 480)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !911, file: !907, line: 248, baseType: !221, size: 32, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !911, file: !907, line: 250, baseType: !156, size: 32, offset: 544)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !906, file: !907, line: 342, baseType: !938, size: 448, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !907, line: 79, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !907, line: 61, size: 448, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !939, file: !907, line: 62, baseType: !231, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !939, file: !907, line: 64, baseType: !242, size: 16, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !939, file: !907, line: 65, baseType: !242, size: 16, offset: 80)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !939, file: !907, line: 67, baseType: !221, size: 32, offset: 96)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !939, file: !907, line: 68, baseType: !221, size: 32, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !939, file: !907, line: 69, baseType: !221, size: 32, offset: 160)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !939, file: !907, line: 70, baseType: !242, size: 16, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !939, file: !907, line: 71, baseType: !242, size: 16, offset: 208)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !939, file: !907, line: 72, baseType: !633, size: 64, offset: 224)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !939, file: !907, line: 75, baseType: !221, size: 32, offset: 288)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !939, file: !907, line: 75, baseType: !221, size: 32, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !939, file: !907, line: 75, baseType: !221, size: 32, offset: 352)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !939, file: !907, line: 78, baseType: !221, size: 32, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !939, file: !907, line: 78, baseType: !221, size: 32, offset: 416)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !906, file: !907, line: 343, baseType: !366, size: 128, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !906, file: !907, line: 344, baseType: !366, size: 128, offset: 1152)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !906, file: !907, line: 345, baseType: !958, size: 192, offset: 1280)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !907, line: 278, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !907, line: 270, size: 192, elements: !960)
!960 = !{!961, !962, !963, !964, !965}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !959, file: !907, line: 271, baseType: !156, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !959, file: !907, line: 273, baseType: !221, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !959, file: !907, line: 275, baseType: !156, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !959, file: !907, line: 276, baseType: !156, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !959, file: !907, line: 277, baseType: !966, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !907, line: 55, size: 576, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !967, file: !907, line: 56, baseType: !156, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !967, file: !907, line: 57, baseType: !221, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !967, file: !907, line: 58, baseType: !523, size: 512, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !906, file: !907, line: 346, baseType: !973, size: 384, offset: 1472)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !907, line: 268, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !907, line: 253, size: 384, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !1024, !1025, !1026, !1027, !1028, !1029}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !974, file: !907, line: 254, baseType: !156, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !974, file: !907, line: 255, baseType: !156, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !974, file: !907, line: 255, baseType: !156, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !974, file: !907, line: 258, baseType: !221, size: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !974, file: !907, line: 259, baseType: !981, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !907, line: 164, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !907, line: 108, size: 1664, elements: !984)
!984 = !{!985, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !907, line: 109, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !983, file: !907, line: 109, baseType: !986, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !907, line: 111, baseType: !303, size: 512, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !983, file: !907, line: 119, baseType: !633, size: 64, offset: 640)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !983, file: !907, line: 119, baseType: !633, size: 64, offset: 704)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !983, file: !907, line: 125, baseType: !633, size: 64, offset: 768)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !983, file: !907, line: 125, baseType: !633, size: 64, offset: 832)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !983, file: !907, line: 127, baseType: !633, size: 64, offset: 896)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !983, file: !907, line: 130, baseType: !156, size: 32, offset: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !983, file: !907, line: 131, baseType: !156, size: 32, offset: 992)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !983, file: !907, line: 132, baseType: !997, size: 64, offset: 1024)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !907, line: 106, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !907, line: 81, size: 512, elements: !1000)
!1000 = !{!1001, !1002, !1005, !1006, !1007, !1008}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !999, file: !907, line: 82, baseType: !633, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !999, file: !907, line: 97, baseType: !1003, size: 256, offset: 64)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 256, elements: !1004)
!1004 = !{!516, !635}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !999, file: !907, line: 102, baseType: !633, size: 64, offset: 320)
