; ModuleID = 'blender/source/blender/editors/space_nla/nla_select.c'
source_filename = "blender/source/blender/editors/space_nla/nla_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!128 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !{!130, !131, !132, !133}
!130 = !DIEnumerator(name: "SNLA_DRAWTIME", value: 4, isUnsigned: true)
!131 = !DIEnumerator(name: "SNLA_NODRAWCFRANUM", value: 16, isUnsigned: true)
!132 = !DIEnumerator(name: "SNLA_NOSTRIPCURVES", value: 32, isUnsigned: true)
!133 = !DIEnumerator(name: "SNLA_NOREALTIMEUPDATES", value: 64, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnim_ChannelType", file: !70, line: 132, baseType: !7, size: 32, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!136 = !DIEnumerator(name: "ANIMTYPE_NONE", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "ANIMTYPE_ANIMDATA", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "ANIMTYPE_SPECIALDATA", value: 2, isUnsigned: true)
!139 = !DIEnumerator(name: "ANIMTYPE_SUMMARY", value: 3, isUnsigned: true)
!140 = !DIEnumerator(name: "ANIMTYPE_SCENE", value: 4, isUnsigned: true)
!141 = !DIEnumerator(name: "ANIMTYPE_OBJECT", value: 5, isUnsigned: true)
!142 = !DIEnumerator(name: "ANIMTYPE_GROUP", value: 6, isUnsigned: true)
!143 = !DIEnumerator(name: "ANIMTYPE_FCURVE", value: 7, isUnsigned: true)
!144 = !DIEnumerator(name: "ANIMTYPE_FILLACTD", value: 8, isUnsigned: true)
!145 = !DIEnumerator(name: "ANIMTYPE_FILLDRIVERS", value: 9, isUnsigned: true)
!146 = !DIEnumerator(name: "ANIMTYPE_DSMAT", value: 10, isUnsigned: true)
!147 = !DIEnumerator(name: "ANIMTYPE_DSLAM", value: 11, isUnsigned: true)
!148 = !DIEnumerator(name: "ANIMTYPE_DSCAM", value: 12, isUnsigned: true)
!149 = !DIEnumerator(name: "ANIMTYPE_DSCUR", value: 13, isUnsigned: true)
!150 = !DIEnumerator(name: "ANIMTYPE_DSSKEY", value: 14, isUnsigned: true)
!151 = !DIEnumerator(name: "ANIMTYPE_DSWOR", value: 15, isUnsigned: true)
!152 = !DIEnumerator(name: "ANIMTYPE_DSNTREE", value: 16, isUnsigned: true)
!153 = !DIEnumerator(name: "ANIMTYPE_DSPART", value: 17, isUnsigned: true)
!154 = !DIEnumerator(name: "ANIMTYPE_DSMBALL", value: 18, isUnsigned: true)
!155 = !DIEnumerator(name: "ANIMTYPE_DSARM", value: 19, isUnsigned: true)
!156 = !DIEnumerator(name: "ANIMTYPE_DSMESH", value: 20, isUnsigned: true)
!157 = !DIEnumerator(name: "ANIMTYPE_DSTEX", value: 21, isUnsigned: true)
!158 = !DIEnumerator(name: "ANIMTYPE_DSLAT", value: 22, isUnsigned: true)
!159 = !DIEnumerator(name: "ANIMTYPE_DSLINESTYLE", value: 23, isUnsigned: true)
!160 = !DIEnumerator(name: "ANIMTYPE_DSSPK", value: 24, isUnsigned: true)
!161 = !DIEnumerator(name: "ANIMTYPE_SHAPEKEY", value: 25, isUnsigned: true)
!162 = !DIEnumerator(name: "ANIMTYPE_GPDATABLOCK", value: 26, isUnsigned: true)
!163 = !DIEnumerator(name: "ANIMTYPE_GPLAYER", value: 27, isUnsigned: true)
!164 = !DIEnumerator(name: "ANIMTYPE_MASKDATABLOCK", value: 28, isUnsigned: true)
!165 = !DIEnumerator(name: "ANIMTYPE_MASKLAYER", value: 29, isUnsigned: true)
!166 = !DIEnumerator(name: "ANIMTYPE_NLATRACK", value: 30, isUnsigned: true)
!167 = !DIEnumerator(name: "ANIMTYPE_NLAACTION", value: 31, isUnsigned: true)
!168 = !DIEnumerator(name: "ANIMTYPE_NUM_TYPES", value: 32, isUnsigned: true)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !170, line: 141, baseType: !7, size: 32, elements: !171)
!170 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!172 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!173 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!174 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!175 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!176 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!177 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!178 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!179 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!180 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!181 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!182 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!183 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaTrack_Flag", file: !87, line: 685, baseType: !7, size: 32, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191}
!186 = !DIEnumerator(name: "NLATRACK_ACTIVE", value: 1, isUnsigned: true)
!187 = !DIEnumerator(name: "NLATRACK_SELECTED", value: 2, isUnsigned: true)
!188 = !DIEnumerator(name: "NLATRACK_MUTED", value: 4, isUnsigned: true)
!189 = !DIEnumerator(name: "NLATRACK_SOLO", value: 8, isUnsigned: true)
!190 = !DIEnumerator(name: "NLATRACK_PROTECTED", value: 16, isUnsigned: true)
!191 = !DIEnumerator(name: "NLATRACK_DISABLED", value: 1024, isUnsigned: true)
!192 = !{!193, !194, !215, !228}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaTrack", file: !87, line: 682, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaTrack", file: !87, line: 673, size: 832, elements: !197)
!197 = !{!198, !200, !201, !208, !209, !210}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !87, line: 674, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !196, file: !87, line: 674, baseType: !199, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !196, file: !87, line: 676, baseType: !202, size: 128, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !203, line: 71, baseType: !204)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !203, line: 69, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !204, file: !203, line: 70, baseType: !193, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !204, file: !203, line: 70, baseType: !193, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !196, file: !87, line: 678, baseType: !42, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !196, file: !87, line: 679, baseType: !42, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !87, line: 681, baseType: !211, size: 512, offset: 320)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 512, elements: !213)
!212 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!213 = !{!214}
!214 = !DISubrange(count: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceNla", file: !128, line: 399, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNla", file: !128, line: 386, size: 1856, elements: !218)
!218 = !{!219, !234, !235, !236, !237, !238, !239, !240, !241, !242, !315}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !128, line: 387, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !128, line: 85, size: 448, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !229}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !128, line: 86, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !221, file: !128, line: 86, baseType: !220, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !221, file: !128, line: 87, baseType: !202, size: 128, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !221, file: !128, line: 88, baseType: !42, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !221, file: !128, line: 89, baseType: !228, size: 32, offset: 288)
!228 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !221, file: !128, line: 90, baseType: !230, size: 128, offset: 320)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 128, elements: !232)
!231 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!232 = !{!233}
!233 = !DISubrange(count: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !217, file: !128, line: 387, baseType: !220, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !217, file: !128, line: 388, baseType: !202, size: 128, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !217, file: !128, line: 389, baseType: !42, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !217, file: !128, line: 390, baseType: !228, size: 32, offset: 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !217, file: !128, line: 391, baseType: !230, size: 128, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "autosnap", scope: !217, file: !128, line: 393, baseType: !231, size: 16, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !217, file: !128, line: 394, baseType: !231, size: 16, offset: 464)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !217, file: !128, line: 395, baseType: !42, size: 32, offset: 480)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !217, file: !128, line: 397, baseType: !243, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDopeSheet", file: !245, line: 519, size: 896, elements: !246)
!245 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!246 = !{!247, !306, !307, !310, !311, !312, !313, !314}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !244, file: !245, line: 520, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !250, line: 130, baseType: !251)
!250 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !250, line: 117, size: 960, elements: !252)
!252 = !{!253, !254, !255, !257, !275, !279, !280, !281, !282, !283}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !250, line: 118, baseType: !193, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !250, line: 118, baseType: !193, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !251, file: !250, line: 119, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !251, file: !250, line: 120, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !250, line: 136, size: 17600, elements: !260)
!260 = !{!261, !262, !263, !266, !270, !271, !272}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !259, file: !250, line: 137, baseType: !249, size: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !259, file: !250, line: 138, baseType: !248, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !259, file: !250, line: 139, baseType: !264, size: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !250, line: 43, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !250, line: 140, baseType: !267, size: 8192, offset: 1088)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 8192, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !259, file: !250, line: 141, baseType: !267, size: 8192, offset: 9280)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !259, file: !250, line: 148, baseType: !258, size: 64, offset: 17472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !259, file: !250, line: 150, baseType: !273, size: 64, offset: 17536)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !250, line: 45, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !250, line: 121, baseType: !276, size: 528, offset: 256)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 528, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 66)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !250, line: 126, baseType: !231, size: 16, offset: 784)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !251, file: !250, line: 127, baseType: !42, size: 32, offset: 800)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !251, file: !250, line: 128, baseType: !42, size: 32, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !251, file: !250, line: 128, baseType: !42, size: 32, offset: 864)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !251, file: !250, line: 129, baseType: !284, size: 64, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !250, line: 75, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !250, line: 62, size: 1024, elements: !287)
!287 = !{!288, !290, !291, !292, !293, !294, !295, !296, !304, !305}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !250, line: 63, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !286, file: !250, line: 63, baseType: !289, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !250, line: 64, baseType: !212, size: 8, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !286, file: !250, line: 64, baseType: !212, size: 8, offset: 136)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !250, line: 65, baseType: !231, size: 16, offset: 144)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !286, file: !250, line: 66, baseType: !211, size: 512, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !286, file: !250, line: 67, baseType: !42, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !250, line: 69, baseType: !297, size: 256, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !250, line: 60, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !250, line: 48, size: 256, elements: !299)
!299 = !{!300, !301, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !298, file: !250, line: 49, baseType: !193, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !298, file: !250, line: 58, baseType: !202, size: 128, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !298, file: !250, line: 59, baseType: !42, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !298, file: !250, line: 59, baseType: !42, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !286, file: !250, line: 70, baseType: !42, size: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !286, file: !250, line: 74, baseType: !42, size: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !244, file: !245, line: 521, baseType: !202, size: 128, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "filter_grp", scope: !244, file: !245, line: 523, baseType: !308, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !245, line: 46, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "searchstr", scope: !244, file: !245, line: 524, baseType: !211, size: 512, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "filterflag", scope: !244, file: !245, line: 526, baseType: !42, size: 32, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !244, file: !245, line: 527, baseType: !42, size: 32, offset: 800)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "renameIndex", scope: !244, file: !245, line: 529, baseType: !42, size: 32, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !244, file: !245, line: 530, baseType: !42, size: 32, offset: 864)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !217, file: !128, line: 398, baseType: !316, size: 1280, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !317, line: 71, baseType: !318)
!317 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !317, line: 40, size: 1280, elements: !319)
!319 = !{!320, !329, !330, !338, !339, !340, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !361, !362, !363, !366}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !318, file: !317, line: 41, baseType: !321, size: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !322, line: 95, baseType: !323)
!322 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !322, line: 92, size: 128, elements: !324)
!324 = !{!325, !326, !327, !328}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !323, file: !322, line: 93, baseType: !228, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !323, file: !322, line: 93, baseType: !228, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !323, file: !322, line: 94, baseType: !228, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !323, file: !322, line: 94, baseType: !228, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !318, file: !317, line: 41, baseType: !321, size: 128, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !318, file: !317, line: 42, baseType: !331, size: 128, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !322, line: 89, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !322, line: 86, size: 128, elements: !333)
!333 = !{!334, !335, !336, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !332, file: !322, line: 87, baseType: !42, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !332, file: !322, line: 87, baseType: !42, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !332, file: !322, line: 88, baseType: !42, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !332, file: !322, line: 88, baseType: !42, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !318, file: !317, line: 42, baseType: !331, size: 128, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !318, file: !317, line: 43, baseType: !331, size: 128, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !318, file: !317, line: 45, baseType: !341, size: 64, offset: 640)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 64, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 2)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !318, file: !317, line: 45, baseType: !341, size: 64, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !318, file: !317, line: 46, baseType: !228, size: 32, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !318, file: !317, line: 46, baseType: !228, size: 32, offset: 800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !318, file: !317, line: 48, baseType: !231, size: 16, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !318, file: !317, line: 49, baseType: !231, size: 16, offset: 848)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !318, file: !317, line: 51, baseType: !231, size: 16, offset: 864)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !318, file: !317, line: 52, baseType: !231, size: 16, offset: 880)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !318, file: !317, line: 53, baseType: !231, size: 16, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !317, line: 55, baseType: !231, size: 16, offset: 912)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !318, file: !317, line: 56, baseType: !231, size: 16, offset: 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !318, file: !317, line: 58, baseType: !231, size: 16, offset: 944)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !318, file: !317, line: 58, baseType: !231, size: 16, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !318, file: !317, line: 59, baseType: !231, size: 16, offset: 976)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !318, file: !317, line: 59, baseType: !231, size: 16, offset: 992)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !318, file: !317, line: 61, baseType: !231, size: 16, offset: 1008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !318, file: !317, line: 63, baseType: !360, size: 64, offset: 1024)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !318, file: !317, line: 64, baseType: !42, size: 32, offset: 1088)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !318, file: !317, line: 65, baseType: !42, size: 32, offset: 1120)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !318, file: !317, line: 68, baseType: !364, size: 64, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !317, line: 68, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !318, file: !317, line: 69, baseType: !367, size: 64, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !170, line: 490, size: 768, elements: !369)
!369 = !{!370, !371, !372, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !170, line: 491, baseType: !367, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !368, file: !170, line: 491, baseType: !367, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !368, file: !170, line: 493, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !49, line: 169, size: 2048, elements: !375)
!375 = !{!376, !377, !378, !379, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1711, !1714, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !49, line: 170, baseType: !373, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !49, line: 170, baseType: !373, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !374, file: !49, line: 172, baseType: !193, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !374, file: !49, line: 174, baseType: !380, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !382, line: 49, size: 1984, elements: !383)
!382 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !{!384, !385, !386, !387, !388, !389, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !381, file: !382, line: 50, baseType: !249, size: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !381, file: !382, line: 52, baseType: !202, size: 128, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !381, file: !382, line: 53, baseType: !202, size: 128, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !381, file: !382, line: 54, baseType: !202, size: 128, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !381, file: !382, line: 55, baseType: !202, size: 128, offset: 1344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !381, file: !382, line: 57, baseType: !390, size: 64, offset: 1472)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !392, line: 1216, size: 39680, elements: !393)
!392 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!393 = !{!394, !395, !463, !467, !470, !471, !472, !484, !485, !489, !490, !491, !492, !493, !494, !495, !496, !497, !501, !569, !1005, !1220, !1223, !1504, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1526, !1527, !1528, !1529, !1530, !1538, !1605, !1612, !1613, !1620, !1621, !1627, !1628, !1629, !1630, !1631}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !391, file: !392, line: 1217, baseType: !249, size: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !391, file: !392, line: 1218, baseType: !396, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !87, line: 838, size: 768, elements: !398)
!398 = !{!399, !413, !414, !424, !425, !456, !457, !458, !459, !460, !461, !462}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !397, file: !87, line: 840, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !245, line: 499, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !245, line: 486, size: 1600, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !245, line: 487, baseType: !249, size: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !402, file: !245, line: 489, baseType: !202, size: 128, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !402, file: !245, line: 490, baseType: !202, size: 128, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !402, file: !245, line: 491, baseType: !202, size: 128, offset: 1216)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !402, file: !245, line: 492, baseType: !202, size: 128, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !245, line: 494, baseType: !42, size: 32, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !402, file: !245, line: 495, baseType: !42, size: 32, offset: 1504)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !402, file: !245, line: 497, baseType: !42, size: 32, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !245, line: 498, baseType: !42, size: 32, offset: 1568)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !397, file: !87, line: 844, baseType: !400, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !397, file: !87, line: 848, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !87, line: 549, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !87, line: 544, size: 320, elements: !418)
!418 = !{!419, !421, !422, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !87, line: 545, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !87, line: 545, baseType: !420, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !417, file: !87, line: 547, baseType: !400, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !417, file: !87, line: 548, baseType: !202, size: 128, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !397, file: !87, line: 851, baseType: !202, size: 128, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !397, file: !87, line: 853, baseType: !426, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !87, line: 594, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !87, line: 561, size: 1664, elements: !429)
!429 = !{!430, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !87, line: 562, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !428, file: !87, line: 562, baseType: !431, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !428, file: !87, line: 564, baseType: !202, size: 128, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !428, file: !87, line: 565, baseType: !400, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !428, file: !87, line: 566, baseType: !415, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !428, file: !87, line: 568, baseType: !202, size: 128, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !428, file: !87, line: 569, baseType: !202, size: 128, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !428, file: !87, line: 571, baseType: !211, size: 512, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !428, file: !87, line: 573, baseType: !228, size: 32, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !428, file: !87, line: 574, baseType: !228, size: 32, offset: 1184)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !428, file: !87, line: 576, baseType: !228, size: 32, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !428, file: !87, line: 576, baseType: !228, size: 32, offset: 1248)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !428, file: !87, line: 577, baseType: !228, size: 32, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !428, file: !87, line: 577, baseType: !228, size: 32, offset: 1312)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !428, file: !87, line: 579, baseType: !228, size: 32, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !428, file: !87, line: 580, baseType: !228, size: 32, offset: 1376)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !428, file: !87, line: 582, baseType: !228, size: 32, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !428, file: !87, line: 582, baseType: !228, size: 32, offset: 1440)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !428, file: !87, line: 583, baseType: !231, size: 16, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !428, file: !87, line: 585, baseType: !231, size: 16, offset: 1488)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !428, file: !87, line: 586, baseType: !231, size: 16, offset: 1504)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, file: !87, line: 588, baseType: !231, size: 16, offset: 1520)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !428, file: !87, line: 590, baseType: !193, size: 64, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !87, line: 592, baseType: !42, size: 32, offset: 1600)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !428, file: !87, line: 593, baseType: !42, size: 32, offset: 1632)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !397, file: !87, line: 858, baseType: !202, size: 128, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !397, file: !87, line: 859, baseType: !202, size: 128, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !87, line: 862, baseType: !42, size: 32, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !397, file: !87, line: 863, baseType: !42, size: 32, offset: 672)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !397, file: !87, line: 866, baseType: !231, size: 16, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !397, file: !87, line: 867, baseType: !231, size: 16, offset: 720)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !397, file: !87, line: 868, baseType: !228, size: 32, offset: 736)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !391, file: !392, line: 1220, baseType: !464, size: 64, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !466, line: 49, flags: DIFlagFwdDecl)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !391, file: !392, line: 1221, baseType: !468, size: 64, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !392, line: 52, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !391, file: !392, line: 1223, baseType: !390, size: 64, offset: 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !392, line: 1225, baseType: !202, size: 128, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !391, file: !392, line: 1226, baseType: !473, size: 64, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !392, line: 69, size: 320, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !392, line: 70, baseType: !473, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !474, file: !392, line: 70, baseType: !473, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !474, file: !392, line: 71, baseType: !7, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !474, file: !392, line: 71, baseType: !7, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !392, line: 72, baseType: !42, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !474, file: !392, line: 73, baseType: !231, size: 16, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !474, file: !392, line: 73, baseType: !231, size: 16, offset: 240)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !474, file: !392, line: 74, baseType: !464, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !391, file: !392, line: 1227, baseType: !464, size: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !391, file: !392, line: 1229, baseType: !486, size: 96, offset: 1472)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 96, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 3)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !391, file: !392, line: 1230, baseType: !486, size: 96, offset: 1568)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !391, file: !392, line: 1231, baseType: !486, size: 96, offset: 1664)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !391, file: !392, line: 1231, baseType: !486, size: 96, offset: 1760)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !391, file: !392, line: 1233, baseType: !7, size: 32, offset: 1856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !391, file: !392, line: 1234, baseType: !42, size: 32, offset: 1888)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !391, file: !392, line: 1235, baseType: !7, size: 32, offset: 1920)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !392, line: 1237, baseType: !231, size: 16, offset: 1952)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !391, file: !392, line: 1239, baseType: !212, size: 8, offset: 1968)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !391, file: !392, line: 1240, baseType: !498, size: 8, offset: 1976)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 8, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 1)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !391, file: !392, line: 1242, baseType: !502, size: 64, offset: 1984)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !504, line: 328, size: 3456, elements: !505)
!504 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = !{!506, !507, !508, !511, !512, !515, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !539, !544, !545, !548, !552, !557, !561, !565, !566, !567, !568}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !503, file: !504, line: 329, baseType: !249, size: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !503, file: !504, line: 330, baseType: !396, size: 64, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !503, file: !504, line: 332, baseType: !509, size: 64, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !504, line: 332, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !503, file: !504, line: 333, baseType: !211, size: 512, offset: 1088)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !503, file: !504, line: 335, baseType: !513, size: 64, offset: 1600)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !6, line: 41, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !503, file: !504, line: 337, baseType: !516, size: 64, offset: 1664)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !392, line: 61, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !503, file: !504, line: 338, baseType: !341, size: 64, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !503, file: !504, line: 340, baseType: !202, size: 128, offset: 1792)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !503, file: !504, line: 340, baseType: !202, size: 128, offset: 1920)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !504, line: 342, baseType: !42, size: 32, offset: 2048)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !503, file: !504, line: 342, baseType: !42, size: 32, offset: 2080)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !503, file: !504, line: 343, baseType: !42, size: 32, offset: 2112)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !503, file: !504, line: 345, baseType: !42, size: 32, offset: 2144)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !503, file: !504, line: 346, baseType: !42, size: 32, offset: 2176)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !503, file: !504, line: 347, baseType: !231, size: 16, offset: 2208)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !503, file: !504, line: 348, baseType: !231, size: 16, offset: 2224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !503, file: !504, line: 349, baseType: !42, size: 32, offset: 2240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !503, file: !504, line: 351, baseType: !42, size: 32, offset: 2272)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !503, file: !504, line: 353, baseType: !231, size: 16, offset: 2304)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !503, file: !504, line: 354, baseType: !231, size: 16, offset: 2320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !503, file: !504, line: 355, baseType: !42, size: 32, offset: 2336)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !503, file: !504, line: 357, baseType: !321, size: 128, offset: 2368)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !503, file: !504, line: 363, baseType: !202, size: 128, offset: 2496)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !503, file: !504, line: 363, baseType: !202, size: 128, offset: 2624)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !503, file: !504, line: 368, baseType: !537, size: 64, offset: 2752)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !504, line: 48, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !503, file: !504, line: 372, baseType: !540, size: 32, offset: 2816)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !504, line: 274, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !504, line: 271, size: 32, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !541, file: !504, line: 273, baseType: !7, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !503, file: !504, line: 373, baseType: !42, size: 32, offset: 2848)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !503, file: !504, line: 382, baseType: !546, size: 64, offset: 2880)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !504, line: 46, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !503, file: !504, line: 385, baseType: !549, size: 64, offset: 2944)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !193, !228}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !503, file: !504, line: 386, baseType: !553, size: 64, offset: 3008)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !193, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !503, file: !504, line: 387, baseType: !558, size: 64, offset: 3072)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!42, !193}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !503, file: !504, line: 388, baseType: !562, size: 64, offset: 3136)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !193}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !503, file: !504, line: 389, baseType: !193, size: 64, offset: 3200)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !503, file: !504, line: 389, baseType: !193, size: 64, offset: 3264)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !503, file: !504, line: 389, baseType: !193, size: 64, offset: 3328)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !503, file: !504, line: 389, baseType: !193, size: 64, offset: 3392)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !391, file: !392, line: 1244, baseType: !570, size: 64, offset: 2048)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !572, line: 200, size: 17024, elements: !573)
!572 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!573 = !{!574, !576, !577, !578, !998, !999, !1000, !1001, !1002, !1003, !1004}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !571, file: !572, line: 201, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !571, file: !572, line: 202, baseType: !202, size: 128, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !571, file: !572, line: 203, baseType: !202, size: 128, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !571, file: !572, line: 206, baseType: !579, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !572, line: 190, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !572, line: 126, size: 2816, elements: !582)
!582 = !{!583, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !682, !685, !686, !687, !969, !973, !974, !975, !976, !977, !978, !979, !980, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !997}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !581, file: !572, line: 127, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !581, file: !572, line: 127, baseType: !584, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !581, file: !572, line: 128, baseType: !193, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !581, file: !572, line: 129, baseType: !193, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !581, file: !572, line: 130, baseType: !211, size: 512, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !581, file: !572, line: 132, baseType: !42, size: 32, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !581, file: !572, line: 132, baseType: !42, size: 32, offset: 800)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !581, file: !572, line: 133, baseType: !42, size: 32, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !581, file: !572, line: 134, baseType: !42, size: 32, offset: 864)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !581, file: !572, line: 134, baseType: !42, size: 32, offset: 896)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !581, file: !572, line: 134, baseType: !42, size: 32, offset: 928)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !581, file: !572, line: 135, baseType: !42, size: 32, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !581, file: !572, line: 135, baseType: !42, size: 32, offset: 992)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !581, file: !572, line: 136, baseType: !42, size: 32, offset: 1024)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !581, file: !572, line: 136, baseType: !42, size: 32, offset: 1056)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !581, file: !572, line: 137, baseType: !42, size: 32, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !581, file: !572, line: 137, baseType: !42, size: 32, offset: 1120)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !581, file: !572, line: 138, baseType: !228, size: 32, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !581, file: !572, line: 139, baseType: !228, size: 32, offset: 1184)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !581, file: !572, line: 139, baseType: !228, size: 32, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !581, file: !572, line: 141, baseType: !231, size: 16, offset: 1248)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !581, file: !572, line: 142, baseType: !231, size: 16, offset: 1264)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !581, file: !572, line: 143, baseType: !42, size: 32, offset: 1280)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !581, file: !572, line: 144, baseType: !42, size: 32, offset: 1312)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !581, file: !572, line: 146, baseType: !609, size: 64, offset: 1344)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !572, line: 114, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !572, line: 99, size: 7232, elements: !612)
!612 = !{!613, !615, !616, !617, !618, !619, !620, !631, !635, !650, !659, !666, !676}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !572, line: 100, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !572, line: 100, baseType: !614, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !611, file: !572, line: 101, baseType: !42, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !611, file: !572, line: 101, baseType: !42, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !611, file: !572, line: 102, baseType: !42, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !611, file: !572, line: 102, baseType: !42, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !611, file: !572, line: 103, baseType: !621, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !572, line: 59, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !572, line: 56, size: 2112, elements: !624)
!624 = !{!625, !629, !630}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !572, line: 57, baseType: !626, size: 2048)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 2048, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !623, file: !572, line: 58, baseType: !42, size: 32, offset: 2048)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !623, file: !572, line: 58, baseType: !42, size: 32, offset: 2080)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !611, file: !572, line: 106, baseType: !632, size: 6144, offset: 320)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 6144, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 768)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !611, file: !572, line: 107, baseType: !636, size: 64, offset: 6464)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !572, line: 97, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !572, line: 83, size: 8320, elements: !639)
!639 = !{!640, !641, !642, !646, !647, !648, !649}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !638, file: !572, line: 84, baseType: !632, size: 6144)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !638, file: !572, line: 87, baseType: !626, size: 2048, offset: 6144)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !638, file: !572, line: 88, baseType: !643, size: 64, offset: 8192)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !645, line: 41, flags: DIFlagFwdDecl)
!645 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !638, file: !572, line: 90, baseType: !231, size: 16, offset: 8256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !638, file: !572, line: 92, baseType: !231, size: 16, offset: 8272)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !638, file: !572, line: 93, baseType: !231, size: 16, offset: 8288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !638, file: !572, line: 95, baseType: !231, size: 16, offset: 8304)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !611, file: !572, line: 108, baseType: !651, size: 64, offset: 6528)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !572, line: 66, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !572, line: 61, size: 128, elements: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !653, file: !572, line: 62, baseType: !42, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !653, file: !572, line: 63, baseType: !42, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !653, file: !572, line: 64, baseType: !42, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !653, file: !572, line: 65, baseType: !42, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !611, file: !572, line: 109, baseType: !660, size: 64, offset: 6592)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !572, line: 71, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !572, line: 68, size: 64, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !662, file: !572, line: 69, baseType: !42, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !662, file: !572, line: 70, baseType: !42, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !611, file: !572, line: 110, baseType: !667, size: 64, offset: 6656)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !572, line: 81, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !572, line: 73, size: 352, elements: !670)
!670 = !{!671, !672, !673, !674, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !669, file: !572, line: 74, baseType: !486, size: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !669, file: !572, line: 75, baseType: !486, size: 96, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !669, file: !572, line: 76, baseType: !486, size: 96, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !572, line: 77, baseType: !42, size: 32, offset: 288)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !669, file: !572, line: 78, baseType: !42, size: 32, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !611, file: !572, line: 113, baseType: !677, size: 512, offset: 6720)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !678, line: 182, baseType: !679)
!678 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !678, line: 180, size: 512, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !678, line: 181, baseType: !211, size: 512)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !581, file: !572, line: 148, baseType: !683, size: 64, offset: 1408)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !466, line: 46, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !581, file: !572, line: 151, baseType: !390, size: 64, offset: 1472)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !581, file: !572, line: 152, baseType: !464, size: 64, offset: 1536)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !581, file: !572, line: 153, baseType: !688, size: 64, offset: 1600)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !690, line: 64, size: 19136, elements: !691)
!690 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!691 = !{!692, !693, !694, !695, !696, !697, !699, !700, !701, !702, !705, !706, !955, !956, !964, !965, !966, !967, !968}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !689, file: !690, line: 65, baseType: !249, size: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !689, file: !690, line: 66, baseType: !396, size: 64, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !690, line: 68, baseType: !267, size: 8192, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !689, file: !690, line: 70, baseType: !42, size: 32, offset: 9216)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !689, file: !690, line: 71, baseType: !42, size: 32, offset: 9248)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !689, file: !690, line: 72, baseType: !698, size: 64, offset: 9280)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !342)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !689, file: !690, line: 74, baseType: !228, size: 32, offset: 9344)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !689, file: !690, line: 74, baseType: !228, size: 32, offset: 9376)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !689, file: !690, line: 76, baseType: !643, size: 64, offset: 9408)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !689, file: !690, line: 77, baseType: !703, size: 64, offset: 9472)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !690, line: 77, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !689, file: !690, line: 78, baseType: !516, size: 64, offset: 9536)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !689, file: !690, line: 80, baseType: !707, size: 2624, offset: 9600)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !708, line: 340, size: 2624, elements: !709)
!708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !{!710, !738, !756, !757, !758, !776, !834, !835, !935, !936, !937, !938, !944}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !707, file: !708, line: 341, baseType: !711, size: 576)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !708, line: 251, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !708, line: 207, size: 576, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !712, file: !708, line: 208, baseType: !42, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !712, file: !708, line: 211, baseType: !231, size: 16, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !712, file: !708, line: 212, baseType: !231, size: 16, offset: 48)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !712, file: !708, line: 213, baseType: !228, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !712, file: !708, line: 214, baseType: !231, size: 16, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !712, file: !708, line: 215, baseType: !231, size: 16, offset: 112)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !712, file: !708, line: 216, baseType: !231, size: 16, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !712, file: !708, line: 217, baseType: !231, size: 16, offset: 144)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !712, file: !708, line: 218, baseType: !231, size: 16, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !712, file: !708, line: 219, baseType: !231, size: 16, offset: 176)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !712, file: !708, line: 220, baseType: !228, size: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !712, file: !708, line: 222, baseType: !231, size: 16, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !712, file: !708, line: 225, baseType: !231, size: 16, offset: 240)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !712, file: !708, line: 228, baseType: !42, size: 32, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !712, file: !708, line: 229, baseType: !42, size: 32, offset: 288)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !712, file: !708, line: 233, baseType: !42, size: 32, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !712, file: !708, line: 236, baseType: !231, size: 16, offset: 352)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !712, file: !708, line: 236, baseType: !231, size: 16, offset: 368)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !712, file: !708, line: 241, baseType: !228, size: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !712, file: !708, line: 244, baseType: !42, size: 32, offset: 416)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !712, file: !708, line: 244, baseType: !42, size: 32, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !712, file: !708, line: 245, baseType: !228, size: 32, offset: 480)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !712, file: !708, line: 248, baseType: !228, size: 32, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !712, file: !708, line: 250, baseType: !42, size: 32, offset: 544)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !707, file: !708, line: 342, baseType: !739, size: 448, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !708, line: 79, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !708, line: 61, size: 448, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !740, file: !708, line: 62, baseType: !193, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !740, file: !708, line: 64, baseType: !231, size: 16, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !740, file: !708, line: 65, baseType: !231, size: 16, offset: 80)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !740, file: !708, line: 67, baseType: !228, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !740, file: !708, line: 68, baseType: !228, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !740, file: !708, line: 69, baseType: !228, size: 32, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !740, file: !708, line: 70, baseType: !231, size: 16, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !740, file: !708, line: 71, baseType: !231, size: 16, offset: 208)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !740, file: !708, line: 72, baseType: !341, size: 64, offset: 224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !740, file: !708, line: 75, baseType: !228, size: 32, offset: 288)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !740, file: !708, line: 75, baseType: !228, size: 32, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !740, file: !708, line: 75, baseType: !228, size: 32, offset: 352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !740, file: !708, line: 78, baseType: !228, size: 32, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !740, file: !708, line: 78, baseType: !228, size: 32, offset: 416)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !707, file: !708, line: 343, baseType: !202, size: 128, offset: 1024)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !707, file: !708, line: 344, baseType: !202, size: 128, offset: 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !707, file: !708, line: 345, baseType: !759, size: 192, offset: 1280)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !708, line: 278, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !708, line: 270, size: 192, elements: !761)
!761 = !{!762, !763, !764, !765, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !708, line: 271, baseType: !42, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !760, file: !708, line: 273, baseType: !228, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !760, file: !708, line: 275, baseType: !42, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !760, file: !708, line: 276, baseType: !42, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !760, file: !708, line: 277, baseType: !767, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !708, line: 55, size: 576, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !768, file: !708, line: 56, baseType: !42, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !768, file: !708, line: 57, baseType: !228, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !768, file: !708, line: 58, baseType: !773, size: 512, offset: 64)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 512, elements: !774)
!774 = !{!775, !775}
!775 = !DISubrange(count: 4)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !707, file: !708, line: 346, baseType: !777, size: 384, offset: 1472)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !708, line: 268, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !708, line: 253, size: 384, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !828, !829, !830, !831, !832, !833}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !778, file: !708, line: 254, baseType: !42, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !778, file: !708, line: 255, baseType: !42, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !778, file: !708, line: 255, baseType: !42, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !778, file: !708, line: 258, baseType: !228, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !778, file: !708, line: 259, baseType: !785, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !708, line: 164, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !708, line: 108, size: 1664, elements: !788)
!788 = !{!789, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !787, file: !708, line: 109, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !787, file: !708, line: 109, baseType: !790, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !787, file: !708, line: 111, baseType: !211, size: 512, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !787, file: !708, line: 119, baseType: !341, size: 64, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !787, file: !708, line: 119, baseType: !341, size: 64, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !787, file: !708, line: 125, baseType: !341, size: 64, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !787, file: !708, line: 125, baseType: !341, size: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !787, file: !708, line: 127, baseType: !341, size: 64, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !787, file: !708, line: 130, baseType: !42, size: 32, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !787, file: !708, line: 131, baseType: !42, size: 32, offset: 992)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !787, file: !708, line: 132, baseType: !801, size: 64, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !708, line: 106, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !708, line: 81, size: 512, elements: !804)
!804 = !{!805, !806, !809, !810, !811, !812}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !803, file: !708, line: 82, baseType: !341, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !803, file: !708, line: 97, baseType: !807, size: 256, offset: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 256, elements: !808)
!808 = !{!775, !343}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !803, file: !708, line: 102, baseType: !341, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !803, file: !708, line: 102, baseType: !341, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !803, file: !708, line: 104, baseType: !42, size: 32, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !803, file: !708, line: 105, baseType: !42, size: 32, offset: 480)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !787, file: !708, line: 135, baseType: !486, size: 96, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !787, file: !708, line: 136, baseType: !228, size: 32, offset: 1184)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !787, file: !708, line: 139, baseType: !42, size: 32, offset: 1216)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !787, file: !708, line: 139, baseType: !42, size: 32, offset: 1248)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !787, file: !708, line: 139, baseType: !42, size: 32, offset: 1280)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !787, file: !708, line: 140, baseType: !486, size: 96, offset: 1312)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !787, file: !708, line: 143, baseType: !231, size: 16, offset: 1408)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !787, file: !708, line: 144, baseType: !231, size: 16, offset: 1424)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !787, file: !708, line: 145, baseType: !231, size: 16, offset: 1440)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !787, file: !708, line: 148, baseType: !231, size: 16, offset: 1456)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !787, file: !708, line: 149, baseType: !42, size: 32, offset: 1472)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !787, file: !708, line: 150, baseType: !228, size: 32, offset: 1504)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !787, file: !708, line: 152, baseType: !516, size: 64, offset: 1536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !787, file: !708, line: 163, baseType: !228, size: 32, offset: 1600)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !787, file: !708, line: 163, baseType: !228, size: 32, offset: 1632)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !778, file: !708, line: 261, baseType: !228, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !778, file: !708, line: 261, baseType: !228, size: 32, offset: 224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !778, file: !708, line: 261, baseType: !228, size: 32, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !778, file: !708, line: 263, baseType: !42, size: 32, offset: 288)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !778, file: !708, line: 266, baseType: !42, size: 32, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !778, file: !708, line: 267, baseType: !228, size: 32, offset: 352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !707, file: !708, line: 347, baseType: !785, size: 64, offset: 1856)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !707, file: !708, line: 348, baseType: !836, size: 64, offset: 1920)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !708, line: 205, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !708, line: 186, size: 1024, elements: !839)
!839 = !{!840, !842, !843, !844, !846, !847, !848, !856, !857, !858, !933, !934}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !708, line: 187, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !838, file: !708, line: 187, baseType: !841, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !838, file: !708, line: 189, baseType: !211, size: 512, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !838, file: !708, line: 191, baseType: !845, size: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !838, file: !708, line: 193, baseType: !42, size: 32, offset: 704)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !838, file: !708, line: 193, baseType: !42, size: 32, offset: 736)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !838, file: !708, line: 195, baseType: !849, size: 64, offset: 768)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !708, line: 184, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !708, line: 166, size: 320, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !851, file: !708, line: 180, baseType: !807, size: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !851, file: !708, line: 182, baseType: !42, size: 32, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !851, file: !708, line: 183, baseType: !42, size: 32, offset: 288)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !838, file: !708, line: 196, baseType: !42, size: 32, offset: 832)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !838, file: !708, line: 198, baseType: !42, size: 32, offset: 864)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !838, file: !708, line: 200, baseType: !859, size: 64, offset: 896)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !645, line: 77, size: 15424, elements: !861)
!861 = !{!862, !863, !864, !867, !870, !871, !874, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !892, !893, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !919, !920, !921, !922, !923, !927}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !860, file: !645, line: 78, baseType: !249, size: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !860, file: !645, line: 80, baseType: !267, size: 8192, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !860, file: !645, line: 82, baseType: !865, size: 64, offset: 9152)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !645, line: 43, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !860, file: !645, line: 83, baseType: !868, size: 64, offset: 9216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !250, line: 46, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !860, file: !645, line: 86, baseType: !643, size: 64, offset: 9280)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !860, file: !645, line: 87, baseType: !872, size: 64, offset: 9344)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !645, line: 44, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !860, file: !645, line: 89, baseType: !875, size: 512, offset: 9408)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 512, elements: !232)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !860, file: !645, line: 90, baseType: !231, size: 16, offset: 9920)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !860, file: !645, line: 90, baseType: !231, size: 16, offset: 9936)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !860, file: !645, line: 92, baseType: !231, size: 16, offset: 9952)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !860, file: !645, line: 92, baseType: !231, size: 16, offset: 9968)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !860, file: !645, line: 93, baseType: !231, size: 16, offset: 9984)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !860, file: !645, line: 93, baseType: !231, size: 16, offset: 10000)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !860, file: !645, line: 94, baseType: !42, size: 32, offset: 10016)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !860, file: !645, line: 97, baseType: !231, size: 16, offset: 10048)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !860, file: !645, line: 97, baseType: !231, size: 16, offset: 10064)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !860, file: !645, line: 98, baseType: !231, size: 16, offset: 10080)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !860, file: !645, line: 98, baseType: !231, size: 16, offset: 10096)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !860, file: !645, line: 99, baseType: !231, size: 16, offset: 10112)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !860, file: !645, line: 99, baseType: !231, size: 16, offset: 10128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !860, file: !645, line: 100, baseType: !7, size: 32, offset: 10144)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !860, file: !645, line: 101, baseType: !891, size: 64, offset: 10176)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !860, file: !645, line: 103, baseType: !273, size: 64, offset: 10240)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !860, file: !645, line: 104, baseType: !894, size: 64, offset: 10304)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !250, line: 159, size: 448, elements: !896)
!896 = !{!897, !899, !900, !902, !903, !905}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !895, file: !250, line: 161, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !342)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !895, file: !250, line: 162, baseType: !898, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !895, file: !250, line: 163, baseType: !901, size: 32, offset: 128)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 32, elements: !342)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !895, file: !250, line: 164, baseType: !901, size: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !895, file: !250, line: 165, baseType: !904, size: 128, offset: 192)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 128, elements: !342)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !895, file: !250, line: 166, baseType: !906, size: 128, offset: 320)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 128, elements: !342)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !860, file: !645, line: 107, baseType: !228, size: 32, offset: 10368)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !860, file: !645, line: 108, baseType: !42, size: 32, offset: 10400)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !860, file: !645, line: 109, baseType: !231, size: 16, offset: 10432)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !860, file: !645, line: 110, baseType: !231, size: 16, offset: 10448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !860, file: !645, line: 113, baseType: !42, size: 32, offset: 10464)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !860, file: !645, line: 113, baseType: !42, size: 32, offset: 10496)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !860, file: !645, line: 114, baseType: !212, size: 8, offset: 10528)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !860, file: !645, line: 114, baseType: !212, size: 8, offset: 10536)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !860, file: !645, line: 115, baseType: !231, size: 16, offset: 10544)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !860, file: !645, line: 116, baseType: !917, size: 128, offset: 10560)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, elements: !918)
!918 = !{!775}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !860, file: !645, line: 119, baseType: !228, size: 32, offset: 10688)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !860, file: !645, line: 119, baseType: !228, size: 32, offset: 10720)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !860, file: !645, line: 122, baseType: !677, size: 512, offset: 10752)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !860, file: !645, line: 123, baseType: !212, size: 8, offset: 11264)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !860, file: !645, line: 125, baseType: !924, size: 56, offset: 11272)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 56, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 7)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !860, file: !645, line: 126, baseType: !928, size: 4096, offset: 11328)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 4096, elements: !232)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !645, line: 69, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !645, line: 67, size: 512, elements: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !930, file: !645, line: 68, baseType: !211, size: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !838, file: !708, line: 201, baseType: !228, size: 32, offset: 960)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !838, file: !708, line: 204, baseType: !42, size: 32, offset: 992)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !707, file: !708, line: 350, baseType: !202, size: 128, offset: 1984)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !707, file: !708, line: 351, baseType: !42, size: 32, offset: 2112)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !707, file: !708, line: 351, baseType: !42, size: 32, offset: 2144)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !707, file: !708, line: 353, baseType: !939, size: 64, offset: 2176)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !708, line: 297, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !708, line: 295, size: 2048, elements: !942)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !941, file: !708, line: 296, baseType: !626, size: 2048)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !707, file: !708, line: 355, baseType: !945, size: 384, offset: 2240)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !708, line: 338, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !708, line: 322, size: 384, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !946, file: !708, line: 323, baseType: !42, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !946, file: !708, line: 325, baseType: !231, size: 16, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !946, file: !708, line: 326, baseType: !231, size: 16, offset: 48)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !946, file: !708, line: 331, baseType: !202, size: 128, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !946, file: !708, line: 334, baseType: !202, size: 128, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !946, file: !708, line: 335, baseType: !42, size: 32, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !946, file: !708, line: 337, baseType: !42, size: 32, offset: 352)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !689, file: !690, line: 81, baseType: !193, size: 64, offset: 12224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !689, file: !690, line: 85, baseType: !957, size: 6208, offset: 12288)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !690, line: 55, size: 6208, elements: !958)
!958 = !{!959, !960, !961, !962, !963}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !957, file: !690, line: 56, baseType: !632, size: 6144)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !957, file: !690, line: 58, baseType: !231, size: 16, offset: 6144)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !957, file: !690, line: 59, baseType: !231, size: 16, offset: 6160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !957, file: !690, line: 60, baseType: !231, size: 16, offset: 6176)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !957, file: !690, line: 61, baseType: !231, size: 16, offset: 6192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !689, file: !690, line: 86, baseType: !42, size: 32, offset: 18496)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !689, file: !690, line: 88, baseType: !42, size: 32, offset: 18528)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !689, file: !690, line: 90, baseType: !42, size: 32, offset: 18560)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !689, file: !690, line: 94, baseType: !42, size: 32, offset: 18592)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !689, file: !690, line: 100, baseType: !677, size: 512, offset: 18624)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !581, file: !572, line: 154, baseType: !970, size: 64, offset: 1664)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !972, line: 264, flags: DIFlagFwdDecl)
!972 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!973 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !581, file: !572, line: 156, baseType: !643, size: 64, offset: 1728)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !581, file: !572, line: 158, baseType: !228, size: 32, offset: 1792)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !581, file: !572, line: 159, baseType: !228, size: 32, offset: 1824)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !581, file: !572, line: 162, baseType: !584, size: 64, offset: 1856)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !581, file: !572, line: 162, baseType: !584, size: 64, offset: 1920)
