; ModuleID = 'blender/source/blender/editors/space_view3d/drawanimviz.c'
source_filename = "blender/source/blender/editors/space_view3d/drawanimviz.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!196 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!197 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!198 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!199 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!200 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!201 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!202 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!203 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!204 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!205 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!206 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!207 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!208 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!209 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!210 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!211 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!212 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!213 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!214 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!215 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!216 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!217 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!218 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!219 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!220 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!221 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!222 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!223 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!224 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!225 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!226 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!227 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!228 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!229 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!230 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eMotionPaths_ViewFlag", file: !4, line: 154, baseType: !5, size: 32, elements: !232)
!232 = !{!233, !234, !235, !236, !237}
!233 = !DIEnumerator(name: "MOTIONPATH_VIEW_FNUMS", value: 1, isUnsigned: true)
!234 = !DIEnumerator(name: "MOTIONPATH_VIEW_KFRAS", value: 2, isUnsigned: true)
!235 = !DIEnumerator(name: "MOTIONPATH_VIEW_KFNOS", value: 4, isUnsigned: true)
!236 = !DIEnumerator(name: "MOTIONPATH_VIEW_KFACT", value: 8, isUnsigned: true)
!237 = !DIEnumerator(name: "MOTIONPATH_VIEW_LINES", value: 16, isUnsigned: true)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 150, baseType: !5, size: 32, elements: !240)
!239 = !DIFile(filename: "blender/source/blender/editors/space_view3d/view3d_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !{!241, !242, !243, !244, !245}
!241 = !DIEnumerator(name: "V3D_CACHE_TEXT_ZBUF", value: 1, isUnsigned: true)
!242 = !DIEnumerator(name: "V3D_CACHE_TEXT_WORLDSPACE", value: 2, isUnsigned: true)
!243 = !DIEnumerator(name: "V3D_CACHE_TEXT_ASCII", value: 4, isUnsigned: true)
!244 = !DIEnumerator(name: "V3D_CACHE_TEXT_GLOBALSPACE", value: 8, isUnsigned: true)
!245 = !DIEnumerator(name: "V3D_CACHE_TEXT_LOCALCLIP", value: 16, isUnsigned: true)
!246 = !{!247, !249, !248}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!250 = !{i32 7, !"Dwarf Version", i32 4}
!251 = !{i32 2, !"Debug Info Version", i32 3}
!252 = !{i32 1, !"wchar_size", i32 4}
!253 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!254 = distinct !DISubprogram(name: "draw_motion_paths_init", scope: !1, file: !1, line: 70, type: !255, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1807)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !257, !1734}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "View3D", file: !259, line: 221, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View3D", file: !259, line: 151, size: 3008, elements: !261)
!261 = !{!262, !265, !266, !273, !275, !276, !281, !285, !286, !287, !289, !293, !294, !295, !296, !297, !1673, !1674, !1675, !1676, !1699, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !259, line: 152, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 44, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !259, line: 152, baseType: !263, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !260, file: !259, line: 153, baseType: !267, size: 128, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !268, line: 71, baseType: !269)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !268, line: 69, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !269, file: !268, line: 70, baseType: !249, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !269, file: !268, line: 70, baseType: !249, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !260, file: !259, line: 154, baseType: !274, size: 32, offset: 256)
!274 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !260, file: !259, line: 155, baseType: !248, size: 32, offset: 288)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !260, file: !259, line: 156, baseType: !277, size: 128, offset: 320)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 128, elements: !279)
!278 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!279 = !{!280}
!280 = !DISubrange(count: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "viewquat", scope: !260, file: !259, line: 158, baseType: !282, size: 128, offset: 448)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 128, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 4)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !260, file: !259, line: 159, baseType: !248, size: 32, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_size", scope: !260, file: !259, line: 161, baseType: !248, size: 32, offset: 608)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_drawtype", scope: !260, file: !259, line: 162, baseType: !288, size: 8, offset: 640)
!288 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !259, line: 163, baseType: !290, size: 24, offset: 648)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 24, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 3)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lay_prev", scope: !260, file: !259, line: 165, baseType: !5, size: 32, offset: 672)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lay_used", scope: !260, file: !259, line: 166, baseType: !5, size: 32, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !260, file: !259, line: 168, baseType: !278, size: 16, offset: 736)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !260, file: !259, line: 169, baseType: !278, size: 16, offset: 752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !260, file: !259, line: 171, baseType: !298, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !300, line: 115, size: 11392, elements: !301)
!300 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302, !364, !433, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !451, !460, !462, !463, !505, !506, !510, !511, !527, !528, !529, !530, !531, !532, !533, !538, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !616, !617, !618, !619, !620, !621, !622, !623, !624, !627, !630, !633, !634, !635, !636, !637, !640, !643, !646, !647, !653, !654, !655, !656, !657, !658, !660, !663, !666, !670, !1661, !1662}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !299, file: !300, line: 116, baseType: !303, size: 960)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !304, line: 130, baseType: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !304, line: 117, size: 960, elements: !306)
!306 = !{!307, !308, !309, !311, !330, !334, !335, !336, !337, !338}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !304, line: 118, baseType: !249, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !305, file: !304, line: 118, baseType: !249, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !305, file: !304, line: 119, baseType: !310, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !305, file: !304, line: 120, baseType: !312, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !304, line: 136, size: 17600, elements: !314)
!314 = !{!315, !316, !318, !321, !325, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !313, file: !304, line: 137, baseType: !303, size: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !313, file: !304, line: 138, baseType: !317, size: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !313, file: !304, line: 139, baseType: !319, size: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !304, line: 43, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !304, line: 140, baseType: !322, size: 8192, offset: 1088)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 8192, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !313, file: !304, line: 141, baseType: !322, size: 8192, offset: 9280)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !313, file: !304, line: 148, baseType: !312, size: 64, offset: 17472)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !313, file: !304, line: 150, baseType: !328, size: 64, offset: 17536)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !304, line: 45, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !304, line: 121, baseType: !331, size: 528, offset: 256)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 528, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 66)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !305, file: !304, line: 126, baseType: !278, size: 16, offset: 784)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !305, file: !304, line: 127, baseType: !274, size: 32, offset: 800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !305, file: !304, line: 128, baseType: !274, size: 32, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !305, file: !304, line: 128, baseType: !274, size: 32, offset: 864)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !305, file: !304, line: 129, baseType: !339, size: 64, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !304, line: 75, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !304, line: 62, size: 1024, elements: !342)
!342 = !{!343, !345, !346, !347, !348, !349, !353, !354, !362, !363}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !304, line: 63, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !341, file: !304, line: 63, baseType: !344, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !341, file: !304, line: 64, baseType: !288, size: 8, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !341, file: !304, line: 64, baseType: !288, size: 8, offset: 136)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !304, line: 65, baseType: !278, size: 16, offset: 144)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !304, line: 66, baseType: !350, size: 512, offset: 160)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 512, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !341, file: !304, line: 67, baseType: !274, size: 32, offset: 672)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !304, line: 69, baseType: !355, size: 256, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !304, line: 60, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !304, line: 48, size: 256, elements: !357)
!357 = !{!358, !359, !360, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !356, file: !304, line: 49, baseType: !249, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !356, file: !304, line: 58, baseType: !267, size: 128, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !356, file: !304, line: 59, baseType: !274, size: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !356, file: !304, line: 59, baseType: !274, size: 32, offset: 224)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !341, file: !304, line: 70, baseType: !274, size: 32, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !341, file: !304, line: 74, baseType: !274, size: 32, offset: 992)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !299, file: !300, line: 117, baseType: !365, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !367, line: 838, size: 768, elements: !368)
!367 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !{!369, !383, !384, !394, !395, !426, !427, !428, !429, !430, !431, !432}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !366, file: !367, line: 840, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !4, line: 499, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !4, line: 486, size: 1600, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !372, file: !4, line: 487, baseType: !303, size: 960)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !372, file: !4, line: 489, baseType: !267, size: 128, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !372, file: !4, line: 490, baseType: !267, size: 128, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !372, file: !4, line: 491, baseType: !267, size: 128, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !372, file: !4, line: 492, baseType: !267, size: 128, offset: 1344)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !4, line: 494, baseType: !274, size: 32, offset: 1472)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !372, file: !4, line: 495, baseType: !274, size: 32, offset: 1504)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !372, file: !4, line: 497, baseType: !274, size: 32, offset: 1536)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !372, file: !4, line: 498, baseType: !274, size: 32, offset: 1568)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !366, file: !367, line: 844, baseType: !370, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !366, file: !367, line: 848, baseType: !385, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !367, line: 549, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !367, line: 544, size: 320, elements: !388)
!388 = !{!389, !391, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !367, line: 545, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !387, file: !367, line: 545, baseType: !390, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !387, file: !367, line: 547, baseType: !370, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !387, file: !367, line: 548, baseType: !267, size: 128, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !366, file: !367, line: 851, baseType: !267, size: 128, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !366, file: !367, line: 853, baseType: !396, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !367, line: 594, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !367, line: 561, size: 1664, elements: !399)
!399 = !{!400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !367, line: 562, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !398, file: !367, line: 562, baseType: !401, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !398, file: !367, line: 564, baseType: !267, size: 128, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !398, file: !367, line: 565, baseType: !370, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !398, file: !367, line: 566, baseType: !385, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !398, file: !367, line: 568, baseType: !267, size: 128, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !398, file: !367, line: 569, baseType: !267, size: 128, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !367, line: 571, baseType: !350, size: 512, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !398, file: !367, line: 573, baseType: !248, size: 32, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !398, file: !367, line: 574, baseType: !248, size: 32, offset: 1184)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !398, file: !367, line: 576, baseType: !248, size: 32, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !398, file: !367, line: 576, baseType: !248, size: 32, offset: 1248)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !398, file: !367, line: 577, baseType: !248, size: 32, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !398, file: !367, line: 577, baseType: !248, size: 32, offset: 1312)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !398, file: !367, line: 579, baseType: !248, size: 32, offset: 1344)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !398, file: !367, line: 580, baseType: !248, size: 32, offset: 1376)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !398, file: !367, line: 582, baseType: !248, size: 32, offset: 1408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !398, file: !367, line: 582, baseType: !248, size: 32, offset: 1440)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !398, file: !367, line: 583, baseType: !278, size: 16, offset: 1472)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !398, file: !367, line: 585, baseType: !278, size: 16, offset: 1488)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !398, file: !367, line: 586, baseType: !278, size: 16, offset: 1504)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !398, file: !367, line: 588, baseType: !278, size: 16, offset: 1520)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !398, file: !367, line: 590, baseType: !249, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !367, line: 592, baseType: !274, size: 32, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !398, file: !367, line: 593, baseType: !274, size: 32, offset: 1632)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !366, file: !367, line: 858, baseType: !267, size: 128, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !366, file: !367, line: 859, baseType: !267, size: 128, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !367, line: 862, baseType: !274, size: 32, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !366, file: !367, line: 863, baseType: !274, size: 32, offset: 672)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !366, file: !367, line: 866, baseType: !278, size: 16, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !366, file: !367, line: 867, baseType: !278, size: 16, offset: 720)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !366, file: !367, line: 868, baseType: !248, size: 32, offset: 736)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !299, file: !300, line: 119, baseType: !434, size: 64, offset: 1024)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !300, line: 57, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !300, line: 121, baseType: !278, size: 16, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !299, file: !300, line: 121, baseType: !278, size: 16, offset: 1104)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !299, file: !300, line: 122, baseType: !274, size: 32, offset: 1120)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !299, file: !300, line: 122, baseType: !274, size: 32, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !299, file: !300, line: 122, baseType: !274, size: 32, offset: 1184)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !299, file: !300, line: 123, baseType: !350, size: 512, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !299, file: !300, line: 124, baseType: !298, size: 64, offset: 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !299, file: !300, line: 124, baseType: !298, size: 64, offset: 1792)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !299, file: !300, line: 127, baseType: !298, size: 64, offset: 1856)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !299, file: !300, line: 127, baseType: !298, size: 64, offset: 1920)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !299, file: !300, line: 127, baseType: !298, size: 64, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !299, file: !300, line: 128, baseType: !448, size: 64, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !450, line: 46, flags: DIFlagFwdDecl)
!450 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !299, file: !300, line: 130, baseType: !452, size: 64, offset: 2112)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !300, line: 97, size: 832, elements: !454)
!454 = !{!455, !458, !459}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !453, file: !300, line: 98, baseType: !456, size: 768)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 768, elements: !457)
!457 = !{!280, !292}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !300, line: 99, baseType: !274, size: 32, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !453, file: !300, line: 99, baseType: !274, size: 32, offset: 800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !299, file: !300, line: 131, baseType: !461, size: 64, offset: 2176)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !299, file: !300, line: 132, baseType: !461, size: 64, offset: 2240)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !299, file: !300, line: 133, baseType: !464, size: 64, offset: 2304)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !4, line: 334, size: 1728, elements: !466)
!466 = !{!467, !468, !471, !472, !473, !474, !475, !476, !478, !479, !480, !481, !482, !483, !484, !504}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !465, file: !4, line: 335, baseType: !267, size: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !465, file: !4, line: 336, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !4, line: 47, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !4, line: 338, baseType: !278, size: 16, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !4, line: 338, baseType: !278, size: 16, offset: 208)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !465, file: !4, line: 339, baseType: !5, size: 32, offset: 224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !465, file: !4, line: 340, baseType: !274, size: 32, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !465, file: !4, line: 342, baseType: !248, size: 32, offset: 288)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !465, file: !4, line: 343, baseType: !477, size: 96, offset: 320)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 96, elements: !291)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !465, file: !4, line: 344, baseType: !477, size: 96, offset: 416)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !465, file: !4, line: 347, baseType: !267, size: 128, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !465, file: !4, line: 349, baseType: !274, size: 32, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !465, file: !4, line: 350, baseType: !274, size: 32, offset: 672)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !465, file: !4, line: 351, baseType: !249, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !465, file: !4, line: 352, baseType: !249, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !465, file: !4, line: 354, baseType: !485, size: 384, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !4, line: 116, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !4, line: 94, size: 384, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !486, file: !4, line: 96, baseType: !274, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !486, file: !4, line: 96, baseType: !274, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !486, file: !4, line: 97, baseType: !274, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !486, file: !4, line: 97, baseType: !274, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !486, file: !4, line: 99, baseType: !278, size: 16, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !486, file: !4, line: 100, baseType: !278, size: 16, offset: 144)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !486, file: !4, line: 102, baseType: !278, size: 16, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !486, file: !4, line: 105, baseType: !278, size: 16, offset: 176)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !486, file: !4, line: 108, baseType: !278, size: 16, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !486, file: !4, line: 109, baseType: !278, size: 16, offset: 208)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !486, file: !4, line: 111, baseType: !278, size: 16, offset: 224)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !486, file: !4, line: 112, baseType: !278, size: 16, offset: 240)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !486, file: !4, line: 114, baseType: !274, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !486, file: !4, line: 114, baseType: !274, size: 32, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !486, file: !4, line: 115, baseType: !274, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !486, file: !4, line: 115, baseType: !274, size: 32, offset: 352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !465, file: !4, line: 355, baseType: !350, size: 512, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !300, line: 134, baseType: !249, size: 64, offset: 2368)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !299, file: !300, line: 136, baseType: !507, size: 64, offset: 2432)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !509, line: 61, flags: DIFlagFwdDecl)
!509 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!510 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !299, file: !300, line: 138, baseType: !485, size: 384, offset: 2496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !299, file: !300, line: 139, baseType: !512, size: 64, offset: 2880)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !4, line: 80, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !4, line: 72, size: 192, elements: !515)
!515 = !{!516, !523, !524, !525, !526}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !514, file: !4, line: 73, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !4, line: 59, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !4, line: 56, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !519, file: !4, line: 57, baseType: !477, size: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !519, file: !4, line: 58, baseType: !274, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !514, file: !4, line: 74, baseType: !274, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !514, file: !4, line: 76, baseType: !274, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !514, file: !4, line: 77, baseType: !274, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !4, line: 79, baseType: !274, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !299, file: !300, line: 141, baseType: !267, size: 128, offset: 2944)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !299, file: !300, line: 142, baseType: !267, size: 128, offset: 3072)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !299, file: !300, line: 143, baseType: !267, size: 128, offset: 3200)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !299, file: !300, line: 144, baseType: !267, size: 128, offset: 3328)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !299, file: !300, line: 146, baseType: !274, size: 32, offset: 3456)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !299, file: !300, line: 147, baseType: !274, size: 32, offset: 3488)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !299, file: !300, line: 150, baseType: !534, size: 64, offset: 3520)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !537, line: 46, flags: DIFlagFwdDecl)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !299, file: !300, line: 151, baseType: !539, size: 64, offset: 3584)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !299, file: !300, line: 152, baseType: !274, size: 32, offset: 3648)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !299, file: !300, line: 153, baseType: !274, size: 32, offset: 3680)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !299, file: !300, line: 156, baseType: !477, size: 96, offset: 3712)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !299, file: !300, line: 156, baseType: !477, size: 96, offset: 3808)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !299, file: !300, line: 156, baseType: !477, size: 96, offset: 3904)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !300, line: 157, baseType: !477, size: 96, offset: 4000)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !299, file: !300, line: 158, baseType: !477, size: 96, offset: 4096)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !299, file: !300, line: 159, baseType: !477, size: 96, offset: 4192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !299, file: !300, line: 160, baseType: !477, size: 96, offset: 4288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !299, file: !300, line: 160, baseType: !477, size: 96, offset: 4384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !299, file: !300, line: 161, baseType: !282, size: 128, offset: 4480)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !299, file: !300, line: 161, baseType: !282, size: 128, offset: 4608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !299, file: !300, line: 162, baseType: !477, size: 96, offset: 4736)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !299, file: !300, line: 162, baseType: !477, size: 96, offset: 4832)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !299, file: !300, line: 163, baseType: !248, size: 32, offset: 4928)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !299, file: !300, line: 163, baseType: !248, size: 32, offset: 4960)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !299, file: !300, line: 164, baseType: !557, size: 512, offset: 4992)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 512, elements: !558)
!558 = !{!284, !284}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !299, file: !300, line: 165, baseType: !557, size: 512, offset: 5504)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !299, file: !300, line: 166, baseType: !557, size: 512, offset: 6016)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !299, file: !300, line: 167, baseType: !557, size: 512, offset: 6528)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !299, file: !300, line: 176, baseType: !557, size: 512, offset: 7040)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !299, file: !300, line: 178, baseType: !5, size: 32, offset: 7552)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !300, line: 180, baseType: !278, size: 16, offset: 7584)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !299, file: !300, line: 181, baseType: !278, size: 16, offset: 7600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !299, file: !300, line: 183, baseType: !278, size: 16, offset: 7616)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !299, file: !300, line: 183, baseType: !278, size: 16, offset: 7632)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !299, file: !300, line: 184, baseType: !278, size: 16, offset: 7648)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !299, file: !300, line: 184, baseType: !278, size: 16, offset: 7664)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !299, file: !300, line: 185, baseType: !278, size: 16, offset: 7680)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !299, file: !300, line: 186, baseType: !278, size: 16, offset: 7696)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !299, file: !300, line: 187, baseType: !278, size: 16, offset: 7712)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !299, file: !300, line: 188, baseType: !288, size: 8, offset: 7728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !299, file: !300, line: 189, baseType: !288, size: 8, offset: 7736)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !299, file: !300, line: 192, baseType: !274, size: 32, offset: 7744)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !299, file: !300, line: 192, baseType: !274, size: 32, offset: 7776)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !299, file: !300, line: 192, baseType: !274, size: 32, offset: 7808)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !299, file: !300, line: 192, baseType: !274, size: 32, offset: 7840)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !299, file: !300, line: 194, baseType: !274, size: 32, offset: 7872)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !299, file: !300, line: 202, baseType: !248, size: 32, offset: 7904)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !299, file: !300, line: 202, baseType: !248, size: 32, offset: 7936)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !299, file: !300, line: 202, baseType: !248, size: 32, offset: 7968)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !299, file: !300, line: 211, baseType: !248, size: 32, offset: 8000)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !299, file: !300, line: 212, baseType: !248, size: 32, offset: 8032)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !299, file: !300, line: 213, baseType: !248, size: 32, offset: 8064)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !299, file: !300, line: 214, baseType: !248, size: 32, offset: 8096)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !299, file: !300, line: 215, baseType: !248, size: 32, offset: 8128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !299, file: !300, line: 216, baseType: !248, size: 32, offset: 8160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !299, file: !300, line: 219, baseType: !248, size: 32, offset: 8192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !299, file: !300, line: 220, baseType: !248, size: 32, offset: 8224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !299, file: !300, line: 221, baseType: !248, size: 32, offset: 8256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !299, file: !300, line: 224, baseType: !593, size: 16, offset: 8288)
!593 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !299, file: !300, line: 224, baseType: !593, size: 16, offset: 8304)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !299, file: !300, line: 226, baseType: !278, size: 16, offset: 8320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !299, file: !300, line: 228, baseType: !288, size: 8, offset: 8336)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !299, file: !300, line: 229, baseType: !288, size: 8, offset: 8344)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !299, file: !300, line: 231, baseType: !278, size: 16, offset: 8352)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !299, file: !300, line: 232, baseType: !288, size: 8, offset: 8368)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !299, file: !300, line: 233, baseType: !288, size: 8, offset: 8376)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !299, file: !300, line: 234, baseType: !248, size: 32, offset: 8384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !299, file: !300, line: 235, baseType: !248, size: 32, offset: 8416)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !299, file: !300, line: 237, baseType: !267, size: 128, offset: 8448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !299, file: !300, line: 238, baseType: !267, size: 128, offset: 8576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !299, file: !300, line: 239, baseType: !267, size: 128, offset: 8704)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !299, file: !300, line: 240, baseType: !267, size: 128, offset: 8832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !299, file: !300, line: 242, baseType: !248, size: 32, offset: 8960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !299, file: !300, line: 244, baseType: !278, size: 16, offset: 8992)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !299, file: !300, line: 245, baseType: !593, size: 16, offset: 9008)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !299, file: !300, line: 246, baseType: !282, size: 128, offset: 9024)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !299, file: !300, line: 248, baseType: !274, size: 32, offset: 9152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !299, file: !300, line: 249, baseType: !274, size: 32, offset: 9184)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !299, file: !300, line: 251, baseType: !614, size: 64, offset: 9216)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !300, line: 251, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !299, file: !300, line: 253, baseType: !288, size: 8, offset: 9280)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !299, file: !300, line: 254, baseType: !288, size: 8, offset: 9288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !299, file: !300, line: 255, baseType: !278, size: 16, offset: 9296)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !299, file: !300, line: 256, baseType: !477, size: 96, offset: 9312)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !299, file: !300, line: 258, baseType: !267, size: 128, offset: 9408)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !299, file: !300, line: 259, baseType: !267, size: 128, offset: 9536)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !299, file: !300, line: 260, baseType: !267, size: 128, offset: 9664)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !299, file: !300, line: 261, baseType: !267, size: 128, offset: 9792)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !299, file: !300, line: 263, baseType: !625, size: 64, offset: 9920)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !300, line: 52, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !299, file: !300, line: 264, baseType: !628, size: 64, offset: 9984)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !300, line: 53, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !299, file: !300, line: 265, baseType: !631, size: 64, offset: 10048)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !4, line: 46, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !299, file: !300, line: 267, baseType: !288, size: 8, offset: 10112)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !299, file: !300, line: 268, baseType: !288, size: 8, offset: 10120)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !299, file: !300, line: 269, baseType: !278, size: 16, offset: 10128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !299, file: !300, line: 270, baseType: !248, size: 32, offset: 10144)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !299, file: !300, line: 272, baseType: !638, size: 64, offset: 10176)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !300, line: 54, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !299, file: !300, line: 275, baseType: !641, size: 64, offset: 10240)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !300, line: 275, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !299, file: !300, line: 277, baseType: !644, size: 64, offset: 10304)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !300, line: 56, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !299, file: !300, line: 277, baseType: !644, size: 64, offset: 10368)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !299, file: !300, line: 278, baseType: !648, size: 64, offset: 10432)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !649, line: 27, baseType: !650)
!649 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !651, line: 45, baseType: !652)
!651 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!652 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !299, file: !300, line: 279, baseType: !648, size: 64, offset: 10496)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !299, file: !300, line: 280, baseType: !5, size: 32, offset: 10560)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !299, file: !300, line: 281, baseType: !5, size: 32, offset: 10592)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !299, file: !300, line: 283, baseType: !267, size: 128, offset: 10624)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !299, file: !300, line: 284, baseType: !267, size: 128, offset: 10752)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !299, file: !300, line: 285, baseType: !659, size: 64, offset: 10880)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !299, file: !300, line: 287, baseType: !661, size: 64, offset: 10944)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !300, line: 59, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !299, file: !300, line: 288, baseType: !664, size: 64, offset: 11008)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !300, line: 288, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !299, file: !300, line: 290, baseType: !667, size: 64, offset: 11072)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 64, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 2)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !299, file: !300, line: 291, baseType: !671, size: 64, offset: 11136)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !673, line: 65, baseType: !674)
!673 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !673, line: 50, size: 320, elements: !675)
!675 = !{!676, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !674, file: !673, line: 51, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !509, line: 1216, size: 39680, elements: !679)
!679 = !{!680, !681, !682, !683, !686, !687, !688, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !714, !717, !720, !1014, !1017, !1316, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1338, !1339, !1340, !1341, !1342, !1350, !1417, !1424, !1425, !1432, !1640, !1641, !1642, !1643, !1644, !1645}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !678, file: !509, line: 1217, baseType: !303, size: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !678, file: !509, line: 1218, baseType: !365, size: 64, offset: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !678, file: !509, line: 1220, baseType: !298, size: 64, offset: 1024)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !678, file: !509, line: 1221, baseType: !684, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !509, line: 52, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !678, file: !509, line: 1223, baseType: !677, size: 64, offset: 1152)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !678, file: !509, line: 1225, baseType: !267, size: 128, offset: 1216)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !678, file: !509, line: 1226, baseType: !689, size: 64, offset: 1344)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !509, line: 69, size: 320, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !690, file: !509, line: 70, baseType: !689, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !690, file: !509, line: 70, baseType: !689, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !690, file: !509, line: 71, baseType: !5, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !690, file: !509, line: 71, baseType: !5, size: 32, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !690, file: !509, line: 72, baseType: !274, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !690, file: !509, line: 73, baseType: !278, size: 16, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !690, file: !509, line: 73, baseType: !278, size: 16, offset: 240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !690, file: !509, line: 74, baseType: !298, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !678, file: !509, line: 1227, baseType: !298, size: 64, offset: 1408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !678, file: !509, line: 1229, baseType: !477, size: 96, offset: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !678, file: !509, line: 1230, baseType: !477, size: 96, offset: 1568)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !678, file: !509, line: 1231, baseType: !477, size: 96, offset: 1664)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !678, file: !509, line: 1231, baseType: !477, size: 96, offset: 1760)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !678, file: !509, line: 1233, baseType: !5, size: 32, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !678, file: !509, line: 1234, baseType: !274, size: 32, offset: 1888)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !678, file: !509, line: 1235, baseType: !5, size: 32, offset: 1920)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !678, file: !509, line: 1237, baseType: !278, size: 16, offset: 1952)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !678, file: !509, line: 1239, baseType: !288, size: 8, offset: 1968)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !678, file: !509, line: 1240, baseType: !711, size: 8, offset: 1976)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 8, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 1)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !678, file: !509, line: 1242, baseType: !715, size: 64, offset: 1984)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !450, line: 248, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !678, file: !509, line: 1244, baseType: !718, size: 64, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !509, line: 59, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !678, file: !509, line: 1246, baseType: !721, size: 64, offset: 2112)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !509, line: 1067, size: 5184, elements: !723)
!723 = !{!724, !755, !756, !771, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !793, !887, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !997}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !722, file: !509, line: 1068, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !509, line: 934, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !509, line: 925, size: 576, elements: !728)
!728 = !{!729, !746, !747, !748, !749, !751, !754}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !727, file: !509, line: 926, baseType: !730, size: 320)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !509, line: 830, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !509, line: 813, size: 320, elements: !732)
!732 = !{!733, !736, !739, !740, !743, !744, !745}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !731, file: !509, line: 814, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !509, line: 51, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !731, file: !509, line: 815, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !509, line: 815, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !731, file: !509, line: 818, baseType: !249, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !731, file: !509, line: 819, baseType: !741, size: 32, offset: 192)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 32, elements: !283)
!742 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !731, file: !509, line: 822, baseType: !274, size: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !731, file: !509, line: 826, baseType: !274, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !731, file: !509, line: 829, baseType: !274, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !727, file: !509, line: 928, baseType: !278, size: 16, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !727, file: !509, line: 928, baseType: !278, size: 16, offset: 336)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !727, file: !509, line: 929, baseType: !274, size: 32, offset: 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !727, file: !509, line: 930, baseType: !750, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !727, file: !509, line: 931, baseType: !752, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !509, line: 931, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !727, file: !509, line: 933, baseType: !249, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !722, file: !509, line: 1069, baseType: !725, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !722, file: !509, line: 1070, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !509, line: 916, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !509, line: 891, size: 704, elements: !760)
!760 = !{!761, !762, !763, !765, !766, !767, !768, !769, !770}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !759, file: !509, line: 892, baseType: !730, size: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !509, line: 896, baseType: !274, size: 32, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !759, file: !509, line: 900, baseType: !764, size: 96, offset: 352)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 96, elements: !291)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !759, file: !509, line: 903, baseType: !248, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !759, file: !509, line: 906, baseType: !274, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !759, file: !509, line: 909, baseType: !248, size: 32, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !759, file: !509, line: 912, baseType: !248, size: 32, offset: 544)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !759, file: !509, line: 914, baseType: !298, size: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !759, file: !509, line: 915, baseType: !249, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !722, file: !509, line: 1071, baseType: !772, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !509, line: 920, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !509, line: 918, size: 320, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !774, file: !509, line: 919, baseType: !730, size: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !722, file: !509, line: 1075, baseType: !248, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !722, file: !509, line: 1077, baseType: !248, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !722, file: !509, line: 1078, baseType: !248, size: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !722, file: !509, line: 1079, baseType: !278, size: 16, offset: 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !722, file: !509, line: 1082, baseType: !278, size: 16, offset: 368)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !722, file: !509, line: 1085, baseType: !288, size: 8, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !722, file: !509, line: 1086, baseType: !288, size: 8, offset: 392)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !722, file: !509, line: 1087, baseType: !288, size: 8, offset: 400)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !722, file: !509, line: 1088, baseType: !288, size: 8, offset: 408)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !722, file: !509, line: 1090, baseType: !248, size: 32, offset: 416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !722, file: !509, line: 1093, baseType: !278, size: 16, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !722, file: !509, line: 1096, baseType: !288, size: 8, offset: 464)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !722, file: !509, line: 1098, baseType: !790, size: 40, offset: 472)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 40, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 5)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !722, file: !509, line: 1101, baseType: !794, size: 832, offset: 512)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !509, line: 836, size: 832, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !803, !804, !805, !883, !884, !885, !886}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !794, file: !509, line: 837, baseType: !730, size: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !509, line: 839, baseType: !278, size: 16, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !794, file: !509, line: 839, baseType: !278, size: 16, offset: 336)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !794, file: !509, line: 842, baseType: !278, size: 16, offset: 352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !794, file: !509, line: 842, baseType: !278, size: 16, offset: 368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !794, file: !509, line: 843, baseType: !802, size: 32, offset: 384)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 32, elements: !668)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !509, line: 845, baseType: !274, size: 32, offset: 416)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !794, file: !509, line: 847, baseType: !249, size: 64, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !794, file: !509, line: 848, baseType: !806, size: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !673, line: 77, size: 15424, elements: !808)
!808 = !{!809, !810, !811, !814, !817, !820, !823, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !872, !873, !877}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !807, file: !673, line: 78, baseType: !303, size: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !807, file: !673, line: 80, baseType: !322, size: 8192, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !807, file: !673, line: 82, baseType: !812, size: 64, offset: 9152)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !673, line: 43, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !807, file: !673, line: 83, baseType: !815, size: 64, offset: 9216)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !304, line: 46, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !807, file: !673, line: 86, baseType: !818, size: 64, offset: 9280)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !673, line: 41, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !807, file: !673, line: 87, baseType: !821, size: 64, offset: 9344)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !673, line: 44, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !807, file: !673, line: 89, baseType: !824, size: 512, offset: 9408)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 512, elements: !279)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !807, file: !673, line: 90, baseType: !278, size: 16, offset: 9920)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !807, file: !673, line: 90, baseType: !278, size: 16, offset: 9936)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !807, file: !673, line: 92, baseType: !278, size: 16, offset: 9952)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !673, line: 92, baseType: !278, size: 16, offset: 9968)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !807, file: !673, line: 93, baseType: !278, size: 16, offset: 9984)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !673, line: 93, baseType: !278, size: 16, offset: 10000)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !807, file: !673, line: 94, baseType: !274, size: 32, offset: 10016)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !807, file: !673, line: 97, baseType: !278, size: 16, offset: 10048)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !807, file: !673, line: 97, baseType: !278, size: 16, offset: 10064)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !807, file: !673, line: 98, baseType: !278, size: 16, offset: 10080)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !807, file: !673, line: 98, baseType: !278, size: 16, offset: 10096)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !807, file: !673, line: 99, baseType: !278, size: 16, offset: 10112)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !807, file: !673, line: 99, baseType: !278, size: 16, offset: 10128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !807, file: !673, line: 100, baseType: !5, size: 32, offset: 10144)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !807, file: !673, line: 101, baseType: !750, size: 64, offset: 10176)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !807, file: !673, line: 103, baseType: !328, size: 64, offset: 10240)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !807, file: !673, line: 104, baseType: !842, size: 64, offset: 10304)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !304, line: 159, size: 448, elements: !844)
!844 = !{!845, !847, !848, !849, !850, !852}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !843, file: !304, line: 161, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !668)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !843, file: !304, line: 162, baseType: !846, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !843, file: !304, line: 163, baseType: !802, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !843, file: !304, line: 164, baseType: !802, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !843, file: !304, line: 165, baseType: !851, size: 128, offset: 192)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 128, elements: !668)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !843, file: !304, line: 166, baseType: !853, size: 128, offset: 320)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 128, elements: !668)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !807, file: !673, line: 107, baseType: !248, size: 32, offset: 10368)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !807, file: !673, line: 108, baseType: !274, size: 32, offset: 10400)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !807, file: !673, line: 109, baseType: !278, size: 16, offset: 10432)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !807, file: !673, line: 110, baseType: !278, size: 16, offset: 10448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !807, file: !673, line: 113, baseType: !274, size: 32, offset: 10464)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !807, file: !673, line: 113, baseType: !274, size: 32, offset: 10496)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !807, file: !673, line: 114, baseType: !288, size: 8, offset: 10528)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !807, file: !673, line: 114, baseType: !288, size: 8, offset: 10536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !807, file: !673, line: 115, baseType: !278, size: 16, offset: 10544)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !807, file: !673, line: 116, baseType: !282, size: 128, offset: 10560)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !807, file: !673, line: 119, baseType: !248, size: 32, offset: 10688)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !807, file: !673, line: 119, baseType: !248, size: 32, offset: 10720)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !807, file: !673, line: 122, baseType: !867, size: 512, offset: 10752)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !868, line: 182, baseType: !869)
!868 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !868, line: 180, size: 512, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !868, line: 181, baseType: !350, size: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !807, file: !673, line: 123, baseType: !288, size: 8, offset: 11264)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !673, line: 125, baseType: !874, size: 56, offset: 11272)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 56, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 7)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !807, file: !673, line: 126, baseType: !878, size: 4096, offset: 11328)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 4096, elements: !279)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !673, line: 69, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !673, line: 67, size: 512, elements: !881)
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !880, file: !673, line: 68, baseType: !350, size: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !794, file: !509, line: 849, baseType: !806, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !794, file: !509, line: 850, baseType: !806, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !794, file: !509, line: 851, baseType: !477, size: 96, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !794, file: !509, line: 852, baseType: !248, size: 32, offset: 800)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !722, file: !509, line: 1104, baseType: !888, size: 1344, offset: 1344)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !509, line: 867, size: 1344, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !888, file: !509, line: 868, baseType: !278, size: 16)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !888, file: !509, line: 869, baseType: !278, size: 16, offset: 16)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !888, file: !509, line: 870, baseType: !278, size: 16, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !888, file: !509, line: 871, baseType: !278, size: 16, offset: 48)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !888, file: !509, line: 873, baseType: !895, size: 896, offset: 64)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 896, elements: !875)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !509, line: 864, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !509, line: 859, size: 128, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !897, file: !509, line: 860, baseType: !278, size: 16)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !897, file: !509, line: 861, baseType: !278, size: 16, offset: 16)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !897, file: !509, line: 861, baseType: !278, size: 16, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !897, file: !509, line: 861, baseType: !278, size: 16, offset: 48)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !897, file: !509, line: 862, baseType: !274, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !897, file: !509, line: 863, baseType: !248, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !888, file: !509, line: 874, baseType: !249, size: 64, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !888, file: !509, line: 876, baseType: !248, size: 32, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !888, file: !509, line: 876, baseType: !248, size: 32, offset: 1056)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !888, file: !509, line: 878, baseType: !274, size: 32, offset: 1088)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !888, file: !509, line: 879, baseType: !274, size: 32, offset: 1120)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !888, file: !509, line: 881, baseType: !274, size: 32, offset: 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !888, file: !509, line: 881, baseType: !274, size: 32, offset: 1184)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !888, file: !509, line: 883, baseType: !677, size: 64, offset: 1216)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !888, file: !509, line: 884, baseType: !298, size: 64, offset: 1280)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !722, file: !509, line: 1107, baseType: !248, size: 32, offset: 2688)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !722, file: !509, line: 1110, baseType: !248, size: 32, offset: 2720)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !722, file: !509, line: 1113, baseType: !278, size: 16, offset: 2752)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !722, file: !509, line: 1113, baseType: !278, size: 16, offset: 2768)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !722, file: !509, line: 1116, baseType: !288, size: 8, offset: 2784)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !722, file: !509, line: 1117, baseType: !711, size: 8, offset: 2792)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !722, file: !509, line: 1120, baseType: !278, size: 16, offset: 2800)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !722, file: !509, line: 1121, baseType: !248, size: 32, offset: 2816)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !722, file: !509, line: 1122, baseType: !248, size: 32, offset: 2848)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !722, file: !509, line: 1123, baseType: !248, size: 32, offset: 2880)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !722, file: !509, line: 1124, baseType: !248, size: 32, offset: 2912)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !722, file: !509, line: 1125, baseType: !248, size: 32, offset: 2944)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !722, file: !509, line: 1126, baseType: !248, size: 32, offset: 2976)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !722, file: !509, line: 1127, baseType: !248, size: 32, offset: 3008)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !722, file: !509, line: 1128, baseType: !248, size: 32, offset: 3040)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !722, file: !509, line: 1129, baseType: !248, size: 32, offset: 3072)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !722, file: !509, line: 1130, baseType: !248, size: 32, offset: 3104)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !722, file: !509, line: 1131, baseType: !278, size: 16, offset: 3136)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !722, file: !509, line: 1132, baseType: !288, size: 8, offset: 3152)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !722, file: !509, line: 1133, baseType: !288, size: 8, offset: 3160)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !722, file: !509, line: 1134, baseType: !290, size: 24, offset: 3168)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !722, file: !509, line: 1135, baseType: !288, size: 8, offset: 3192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !722, file: !509, line: 1138, baseType: !298, size: 64, offset: 3200)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !722, file: !509, line: 1139, baseType: !288, size: 8, offset: 3264)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !722, file: !509, line: 1140, baseType: !288, size: 8, offset: 3272)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !722, file: !509, line: 1141, baseType: !288, size: 8, offset: 3280)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !722, file: !509, line: 1142, baseType: !288, size: 8, offset: 3288)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !722, file: !509, line: 1143, baseType: !288, size: 8, offset: 3296)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !722, file: !509, line: 1144, baseType: !943, size: 64, offset: 3304)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 64, elements: !279)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !722, file: !509, line: 1145, baseType: !943, size: 64, offset: 3368)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !722, file: !509, line: 1148, baseType: !288, size: 8, offset: 3432)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !722, file: !509, line: 1149, baseType: !288, size: 8, offset: 3440)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !722, file: !509, line: 1152, baseType: !288, size: 8, offset: 3448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !722, file: !509, line: 1152, baseType: !288, size: 8, offset: 3456)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !722, file: !509, line: 1153, baseType: !288, size: 8, offset: 3464)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !722, file: !509, line: 1154, baseType: !278, size: 16, offset: 3472)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !722, file: !509, line: 1154, baseType: !278, size: 16, offset: 3488)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !722, file: !509, line: 1155, baseType: !278, size: 16, offset: 3504)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !722, file: !509, line: 1155, baseType: !278, size: 16, offset: 3520)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !722, file: !509, line: 1156, baseType: !288, size: 8, offset: 3536)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !722, file: !509, line: 1157, baseType: !288, size: 8, offset: 3544)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !722, file: !509, line: 1159, baseType: !288, size: 8, offset: 3552)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !722, file: !509, line: 1160, baseType: !288, size: 8, offset: 3560)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !722, file: !509, line: 1161, baseType: !288, size: 8, offset: 3568)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !722, file: !509, line: 1162, baseType: !288, size: 8, offset: 3576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !722, file: !509, line: 1165, baseType: !274, size: 32, offset: 3584)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !722, file: !509, line: 1166, baseType: !274, size: 32, offset: 3616)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !722, file: !509, line: 1167, baseType: !274, size: 32, offset: 3648)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !722, file: !509, line: 1168, baseType: !274, size: 32, offset: 3680)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !722, file: !509, line: 1171, baseType: !278, size: 16, offset: 3712)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !722, file: !509, line: 1171, baseType: !278, size: 16, offset: 3728)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !722, file: !509, line: 1172, baseType: !274, size: 32, offset: 3744)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !722, file: !509, line: 1173, baseType: !248, size: 32, offset: 3776)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !722, file: !509, line: 1174, baseType: !248, size: 32, offset: 3808)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !722, file: !509, line: 1177, baseType: !970, size: 1024, offset: 3840)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !509, line: 963, size: 1024, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !995, !996}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !970, file: !509, line: 965, baseType: !274, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !970, file: !509, line: 968, baseType: !248, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !970, file: !509, line: 971, baseType: !248, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !970, file: !509, line: 974, baseType: !248, size: 32, offset: 96)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !970, file: !509, line: 977, baseType: !477, size: 96, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !970, file: !509, line: 979, baseType: !477, size: 96, offset: 224)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !970, file: !509, line: 982, baseType: !274, size: 32, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !970, file: !509, line: 987, baseType: !667, size: 64, offset: 352)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !970, file: !509, line: 989, baseType: !248, size: 32, offset: 416)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !970, file: !509, line: 994, baseType: !274, size: 32, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !970, file: !509, line: 995, baseType: !274, size: 32, offset: 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !970, file: !509, line: 997, baseType: !288, size: 8, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !970, file: !509, line: 998, baseType: !874, size: 56, offset: 520)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !970, file: !509, line: 1000, baseType: !248, size: 32, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !970, file: !509, line: 1003, baseType: !667, size: 64, offset: 608)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !970, file: !509, line: 1006, baseType: !274, size: 32, offset: 672)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !970, file: !509, line: 1009, baseType: !248, size: 32, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !970, file: !509, line: 1012, baseType: !667, size: 64, offset: 736)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !970, file: !509, line: 1015, baseType: !667, size: 64, offset: 800)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !970, file: !509, line: 1018, baseType: !274, size: 32, offset: 864)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !970, file: !509, line: 1019, baseType: !993, size: 64, offset: 896)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !509, line: 63, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !970, file: !509, line: 1023, baseType: !248, size: 32, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !970, file: !509, line: 1024, baseType: !274, size: 32, offset: 992)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !722, file: !509, line: 1179, baseType: !998, size: 320, offset: 4864)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !509, line: 1043, size: 320, elements: !999)
!999 = !{!1000, !1001, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !998, file: !509, line: 1044, baseType: !288, size: 8)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !998, file: !509, line: 1045, baseType: !1002, size: 16, offset: 8)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 16, elements: !668)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !998, file: !509, line: 1048, baseType: !288, size: 8, offset: 24)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !998, file: !509, line: 1049, baseType: !248, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !998, file: !509, line: 1049, baseType: !248, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !998, file: !509, line: 1052, baseType: !248, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !998, file: !509, line: 1052, baseType: !248, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !998, file: !509, line: 1053, baseType: !288, size: 8, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !998, file: !509, line: 1054, baseType: !290, size: 24, offset: 168)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !998, file: !509, line: 1057, baseType: !248, size: 32, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !998, file: !509, line: 1057, baseType: !248, size: 32, offset: 224)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !998, file: !509, line: 1060, baseType: !248, size: 32, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !998, file: !509, line: 1060, baseType: !248, size: 32, offset: 288)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !678, file: !509, line: 1247, baseType: !1015, size: 64, offset: 2176)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
