; ModuleID = 'blender/source/blender/blenkernel/intern/tracking_plane_tracker.c'
source_filename = "blender/source/blender/blenkernel/intern/tracking_plane_tracker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MovieTrackingPlaneTrack = type { %struct.MovieTrackingPlaneTrack*, %struct.MovieTrackingPlaneTrack*, [64 x i8], %struct.MovieTrackingTrack**, i32, i32, %struct.MovieTrackingPlaneMarker*, i32, i32, %struct.Image*, float, i32 }
%struct.MovieTrackingTrack = type { %struct.MovieTrackingTrack*, %struct.MovieTrackingTrack*, [64 x i8], [2 x float], [2 x float], [2 x float], [2 x float], [2 x float], i32, i32, %struct.MovieTrackingMarker*, [3 x float], float, i32, i32, i32, [3 x float], i16, i16, i16, i16, i32, float, %struct.bGPdata*, float, float }
%struct.MovieTrackingMarker = type { [2 x float], [4 x [2 x float]], [2 x float], [2 x float], i32, i32 }
%struct.bGPdata = type opaque
%struct.MovieTrackingPlaneMarker = type { [4 x [2 x float]], i32, i32 }
%struct.Image = type opaque

@MEM_freeN = external dso_local global void (i8*)*, align 8
@__const.track_plane_from_existing_motion.vec = private unnamed_addr constant [3 x float] [float 0.000000e+00, float 0.000000e+00, float 1.000000e+00], align 4
@MEM_mallocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [25 x i8] c"point correspondences x1\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/tracking_plane_tracker.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 512, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "PLANE_TRACK_HIDDEN", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "PLANE_TRACK_LOCKED", value: 4, isUnsigned: true)
!9 = !DIEnumerator(name: "PLANE_TRACK_AUTOKEY", value: 8, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 506, baseType: !5, size: 32, elements: !11)
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "PLANE_MARKER_DISABLED", value: 1, isUnsigned: true)
!13 = !DIEnumerator(name: "PLANE_MARKER_TRACKED", value: 2, isUnsigned: true)
!14 = !{!15, !16, !17}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!17 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!18 = !{i32 7, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{i32 1, !"wchar_size", i32 4}
!21 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!22 = distinct !DISubprogram(name: "BKE_tracking_track_plane_from_existing_motion", scope: !1, file: !1, line: 180, type: !23, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !110)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25, !56}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !4, line: 205, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !4, line: 186, size: 1024, elements: !28)
!28 = !{!29, !31, !32, !37, !93, !94, !95, !103, !104, !105, !108, !109}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !4, line: 187, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !4, line: 187, baseType: !30, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !4, line: 189, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 512, elements: !35)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!36}
!36 = !DISubrange(count: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !27, file: !4, line: 191, baseType: !38, size: 64, offset: 640)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !4, line: 164, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !4, line: 108, size: 1664, elements: !42)
!42 = !{!43, !45, !46, !47, !51, !52, !53, !54, !55, !57, !58, !72, !76, !77, !78, !79, !80, !81, !83, !84, !85, !86, !87, !88, !91, !92}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !4, line: 109, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !41, file: !4, line: 109, baseType: !44, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !4, line: 111, baseType: !33, size: 512, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !41, file: !4, line: 119, baseType: !48, size: 64, offset: 640)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 2)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !41, file: !4, line: 119, baseType: !48, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !41, file: !4, line: 125, baseType: !48, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !41, file: !4, line: 125, baseType: !48, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !41, file: !4, line: 127, baseType: !48, size: 64, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !41, file: !4, line: 130, baseType: !56, size: 32, offset: 960)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !41, file: !4, line: 131, baseType: !56, size: 32, offset: 992)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !41, file: !4, line: 132, baseType: !59, size: 64, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !4, line: 106, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !4, line: 81, size: 512, elements: !62)
!62 = !{!63, !64, !68, !69, !70, !71}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !61, file: !4, line: 82, baseType: !48, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !61, file: !4, line: 97, baseType: !65, size: 256, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 256, elements: !66)
!66 = !{!67, !50}
!67 = !DISubrange(count: 4)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !61, file: !4, line: 102, baseType: !48, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !61, file: !4, line: 102, baseType: !48, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !61, file: !4, line: 104, baseType: !56, size: 32, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !61, file: !4, line: 105, baseType: !56, size: 32, offset: 480)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !41, file: !4, line: 135, baseType: !73, size: 96, offset: 1088)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 96, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !41, file: !4, line: 136, baseType: !16, size: 32, offset: 1184)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !41, file: !4, line: 139, baseType: !56, size: 32, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !41, file: !4, line: 139, baseType: !56, size: 32, offset: 1248)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !41, file: !4, line: 139, baseType: !56, size: 32, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !41, file: !4, line: 140, baseType: !73, size: 96, offset: 1312)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !41, file: !4, line: 143, baseType: !82, size: 16, offset: 1408)
!82 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !41, file: !4, line: 144, baseType: !82, size: 16, offset: 1424)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !41, file: !4, line: 145, baseType: !82, size: 16, offset: 1440)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !41, file: !4, line: 148, baseType: !82, size: 16, offset: 1456)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !41, file: !4, line: 149, baseType: !56, size: 32, offset: 1472)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !41, file: !4, line: 150, baseType: !16, size: 32, offset: 1504)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !41, file: !4, line: 152, baseType: !89, size: 64, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 45, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !41, file: !4, line: 163, baseType: !16, size: 32, offset: 1600)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !41, file: !4, line: 163, baseType: !16, size: 32, offset: 1632)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !27, file: !4, line: 193, baseType: !56, size: 32, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !27, file: !4, line: 193, baseType: !56, size: 32, offset: 736)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !27, file: !4, line: 195, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !4, line: 184, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !4, line: 166, size: 320, elements: !99)
!99 = !{!100, !101, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !98, file: !4, line: 180, baseType: !65, size: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !98, file: !4, line: 182, baseType: !56, size: 32, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !98, file: !4, line: 183, baseType: !56, size: 32, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !27, file: !4, line: 196, baseType: !56, size: 32, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !27, file: !4, line: 198, baseType: !56, size: 32, offset: 864)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !27, file: !4, line: 200, baseType: !106, size: 64, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !4, line: 47, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !27, file: !4, line: 201, baseType: !16, size: 32, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !27, file: !4, line: 204, baseType: !56, size: 32, offset: 992)
!110 = !{}
!111 = !DILocalVariable(name: "plane_track", arg: 1, scope: !22, file: !1, line: 180, type: !25)
!112 = !DILocation(line: 180, column: 77, scope: !22)
!113 = !DILocalVariable(name: "start_frame", arg: 2, scope: !22, file: !1, line: 180, type: !56)
!114 = !DILocation(line: 180, column: 94, scope: !22)
!115 = !DILocation(line: 182, column: 35, scope: !22)
!116 = !DILocation(line: 182, column: 48, scope: !22)
!117 = !DILocation(line: 182, column: 2, scope: !22)
!118 = !DILocation(line: 183, column: 35, scope: !22)
!119 = !DILocation(line: 183, column: 48, scope: !22)
!120 = !DILocation(line: 183, column: 2, scope: !22)
!121 = !DILocation(line: 184, column: 1, scope: !22)
!122 = distinct !DISubprogram(name: "track_plane_from_existing_motion", scope: !1, file: !1, line: 79, type: !123, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !110)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !25, !56, !56, !125}
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DILocalVariable(name: "plane_track", arg: 1, scope: !122, file: !1, line: 79, type: !25)
!127 = !DILocation(line: 79, column: 71, scope: !122)
!128 = !DILocalVariable(name: "start_frame", arg: 2, scope: !122, file: !1, line: 79, type: !56)
!129 = !DILocation(line: 79, column: 88, scope: !122)
!130 = !DILocalVariable(name: "direction", arg: 3, scope: !122, file: !1, line: 80, type: !56)
!131 = !DILocation(line: 80, column: 50, scope: !122)
!132 = !DILocalVariable(name: "retrack", arg: 4, scope: !122, file: !1, line: 80, type: !125)
!133 = !DILocation(line: 80, column: 66, scope: !122)
!134 = !DILocalVariable(name: "start_plane_marker", scope: !122, file: !1, line: 82, type: !96)
!135 = !DILocation(line: 82, column: 28, scope: !122)
!136 = !DILocation(line: 82, column: 79, scope: !122)
!137 = !DILocation(line: 82, column: 92, scope: !122)
!138 = !DILocation(line: 82, column: 49, scope: !122)
!139 = !DILocalVariable(name: "keyframe_plane_marker", scope: !122, file: !1, line: 83, type: !96)
!140 = !DILocation(line: 83, column: 28, scope: !122)
!141 = !DILocalVariable(name: "new_plane_marker", scope: !122, file: !1, line: 84, type: !97)
!142 = !DILocation(line: 84, column: 27, scope: !122)
!143 = !DILocalVariable(name: "current_frame", scope: !122, file: !1, line: 85, type: !56)
!144 = !DILocation(line: 85, column: 6, scope: !122)
!145 = !DILocalVariable(name: "frame_delta", scope: !122, file: !1, line: 85, type: !56)
!146 = !DILocation(line: 85, column: 21, scope: !122)
!147 = !DILocation(line: 85, column: 35, scope: !122)
!148 = !DILocation(line: 85, column: 45, scope: !122)
!149 = !DILocation(line: 87, column: 6, scope: !150)
!150 = distinct !DILexicalBlock(scope: !122, file: !1, line: 87, column: 6)
!151 = !DILocation(line: 87, column: 19, scope: !150)
!152 = !DILocation(line: 87, column: 24, scope: !150)
!153 = !DILocation(line: 87, column: 6, scope: !122)
!154 = !DILocation(line: 89, column: 24, scope: !155)
!155 = distinct !DILexicalBlock(scope: !156, file: !1, line: 89, column: 3)
!156 = distinct !DILexicalBlock(scope: !150, file: !1, line: 87, column: 47)
!157 = !DILocation(line: 89, column: 22, scope: !155)
!158 = !DILocation(line: 89, column: 8, scope: !155)
!159 = !DILocalVariable(name: "next_plane_marker", scope: !160, file: !1, line: 90, type: !96)
!160 = distinct !DILexicalBlock(scope: !161, file: !1, line: 89, column: 69)
!161 = distinct !DILexicalBlock(scope: !155, file: !1, line: 89, column: 3)
!162 = !DILocation(line: 90, column: 30, scope: !160)
!163 = !DILocation(line: 91, column: 41, scope: !160)
!164 = !DILocation(line: 91, column: 54, scope: !160)
!165 = !DILocation(line: 91, column: 70, scope: !160)
!166 = !DILocation(line: 91, column: 68, scope: !160)
!167 = !DILocation(line: 91, column: 5, scope: !160)
