; ModuleID = 'blender/source/blender/editors/space_node/node_group.c'
source_filename = "blender/source/blender/editors/space_node/node_group.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!847 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!848 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!849 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!850 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!851 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!852 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!853 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!854 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!855 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!856 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!857 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!858 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!859 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!860 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!861 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!862 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!863 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!864 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!865 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!866 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!867 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!868 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!869 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!870 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!871 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!872 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!873 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!874 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!875 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!876 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!877 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!878 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!879 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!880 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!881 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!882 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!883 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!884 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!885 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!886 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!887 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!888 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !890, line: 141, baseType: !6, size: 32, elements: !891)
!890 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!892 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!893 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!894 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!895 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!896 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!897 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!898 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!899 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!900 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!901 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!902 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!903 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!904 = !{!905, !915, !925}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeTree", file: !31, line: 391, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !31, line: 328, size: 3456, elements: !908)
!908 = !{!909, !981, !1052, !3141, !3142, !3143, !3144, !3145, !3146, !3147, !3148, !3149, !3150, !3151, !3152, !3153, !3154, !3155, !3156, !3157, !3158, !3159, !3160, !3161, !3162, !3171, !3172, !3173, !3176, !3180, !3184, !3188, !3189, !3190, !3191, !3192}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !907, file: !31, line: 329, baseType: !910, size: 960)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !911, line: 130, baseType: !912)
!911 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !911, line: 117, size: 960, elements: !913)
!913 = !{!914, !916, !917, !919, !939, !943, !945, !947, !948, !949}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !911, line: 118, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !912, file: !911, line: 118, baseType: !915, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !912, file: !911, line: 119, baseType: !918, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !912, file: !911, line: 120, baseType: !920, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !911, line: 136, size: 17600, elements: !922)
!922 = !{!923, !924, !926, !929, !934, !935, !936}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !921, file: !911, line: 137, baseType: !910, size: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !921, file: !911, line: 138, baseType: !925, size: 64, offset: 960)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !921, file: !911, line: 139, baseType: !927, size: 64, offset: 1024)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !911, line: 43, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !921, file: !911, line: 140, baseType: !930, size: 8192, offset: 1088)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 8192, elements: !932)
!931 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!932 = !{!933}
!933 = !DISubrange(count: 1024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !921, file: !911, line: 141, baseType: !930, size: 8192, offset: 9280)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !921, file: !911, line: 148, baseType: !920, size: 64, offset: 17472)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !921, file: !911, line: 150, baseType: !937, size: 64, offset: 17536)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !911, line: 45, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !912, file: !911, line: 121, baseType: !940, size: 528, offset: 256)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 528, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 66)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !912, file: !911, line: 126, baseType: !944, size: 16, offset: 784)
!944 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !912, file: !911, line: 127, baseType: !946, size: 32, offset: 800)
!946 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !912, file: !911, line: 128, baseType: !946, size: 32, offset: 832)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !912, file: !911, line: 128, baseType: !946, size: 32, offset: 864)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !912, file: !911, line: 129, baseType: !950, size: 64, offset: 896)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !911, line: 75, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !911, line: 62, size: 1024, elements: !953)
!953 = !{!954, !956, !957, !958, !959, !960, !964, !965, !979, !980}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !911, line: 63, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !952, file: !911, line: 63, baseType: !955, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !952, file: !911, line: 64, baseType: !931, size: 8, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !952, file: !911, line: 64, baseType: !931, size: 8, offset: 136)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !952, file: !911, line: 65, baseType: !944, size: 16, offset: 144)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !911, line: 66, baseType: !961, size: 512, offset: 160)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 512, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !952, file: !911, line: 67, baseType: !946, size: 32, offset: 672)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !952, file: !911, line: 69, baseType: !966, size: 256, offset: 704)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !911, line: 60, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !911, line: 48, size: 256, elements: !968)
!968 = !{!969, !970, !977, !978}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !967, file: !911, line: 49, baseType: !915, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !967, file: !911, line: 58, baseType: !971, size: 128, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !972, line: 71, baseType: !973)
!972 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !972, line: 69, size: 128, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !973, file: !972, line: 70, baseType: !915, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !973, file: !972, line: 70, baseType: !915, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !967, file: !911, line: 59, baseType: !946, size: 32, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !967, file: !911, line: 59, baseType: !946, size: 32, offset: 224)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !952, file: !911, line: 70, baseType: !946, size: 32, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !952, file: !911, line: 74, baseType: !946, size: 32, offset: 992)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !907, file: !31, line: 330, baseType: !982, size: 64, offset: 960)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !984, line: 838, size: 768, elements: !985)
!984 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!985 = !{!986, !1001, !1002, !1012, !1013, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !983, file: !984, line: 840, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !989, line: 499, baseType: !990)
!989 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !989, line: 486, size: 1600, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997, !998, !999, !1000}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !990, file: !989, line: 487, baseType: !910, size: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !990, file: !989, line: 489, baseType: !971, size: 128, offset: 960)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !990, file: !989, line: 490, baseType: !971, size: 128, offset: 1088)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !990, file: !989, line: 491, baseType: !971, size: 128, offset: 1216)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !990, file: !989, line: 492, baseType: !971, size: 128, offset: 1344)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !990, file: !989, line: 494, baseType: !946, size: 32, offset: 1472)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !990, file: !989, line: 495, baseType: !946, size: 32, offset: 1504)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !990, file: !989, line: 497, baseType: !946, size: 32, offset: 1536)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !990, file: !989, line: 498, baseType: !946, size: 32, offset: 1568)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !983, file: !984, line: 844, baseType: !987, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !983, file: !984, line: 848, baseType: !1003, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !984, line: 549, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !984, line: 544, size: 320, elements: !1006)
!1006 = !{!1007, !1009, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1005, file: !984, line: 545, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1005, file: !984, line: 545, baseType: !1008, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1005, file: !984, line: 547, baseType: !987, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1005, file: !984, line: 548, baseType: !971, size: 128, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !983, file: !984, line: 851, baseType: !971, size: 128, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !983, file: !984, line: 853, baseType: !1014, size: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !984, line: 594, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !984, line: 561, size: 1664, elements: !1017)
!1017 = !{!1018, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !984, line: 562, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1016, file: !984, line: 562, baseType: !1019, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1016, file: !984, line: 564, baseType: !971, size: 128, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1016, file: !984, line: 565, baseType: !987, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1016, file: !984, line: 566, baseType: !1003, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1016, file: !984, line: 568, baseType: !971, size: 128, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1016, file: !984, line: 569, baseType: !971, size: 128, offset: 512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !984, line: 571, baseType: !961, size: 512, offset: 640)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1016, file: !984, line: 573, baseType: !1028, size: 32, offset: 1152)
!1028 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1016, file: !984, line: 574, baseType: !1028, size: 32, offset: 1184)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1016, file: !984, line: 576, baseType: !1028, size: 32, offset: 1216)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1016, file: !984, line: 576, baseType: !1028, size: 32, offset: 1248)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1016, file: !984, line: 577, baseType: !1028, size: 32, offset: 1280)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1016, file: !984, line: 577, baseType: !1028, size: 32, offset: 1312)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1016, file: !984, line: 579, baseType: !1028, size: 32, offset: 1344)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1016, file: !984, line: 580, baseType: !1028, size: 32, offset: 1376)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1016, file: !984, line: 582, baseType: !1028, size: 32, offset: 1408)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1016, file: !984, line: 582, baseType: !1028, size: 32, offset: 1440)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1016, file: !984, line: 583, baseType: !944, size: 16, offset: 1472)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1016, file: !984, line: 585, baseType: !944, size: 16, offset: 1488)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1016, file: !984, line: 586, baseType: !944, size: 16, offset: 1504)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1016, file: !984, line: 588, baseType: !944, size: 16, offset: 1520)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1016, file: !984, line: 590, baseType: !915, size: 64, offset: 1536)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1016, file: !984, line: 592, baseType: !946, size: 32, offset: 1600)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1016, file: !984, line: 593, baseType: !946, size: 32, offset: 1632)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !983, file: !984, line: 858, baseType: !971, size: 128, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !983, file: !984, line: 859, baseType: !971, size: 128, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !983, file: !984, line: 862, baseType: !946, size: 32, offset: 640)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !983, file: !984, line: 863, baseType: !946, size: 32, offset: 672)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !983, file: !984, line: 866, baseType: !944, size: 16, offset: 704)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !983, file: !984, line: 867, baseType: !944, size: 16, offset: 720)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !983, file: !984, line: 868, baseType: !1028, size: 32, offset: 736)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !907, file: !31, line: 332, baseType: !1053, size: 64, offset: 1024)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1055, line: 283, size: 4096, elements: !1056)
!1055 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1056 = !{!1057, !1058, !1059, !1060, !1064, !1065, !1070, !3110, !3118, !3122, !3128, !3132, !3133, !3134, !3135, !3139, !3140}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1054, file: !1055, line: 284, baseType: !946, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1054, file: !1055, line: 285, baseType: !961, size: 512, offset: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1054, file: !1055, line: 287, baseType: !961, size: 512, offset: 544)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1054, file: !1055, line: 288, baseType: !1061, size: 2048, offset: 1056)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 2048, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1054, file: !1055, line: 289, baseType: !946, size: 32, offset: 3104)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !1054, file: !1055, line: 292, baseType: !1066, size: 64, offset: 3136)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !1054, file: !1055, line: 293, baseType: !1071, size: 64, offset: 3200)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !1069, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !31, line: 167, size: 3712, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !3066, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3075, !3076, !3077, !3078, !3079, !3080, !3081, !3082, !3083, !3084, !3085, !3086, !3087, !3088, !3089, !3090, !3091, !3092, !3093, !3094, !3095, !3096, !3097, !3098, !3099, !3100, !3101, !3102, !3103, !3104, !3105, !3106, !3107}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1075, file: !31, line: 168, baseType: !1074, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1075, file: !31, line: 168, baseType: !1074, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !1075, file: !31, line: 168, baseType: !1074, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1075, file: !31, line: 170, baseType: !950, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1075, file: !31, line: 172, baseType: !1082, size: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !1055, line: 144, size: 6016, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1268, !1269, !1270, !2980, !2984, !2988, !2989, !2993, !2997, !3001, !3002, !3003, !3004, !3008, !3009, !3013, !3017, !3021, !3025, !3029, !3033, !3037, !3038, !3045, !3047, !3056, !3065}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1083, file: !1055, line: 145, baseType: !915, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1083, file: !1055, line: 145, baseType: !915, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !1083, file: !1055, line: 146, baseType: !944, size: 16, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1083, file: !1055, line: 148, baseType: !961, size: 512, offset: 144)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1083, file: !1055, line: 149, baseType: !946, size: 32, offset: 672)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1083, file: !1055, line: 151, baseType: !961, size: 512, offset: 704)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1083, file: !1055, line: 152, baseType: !1061, size: 2048, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1083, file: !1055, line: 153, baseType: !946, size: 32, offset: 3264)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1083, file: !1055, line: 155, baseType: !1028, size: 32, offset: 3296)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !1083, file: !1055, line: 155, baseType: !1028, size: 32, offset: 3328)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !1083, file: !1055, line: 155, baseType: !1028, size: 32, offset: 3360)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1083, file: !1055, line: 156, baseType: !1028, size: 32, offset: 3392)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !1083, file: !1055, line: 156, baseType: !1028, size: 32, offset: 3424)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !1083, file: !1055, line: 156, baseType: !1028, size: 32, offset: 3456)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !1083, file: !1055, line: 157, baseType: !944, size: 16, offset: 3488)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1083, file: !1055, line: 157, baseType: !944, size: 16, offset: 3504)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !1083, file: !1055, line: 157, baseType: !944, size: 16, offset: 3520)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1083, file: !1055, line: 160, baseType: !1103, size: 64, offset: 3584)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !1055, line: 109, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !1055, line: 98, size: 1408, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1267}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1105, file: !1055, line: 99, baseType: !946, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1105, file: !1055, line: 99, baseType: !946, size: 32, offset: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1105, file: !1055, line: 100, baseType: !961, size: 512, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !1105, file: !1055, line: 101, baseType: !1028, size: 32, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1105, file: !1055, line: 101, baseType: !1028, size: 32, offset: 608)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !1105, file: !1055, line: 101, baseType: !1028, size: 32, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !1105, file: !1055, line: 101, baseType: !1028, size: 32, offset: 672)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1105, file: !1055, line: 102, baseType: !1028, size: 32, offset: 704)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1105, file: !1055, line: 102, baseType: !1028, size: 32, offset: 736)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1105, file: !1055, line: 103, baseType: !946, size: 32, offset: 768)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1105, file: !1055, line: 104, baseType: !946, size: 32, offset: 800)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !1105, file: !1055, line: 107, baseType: !1119, size: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !31, line: 87, size: 2816, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1246}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !31, line: 88, baseType: !1119, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1120, file: !31, line: 88, baseType: !1119, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !1120, file: !31, line: 88, baseType: !1119, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1120, file: !31, line: 90, baseType: !950, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1120, file: !31, line: 92, baseType: !961, size: 512, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1120, file: !31, line: 94, baseType: !961, size: 512, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !1120, file: !31, line: 99, baseType: !915, size: 64, offset: 1280)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1120, file: !31, line: 101, baseType: !944, size: 16, offset: 1344)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1120, file: !31, line: 101, baseType: !944, size: 16, offset: 1360)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1120, file: !31, line: 102, baseType: !944, size: 16, offset: 1376)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !1120, file: !31, line: 103, baseType: !944, size: 16, offset: 1392)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1120, file: !31, line: 104, baseType: !1134, size: 64, offset: 1408)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !1055, line: 114, size: 1600, elements: !1136)
!1136 = !{!1137, !1138, !1161, !1166, !1170, !1174, !1178, !1182, !1183, !1187, !1216, !1217, !1218}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1135, file: !1055, line: 115, baseType: !961, size: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1135, file: !1055, line: 117, baseType: !1139, size: 64, offset: 512)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !1142, !1145, !1147, !1147, !1159}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1144, line: 40, flags: DIFlagFwdDecl)
!1144 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_animsys.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !11, line: 61, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1149, line: 55, size: 192, elements: !1150)
!1149 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1150 = !{!1151, !1155, !1158}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1148, file: !1149, line: 58, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1148, file: !1149, line: 56, size: 64, elements: !1153)
!1153 = !{!1154}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !1149, line: 57, baseType: !915, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1148, file: !1149, line: 60, baseType: !1156, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !31, line: 335, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1148, file: !1149, line: 61, baseType: !915, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !1135, file: !1055, line: 118, baseType: !1162, size: 64, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{null, !1142, !1147, !1147, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !1135, file: !1055, line: 120, baseType: !1167, size: 64, offset: 640)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{null, !1142, !1145, !1147}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !1135, file: !1055, line: 121, baseType: !1171, size: 64, offset: 704)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{null, !1142, !1147, !1165}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !1135, file: !1055, line: 122, baseType: !1175, size: 64, offset: 768)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{null, !1069, !1119, !1156}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !1135, file: !1055, line: 123, baseType: !1179, size: 64, offset: 832)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{null, !1069, !1119, !1074, !1119, !1159}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !1135, file: !1055, line: 124, baseType: !1179, size: 64, offset: 896)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !1135, file: !1055, line: 125, baseType: !1184, size: 64, offset: 960)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !1069, !1119, !1074, !1119}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !1135, file: !1055, line: 128, baseType: !1188, size: 256, offset: 1024)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !1149, line: 436, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !1149, line: 430, size: 256, elements: !1190)
!1190 = !{!1191, !1192, !1195, !1211}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1189, file: !1149, line: 431, baseType: !915, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1189, file: !1149, line: 432, baseType: !1193, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !1149, line: 417, baseType: !1157)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1189, file: !1149, line: 433, baseType: !1196, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !1149, line: 408, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!946, !1142, !1147, !1200, !1202}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1149, line: 38, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !1149, line: 348, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !1149, line: 337, size: 256, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1204, file: !1149, line: 339, baseType: !915, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1204, file: !1149, line: 342, baseType: !1200, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1204, file: !1149, line: 345, baseType: !946, size: 32, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1204, file: !1149, line: 347, baseType: !946, size: 32, offset: 160)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1204, file: !1149, line: 347, baseType: !946, size: 32, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1189, file: !1149, line: 434, baseType: !1212, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !1149, line: 409, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !915}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !1135, file: !1055, line: 129, baseType: !1188, size: 256, offset: 1280)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1135, file: !1055, line: 132, baseType: !946, size: 32, offset: 1536)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1135, file: !1055, line: 132, baseType: !946, size: 32, offset: 1568)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1120, file: !31, line: 105, baseType: !961, size: 512, offset: 1472)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !1120, file: !31, line: 107, baseType: !1028, size: 32, offset: 1984)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !1120, file: !31, line: 107, baseType: !1028, size: 32, offset: 2016)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !1120, file: !31, line: 109, baseType: !915, size: 64, offset: 2048)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !1120, file: !31, line: 112, baseType: !944, size: 16, offset: 2112)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !1120, file: !31, line: 114, baseType: !944, size: 16, offset: 2128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1120, file: !31, line: 115, baseType: !946, size: 32, offset: 2144)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1120, file: !31, line: 117, baseType: !915, size: 64, offset: 2176)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !1120, file: !31, line: 122, baseType: !946, size: 32, offset: 2240)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !1120, file: !31, line: 124, baseType: !946, size: 32, offset: 2272)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !1120, file: !31, line: 126, baseType: !1119, size: 64, offset: 2304)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1120, file: !31, line: 128, baseType: !1231, size: 64, offset: 2368)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !31, line: 298, size: 448, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1239, !1240, !1243, !1244, !1245}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1232, file: !31, line: 299, baseType: !1231, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1232, file: !31, line: 299, baseType: !1231, size: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !1232, file: !31, line: 301, baseType: !1237, size: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !31, line: 218, baseType: !1075)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !1232, file: !31, line: 301, baseType: !1237, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !1232, file: !31, line: 302, baseType: !1241, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !31, line: 132, baseType: !1120)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !1232, file: !31, line: 302, baseType: !1241, size: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1232, file: !31, line: 304, baseType: !946, size: 32, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1232, file: !31, line: 305, baseType: !946, size: 32, offset: 416)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1120, file: !31, line: 131, baseType: !1247, size: 384, offset: 2432)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !31, line: 73, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !31, line: 62, size: 384, elements: !1249)
!1249 = !{!1250, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1248, file: !31, line: 63, baseType: !1251, size: 128)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 128, elements: !1252)
!1252 = !{!1253}
!1253 = !DISubrange(count: 4)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1248, file: !31, line: 64, baseType: !1028, size: 32, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1248, file: !31, line: 64, baseType: !1028, size: 32, offset: 160)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1248, file: !31, line: 65, baseType: !915, size: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !1248, file: !31, line: 66, baseType: !944, size: 16, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !1248, file: !31, line: 67, baseType: !944, size: 16, offset: 272)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !1248, file: !31, line: 68, baseType: !944, size: 16, offset: 288)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !1248, file: !31, line: 69, baseType: !944, size: 16, offset: 304)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1248, file: !31, line: 70, baseType: !944, size: 16, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1248, file: !31, line: 71, baseType: !944, size: 16, offset: 336)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1248, file: !31, line: 72, baseType: !1264, size: 32, offset: 352)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 32, elements: !1265)
!1265 = !{!1266}
!1266 = !DISubrange(count: 2)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1105, file: !1055, line: 108, baseType: !961, size: 512, offset: 896)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1083, file: !1055, line: 160, baseType: !1103, size: 64, offset: 3648)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !1083, file: !1055, line: 162, baseType: !961, size: 512, offset: 3712)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !1083, file: !1055, line: 165, baseType: !1271, size: 64, offset: 4224)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null, !1274, !1276, !2931, !1069, !1074, !2976}
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1278, line: 230, size: 3072, elements: !1279)
!1278 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1279 = !{!1280, !1281, !1282, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2930}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1277, file: !1278, line: 231, baseType: !1276, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1277, file: !1278, line: 231, baseType: !1276, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1277, file: !1278, line: 233, baseType: !1283, size: 1280, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1284, line: 71, baseType: !1285)
!1284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1284, line: 40, size: 1280, elements: !1286)
!1286 = !{!1287, !1296, !1297, !1305, !1306, !1307, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1330}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1285, file: !1284, line: 41, baseType: !1288, size: 128)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1289, line: 95, baseType: !1290)
!1289 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1289, line: 92, size: 128, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1290, file: !1289, line: 93, baseType: !1028, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1290, file: !1289, line: 93, baseType: !1028, size: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1290, file: !1289, line: 94, baseType: !1028, size: 32, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1290, file: !1289, line: 94, baseType: !1028, size: 32, offset: 96)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1285, file: !1284, line: 41, baseType: !1288, size: 128, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1285, file: !1284, line: 42, baseType: !1298, size: 128, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1289, line: 89, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1289, line: 86, size: 128, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1299, file: !1289, line: 87, baseType: !946, size: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1299, file: !1289, line: 87, baseType: !946, size: 32, offset: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1299, file: !1289, line: 88, baseType: !946, size: 32, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1299, file: !1289, line: 88, baseType: !946, size: 32, offset: 96)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1285, file: !1284, line: 42, baseType: !1298, size: 128, offset: 384)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1285, file: !1284, line: 43, baseType: !1298, size: 128, offset: 512)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1285, file: !1284, line: 45, baseType: !1308, size: 64, offset: 640)
!1308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 64, elements: !1265)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1285, file: !1284, line: 45, baseType: !1308, size: 64, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1285, file: !1284, line: 46, baseType: !1028, size: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1285, file: !1284, line: 46, baseType: !1028, size: 32, offset: 800)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1285, file: !1284, line: 48, baseType: !944, size: 16, offset: 832)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1285, file: !1284, line: 49, baseType: !944, size: 16, offset: 848)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1285, file: !1284, line: 51, baseType: !944, size: 16, offset: 864)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1285, file: !1284, line: 52, baseType: !944, size: 16, offset: 880)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1285, file: !1284, line: 53, baseType: !944, size: 16, offset: 896)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1285, file: !1284, line: 55, baseType: !944, size: 16, offset: 912)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1285, file: !1284, line: 56, baseType: !944, size: 16, offset: 928)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1285, file: !1284, line: 58, baseType: !944, size: 16, offset: 944)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1285, file: !1284, line: 58, baseType: !944, size: 16, offset: 960)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1285, file: !1284, line: 59, baseType: !944, size: 16, offset: 976)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1285, file: !1284, line: 59, baseType: !944, size: 16, offset: 992)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1285, file: !1284, line: 61, baseType: !944, size: 16, offset: 1008)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1285, file: !1284, line: 63, baseType: !1165, size: 64, offset: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1285, file: !1284, line: 64, baseType: !946, size: 32, offset: 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1285, file: !1284, line: 65, baseType: !946, size: 32, offset: 1120)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1285, file: !1284, line: 68, baseType: !1328, size: 64, offset: 1152)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1284, line: 68, flags: DIFlagFwdDecl)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1285, file: !1284, line: 69, baseType: !1331, size: 64, offset: 1216)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !890, line: 490, size: 768, elements: !1333)
!1333 = !{!1334, !1335, !1336, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1332, file: !890, line: 491, baseType: !1331, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1332, file: !890, line: 491, baseType: !1331, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1332, file: !890, line: 493, baseType: !1337, size: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !11, line: 169, size: 2048, elements: !1339)
!1339 = !{!1340, !1341, !1342, !1343, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2866, !2869, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1338, file: !11, line: 170, baseType: !1337, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1338, file: !11, line: 170, baseType: !1337, size: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1338, file: !11, line: 172, baseType: !915, size: 64, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1338, file: !11, line: 174, baseType: !1344, size: 64, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1278, line: 49, size: 1984, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1351, !1352, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1345, file: !1278, line: 50, baseType: !910, size: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1345, file: !1278, line: 52, baseType: !971, size: 128, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1345, file: !1278, line: 53, baseType: !971, size: 128, offset: 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1345, file: !1278, line: 54, baseType: !971, size: 128, offset: 1216)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1345, file: !1278, line: 55, baseType: !971, size: 128, offset: 1344)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1345, file: !1278, line: 57, baseType: !1353, size: 64, offset: 1472)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1355, line: 1216, size: 39680, elements: !1356)
!1355 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1356 = !{!1357, !1358, !1359, !1363, !1831, !1832, !1833, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !2205, !2419, !2422, !2662, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681, !2684, !2685, !2686, !2687, !2688, !2696, !2762, !2769, !2770, !2777, !2778, !2784, !2785, !2786, !2787, !2788}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1354, file: !1355, line: 1217, baseType: !910, size: 960)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1354, file: !1355, line: 1218, baseType: !982, size: 64, offset: 960)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1354, file: !1355, line: 1220, baseType: !1360, size: 64, offset: 1024)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1362, line: 49, flags: DIFlagFwdDecl)
!1362 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1354, file: !1355, line: 1221, baseType: !1364, size: 64, offset: 1088)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1366, line: 52, size: 4224, elements: !1367)
!1366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1440, !1826, !1827, !1828, !1829, !1830}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1365, file: !1366, line: 53, baseType: !910, size: 960)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1365, file: !1366, line: 54, baseType: !982, size: 64, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !1365, file: !1366, line: 56, baseType: !944, size: 16, offset: 1024)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !1365, file: !1366, line: 56, baseType: !944, size: 16, offset: 1040)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1365, file: !1366, line: 57, baseType: !944, size: 16, offset: 1056)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !1365, file: !1366, line: 57, baseType: !944, size: 16, offset: 1072)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !1365, file: !1366, line: 59, baseType: !1028, size: 32, offset: 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !1365, file: !1366, line: 59, baseType: !1028, size: 32, offset: 1120)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !1365, file: !1366, line: 59, baseType: !1028, size: 32, offset: 1152)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !1365, file: !1366, line: 60, baseType: !1028, size: 32, offset: 1184)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !1365, file: !1366, line: 60, baseType: !1028, size: 32, offset: 1216)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !1365, file: !1366, line: 60, baseType: !1028, size: 32, offset: 1248)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1365, file: !1366, line: 61, baseType: !1028, size: 32, offset: 1280)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1365, file: !1366, line: 61, baseType: !1028, size: 32, offset: 1312)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1365, file: !1366, line: 61, baseType: !1028, size: 32, offset: 1344)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !1365, file: !1366, line: 68, baseType: !1028, size: 32, offset: 1376)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1365, file: !1366, line: 68, baseType: !1028, size: 32, offset: 1408)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1365, file: !1366, line: 68, baseType: !1028, size: 32, offset: 1440)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !1365, file: !1366, line: 69, baseType: !1028, size: 32, offset: 1472)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !1365, file: !1366, line: 69, baseType: !1028, size: 32, offset: 1504)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1365, file: !1366, line: 74, baseType: !1028, size: 32, offset: 1536)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !1365, file: !1366, line: 79, baseType: !1028, size: 32, offset: 1568)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !1365, file: !1366, line: 81, baseType: !944, size: 16, offset: 1600)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1365, file: !1366, line: 91, baseType: !944, size: 16, offset: 1616)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !1365, file: !1366, line: 92, baseType: !944, size: 16, offset: 1632)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !1365, file: !1366, line: 93, baseType: !944, size: 16, offset: 1648)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !1365, file: !1366, line: 94, baseType: !944, size: 16, offset: 1664)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !1365, file: !1366, line: 94, baseType: !944, size: 16, offset: 1680)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !1365, file: !1366, line: 94, baseType: !944, size: 16, offset: 1696)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !1365, file: !1366, line: 94, baseType: !944, size: 16, offset: 1712)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !1365, file: !1366, line: 96, baseType: !1028, size: 32, offset: 1728)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !1365, file: !1366, line: 96, baseType: !1028, size: 32, offset: 1760)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !1365, file: !1366, line: 96, baseType: !1028, size: 32, offset: 1792)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !1365, file: !1366, line: 96, baseType: !1028, size: 32, offset: 1824)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !1365, file: !1366, line: 98, baseType: !1028, size: 32, offset: 1856)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !1365, file: !1366, line: 98, baseType: !1028, size: 32, offset: 1888)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !1365, file: !1366, line: 98, baseType: !1028, size: 32, offset: 1920)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !1365, file: !1366, line: 98, baseType: !1028, size: 32, offset: 1952)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !1365, file: !1366, line: 99, baseType: !1028, size: 32, offset: 1984)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !1365, file: !1366, line: 99, baseType: !1028, size: 32, offset: 2016)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !1365, file: !1366, line: 100, baseType: !1028, size: 32, offset: 2048)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !1365, file: !1366, line: 100, baseType: !1028, size: 32, offset: 2080)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !1365, file: !1366, line: 103, baseType: !944, size: 16, offset: 2112)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !1365, file: !1366, line: 103, baseType: !944, size: 16, offset: 2128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !1365, file: !1366, line: 103, baseType: !944, size: 16, offset: 2144)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !1365, file: !1366, line: 103, baseType: !944, size: 16, offset: 2160)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !1365, file: !1366, line: 106, baseType: !1028, size: 32, offset: 2176)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !1365, file: !1366, line: 106, baseType: !1028, size: 32, offset: 2208)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !1365, file: !1366, line: 106, baseType: !1028, size: 32, offset: 2240)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !1365, file: !1366, line: 106, baseType: !1028, size: 32, offset: 2272)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !1365, file: !1366, line: 107, baseType: !944, size: 16, offset: 2304)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !1365, file: !1366, line: 107, baseType: !944, size: 16, offset: 2320)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !1365, file: !1366, line: 107, baseType: !944, size: 16, offset: 2336)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !1365, file: !1366, line: 107, baseType: !944, size: 16, offset: 2352)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !1365, file: !1366, line: 108, baseType: !1028, size: 32, offset: 2368)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !1365, file: !1366, line: 108, baseType: !1028, size: 32, offset: 2400)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !1365, file: !1366, line: 109, baseType: !1028, size: 32, offset: 2432)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !1365, file: !1366, line: 109, baseType: !1028, size: 32, offset: 2464)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !1365, file: !1366, line: 110, baseType: !1028, size: 32, offset: 2496)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !1365, file: !1366, line: 110, baseType: !1028, size: 32, offset: 2528)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !1365, file: !1366, line: 110, baseType: !1028, size: 32, offset: 2560)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !1365, file: !1366, line: 111, baseType: !944, size: 16, offset: 2592)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !1365, file: !1366, line: 111, baseType: !944, size: 16, offset: 2608)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !1365, file: !1366, line: 112, baseType: !944, size: 16, offset: 2624)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !1365, file: !1366, line: 112, baseType: !944, size: 16, offset: 2640)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !1365, file: !1366, line: 112, baseType: !944, size: 16, offset: 2656)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1365, file: !1366, line: 115, baseType: !944, size: 16, offset: 2672)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !1365, file: !1366, line: 118, baseType: !1165, size: 64, offset: 2688)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !1365, file: !1366, line: 118, baseType: !1165, size: 64, offset: 2752)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1365, file: !1366, line: 121, baseType: !1438, size: 64, offset: 2816)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1362, line: 46, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1365, file: !1366, line: 122, baseType: !1441, size: 1152, offset: 2880)
!1441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1442, size: 1152, elements: !1824)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1362, line: 57, size: 2496, elements: !1444)
!1444 = !{!1445, !1446, !1447, !1448, !1449, !1450, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1443, file: !1362, line: 59, baseType: !944, size: 16)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1443, file: !1362, line: 59, baseType: !944, size: 16, offset: 16)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1443, file: !1362, line: 59, baseType: !944, size: 16, offset: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1443, file: !1362, line: 59, baseType: !944, size: 16, offset: 48)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1443, file: !1362, line: 60, baseType: !1360, size: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1443, file: !1362, line: 61, baseType: !1451, size: 64, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1362, line: 202, size: 3328, elements: !1453)
!1453 = !{!1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1523, !1524, !1525, !1606, !1632, !1663, !1664, !1734, !1755, !1763, !1764}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1452, file: !1362, line: 203, baseType: !910, size: 960)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1452, file: !1362, line: 204, baseType: !982, size: 64, offset: 960)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1452, file: !1362, line: 206, baseType: !1028, size: 32, offset: 1024)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1452, file: !1362, line: 206, baseType: !1028, size: 32, offset: 1056)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1452, file: !1362, line: 207, baseType: !1028, size: 32, offset: 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1452, file: !1362, line: 207, baseType: !1028, size: 32, offset: 1120)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1452, file: !1362, line: 207, baseType: !1028, size: 32, offset: 1152)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1452, file: !1362, line: 207, baseType: !1028, size: 32, offset: 1184)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1452, file: !1362, line: 207, baseType: !1028, size: 32, offset: 1216)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1452, file: !1362, line: 207, baseType: !1028, size: 32, offset: 1248)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1452, file: !1362, line: 208, baseType: !1028, size: 32, offset: 1280)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1452, file: !1362, line: 208, baseType: !1028, size: 32, offset: 1312)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1452, file: !1362, line: 211, baseType: !1028, size: 32, offset: 1344)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1452, file: !1362, line: 211, baseType: !1028, size: 32, offset: 1376)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1452, file: !1362, line: 211, baseType: !1028, size: 32, offset: 1408)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1452, file: !1362, line: 211, baseType: !1028, size: 32, offset: 1440)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1452, file: !1362, line: 211, baseType: !1028, size: 32, offset: 1472)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1452, file: !1362, line: 214, baseType: !1028, size: 32, offset: 1504)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1452, file: !1362, line: 214, baseType: !1028, size: 32, offset: 1536)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1452, file: !1362, line: 217, baseType: !1028, size: 32, offset: 1568)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1452, file: !1362, line: 218, baseType: !1028, size: 32, offset: 1600)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1452, file: !1362, line: 219, baseType: !1028, size: 32, offset: 1632)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1452, file: !1362, line: 220, baseType: !1028, size: 32, offset: 1664)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1452, file: !1362, line: 221, baseType: !1028, size: 32, offset: 1696)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1452, file: !1362, line: 222, baseType: !944, size: 16, offset: 1728)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1452, file: !1362, line: 222, baseType: !944, size: 16, offset: 1744)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1452, file: !1362, line: 224, baseType: !944, size: 16, offset: 1760)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1452, file: !1362, line: 224, baseType: !944, size: 16, offset: 1776)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1452, file: !1362, line: 227, baseType: !944, size: 16, offset: 1792)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1452, file: !1362, line: 227, baseType: !944, size: 16, offset: 1808)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1452, file: !1362, line: 229, baseType: !944, size: 16, offset: 1824)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1452, file: !1362, line: 229, baseType: !944, size: 16, offset: 1840)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1452, file: !1362, line: 230, baseType: !944, size: 16, offset: 1856)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1452, file: !1362, line: 230, baseType: !944, size: 16, offset: 1872)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1452, file: !1362, line: 232, baseType: !1028, size: 32, offset: 1888)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1452, file: !1362, line: 232, baseType: !1028, size: 32, offset: 1920)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1452, file: !1362, line: 232, baseType: !1028, size: 32, offset: 1952)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1452, file: !1362, line: 232, baseType: !1028, size: 32, offset: 1984)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1452, file: !1362, line: 233, baseType: !946, size: 32, offset: 2016)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1452, file: !1362, line: 234, baseType: !946, size: 32, offset: 2048)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1452, file: !1362, line: 235, baseType: !944, size: 16, offset: 2080)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1452, file: !1362, line: 235, baseType: !944, size: 16, offset: 2096)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1452, file: !1362, line: 236, baseType: !944, size: 16, offset: 2112)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1452, file: !1362, line: 239, baseType: !944, size: 16, offset: 2128)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1452, file: !1362, line: 240, baseType: !946, size: 32, offset: 2144)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1452, file: !1362, line: 241, baseType: !946, size: 32, offset: 2176)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1452, file: !1362, line: 241, baseType: !946, size: 32, offset: 2208)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1452, file: !1362, line: 241, baseType: !946, size: 32, offset: 2240)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1452, file: !1362, line: 243, baseType: !1028, size: 32, offset: 2272)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1452, file: !1362, line: 243, baseType: !1028, size: 32, offset: 2304)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1452, file: !1362, line: 244, baseType: !1028, size: 32, offset: 2336)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1452, file: !1362, line: 246, baseType: !1506, size: 320, offset: 2368)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1507, line: 50, size: 320, elements: !1508)
!1507 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1508 = !{!1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1506, file: !1507, line: 51, baseType: !1353, size: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1506, file: !1507, line: 53, baseType: !946, size: 32, offset: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1506, file: !1507, line: 54, baseType: !946, size: 32, offset: 96)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1506, file: !1507, line: 55, baseType: !946, size: 32, offset: 128)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1506, file: !1507, line: 55, baseType: !946, size: 32, offset: 160)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1506, file: !1507, line: 56, baseType: !931, size: 8, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1506, file: !1507, line: 56, baseType: !931, size: 8, offset: 200)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1506, file: !1507, line: 57, baseType: !931, size: 8, offset: 208)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1506, file: !1507, line: 57, baseType: !931, size: 8, offset: 216)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1506, file: !1507, line: 59, baseType: !944, size: 16, offset: 224)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1506, file: !1507, line: 59, baseType: !944, size: 16, offset: 240)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1506, file: !1507, line: 59, baseType: !944, size: 16, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1506, file: !1507, line: 61, baseType: !944, size: 16, offset: 272)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1506, file: !1507, line: 63, baseType: !946, size: 32, offset: 288)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1452, file: !1362, line: 248, baseType: !1069, size: 64, offset: 2688)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1452, file: !1362, line: 249, baseType: !1438, size: 64, offset: 2752)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !1452, file: !1362, line: 250, baseType: !1526, size: 64, offset: 2816)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1507, line: 77, size: 15424, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1534, !1537, !1540, !1543, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1563, !1564, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1595, !1596, !1600}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1527, file: !1507, line: 78, baseType: !910, size: 960)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1527, file: !1507, line: 80, baseType: !930, size: 8192, offset: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1527, file: !1507, line: 82, baseType: !1532, size: 64, offset: 9152)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1533 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1507, line: 43, flags: DIFlagFwdDecl)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1527, file: !1507, line: 83, baseType: !1535, size: 64, offset: 9216)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64)
!1536 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !911, line: 46, flags: DIFlagFwdDecl)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1527, file: !1507, line: 86, baseType: !1538, size: 64, offset: 9280)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1507, line: 41, flags: DIFlagFwdDecl)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1527, file: !1507, line: 87, baseType: !1541, size: 64, offset: 9344)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1507, line: 44, flags: DIFlagFwdDecl)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1527, file: !1507, line: 89, baseType: !1544, size: 512, offset: 9408)
!1544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1541, size: 512, elements: !1545)
!1545 = !{!1546}
!1546 = !DISubrange(count: 8)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1527, file: !1507, line: 90, baseType: !944, size: 16, offset: 9920)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1527, file: !1507, line: 90, baseType: !944, size: 16, offset: 9936)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1527, file: !1507, line: 92, baseType: !944, size: 16, offset: 9952)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1527, file: !1507, line: 92, baseType: !944, size: 16, offset: 9968)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1527, file: !1507, line: 93, baseType: !944, size: 16, offset: 9984)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1527, file: !1507, line: 93, baseType: !944, size: 16, offset: 10000)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1527, file: !1507, line: 94, baseType: !946, size: 32, offset: 10016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1527, file: !1507, line: 97, baseType: !944, size: 16, offset: 10048)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1527, file: !1507, line: 97, baseType: !944, size: 16, offset: 10064)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1527, file: !1507, line: 98, baseType: !944, size: 16, offset: 10080)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1527, file: !1507, line: 98, baseType: !944, size: 16, offset: 10096)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1527, file: !1507, line: 99, baseType: !944, size: 16, offset: 10112)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1527, file: !1507, line: 99, baseType: !944, size: 16, offset: 10128)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1527, file: !1507, line: 100, baseType: !6, size: 32, offset: 10144)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1527, file: !1507, line: 101, baseType: !1562, size: 64, offset: 10176)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1527, file: !1507, line: 103, baseType: !937, size: 64, offset: 10240)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1527, file: !1507, line: 104, baseType: !1565, size: 64, offset: 10304)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !911, line: 159, size: 448, elements: !1567)
!1567 = !{!1568, !1570, !1571, !1572, !1573, !1575}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1566, file: !911, line: 161, baseType: !1569, size: 64)
!1569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !1265)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1566, file: !911, line: 162, baseType: !1569, size: 64, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1566, file: !911, line: 163, baseType: !1264, size: 32, offset: 128)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1566, file: !911, line: 164, baseType: !1264, size: 32, offset: 160)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1566, file: !911, line: 165, baseType: !1574, size: 128, offset: 192)
!1574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1562, size: 128, elements: !1265)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1566, file: !911, line: 166, baseType: !1576, size: 128, offset: 320)
!1576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1535, size: 128, elements: !1265)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1527, file: !1507, line: 107, baseType: !1028, size: 32, offset: 10368)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1527, file: !1507, line: 108, baseType: !946, size: 32, offset: 10400)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1527, file: !1507, line: 109, baseType: !944, size: 16, offset: 10432)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1527, file: !1507, line: 110, baseType: !944, size: 16, offset: 10448)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1527, file: !1507, line: 113, baseType: !946, size: 32, offset: 10464)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1527, file: !1507, line: 113, baseType: !946, size: 32, offset: 10496)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1527, file: !1507, line: 114, baseType: !931, size: 8, offset: 10528)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1527, file: !1507, line: 114, baseType: !931, size: 8, offset: 10536)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1527, file: !1507, line: 115, baseType: !944, size: 16, offset: 10544)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1527, file: !1507, line: 116, baseType: !1251, size: 128, offset: 10560)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1527, file: !1507, line: 119, baseType: !1028, size: 32, offset: 10688)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1527, file: !1507, line: 119, baseType: !1028, size: 32, offset: 10720)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1527, file: !1507, line: 122, baseType: !1590, size: 512, offset: 10752)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1591, line: 182, baseType: !1592)
!1591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1591, line: 180, size: 512, elements: !1593)
!1593 = !{!1594}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1592, file: !1591, line: 181, baseType: !961, size: 512)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1527, file: !1507, line: 123, baseType: !931, size: 8, offset: 11264)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1527, file: !1507, line: 125, baseType: !1597, size: 56, offset: 11272)
!1597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 56, elements: !1598)
!1598 = !{!1599}
!1599 = !DISubrange(count: 7)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1527, file: !1507, line: 126, baseType: !1601, size: 4096, offset: 11328)
!1601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1602, size: 4096, elements: !1545)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1507, line: 69, baseType: !1603)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1507, line: 67, size: 512, elements: !1604)
!1604 = !{!1605}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1603, file: !1507, line: 68, baseType: !961, size: 512)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !1452, file: !1362, line: 251, baseType: !1607, size: 64, offset: 2880)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1362, line: 113, size: 6208, elements: !1609)
!1609 = !{!1610, !1611, !1612, !1613, !1614, !1615, !1619}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1608, file: !1362, line: 114, baseType: !944, size: 16)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1608, file: !1362, line: 114, baseType: !944, size: 16, offset: 16)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1608, file: !1362, line: 115, baseType: !931, size: 8, offset: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1608, file: !1362, line: 115, baseType: !931, size: 8, offset: 40)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1608, file: !1362, line: 116, baseType: !931, size: 8, offset: 48)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1608, file: !1362, line: 117, baseType: !1616, size: 8, offset: 56)
!1616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 8, elements: !1617)
!1617 = !{!1618}
!1618 = !DISubrange(count: 1)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1608, file: !1362, line: 119, baseType: !1620, size: 6144, offset: 64)
!1620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1621, size: 6144, elements: !1630)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1362, line: 109, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1362, line: 106, size: 192, elements: !1623)
!1623 = !{!1624, !1625, !1626, !1627, !1628, !1629}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1622, file: !1362, line: 107, baseType: !1028, size: 32)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1622, file: !1362, line: 107, baseType: !1028, size: 32, offset: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1622, file: !1362, line: 107, baseType: !1028, size: 32, offset: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1622, file: !1362, line: 107, baseType: !1028, size: 32, offset: 96)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1622, file: !1362, line: 107, baseType: !1028, size: 32, offset: 128)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1622, file: !1362, line: 108, baseType: !946, size: 32, offset: 160)
!1630 = !{!1631}
!1631 = !DISubrange(count: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !1452, file: !1362, line: 252, baseType: !1633, size: 64, offset: 2944)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !1362, line: 122, size: 1600, elements: !1635)
!1635 = !{!1636, !1637, !1638, !1644, !1647, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1634, file: !1362, line: 123, baseType: !1360, size: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !1634, file: !1362, line: 124, baseType: !1526, size: 64, offset: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !1634, file: !1362, line: 125, baseType: !1639, size: 384, offset: 128)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1640, size: 384, elements: !1642)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64)
!1641 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !1591, line: 136, flags: DIFlagFwdDecl)
!1642 = !{!1643}
!1643 = !DISubrange(count: 6)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1634, file: !1362, line: 126, baseType: !1645, size: 512, offset: 512)
!1645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 512, elements: !1646)
!1646 = !{!1253, !1253}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !1634, file: !1362, line: 127, baseType: !1648, size: 288, offset: 1024)
!1648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 288, elements: !1649)
!1649 = !{!1650, !1650}
!1650 = !DISubrange(count: 3)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1634, file: !1362, line: 128, baseType: !944, size: 16, offset: 1312)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1634, file: !1362, line: 128, baseType: !944, size: 16, offset: 1328)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !1634, file: !1362, line: 129, baseType: !1028, size: 32, offset: 1344)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !1634, file: !1362, line: 129, baseType: !1028, size: 32, offset: 1376)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !1634, file: !1362, line: 130, baseType: !1028, size: 32, offset: 1408)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !1634, file: !1362, line: 131, baseType: !6, size: 32, offset: 1440)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !1634, file: !1362, line: 132, baseType: !944, size: 16, offset: 1472)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1634, file: !1362, line: 132, baseType: !944, size: 16, offset: 1488)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1634, file: !1362, line: 133, baseType: !946, size: 32, offset: 1504)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1634, file: !1362, line: 133, baseType: !946, size: 32, offset: 1536)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1634, file: !1362, line: 134, baseType: !944, size: 16, offset: 1568)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1634, file: !1362, line: 134, baseType: !944, size: 16, offset: 1584)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1452, file: !1362, line: 253, baseType: !1565, size: 64, offset: 3008)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1452, file: !1362, line: 254, baseType: !1665, size: 64, offset: 3072)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !1362, line: 137, size: 832, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1689, !1690, !1691, !1692, !1693, !1694}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1666, file: !1362, line: 138, baseType: !944, size: 16)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !1666, file: !1362, line: 140, baseType: !944, size: 16, offset: 16)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !1666, file: !1362, line: 141, baseType: !1028, size: 32, offset: 32)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !1666, file: !1362, line: 142, baseType: !1028, size: 32, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1666, file: !1362, line: 143, baseType: !944, size: 16, offset: 96)
