; ModuleID = 'blender/source/blender/editors/animation/anim_draw.c'
source_filename = "blender/source/blender/editors/animation/anim_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!222 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!223 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!224 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!225 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!226 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!227 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!228 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!229 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!230 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!231 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGraphEdit_Flag", file: !208, line: 338, baseType: !5, size: 32, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!234 = !DIEnumerator(name: "SIPO_NOTRANSKEYCULL", value: 2, isUnsigned: true)
!235 = !DIEnumerator(name: "SIPO_NOHANDLES", value: 4, isUnsigned: true)
!236 = !DIEnumerator(name: "SIPO_NODRAWCFRANUM", value: 8, isUnsigned: true)
!237 = !DIEnumerator(name: "SIPO_DRAWTIME", value: 16, isUnsigned: true)
!238 = !DIEnumerator(name: "SIPO_SELCUVERTSONLY", value: 32, isUnsigned: true)
!239 = !DIEnumerator(name: "SIPO_DRAWNAMES", value: 64, isUnsigned: true)
!240 = !DIEnumerator(name: "SIPO_SLIDERS", value: 128, isUnsigned: true)
!241 = !DIEnumerator(name: "SIPO_NODRAWCURSOR", value: 256, isUnsigned: true)
!242 = !DIEnumerator(name: "SIPO_SELVHANDLESONLY", value: 512, isUnsigned: true)
!243 = !DIEnumerator(name: "SIPO_TEMP_NEEDCHANSYNC", value: 1024, isUnsigned: true)
!244 = !DIEnumerator(name: "SIPO_NOREALTIMEUPDATES", value: 2048, isUnsigned: true)
!245 = !DIEnumerator(name: "SIPO_BEAUTYDRAW_OFF", value: 4096, isUnsigned: true)
!246 = !DIEnumerator(name: "SIPO_NODRAWGCOLORS", value: 8192, isUnsigned: true)
!247 = !DIEnumerator(name: "SIPO_NORMALIZE", value: 16384, isUnsigned: true)
!248 = !DIEnumerator(name: "SIPO_NORMALIZE_FREEZE", value: 32768, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimUnitConv_Flags", file: !201, line: 591, baseType: !5, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257}
!251 = !DIEnumerator(name: "ANIM_UNITCONV_RESTORE", value: 1, isUnsigned: true)
!252 = !DIEnumerator(name: "ANIM_UNITCONV_ONLYKEYS", value: 2, isUnsigned: true)
!253 = !DIEnumerator(name: "ANIM_UNITCONV_ONLYSEL", value: 4, isUnsigned: true)
!254 = !DIEnumerator(name: "ANIM_UNITCONV_SELVERTS", value: 8, isUnsigned: true)
!255 = !DIEnumerator(name: "ANIM_UNITCONV_SKIPKNOTS", value: 16, isUnsigned: true)
!256 = !DIEnumerator(name: "ANIM_UNITCONV_NORMALIZE", value: 32, isUnsigned: true)
!257 = !DIEnumerator(name: "ANIM_UNITCONV_NORMALIZE_FREEZE", value: 64, isUnsigned: true)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyUnit", file: !259, line: 82, baseType: !5, size: 32, elements: !260)
!259 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!261 = !DIEnumerator(name: "PROP_UNIT_NONE", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "PROP_UNIT_LENGTH", value: 65536, isUnsigned: true)
!263 = !DIEnumerator(name: "PROP_UNIT_AREA", value: 131072, isUnsigned: true)
!264 = !DIEnumerator(name: "PROP_UNIT_VOLUME", value: 196608, isUnsigned: true)
!265 = !DIEnumerator(name: "PROP_UNIT_MASS", value: 262144, isUnsigned: true)
!266 = !DIEnumerator(name: "PROP_UNIT_ROTATION", value: 327680, isUnsigned: true)
!267 = !DIEnumerator(name: "PROP_UNIT_TIME", value: 393216, isUnsigned: true)
!268 = !DIEnumerator(name: "PROP_UNIT_VELOCITY", value: 458752, isUnsigned: true)
!269 = !DIEnumerator(name: "PROP_UNIT_ACCELERATION", value: 524288, isUnsigned: true)
!270 = !DIEnumerator(name: "PROP_UNIT_CAMERA", value: 589824, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaTime_ConvertModes", file: !272, line: 117, baseType: !5, size: 32, elements: !273)
!272 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_nla.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = !{!274, !275, !276}
!274 = !DIEnumerator(name: "NLATIME_CONVERT_EVAL", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "NLATIME_CONVERT_UNMAP", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "NLATIME_CONVERT_MAP", value: 2, isUnsigned: true)
!277 = !{!278, !279, !280, !281, !449, !304, !450}
!278 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!280 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceIpo", file: !208, line: 334, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceIpo", file: !208, line: 315, size: 2048, elements: !284)
!284 = !{!285, !307, !308, !309, !310, !311, !312, !366, !443, !444, !445, !446, !447, !448}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !208, line: 316, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !208, line: 91, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !208, line: 85, size: 448, elements: !289)
!289 = !{!290, !292, !293, !300, !301, !302}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !208, line: 86, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !288, file: !208, line: 86, baseType: !291, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !288, file: !208, line: 87, baseType: !294, size: 128, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !295, line: 71, baseType: !296)
!295 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !295, line: 69, size: 128, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !296, file: !295, line: 70, baseType: !279, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !296, file: !295, line: 70, baseType: !279, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !288, file: !208, line: 88, baseType: !280, size: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !288, file: !208, line: 89, baseType: !278, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !288, file: !208, line: 90, baseType: !303, size: 128, offset: 320)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 128, elements: !305)
!304 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!305 = !{!306}
!306 = !DISubrange(count: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !208, line: 316, baseType: !286, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !283, file: !208, line: 317, baseType: !294, size: 128, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !283, file: !208, line: 318, baseType: !280, size: 32, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !283, file: !208, line: 319, baseType: !278, size: 32, offset: 288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !283, file: !208, line: 320, baseType: !303, size: 128, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !283, file: !208, line: 322, baseType: !313, size: 1280, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !314, line: 71, baseType: !315)
!314 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !314, line: 40, size: 1280, elements: !316)
!316 = !{!317, !326, !327, !335, !336, !337, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !358, !359, !360, !363}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !315, file: !314, line: 41, baseType: !318, size: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !319, line: 95, baseType: !320)
!319 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !319, line: 92, size: 128, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !320, file: !319, line: 93, baseType: !278, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !320, file: !319, line: 93, baseType: !278, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !320, file: !319, line: 94, baseType: !278, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !320, file: !319, line: 94, baseType: !278, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !315, file: !314, line: 41, baseType: !318, size: 128, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !315, file: !314, line: 42, baseType: !328, size: 128, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !319, line: 89, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !319, line: 86, size: 128, elements: !330)
!330 = !{!331, !332, !333, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !329, file: !319, line: 87, baseType: !280, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !329, file: !319, line: 87, baseType: !280, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !329, file: !319, line: 88, baseType: !280, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !329, file: !319, line: 88, baseType: !280, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !315, file: !314, line: 42, baseType: !328, size: 128, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !315, file: !314, line: 43, baseType: !328, size: 128, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !315, file: !314, line: 45, baseType: !338, size: 64, offset: 640)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 64, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 2)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !315, file: !314, line: 45, baseType: !338, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !315, file: !314, line: 46, baseType: !278, size: 32, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !315, file: !314, line: 46, baseType: !278, size: 32, offset: 800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !315, file: !314, line: 48, baseType: !304, size: 16, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !315, file: !314, line: 49, baseType: !304, size: 16, offset: 848)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !315, file: !314, line: 51, baseType: !304, size: 16, offset: 864)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !315, file: !314, line: 52, baseType: !304, size: 16, offset: 880)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !315, file: !314, line: 53, baseType: !304, size: 16, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !314, line: 55, baseType: !304, size: 16, offset: 912)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !315, file: !314, line: 56, baseType: !304, size: 16, offset: 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !315, file: !314, line: 58, baseType: !304, size: 16, offset: 944)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !315, file: !314, line: 58, baseType: !304, size: 16, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !315, file: !314, line: 59, baseType: !304, size: 16, offset: 976)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !315, file: !314, line: 59, baseType: !304, size: 16, offset: 992)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !315, file: !314, line: 61, baseType: !304, size: 16, offset: 1008)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !315, file: !314, line: 63, baseType: !357, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !315, file: !314, line: 64, baseType: !280, size: 32, offset: 1088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !315, file: !314, line: 65, baseType: !280, size: 32, offset: 1120)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !315, file: !314, line: 68, baseType: !361, size: 64, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !314, line: 68, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !315, file: !314, line: 69, baseType: !364, size: 64, offset: 1216)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !314, line: 69, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !283, file: !208, line: 324, baseType: !367, size: 64, offset: 1728)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDopeSheet", file: !369, line: 519, size: 896, elements: !370)
!369 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !434, !435, !438, !439, !440, !441, !442}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !368, file: !369, line: 520, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !374, line: 130, baseType: !375)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !374, line: 117, size: 960, elements: !376)
!376 = !{!377, !378, !379, !381, !400, !404, !405, !406, !407, !408}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !374, line: 118, baseType: !279, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !374, line: 118, baseType: !279, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !375, file: !374, line: 119, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !375, file: !374, line: 120, baseType: !382, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !374, line: 136, size: 17600, elements: !384)
!384 = !{!385, !386, !387, !390, !395, !396, !397}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !374, line: 137, baseType: !373, size: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !383, file: !374, line: 138, baseType: !372, size: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !383, file: !374, line: 139, baseType: !388, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !374, line: 43, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !374, line: 140, baseType: !391, size: 8192, offset: 1088)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 8192, elements: !393)
!392 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!393 = !{!394}
!394 = !DISubrange(count: 1024)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !383, file: !374, line: 141, baseType: !391, size: 8192, offset: 9280)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !383, file: !374, line: 148, baseType: !382, size: 64, offset: 17472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !383, file: !374, line: 150, baseType: !398, size: 64, offset: 17536)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !374, line: 45, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !375, file: !374, line: 121, baseType: !401, size: 528, offset: 256)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 528, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 66)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !375, file: !374, line: 126, baseType: !304, size: 16, offset: 784)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !375, file: !374, line: 127, baseType: !280, size: 32, offset: 800)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !375, file: !374, line: 128, baseType: !280, size: 32, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !375, file: !374, line: 128, baseType: !280, size: 32, offset: 864)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !375, file: !374, line: 129, baseType: !409, size: 64, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !374, line: 75, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !374, line: 62, size: 1024, elements: !412)
!412 = !{!413, !415, !416, !417, !418, !419, !423, !424, !432, !433}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !374, line: 63, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !411, file: !374, line: 63, baseType: !414, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !374, line: 64, baseType: !392, size: 8, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !411, file: !374, line: 64, baseType: !392, size: 8, offset: 136)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !411, file: !374, line: 65, baseType: !304, size: 16, offset: 144)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !374, line: 66, baseType: !420, size: 512, offset: 160)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 512, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !411, file: !374, line: 67, baseType: !280, size: 32, offset: 672)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !374, line: 69, baseType: !425, size: 256, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !374, line: 60, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !374, line: 48, size: 256, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !426, file: !374, line: 49, baseType: !279, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !426, file: !374, line: 58, baseType: !294, size: 128, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !426, file: !374, line: 59, baseType: !280, size: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !426, file: !374, line: 59, baseType: !280, size: 32, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !411, file: !374, line: 70, baseType: !280, size: 32, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !411, file: !374, line: 74, baseType: !280, size: 32, offset: 992)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !368, file: !369, line: 521, baseType: !294, size: 128, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "filter_grp", scope: !368, file: !369, line: 523, baseType: !436, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !369, line: 46, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "searchstr", scope: !368, file: !369, line: 524, baseType: !420, size: 512, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "filterflag", scope: !368, file: !369, line: 526, baseType: !280, size: 32, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !368, file: !369, line: 527, baseType: !280, size: 32, offset: 800)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "renameIndex", scope: !368, file: !369, line: 529, baseType: !280, size: 32, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !368, file: !369, line: 530, baseType: !280, size: 32, offset: 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ghostCurves", scope: !283, file: !208, line: 326, baseType: !294, size: 128, offset: 1792)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !283, file: !208, line: 328, baseType: !304, size: 16, offset: 1920)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "autosnap", scope: !283, file: !208, line: 329, baseType: !304, size: 16, offset: 1936)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !208, line: 330, baseType: !280, size: 32, offset: 1952)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cursorVal", scope: !283, file: !208, line: 332, baseType: !278, size: 32, offset: 1984)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !283, file: !208, line: 333, baseType: !280, size: 32, offset: 2016)
!449 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimData", file: !452, line: 869, baseType: !453)
!452 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !452, line: 838, size: 768, elements: !454)
!454 = !{!455, !469, !470, !480, !481, !512, !513, !514, !515, !516, !517, !518}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !453, file: !452, line: 840, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !369, line: 499, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !369, line: 486, size: 1600, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !458, file: !369, line: 487, baseType: !373, size: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !458, file: !369, line: 489, baseType: !294, size: 128, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !458, file: !369, line: 490, baseType: !294, size: 128, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !458, file: !369, line: 491, baseType: !294, size: 128, offset: 1216)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !458, file: !369, line: 492, baseType: !294, size: 128, offset: 1344)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !369, line: 494, baseType: !280, size: 32, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !458, file: !369, line: 495, baseType: !280, size: 32, offset: 1504)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !458, file: !369, line: 497, baseType: !280, size: 32, offset: 1536)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !458, file: !369, line: 498, baseType: !280, size: 32, offset: 1568)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !453, file: !452, line: 844, baseType: !456, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !453, file: !452, line: 848, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !452, line: 549, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !452, line: 544, size: 320, elements: !474)
!474 = !{!475, !477, !478, !479}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !452, line: 545, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !473, file: !452, line: 545, baseType: !476, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !473, file: !452, line: 547, baseType: !456, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !473, file: !452, line: 548, baseType: !294, size: 128, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !453, file: !452, line: 851, baseType: !294, size: 128, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !453, file: !452, line: 853, baseType: !482, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !452, line: 594, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !452, line: 561, size: 1664, elements: !485)
!485 = !{!486, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !452, line: 562, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !484, file: !452, line: 562, baseType: !487, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !484, file: !452, line: 564, baseType: !294, size: 128, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !484, file: !452, line: 565, baseType: !456, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !484, file: !452, line: 566, baseType: !471, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !484, file: !452, line: 568, baseType: !294, size: 128, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !484, file: !452, line: 569, baseType: !294, size: 128, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !452, line: 571, baseType: !420, size: 512, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !484, file: !452, line: 573, baseType: !278, size: 32, offset: 1152)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !484, file: !452, line: 574, baseType: !278, size: 32, offset: 1184)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !484, file: !452, line: 576, baseType: !278, size: 32, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !484, file: !452, line: 576, baseType: !278, size: 32, offset: 1248)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !484, file: !452, line: 577, baseType: !278, size: 32, offset: 1280)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !484, file: !452, line: 577, baseType: !278, size: 32, offset: 1312)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !484, file: !452, line: 579, baseType: !278, size: 32, offset: 1344)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !484, file: !452, line: 580, baseType: !278, size: 32, offset: 1376)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !484, file: !452, line: 582, baseType: !278, size: 32, offset: 1408)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !484, file: !452, line: 582, baseType: !278, size: 32, offset: 1440)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !484, file: !452, line: 583, baseType: !304, size: 16, offset: 1472)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !484, file: !452, line: 585, baseType: !304, size: 16, offset: 1488)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !484, file: !452, line: 586, baseType: !304, size: 16, offset: 1504)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !452, line: 588, baseType: !304, size: 16, offset: 1520)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !484, file: !452, line: 590, baseType: !279, size: 64, offset: 1536)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !484, file: !452, line: 592, baseType: !280, size: 32, offset: 1600)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !484, file: !452, line: 593, baseType: !280, size: 32, offset: 1632)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !453, file: !452, line: 858, baseType: !294, size: 128, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !453, file: !452, line: 859, baseType: !294, size: 128, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !452, line: 862, baseType: !280, size: 32, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !453, file: !452, line: 863, baseType: !280, size: 32, offset: 672)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !453, file: !452, line: 866, baseType: !304, size: 16, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !453, file: !452, line: 867, baseType: !304, size: 16, offset: 720)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !453, file: !452, line: 868, baseType: !278, size: 32, offset: 736)
!519 = !{i32 7, !"Dwarf Version", i32 4}
!520 = !{i32 2, !"Debug Info Version", i32 3}
!521 = !{i32 1, !"wchar_size", i32 4}
!522 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!523 = distinct !DISubprogram(name: "ANIM_draw_cfra", scope: !1, file: !1, line: 101, type: !524, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !532)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526, !531, !304}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !529, line: 69, baseType: !530)
!529 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !259, line: 44, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!532 = !{}
!533 = !DILocalVariable(name: "C", arg: 1, scope: !523, file: !1, line: 101, type: !526)
!534 = !DILocation(line: 101, column: 37, scope: !523)
!535 = !DILocalVariable(name: "v2d", arg: 2, scope: !523, file: !1, line: 101, type: !531)
!536 = !DILocation(line: 101, column: 48, scope: !523)
!537 = !DILocalVariable(name: "flag", arg: 3, scope: !523, file: !1, line: 101, type: !304)
!538 = !DILocation(line: 101, column: 59, scope: !523)
!539 = !DILocalVariable(name: "scene", scope: !523, file: !1, line: 103, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !542, line: 1299, baseType: !543)
!542 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !542, line: 1216, size: 39680, elements: !544)
!544 = !{!545, !546, !548, !552, !555, !557, !558, !570, !571, !575, !576, !577, !578, !579, !580, !581, !582, !583, !587, !655, !1090, !1305, !1308, !1589, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1611, !1612, !1613, !1614, !1615, !1623, !1690, !1697, !1698, !1705, !1706, !1712, !1713, !1714, !1715, !1716}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !543, file: !542, line: 1217, baseType: !373, size: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !543, file: !542, line: 1218, baseType: !547, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !543, file: !542, line: 1220, baseType: !549, size: 64, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !551, line: 49, flags: DIFlagFwdDecl)
!551 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!552 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !543, file: !542, line: 1221, baseType: !553, size: 64, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !542, line: 52, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !543, file: !542, line: 1223, baseType: !556, size: 64, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !543, file: !542, line: 1225, baseType: !294, size: 128, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !543, file: !542, line: 1226, baseType: !559, size: 64, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !542, line: 69, size: 320, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !542, line: 70, baseType: !559, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !560, file: !542, line: 70, baseType: !559, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !560, file: !542, line: 71, baseType: !5, size: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !560, file: !542, line: 71, baseType: !5, size: 32, offset: 160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !542, line: 72, baseType: !280, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !560, file: !542, line: 73, baseType: !304, size: 16, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !560, file: !542, line: 73, baseType: !304, size: 16, offset: 240)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !560, file: !542, line: 74, baseType: !549, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !543, file: !542, line: 1227, baseType: !549, size: 64, offset: 1408)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !543, file: !542, line: 1229, baseType: !572, size: 96, offset: 1472)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 96, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 3)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !543, file: !542, line: 1230, baseType: !572, size: 96, offset: 1568)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !543, file: !542, line: 1231, baseType: !572, size: 96, offset: 1664)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !543, file: !542, line: 1231, baseType: !572, size: 96, offset: 1760)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !543, file: !542, line: 1233, baseType: !5, size: 32, offset: 1856)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !543, file: !542, line: 1234, baseType: !280, size: 32, offset: 1888)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !543, file: !542, line: 1235, baseType: !5, size: 32, offset: 1920)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !543, file: !542, line: 1237, baseType: !304, size: 16, offset: 1952)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !543, file: !542, line: 1239, baseType: !392, size: 8, offset: 1968)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !543, file: !542, line: 1240, baseType: !584, size: 8, offset: 1976)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 8, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 1)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !543, file: !542, line: 1242, baseType: !588, size: 64, offset: 1984)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !590, line: 328, size: 3456, elements: !591)
!590 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!591 = !{!592, !593, !594, !597, !598, !601, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !625, !630, !631, !634, !638, !643, !647, !651, !652, !653, !654}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !589, file: !590, line: 329, baseType: !373, size: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !589, file: !590, line: 330, baseType: !547, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !589, file: !590, line: 332, baseType: !595, size: 64, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !590, line: 332, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !589, file: !590, line: 333, baseType: !420, size: 512, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !589, file: !590, line: 335, baseType: !599, size: 64, offset: 1600)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !590, line: 335, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !589, file: !590, line: 337, baseType: !602, size: 64, offset: 1664)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !542, line: 61, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !589, file: !590, line: 338, baseType: !338, size: 64, offset: 1728)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !589, file: !590, line: 340, baseType: !294, size: 128, offset: 1792)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !589, file: !590, line: 340, baseType: !294, size: 128, offset: 1920)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !589, file: !590, line: 342, baseType: !280, size: 32, offset: 2048)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !589, file: !590, line: 342, baseType: !280, size: 32, offset: 2080)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !589, file: !590, line: 343, baseType: !280, size: 32, offset: 2112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !589, file: !590, line: 345, baseType: !280, size: 32, offset: 2144)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !589, file: !590, line: 346, baseType: !280, size: 32, offset: 2176)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !589, file: !590, line: 347, baseType: !304, size: 16, offset: 2208)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !589, file: !590, line: 348, baseType: !304, size: 16, offset: 2224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !589, file: !590, line: 349, baseType: !280, size: 32, offset: 2240)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !589, file: !590, line: 351, baseType: !280, size: 32, offset: 2272)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !589, file: !590, line: 353, baseType: !304, size: 16, offset: 2304)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !589, file: !590, line: 354, baseType: !304, size: 16, offset: 2320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !589, file: !590, line: 355, baseType: !280, size: 32, offset: 2336)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !589, file: !590, line: 357, baseType: !318, size: 128, offset: 2368)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !589, file: !590, line: 363, baseType: !294, size: 128, offset: 2496)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !589, file: !590, line: 363, baseType: !294, size: 128, offset: 2624)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !589, file: !590, line: 368, baseType: !623, size: 64, offset: 2752)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !590, line: 48, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !589, file: !590, line: 372, baseType: !626, size: 32, offset: 2816)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !590, line: 274, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !590, line: 271, size: 32, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !627, file: !590, line: 273, baseType: !5, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !589, file: !590, line: 373, baseType: !280, size: 32, offset: 2848)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !589, file: !590, line: 382, baseType: !632, size: 64, offset: 2880)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !590, line: 46, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !589, file: !590, line: 385, baseType: !635, size: 64, offset: 2944)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !279, !278}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !589, file: !590, line: 386, baseType: !639, size: 64, offset: 3008)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !279, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !589, file: !590, line: 387, baseType: !644, size: 64, offset: 3072)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!280, !279}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !589, file: !590, line: 388, baseType: !648, size: 64, offset: 3136)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !279}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !589, file: !590, line: 389, baseType: !279, size: 64, offset: 3200)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !589, file: !590, line: 389, baseType: !279, size: 64, offset: 3264)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !589, file: !590, line: 389, baseType: !279, size: 64, offset: 3328)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !589, file: !590, line: 389, baseType: !279, size: 64, offset: 3392)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !543, file: !542, line: 1244, baseType: !656, size: 64, offset: 2048)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !658, line: 200, size: 17024, elements: !659)
!658 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!659 = !{!660, !662, !663, !664, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !657, file: !658, line: 201, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !657, file: !658, line: 202, baseType: !294, size: 128, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !657, file: !658, line: 203, baseType: !294, size: 128, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !657, file: !658, line: 206, baseType: !665, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !658, line: 190, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !658, line: 126, size: 2816, elements: !668)
!668 = !{!669, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !768, !771, !772, !773, !1055, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1082}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !658, line: 127, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !667, file: !658, line: 127, baseType: !670, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !667, file: !658, line: 128, baseType: !279, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !667, file: !658, line: 129, baseType: !279, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !658, line: 130, baseType: !420, size: 512, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !667, file: !658, line: 132, baseType: !280, size: 32, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !658, line: 132, baseType: !280, size: 32, offset: 800)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !667, file: !658, line: 133, baseType: !280, size: 32, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !667, file: !658, line: 134, baseType: !280, size: 32, offset: 864)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !667, file: !658, line: 134, baseType: !280, size: 32, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !667, file: !658, line: 134, baseType: !280, size: 32, offset: 928)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !667, file: !658, line: 135, baseType: !280, size: 32, offset: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !667, file: !658, line: 135, baseType: !280, size: 32, offset: 992)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !667, file: !658, line: 136, baseType: !280, size: 32, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !667, file: !658, line: 136, baseType: !280, size: 32, offset: 1056)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !667, file: !658, line: 137, baseType: !280, size: 32, offset: 1088)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !667, file: !658, line: 137, baseType: !280, size: 32, offset: 1120)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !667, file: !658, line: 138, baseType: !278, size: 32, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !667, file: !658, line: 139, baseType: !278, size: 32, offset: 1184)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !667, file: !658, line: 139, baseType: !278, size: 32, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !667, file: !658, line: 141, baseType: !304, size: 16, offset: 1248)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !667, file: !658, line: 142, baseType: !304, size: 16, offset: 1264)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !667, file: !658, line: 143, baseType: !280, size: 32, offset: 1280)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !667, file: !658, line: 144, baseType: !280, size: 32, offset: 1312)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !667, file: !658, line: 146, baseType: !695, size: 64, offset: 1344)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !658, line: 114, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !658, line: 99, size: 7232, elements: !698)
!698 = !{!699, !701, !702, !703, !704, !705, !706, !717, !721, !736, !745, !752, !762}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !658, line: 100, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !658, line: 100, baseType: !700, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !697, file: !658, line: 101, baseType: !280, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !697, file: !658, line: 101, baseType: !280, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !697, file: !658, line: 102, baseType: !280, size: 32, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !697, file: !658, line: 102, baseType: !280, size: 32, offset: 224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !697, file: !658, line: 103, baseType: !707, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !658, line: 59, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !658, line: 56, size: 2112, elements: !710)
!710 = !{!711, !715, !716}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !658, line: 57, baseType: !712, size: 2048)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 2048, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !709, file: !658, line: 58, baseType: !280, size: 32, offset: 2048)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !709, file: !658, line: 58, baseType: !280, size: 32, offset: 2080)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !697, file: !658, line: 106, baseType: !718, size: 6144, offset: 320)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 6144, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 768)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !697, file: !658, line: 107, baseType: !722, size: 64, offset: 6464)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !658, line: 97, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !658, line: 83, size: 8320, elements: !725)
!725 = !{!726, !727, !728, !732, !733, !734, !735}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !724, file: !658, line: 84, baseType: !718, size: 6144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !724, file: !658, line: 87, baseType: !712, size: 2048, offset: 6144)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !724, file: !658, line: 88, baseType: !729, size: 64, offset: 8192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !731, line: 41, flags: DIFlagFwdDecl)
!731 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !724, file: !658, line: 90, baseType: !304, size: 16, offset: 8256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !724, file: !658, line: 92, baseType: !304, size: 16, offset: 8272)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !724, file: !658, line: 93, baseType: !304, size: 16, offset: 8288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !724, file: !658, line: 95, baseType: !304, size: 16, offset: 8304)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !697, file: !658, line: 108, baseType: !737, size: 64, offset: 6528)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !658, line: 66, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !658, line: 61, size: 128, elements: !740)
!740 = !{!741, !742, !743, !744}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !739, file: !658, line: 62, baseType: !280, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !739, file: !658, line: 63, baseType: !280, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !739, file: !658, line: 64, baseType: !280, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !739, file: !658, line: 65, baseType: !280, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !697, file: !658, line: 109, baseType: !746, size: 64, offset: 6592)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !658, line: 71, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !658, line: 68, size: 64, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !748, file: !658, line: 69, baseType: !280, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !748, file: !658, line: 70, baseType: !280, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !697, file: !658, line: 110, baseType: !753, size: 64, offset: 6656)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !658, line: 81, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !658, line: 73, size: 352, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !755, file: !658, line: 74, baseType: !572, size: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !755, file: !658, line: 75, baseType: !572, size: 96, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !755, file: !658, line: 76, baseType: !572, size: 96, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !658, line: 77, baseType: !280, size: 32, offset: 288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !755, file: !658, line: 78, baseType: !280, size: 32, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !697, file: !658, line: 113, baseType: !763, size: 512, offset: 6720)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !764, line: 182, baseType: !765)
!764 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !764, line: 180, size: 512, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !765, file: !764, line: 181, baseType: !420, size: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !667, file: !658, line: 148, baseType: !769, size: 64, offset: 1408)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !551, line: 46, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !667, file: !658, line: 151, baseType: !556, size: 64, offset: 1472)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !667, file: !658, line: 152, baseType: !549, size: 64, offset: 1536)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !667, file: !658, line: 153, baseType: !774, size: 64, offset: 1600)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !776, line: 64, size: 19136, elements: !777)
!776 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !779, !780, !781, !782, !783, !785, !786, !787, !788, !791, !792, !1041, !1042, !1050, !1051, !1052, !1053, !1054}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !775, file: !776, line: 65, baseType: !373, size: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !775, file: !776, line: 66, baseType: !547, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !776, line: 68, baseType: !391, size: 8192, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !775, file: !776, line: 70, baseType: !280, size: 32, offset: 9216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !775, file: !776, line: 71, baseType: !280, size: 32, offset: 9248)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !775, file: !776, line: 72, baseType: !784, size: 64, offset: 9280)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 64, elements: !339)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !775, file: !776, line: 74, baseType: !278, size: 32, offset: 9344)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !775, file: !776, line: 74, baseType: !278, size: 32, offset: 9376)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !775, file: !776, line: 76, baseType: !729, size: 64, offset: 9408)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !775, file: !776, line: 77, baseType: !789, size: 64, offset: 9472)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !776, line: 77, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !775, file: !776, line: 78, baseType: !602, size: 64, offset: 9536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !775, file: !776, line: 80, baseType: !793, size: 2624, offset: 9600)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !794, line: 340, size: 2624, elements: !795)
!794 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!795 = !{!796, !824, !842, !843, !844, !862, !920, !921, !1021, !1022, !1023, !1024, !1030}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !793, file: !794, line: 341, baseType: !797, size: 576)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !794, line: 251, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !794, line: 207, size: 576, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !798, file: !794, line: 208, baseType: !280, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !798, file: !794, line: 211, baseType: !304, size: 16, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !798, file: !794, line: 212, baseType: !304, size: 16, offset: 48)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !798, file: !794, line: 213, baseType: !278, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !798, file: !794, line: 214, baseType: !304, size: 16, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !798, file: !794, line: 215, baseType: !304, size: 16, offset: 112)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !798, file: !794, line: 216, baseType: !304, size: 16, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !798, file: !794, line: 217, baseType: !304, size: 16, offset: 144)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !798, file: !794, line: 218, baseType: !304, size: 16, offset: 160)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !798, file: !794, line: 219, baseType: !304, size: 16, offset: 176)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !798, file: !794, line: 220, baseType: !278, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !798, file: !794, line: 222, baseType: !304, size: 16, offset: 224)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !798, file: !794, line: 225, baseType: !304, size: 16, offset: 240)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !798, file: !794, line: 228, baseType: !280, size: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !798, file: !794, line: 229, baseType: !280, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !798, file: !794, line: 233, baseType: !280, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !798, file: !794, line: 236, baseType: !304, size: 16, offset: 352)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !798, file: !794, line: 236, baseType: !304, size: 16, offset: 368)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !798, file: !794, line: 241, baseType: !278, size: 32, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !798, file: !794, line: 244, baseType: !280, size: 32, offset: 416)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !798, file: !794, line: 244, baseType: !280, size: 32, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !798, file: !794, line: 245, baseType: !278, size: 32, offset: 480)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !798, file: !794, line: 248, baseType: !278, size: 32, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !798, file: !794, line: 250, baseType: !280, size: 32, offset: 544)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !793, file: !794, line: 342, baseType: !825, size: 448, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !794, line: 79, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !794, line: 61, size: 448, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !826, file: !794, line: 62, baseType: !279, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !826, file: !794, line: 64, baseType: !304, size: 16, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !826, file: !794, line: 65, baseType: !304, size: 16, offset: 80)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !826, file: !794, line: 67, baseType: !278, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !826, file: !794, line: 68, baseType: !278, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !826, file: !794, line: 69, baseType: !278, size: 32, offset: 160)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !826, file: !794, line: 70, baseType: !304, size: 16, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !826, file: !794, line: 71, baseType: !304, size: 16, offset: 208)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !826, file: !794, line: 72, baseType: !338, size: 64, offset: 224)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !826, file: !794, line: 75, baseType: !278, size: 32, offset: 288)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !826, file: !794, line: 75, baseType: !278, size: 32, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !826, file: !794, line: 75, baseType: !278, size: 32, offset: 352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !826, file: !794, line: 78, baseType: !278, size: 32, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !826, file: !794, line: 78, baseType: !278, size: 32, offset: 416)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !793, file: !794, line: 343, baseType: !294, size: 128, offset: 1024)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !793, file: !794, line: 344, baseType: !294, size: 128, offset: 1152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !793, file: !794, line: 345, baseType: !845, size: 192, offset: 1280)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !794, line: 278, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !794, line: 270, size: 192, elements: !847)
!847 = !{!848, !849, !850, !851, !852}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !846, file: !794, line: 271, baseType: !280, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !846, file: !794, line: 273, baseType: !278, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !846, file: !794, line: 275, baseType: !280, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !846, file: !794, line: 276, baseType: !280, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !846, file: !794, line: 277, baseType: !853, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !794, line: 55, size: 576, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !854, file: !794, line: 56, baseType: !280, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !854, file: !794, line: 57, baseType: !278, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !854, file: !794, line: 58, baseType: !859, size: 512, offset: 64)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 512, elements: !860)
!860 = !{!861, !861}
!861 = !DISubrange(count: 4)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !793, file: !794, line: 346, baseType: !863, size: 384, offset: 1472)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !794, line: 268, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !794, line: 253, size: 384, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !914, !915, !916, !917, !918, !919}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !864, file: !794, line: 254, baseType: !280, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !864, file: !794, line: 255, baseType: !280, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !864, file: !794, line: 255, baseType: !280, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !864, file: !794, line: 258, baseType: !278, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !864, file: !794, line: 259, baseType: !871, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !794, line: 164, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !794, line: 108, size: 1664, elements: !874)
!874 = !{!875, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !873, file: !794, line: 109, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !873, file: !794, line: 109, baseType: !876, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !794, line: 111, baseType: !420, size: 512, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !873, file: !794, line: 119, baseType: !338, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !873, file: !794, line: 119, baseType: !338, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !873, file: !794, line: 125, baseType: !338, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !873, file: !794, line: 125, baseType: !338, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !873, file: !794, line: 127, baseType: !338, size: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !873, file: !794, line: 130, baseType: !280, size: 32, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !873, file: !794, line: 131, baseType: !280, size: 32, offset: 992)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !873, file: !794, line: 132, baseType: !887, size: 64, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !794, line: 106, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !794, line: 81, size: 512, elements: !890)
!890 = !{!891, !892, !895, !896, !897, !898}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !889, file: !794, line: 82, baseType: !338, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !889, file: !794, line: 97, baseType: !893, size: 256, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !894)
!894 = !{!861, !340}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !889, file: !794, line: 102, baseType: !338, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !889, file: !794, line: 102, baseType: !338, size: 64, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !889, file: !794, line: 104, baseType: !280, size: 32, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !889, file: !794, line: 105, baseType: !280, size: 32, offset: 480)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !873, file: !794, line: 135, baseType: !572, size: 96, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !873, file: !794, line: 136, baseType: !278, size: 32, offset: 1184)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !873, file: !794, line: 139, baseType: !280, size: 32, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !873, file: !794, line: 139, baseType: !280, size: 32, offset: 1248)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !873, file: !794, line: 139, baseType: !280, size: 32, offset: 1280)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !873, file: !794, line: 140, baseType: !572, size: 96, offset: 1312)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !873, file: !794, line: 143, baseType: !304, size: 16, offset: 1408)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !873, file: !794, line: 144, baseType: !304, size: 16, offset: 1424)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !873, file: !794, line: 145, baseType: !304, size: 16, offset: 1440)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !873, file: !794, line: 148, baseType: !304, size: 16, offset: 1456)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !873, file: !794, line: 149, baseType: !280, size: 32, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !873, file: !794, line: 150, baseType: !278, size: 32, offset: 1504)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !873, file: !794, line: 152, baseType: !602, size: 64, offset: 1536)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !873, file: !794, line: 163, baseType: !278, size: 32, offset: 1600)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !873, file: !794, line: 163, baseType: !278, size: 32, offset: 1632)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !864, file: !794, line: 261, baseType: !278, size: 32, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !864, file: !794, line: 261, baseType: !278, size: 32, offset: 224)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !864, file: !794, line: 261, baseType: !278, size: 32, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !864, file: !794, line: 263, baseType: !280, size: 32, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !864, file: !794, line: 266, baseType: !280, size: 32, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !864, file: !794, line: 267, baseType: !278, size: 32, offset: 352)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !793, file: !794, line: 347, baseType: !871, size: 64, offset: 1856)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !793, file: !794, line: 348, baseType: !922, size: 64, offset: 1920)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !794, line: 205, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !794, line: 186, size: 1024, elements: !925)
!925 = !{!926, !928, !929, !930, !932, !933, !934, !942, !943, !944, !1019, !1020}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !794, line: 187, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !924, file: !794, line: 187, baseType: !927, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !924, file: !794, line: 189, baseType: !420, size: 512, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !924, file: !794, line: 191, baseType: !931, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !924, file: !794, line: 193, baseType: !280, size: 32, offset: 704)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !924, file: !794, line: 193, baseType: !280, size: 32, offset: 736)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !924, file: !794, line: 195, baseType: !935, size: 64, offset: 768)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !794, line: 184, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !794, line: 166, size: 320, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !937, file: !794, line: 180, baseType: !893, size: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !937, file: !794, line: 182, baseType: !280, size: 32, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !937, file: !794, line: 183, baseType: !280, size: 32, offset: 288)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !924, file: !794, line: 196, baseType: !280, size: 32, offset: 832)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !924, file: !794, line: 198, baseType: !280, size: 32, offset: 864)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !924, file: !794, line: 200, baseType: !945, size: 64, offset: 896)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !731, line: 77, size: 15424, elements: !947)
!947 = !{!948, !949, !950, !953, !956, !957, !960, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !978, !979, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1005, !1006, !1007, !1008, !1009, !1013}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !946, file: !731, line: 78, baseType: !373, size: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !946, file: !731, line: 80, baseType: !391, size: 8192, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !946, file: !731, line: 82, baseType: !951, size: 64, offset: 9152)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !731, line: 43, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !946, file: !731, line: 83, baseType: !954, size: 64, offset: 9216)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !374, line: 46, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !946, file: !731, line: 86, baseType: !729, size: 64, offset: 9280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !946, file: !731, line: 87, baseType: !958, size: 64, offset: 9344)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !731, line: 44, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !946, file: !731, line: 89, baseType: !961, size: 512, offset: 9408)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 512, elements: !305)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !946, file: !731, line: 90, baseType: !304, size: 16, offset: 9920)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !946, file: !731, line: 90, baseType: !304, size: 16, offset: 9936)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !946, file: !731, line: 92, baseType: !304, size: 16, offset: 9952)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !946, file: !731, line: 92, baseType: !304, size: 16, offset: 9968)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !946, file: !731, line: 93, baseType: !304, size: 16, offset: 9984)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !946, file: !731, line: 93, baseType: !304, size: 16, offset: 10000)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !946, file: !731, line: 94, baseType: !280, size: 32, offset: 10016)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !946, file: !731, line: 97, baseType: !304, size: 16, offset: 10048)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !946, file: !731, line: 97, baseType: !304, size: 16, offset: 10064)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !946, file: !731, line: 98, baseType: !304, size: 16, offset: 10080)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !946, file: !731, line: 98, baseType: !304, size: 16, offset: 10096)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !946, file: !731, line: 99, baseType: !304, size: 16, offset: 10112)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !946, file: !731, line: 99, baseType: !304, size: 16, offset: 10128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !946, file: !731, line: 100, baseType: !5, size: 32, offset: 10144)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !946, file: !731, line: 101, baseType: !977, size: 64, offset: 10176)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !946, file: !731, line: 103, baseType: !398, size: 64, offset: 10240)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !946, file: !731, line: 104, baseType: !980, size: 64, offset: 10304)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !374, line: 159, size: 448, elements: !982)
!982 = !{!983, !985, !986, !988, !989, !991}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !981, file: !374, line: 161, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !339)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !981, file: !374, line: 162, baseType: !984, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !981, file: !374, line: 163, baseType: !987, size: 32, offset: 128)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 32, elements: !339)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !981, file: !374, line: 164, baseType: !987, size: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !981, file: !374, line: 165, baseType: !990, size: 128, offset: 192)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, elements: !339)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !981, file: !374, line: 166, baseType: !992, size: 128, offset: 320)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, elements: !339)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !946, file: !731, line: 107, baseType: !278, size: 32, offset: 10368)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !946, file: !731, line: 108, baseType: !280, size: 32, offset: 10400)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !946, file: !731, line: 109, baseType: !304, size: 16, offset: 10432)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !946, file: !731, line: 110, baseType: !304, size: 16, offset: 10448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !946, file: !731, line: 113, baseType: !280, size: 32, offset: 10464)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !946, file: !731, line: 113, baseType: !280, size: 32, offset: 10496)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !946, file: !731, line: 114, baseType: !392, size: 8, offset: 10528)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !946, file: !731, line: 114, baseType: !392, size: 8, offset: 10536)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !946, file: !731, line: 115, baseType: !304, size: 16, offset: 10544)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !946, file: !731, line: 116, baseType: !1003, size: 128, offset: 10560)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 128, elements: !1004)
!1004 = !{!861}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !946, file: !731, line: 119, baseType: !278, size: 32, offset: 10688)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !946, file: !731, line: 119, baseType: !278, size: 32, offset: 10720)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !946, file: !731, line: 122, baseType: !763, size: 512, offset: 10752)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !946, file: !731, line: 123, baseType: !392, size: 8, offset: 11264)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !946, file: !731, line: 125, baseType: !1010, size: 56, offset: 11272)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 56, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 7)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !946, file: !731, line: 126, baseType: !1014, size: 4096, offset: 11328)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 4096, elements: !305)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !731, line: 69, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !731, line: 67, size: 512, elements: !1017)
!1017 = !{!1018}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !731, line: 68, baseType: !420, size: 512)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !924, file: !794, line: 201, baseType: !278, size: 32, offset: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !924, file: !794, line: 204, baseType: !280, size: 32, offset: 992)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !793, file: !794, line: 350, baseType: !294, size: 128, offset: 1984)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !793, file: !794, line: 351, baseType: !280, size: 32, offset: 2112)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !793, file: !794, line: 351, baseType: !280, size: 32, offset: 2144)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !793, file: !794, line: 353, baseType: !1025, size: 64, offset: 2176)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !794, line: 297, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !794, line: 295, size: 2048, elements: !1028)
!1028 = !{!1029}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1027, file: !794, line: 296, baseType: !712, size: 2048)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !793, file: !794, line: 355, baseType: !1031, size: 384, offset: 2240)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !794, line: 338, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !794, line: 322, size: 384, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1032, file: !794, line: 323, baseType: !280, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1032, file: !794, line: 325, baseType: !304, size: 16, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1032, file: !794, line: 326, baseType: !304, size: 16, offset: 48)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1032, file: !794, line: 331, baseType: !294, size: 128, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1032, file: !794, line: 334, baseType: !294, size: 128, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1032, file: !794, line: 335, baseType: !280, size: 32, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1032, file: !794, line: 337, baseType: !280, size: 32, offset: 352)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !775, file: !776, line: 81, baseType: !279, size: 64, offset: 12224)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !775, file: !776, line: 85, baseType: !1043, size: 6208, offset: 12288)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !776, line: 55, size: 6208, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1043, file: !776, line: 56, baseType: !718, size: 6144)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1043, file: !776, line: 58, baseType: !304, size: 16, offset: 6144)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1043, file: !776, line: 59, baseType: !304, size: 16, offset: 6160)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1043, file: !776, line: 60, baseType: !304, size: 16, offset: 6176)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1043, file: !776, line: 61, baseType: !304, size: 16, offset: 6192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !775, file: !776, line: 86, baseType: !280, size: 32, offset: 18496)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !775, file: !776, line: 88, baseType: !280, size: 32, offset: 18528)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !775, file: !776, line: 90, baseType: !280, size: 32, offset: 18560)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !775, file: !776, line: 94, baseType: !280, size: 32, offset: 18592)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !775, file: !776, line: 100, baseType: !763, size: 512, offset: 18624)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !667, file: !658, line: 154, baseType: !1056, size: 64, offset: 1664)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !658, line: 154, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !667, file: !658, line: 156, baseType: !729, size: 64, offset: 1728)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !667, file: !658, line: 158, baseType: !278, size: 32, offset: 1792)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !667, file: !658, line: 159, baseType: !278, size: 32, offset: 1824)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !667, file: !658, line: 162, baseType: !670, size: 64, offset: 1856)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !667, file: !658, line: 162, baseType: !670, size: 64, offset: 1920)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !667, file: !658, line: 162, baseType: !670, size: 64, offset: 1984)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !667, file: !658, line: 164, baseType: !294, size: 128, offset: 2048)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !667, file: !658, line: 166, baseType: !1066, size: 64, offset: 2176)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !658, line: 51, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !667, file: !658, line: 167, baseType: !279, size: 64, offset: 2240)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !667, file: !658, line: 168, baseType: !278, size: 32, offset: 2304)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !667, file: !658, line: 170, baseType: !278, size: 32, offset: 2336)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !667, file: !658, line: 170, baseType: !278, size: 32, offset: 2368)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !667, file: !658, line: 171, baseType: !278, size: 32, offset: 2400)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !667, file: !658, line: 173, baseType: !279, size: 64, offset: 2432)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !667, file: !658, line: 175, baseType: !280, size: 32, offset: 2496)
