; ModuleID = 'blender/source/blender/blenkernel/intern/modifier.c'
source_filename = "blender/source/blender/blenkernel/intern/modifier.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!102 = !DIEnumerator(name: "eModifierTypeType_Constructive", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "eModifierTypeType_Nonconstructive", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "eModifierTypeType_DeformOrConstruct", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "eModifierTypeType_NonGeometrical", value: 5, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 73, baseType: !7, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!108 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!109 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!110 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!112 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!113 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!115 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!116 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!117 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !98, line: 110, baseType: !7, size: 32, elements: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 339, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!127 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!131 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!132 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!133 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!134 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!135 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!136 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!137 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 377, baseType: !7, size: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148}
!140 = !DIEnumerator(name: "PARTYPE", value: 15, isUnsigned: true)
!141 = !DIEnumerator(name: "PAROBJECT", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "PARCURVE", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "PARKEY", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "PARSKEL", value: 4, isUnsigned: true)
!145 = !DIEnumerator(name: "PARVERT1", value: 5, isUnsigned: true)
!146 = !DIEnumerator(name: "PARVERT3", value: 6, isUnsigned: true)
!147 = !DIEnumerator(name: "PARBONE", value: 7, isUnsigned: true)
!148 = !DIEnumerator(name: "PARSLOW", value: 16, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 626, baseType: !7, size: 32, elements: !150)
!150 = !{!151, !152}
!151 = !DIEnumerator(name: "OB_SHAPE_LOCK", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "OB_SHAPE_EDIT_MODE", value: 4, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !125, line: 666, baseType: !7, size: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162}
!155 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!160 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!161 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!162 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!163 = !{!164, !1040, !1052, !1062, !1067, !189, !1072, !1074, !1077, !204, !1148}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ArmatureModifierData", file: !6, line: 535, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArmatureModifierData", file: !6, line: 527, size: 1600, elements: !167)
!167 = !{!168, !190, !192, !193, !194, !1038, !1039}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !166, file: !6, line: 528, baseType: !169, size: 896)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !6, line: 110, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !6, line: 99, size: 896, elements: !171)
!171 = !{!172, !174, !175, !176, !177, !178, !179, !184, !188}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !6, line: 100, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !6, line: 100, baseType: !173, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !6, line: 102, baseType: !87, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !170, file: !6, line: 102, baseType: !87, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !170, file: !6, line: 103, baseType: !87, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !170, file: !6, line: 103, baseType: !87, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !6, line: 104, baseType: !180, size: 512, offset: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 512, elements: !182)
!181 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !{!183}
!183 = !DISubrange(count: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !170, file: !6, line: 107, baseType: !185, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !187, line: 40, flags: DIFlagFwdDecl)
!187 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !170, file: !6, line: 109, baseType: !189, size: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !166, file: !6, line: 530, baseType: !191, size: 16, offset: 896)
!191 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !166, file: !6, line: 530, baseType: !191, size: 16, offset: 912)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !166, file: !6, line: 531, baseType: !87, size: 32, offset: 928)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !166, file: !6, line: 532, baseType: !195, size: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !125, line: 115, size: 11392, elements: !197)
!197 = !{!198, !264, !268, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !286, !298, !312, !313, !356, !357, !360, !361, !377, !378, !379, !380, !381, !382, !383, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !402, !403, !404, !405, !406, !407, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !467, !468, !469, !470, !471, !472, !473, !474, !475, !478, !481, !484, !485, !486, !487, !488, !491, !494, !985, !986, !992, !993, !994, !995, !996, !997, !999, !1002, !1005, !1007, !1026, !1027}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !196, file: !125, line: 116, baseType: !199, size: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !200, line: 130, baseType: !201)
!200 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !200, line: 117, size: 960, elements: !202)
!202 = !{!203, !205, !206, !208, !227, !231, !232, !233, !234, !235}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !200, line: 118, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !200, line: 118, baseType: !204, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !201, file: !200, line: 119, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !201, file: !200, line: 120, baseType: !209, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !200, line: 136, size: 17600, elements: !211)
!211 = !{!212, !213, !215, !218, !222, !223, !224}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !200, line: 137, baseType: !199, size: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !210, file: !200, line: 138, baseType: !214, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !210, file: !200, line: 139, baseType: !216, size: 64, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !200, line: 43, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !200, line: 140, baseType: !219, size: 8192, offset: 1088)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 8192, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !210, file: !200, line: 141, baseType: !219, size: 8192, offset: 9280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !210, file: !200, line: 148, baseType: !209, size: 64, offset: 17472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !210, file: !200, line: 150, baseType: !225, size: 64, offset: 17536)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !200, line: 45, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !200, line: 121, baseType: !228, size: 528, offset: 256)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 528, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 66)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !200, line: 126, baseType: !191, size: 16, offset: 784)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !201, file: !200, line: 127, baseType: !87, size: 32, offset: 800)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !201, file: !200, line: 128, baseType: !87, size: 32, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !201, file: !200, line: 128, baseType: !87, size: 32, offset: 864)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !201, file: !200, line: 129, baseType: !236, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !200, line: 75, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !200, line: 62, size: 1024, elements: !239)
!239 = !{!240, !242, !243, !244, !245, !246, !247, !248, !262, !263}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !200, line: 63, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !200, line: 63, baseType: !241, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !200, line: 64, baseType: !181, size: 8, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !238, file: !200, line: 64, baseType: !181, size: 8, offset: 136)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !238, file: !200, line: 65, baseType: !191, size: 16, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !200, line: 66, baseType: !180, size: 512, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !238, file: !200, line: 67, baseType: !87, size: 32, offset: 672)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !200, line: 69, baseType: !249, size: 256, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !200, line: 60, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !200, line: 48, size: 256, elements: !251)
!251 = !{!252, !253, !260, !261}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !250, file: !200, line: 49, baseType: !204, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !250, file: !200, line: 58, baseType: !254, size: 128, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !255, line: 71, baseType: !256)
!255 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !255, line: 69, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !256, file: !255, line: 70, baseType: !204, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !256, file: !255, line: 70, baseType: !204, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !250, file: !200, line: 59, baseType: !87, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !250, file: !200, line: 59, baseType: !87, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !238, file: !200, line: 70, baseType: !87, size: 32, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !238, file: !200, line: 74, baseType: !87, size: 32, offset: 992)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !196, file: !125, line: 117, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !267, line: 37, flags: DIFlagFwdDecl)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !196, file: !125, line: 119, baseType: !269, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !125, line: 57, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !125, line: 121, baseType: !191, size: 16, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !196, file: !125, line: 121, baseType: !191, size: 16, offset: 1104)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !196, file: !125, line: 122, baseType: !87, size: 32, offset: 1120)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !196, file: !125, line: 122, baseType: !87, size: 32, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !196, file: !125, line: 122, baseType: !87, size: 32, offset: 1184)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !196, file: !125, line: 123, baseType: !180, size: 512, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !196, file: !125, line: 124, baseType: !195, size: 64, offset: 1728)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !196, file: !125, line: 124, baseType: !195, size: 64, offset: 1792)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !196, file: !125, line: 127, baseType: !195, size: 64, offset: 1856)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !196, file: !125, line: 127, baseType: !195, size: 64, offset: 1920)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !196, file: !125, line: 127, baseType: !195, size: 64, offset: 1984)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !196, file: !125, line: 128, baseType: !283, size: 64, offset: 2048)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !285, line: 46, flags: DIFlagFwdDecl)
!285 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !196, file: !125, line: 130, baseType: !287, size: 64, offset: 2112)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !125, line: 97, size: 832, elements: !289)
!289 = !{!290, !296, !297}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !288, file: !125, line: 98, baseType: !291, size: 768)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 768, elements: !293)
!292 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!293 = !{!294, !295}
!294 = !DISubrange(count: 8)
!295 = !DISubrange(count: 3)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !125, line: 99, baseType: !87, size: 32, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !288, file: !125, line: 99, baseType: !87, size: 32, offset: 800)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !196, file: !125, line: 131, baseType: !299, size: 64, offset: 2176)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !301, line: 486, size: 1600, elements: !302)
!301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !300, file: !301, line: 487, baseType: !199, size: 960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !300, file: !301, line: 489, baseType: !254, size: 128, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !300, file: !301, line: 490, baseType: !254, size: 128, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !300, file: !301, line: 491, baseType: !254, size: 128, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !300, file: !301, line: 492, baseType: !254, size: 128, offset: 1344)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !300, file: !301, line: 494, baseType: !87, size: 32, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !300, file: !301, line: 495, baseType: !87, size: 32, offset: 1504)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !300, file: !301, line: 497, baseType: !87, size: 32, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !300, file: !301, line: 498, baseType: !87, size: 32, offset: 1568)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !196, file: !125, line: 132, baseType: !299, size: 64, offset: 2240)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !196, file: !125, line: 133, baseType: !314, size: 64, offset: 2304)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !301, line: 334, size: 1728, elements: !316)
!316 = !{!317, !318, !321, !322, !323, !324, !325, !326, !329, !330, !331, !332, !333, !334, !335, !355}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !315, file: !301, line: 335, baseType: !254, size: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !315, file: !301, line: 336, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !301, line: 47, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !301, line: 338, baseType: !191, size: 16, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !315, file: !301, line: 338, baseType: !191, size: 16, offset: 208)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !315, file: !301, line: 339, baseType: !7, size: 32, offset: 224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !315, file: !301, line: 340, baseType: !87, size: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !315, file: !301, line: 342, baseType: !292, size: 32, offset: 288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !315, file: !301, line: 343, baseType: !327, size: 96, offset: 320)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 96, elements: !328)
!328 = !{!295}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !315, file: !301, line: 344, baseType: !327, size: 96, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !315, file: !301, line: 347, baseType: !254, size: 128, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !315, file: !301, line: 349, baseType: !87, size: 32, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !315, file: !301, line: 350, baseType: !87, size: 32, offset: 672)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !315, file: !301, line: 351, baseType: !204, size: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !315, file: !301, line: 352, baseType: !204, size: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !315, file: !301, line: 354, baseType: !336, size: 384, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !301, line: 116, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !301, line: 94, size: 384, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !337, file: !301, line: 96, baseType: !87, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !337, file: !301, line: 96, baseType: !87, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !337, file: !301, line: 97, baseType: !87, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !337, file: !301, line: 97, baseType: !87, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !337, file: !301, line: 99, baseType: !191, size: 16, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !337, file: !301, line: 100, baseType: !191, size: 16, offset: 144)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !337, file: !301, line: 102, baseType: !191, size: 16, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !337, file: !301, line: 105, baseType: !191, size: 16, offset: 176)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !337, file: !301, line: 108, baseType: !191, size: 16, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !337, file: !301, line: 109, baseType: !191, size: 16, offset: 208)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !337, file: !301, line: 111, baseType: !191, size: 16, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !337, file: !301, line: 112, baseType: !191, size: 16, offset: 240)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !337, file: !301, line: 114, baseType: !87, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !337, file: !301, line: 114, baseType: !87, size: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !337, file: !301, line: 115, baseType: !87, size: 32, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !337, file: !301, line: 115, baseType: !87, size: 32, offset: 352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !315, file: !301, line: 355, baseType: !180, size: 512, offset: 1216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !125, line: 134, baseType: !204, size: 64, offset: 2368)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !196, file: !125, line: 136, baseType: !358, size: 64, offset: 2432)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !125, line: 58, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !196, file: !125, line: 138, baseType: !336, size: 384, offset: 2496)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !196, file: !125, line: 139, baseType: !362, size: 64, offset: 2880)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !301, line: 80, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !301, line: 72, size: 192, elements: !365)
!365 = !{!366, !373, !374, !375, !376}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !364, file: !301, line: 73, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !301, line: 59, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !301, line: 56, size: 128, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !369, file: !301, line: 57, baseType: !327, size: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !301, line: 58, baseType: !87, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !364, file: !301, line: 74, baseType: !87, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !364, file: !301, line: 76, baseType: !87, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !364, file: !301, line: 77, baseType: !87, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !364, file: !301, line: 79, baseType: !87, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !196, file: !125, line: 141, baseType: !254, size: 128, offset: 2944)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !196, file: !125, line: 142, baseType: !254, size: 128, offset: 3072)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !196, file: !125, line: 143, baseType: !254, size: 128, offset: 3200)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !196, file: !125, line: 144, baseType: !254, size: 128, offset: 3328)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !196, file: !125, line: 146, baseType: !87, size: 32, offset: 3456)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !196, file: !125, line: 147, baseType: !87, size: 32, offset: 3488)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !196, file: !125, line: 150, baseType: !384, size: 64, offset: 3520)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !125, line: 50, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !196, file: !125, line: 151, baseType: !189, size: 64, offset: 3584)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !196, file: !125, line: 152, baseType: !87, size: 32, offset: 3648)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !196, file: !125, line: 153, baseType: !87, size: 32, offset: 3680)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !196, file: !125, line: 156, baseType: !327, size: 96, offset: 3712)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !196, file: !125, line: 156, baseType: !327, size: 96, offset: 3808)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !196, file: !125, line: 156, baseType: !327, size: 96, offset: 3904)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !196, file: !125, line: 157, baseType: !327, size: 96, offset: 4000)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !196, file: !125, line: 158, baseType: !327, size: 96, offset: 4096)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !196, file: !125, line: 159, baseType: !327, size: 96, offset: 4192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !196, file: !125, line: 160, baseType: !327, size: 96, offset: 4288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !196, file: !125, line: 160, baseType: !327, size: 96, offset: 4384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !196, file: !125, line: 161, baseType: !399, size: 128, offset: 4480)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 128, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 4)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !196, file: !125, line: 161, baseType: !399, size: 128, offset: 4608)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !196, file: !125, line: 162, baseType: !327, size: 96, offset: 4736)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !196, file: !125, line: 162, baseType: !327, size: 96, offset: 4832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !196, file: !125, line: 163, baseType: !292, size: 32, offset: 4928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !196, file: !125, line: 163, baseType: !292, size: 32, offset: 4960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !196, file: !125, line: 164, baseType: !408, size: 512, offset: 4992)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 512, elements: !409)
!409 = !{!401, !401}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !196, file: !125, line: 165, baseType: !408, size: 512, offset: 5504)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !196, file: !125, line: 166, baseType: !408, size: 512, offset: 6016)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !196, file: !125, line: 167, baseType: !408, size: 512, offset: 6528)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !196, file: !125, line: 176, baseType: !408, size: 512, offset: 7040)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !196, file: !125, line: 178, baseType: !7, size: 32, offset: 7552)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !196, file: !125, line: 180, baseType: !191, size: 16, offset: 7584)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !196, file: !125, line: 181, baseType: !191, size: 16, offset: 7600)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !196, file: !125, line: 183, baseType: !191, size: 16, offset: 7616)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !196, file: !125, line: 183, baseType: !191, size: 16, offset: 7632)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !196, file: !125, line: 184, baseType: !191, size: 16, offset: 7648)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !196, file: !125, line: 184, baseType: !191, size: 16, offset: 7664)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !196, file: !125, line: 185, baseType: !191, size: 16, offset: 7680)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !196, file: !125, line: 186, baseType: !191, size: 16, offset: 7696)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !196, file: !125, line: 187, baseType: !191, size: 16, offset: 7712)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !196, file: !125, line: 188, baseType: !181, size: 8, offset: 7728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !196, file: !125, line: 189, baseType: !181, size: 8, offset: 7736)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !196, file: !125, line: 192, baseType: !87, size: 32, offset: 7744)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !196, file: !125, line: 192, baseType: !87, size: 32, offset: 7776)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !196, file: !125, line: 192, baseType: !87, size: 32, offset: 7808)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !196, file: !125, line: 192, baseType: !87, size: 32, offset: 7840)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !196, file: !125, line: 194, baseType: !87, size: 32, offset: 7872)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !196, file: !125, line: 202, baseType: !292, size: 32, offset: 7904)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !196, file: !125, line: 202, baseType: !292, size: 32, offset: 7936)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !196, file: !125, line: 202, baseType: !292, size: 32, offset: 7968)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !196, file: !125, line: 211, baseType: !292, size: 32, offset: 8000)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !196, file: !125, line: 212, baseType: !292, size: 32, offset: 8032)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !196, file: !125, line: 213, baseType: !292, size: 32, offset: 8064)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !196, file: !125, line: 214, baseType: !292, size: 32, offset: 8096)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !196, file: !125, line: 215, baseType: !292, size: 32, offset: 8128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !196, file: !125, line: 216, baseType: !292, size: 32, offset: 8160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !196, file: !125, line: 219, baseType: !292, size: 32, offset: 8192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !196, file: !125, line: 220, baseType: !292, size: 32, offset: 8224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !196, file: !125, line: 221, baseType: !292, size: 32, offset: 8256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !196, file: !125, line: 224, baseType: !444, size: 16, offset: 8288)
!444 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !196, file: !125, line: 224, baseType: !444, size: 16, offset: 8304)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !196, file: !125, line: 226, baseType: !191, size: 16, offset: 8320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !196, file: !125, line: 228, baseType: !181, size: 8, offset: 8336)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !196, file: !125, line: 229, baseType: !181, size: 8, offset: 8344)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !196, file: !125, line: 231, baseType: !191, size: 16, offset: 8352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !196, file: !125, line: 232, baseType: !181, size: 8, offset: 8368)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !196, file: !125, line: 233, baseType: !181, size: 8, offset: 8376)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !196, file: !125, line: 234, baseType: !292, size: 32, offset: 8384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !196, file: !125, line: 235, baseType: !292, size: 32, offset: 8416)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !196, file: !125, line: 237, baseType: !254, size: 128, offset: 8448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !196, file: !125, line: 238, baseType: !254, size: 128, offset: 8576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !196, file: !125, line: 239, baseType: !254, size: 128, offset: 8704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !196, file: !125, line: 240, baseType: !254, size: 128, offset: 8832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !196, file: !125, line: 242, baseType: !292, size: 32, offset: 8960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !196, file: !125, line: 244, baseType: !191, size: 16, offset: 8992)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !196, file: !125, line: 245, baseType: !444, size: 16, offset: 9008)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !196, file: !125, line: 246, baseType: !399, size: 128, offset: 9024)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !196, file: !125, line: 248, baseType: !87, size: 32, offset: 9152)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !196, file: !125, line: 249, baseType: !87, size: 32, offset: 9184)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !196, file: !125, line: 251, baseType: !465, size: 64, offset: 9216)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !125, line: 251, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !196, file: !125, line: 253, baseType: !181, size: 8, offset: 9280)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !196, file: !125, line: 254, baseType: !181, size: 8, offset: 9288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !196, file: !125, line: 255, baseType: !191, size: 16, offset: 9296)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !196, file: !125, line: 256, baseType: !327, size: 96, offset: 9312)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !196, file: !125, line: 258, baseType: !254, size: 128, offset: 9408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !196, file: !125, line: 259, baseType: !254, size: 128, offset: 9536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !196, file: !125, line: 260, baseType: !254, size: 128, offset: 9664)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !196, file: !125, line: 261, baseType: !254, size: 128, offset: 9792)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !196, file: !125, line: 263, baseType: !476, size: 64, offset: 9920)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !125, line: 52, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !196, file: !125, line: 264, baseType: !479, size: 64, offset: 9984)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !125, line: 53, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !196, file: !125, line: 265, baseType: !482, size: 64, offset: 10048)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !301, line: 46, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !196, file: !125, line: 267, baseType: !181, size: 8, offset: 10112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !196, file: !125, line: 268, baseType: !181, size: 8, offset: 10120)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !196, file: !125, line: 269, baseType: !191, size: 16, offset: 10128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !196, file: !125, line: 270, baseType: !292, size: 32, offset: 10144)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !196, file: !125, line: 272, baseType: !489, size: 64, offset: 10176)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !125, line: 54, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !196, file: !125, line: 275, baseType: !492, size: 64, offset: 10240)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !125, line: 275, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !196, file: !125, line: 277, baseType: !495, size: 64, offset: 10304)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !60, line: 178, size: 13504, elements: !497)
!497 = !{!498, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !554, !557, !559, !560, !562, !563, !564, !565, !571, !576, !577, !581, !582, !583, !584, !585, !598, !610, !624, !628, !632, !636, !645, !657, !661, !665, !669, !673, !677, !678, !679, !680, !681, !682, !686, !687, !688, !689, !693, !694, !695, !696, !697, !702, !703, !704, !705, !706, !710, !711, !712, !713, !714, !721, !732, !737, !743, !753, !759, !770, !777, !784, !788, !793, !797, !802, !803, !804, !811, !817, !818, !819, !824, !825, !834, !942, !946, !954, !958, !962, !966, !974, !984}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !496, file: !60, line: 180, baseType: !499, size: 1600)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !500, line: 73, baseType: !501)
!500 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !500, line: 64, size: 1600, elements: !502)
!502 = !{!503, !518, !522, !523, !524, !525, !528}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !501, file: !500, line: 65, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !500, line: 53, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !500, line: 42, size: 832, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !500, line: 43, baseType: !87, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !506, file: !500, line: 44, baseType: !87, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !506, file: !500, line: 45, baseType: !87, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !506, file: !500, line: 46, baseType: !87, size: 32, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !506, file: !500, line: 47, baseType: !87, size: 32, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !506, file: !500, line: 48, baseType: !87, size: 32, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !506, file: !500, line: 49, baseType: !87, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !506, file: !500, line: 50, baseType: !87, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !506, file: !500, line: 51, baseType: !180, size: 512, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !506, file: !500, line: 52, baseType: !204, size: 64, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !501, file: !500, line: 66, baseType: !519, size: 1312, offset: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1312, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 41)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !501, file: !500, line: 69, baseType: !87, size: 32, offset: 1376)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !501, file: !500, line: 69, baseType: !87, size: 32, offset: 1408)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !501, file: !500, line: 70, baseType: !87, size: 32, offset: 1440)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !501, file: !500, line: 71, baseType: !526, size: 64, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !500, line: 71, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !501, file: !500, line: 72, baseType: !529, size: 64, offset: 1536)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !500, line: 59, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !500, line: 57, size: 8192, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !531, file: !500, line: 58, baseType: !219, size: 8192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !496, file: !60, line: 180, baseType: !499, size: 1600, offset: 1600)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !496, file: !60, line: 180, baseType: !499, size: 1600, offset: 3200)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !496, file: !60, line: 180, baseType: !499, size: 1600, offset: 4800)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !496, file: !60, line: 180, baseType: !499, size: 1600, offset: 6400)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !496, file: !60, line: 181, baseType: !87, size: 32, offset: 8000)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !496, file: !60, line: 181, baseType: !87, size: 32, offset: 8032)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !496, file: !60, line: 181, baseType: !87, size: 32, offset: 8064)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !496, file: !60, line: 181, baseType: !87, size: 32, offset: 8096)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !496, file: !60, line: 181, baseType: !87, size: 32, offset: 8128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !496, file: !60, line: 182, baseType: !87, size: 32, offset: 8160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !496, file: !60, line: 183, baseType: !87, size: 32, offset: 8192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !496, file: !60, line: 184, baseType: !546, size: 64, offset: 8256)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !547, line: 124, baseType: !548)
!547 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !550, line: 45, size: 128, elements: !551)
!550 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !550, line: 46, baseType: !548, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !549, file: !550, line: 47, baseType: !204, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !496, file: !60, line: 185, baseType: !555, size: 64, offset: 8320)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !60, line: 97, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !60, line: 186, baseType: !558, size: 32, offset: 8384)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !60, line: 132, baseType: !59)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !496, file: !60, line: 187, baseType: !292, size: 32, offset: 8416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !496, file: !60, line: 188, baseType: !561, size: 32, offset: 8448)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !60, line: 175, baseType: !65)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !496, file: !60, line: 189, baseType: !87, size: 32, offset: 8480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !496, file: !60, line: 190, baseType: !384, size: 64, offset: 8512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !496, file: !60, line: 193, baseType: !181, size: 8, offset: 8576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !496, file: !60, line: 196, baseType: !566, size: 64, offset: 8640)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !60, line: 177, baseType: !496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !496, file: !60, line: 199, baseType: !572, size: 64, offset: 8704)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !569, !575}
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !496, file: !60, line: 202, baseType: !566, size: 64, offset: 8768)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !496, file: !60, line: 207, baseType: !578, size: 64, offset: 8832)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!87, !569}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !496, file: !60, line: 208, baseType: !578, size: 64, offset: 8896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !496, file: !60, line: 209, baseType: !578, size: 64, offset: 8960)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !496, file: !60, line: 210, baseType: !578, size: 64, offset: 9024)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !496, file: !60, line: 211, baseType: !578, size: 64, offset: 9088)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !496, file: !60, line: 218, baseType: !586, size: 64, offset: 9152)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !569, !87, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !591, line: 65, size: 160, elements: !592)
!591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!592 = !{!593, !594, !596, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !590, file: !591, line: 66, baseType: !327, size: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !590, file: !591, line: 67, baseType: !595, size: 48, offset: 96)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 48, elements: !328)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !591, line: 68, baseType: !181, size: 8, offset: 144)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !590, file: !591, line: 68, baseType: !181, size: 8, offset: 152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !496, file: !60, line: 219, baseType: !599, size: 64, offset: 9216)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !569, !87, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !591, line: 48, size: 96, elements: !604)
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !603, file: !591, line: 49, baseType: !7, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !603, file: !591, line: 49, baseType: !7, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !603, file: !591, line: 50, baseType: !181, size: 8, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !603, file: !591, line: 50, baseType: !181, size: 8, offset: 72)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !603, file: !591, line: 51, baseType: !191, size: 16, offset: 80)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !496, file: !60, line: 220, baseType: !611, size: 64, offset: 9280)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !569, !87, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !591, line: 42, size: 160, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !615, file: !591, line: 43, baseType: !7, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !615, file: !591, line: 43, baseType: !7, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !615, file: !591, line: 43, baseType: !7, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !615, file: !591, line: 43, baseType: !7, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !615, file: !591, line: 44, baseType: !191, size: 16, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !615, file: !591, line: 45, baseType: !181, size: 8, offset: 144)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !591, line: 45, baseType: !181, size: 8, offset: 152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !496, file: !60, line: 227, baseType: !625, size: 64, offset: 9344)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!589, !569}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !496, file: !60, line: 228, baseType: !629, size: 64, offset: 9408)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!602, !569}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !496, file: !60, line: 229, baseType: !633, size: 64, offset: 9472)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!614, !569}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !496, file: !60, line: 230, baseType: !637, size: 64, offset: 9536)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!640, !569}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !591, line: 88, size: 64, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !641, file: !591, line: 89, baseType: !7, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !641, file: !591, line: 90, baseType: !7, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !496, file: !60, line: 231, baseType: !646, size: 64, offset: 9600)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!649, !569}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !591, line: 79, size: 96, elements: !651)
!651 = !{!652, !653, !654, !655, !656}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !650, file: !591, line: 81, baseType: !87, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !650, file: !591, line: 82, baseType: !87, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !650, file: !591, line: 83, baseType: !191, size: 16, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !650, file: !591, line: 84, baseType: !181, size: 8, offset: 80)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !650, file: !591, line: 84, baseType: !181, size: 8, offset: 88)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !496, file: !60, line: 236, baseType: !658, size: 64, offset: 9664)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !569, !589}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !496, file: !60, line: 237, baseType: !662, size: 64, offset: 9728)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !569, !602}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !496, file: !60, line: 238, baseType: !666, size: 64, offset: 9792)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !569, !614}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !496, file: !60, line: 239, baseType: !670, size: 64, offset: 9856)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !569, !640}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !496, file: !60, line: 240, baseType: !674, size: 64, offset: 9920)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !569, !649}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !496, file: !60, line: 245, baseType: !625, size: 64, offset: 9984)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !496, file: !60, line: 246, baseType: !629, size: 64, offset: 10048)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !496, file: !60, line: 247, baseType: !633, size: 64, offset: 10112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !496, file: !60, line: 248, baseType: !637, size: 64, offset: 10176)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !496, file: !60, line: 249, baseType: !646, size: 64, offset: 10240)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !496, file: !60, line: 255, baseType: !683, size: 64, offset: 10304)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!204, !569, !87, !87}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !496, file: !60, line: 256, baseType: !683, size: 64, offset: 10368)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !496, file: !60, line: 257, baseType: !683, size: 64, offset: 10432)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !496, file: !60, line: 258, baseType: !683, size: 64, offset: 10496)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !496, file: !60, line: 264, baseType: !690, size: 64, offset: 10560)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!204, !569, !87}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !496, file: !60, line: 265, baseType: !690, size: 64, offset: 10624)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !496, file: !60, line: 266, baseType: !690, size: 64, offset: 10688)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !496, file: !60, line: 267, baseType: !690, size: 64, offset: 10752)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !496, file: !60, line: 268, baseType: !690, size: 64, offset: 10816)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !496, file: !60, line: 272, baseType: !698, size: 64, offset: 10880)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!701, !569}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !496, file: !60, line: 273, baseType: !698, size: 64, offset: 10944)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !496, file: !60, line: 274, baseType: !698, size: 64, offset: 11008)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !496, file: !60, line: 275, baseType: !698, size: 64, offset: 11072)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !496, file: !60, line: 276, baseType: !698, size: 64, offset: 11136)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !496, file: !60, line: 279, baseType: !707, size: 64, offset: 11200)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !569, !87, !701, !87}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !496, file: !60, line: 280, baseType: !707, size: 64, offset: 11264)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !496, file: !60, line: 281, baseType: !707, size: 64, offset: 11328)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !496, file: !60, line: 284, baseType: !578, size: 64, offset: 11392)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !496, file: !60, line: 285, baseType: !578, size: 64, offset: 11456)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !496, file: !60, line: 286, baseType: !715, size: 64, offset: 11520)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!718, !569}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !60, line: 82, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !496, file: !60, line: 287, baseType: !722, size: 64, offset: 11584)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!725, !569}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !60, line: 120, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !60, line: 117, size: 256, elements: !728)
!728 = !{!729, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !727, file: !60, line: 118, baseType: !730, size: 128)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !400)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !727, file: !60, line: 119, baseType: !730, size: 128, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !496, file: !60, line: 288, baseType: !733, size: 64, offset: 11648)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!736, !569}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !496, file: !60, line: 289, baseType: !738, size: 64, offset: 11712)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !569, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !60, line: 83, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !496, file: !60, line: 290, baseType: !744, size: 64, offset: 11776)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !569}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !60, line: 126, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !60, line: 123, size: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !749, file: !60, line: 124, baseType: !191, size: 16)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !749, file: !60, line: 125, baseType: !181, size: 8, offset: 16)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !496, file: !60, line: 291, baseType: !754, size: 64, offset: 11840)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!757, !569}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !496, file: !60, line: 299, baseType: !760, size: 64, offset: 11904)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !569, !763, !204, !769}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !204, !87, !766, !766, !767}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !60, line: 162, baseType: !70)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !496, file: !60, line: 309, baseType: !771, size: 64, offset: 11968)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !569, !774, !204}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !204, !87, !766, !766}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !496, file: !60, line: 317, baseType: !778, size: 64, offset: 12032)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !569, !781, !204, !769}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !204, !87, !87, !766, !766}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !496, file: !60, line: 327, baseType: !785, size: 64, offset: 12096)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !569, !774, !204, !769}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !496, file: !60, line: 337, baseType: !789, size: 64, offset: 12160)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !569, !792, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !496, file: !60, line: 344, baseType: !794, size: 64, offset: 12224)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !569, !87, !792}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !496, file: !60, line: 347, baseType: !798, size: 64, offset: 12288)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !569, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !496, file: !60, line: 350, baseType: !794, size: 64, offset: 12352)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !496, file: !60, line: 351, baseType: !794, size: 64, offset: 12416)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !496, file: !60, line: 355, baseType: !805, size: 64, offset: 12480)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!808, !195, !569}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !60, line: 355, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !496, file: !60, line: 359, baseType: !812, size: 64, offset: 12544)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !195, !569}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !60, line: 100, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !496, file: !60, line: 364, baseType: !566, size: 64, offset: 12608)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !496, file: !60, line: 367, baseType: !566, size: 64, offset: 12672)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !496, file: !60, line: 373, baseType: !820, size: 64, offset: 12736)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !569, !823, !823}
!823 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !496, file: !60, line: 376, baseType: !566, size: 64, offset: 12800)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !496, file: !60, line: 385, baseType: !826, size: 64, offset: 12864)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !569, !829, !823, !830}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !60, line: 146, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!87, !87, !204}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !496, file: !60, line: 391, baseType: !835, size: 64, offset: 12928)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !569, !838, !937, !204, !941}
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !60, line: 150, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!842, !843, !936, !87}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !60, line: 143, baseType: !74)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !591, line: 160, size: 384, elements: !845)
!845 = !{!846, !850, !931, !932, !933, !934, !935}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !844, file: !591, line: 161, baseType: !847, size: 256)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !848)
!848 = !{!401, !849}
!849 = !DISubrange(count: 2)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !844, file: !591, line: 162, baseType: !851, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !187, line: 77, size: 15424, elements: !853)
!853 = !{!854, !855, !856, !859, !862, !865, !868, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !920, !921, !925}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !852, file: !187, line: 78, baseType: !199, size: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !852, file: !187, line: 80, baseType: !219, size: 8192, offset: 960)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !852, file: !187, line: 82, baseType: !857, size: 64, offset: 9152)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !187, line: 43, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !852, file: !187, line: 83, baseType: !860, size: 64, offset: 9216)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !200, line: 46, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !852, file: !187, line: 86, baseType: !863, size: 64, offset: 9280)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !187, line: 41, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !852, file: !187, line: 87, baseType: !866, size: 64, offset: 9344)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !187, line: 44, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !852, file: !187, line: 89, baseType: !869, size: 512, offset: 9408)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 512, elements: !870)
!870 = !{!294}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !852, file: !187, line: 90, baseType: !191, size: 16, offset: 9920)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !852, file: !187, line: 90, baseType: !191, size: 16, offset: 9936)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !852, file: !187, line: 92, baseType: !191, size: 16, offset: 9952)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !852, file: !187, line: 92, baseType: !191, size: 16, offset: 9968)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !852, file: !187, line: 93, baseType: !191, size: 16, offset: 9984)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !187, line: 93, baseType: !191, size: 16, offset: 10000)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !852, file: !187, line: 94, baseType: !87, size: 32, offset: 10016)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !852, file: !187, line: 97, baseType: !191, size: 16, offset: 10048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !852, file: !187, line: 97, baseType: !191, size: 16, offset: 10064)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !852, file: !187, line: 98, baseType: !191, size: 16, offset: 10080)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !852, file: !187, line: 98, baseType: !191, size: 16, offset: 10096)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !852, file: !187, line: 99, baseType: !191, size: 16, offset: 10112)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !852, file: !187, line: 99, baseType: !191, size: 16, offset: 10128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !852, file: !187, line: 100, baseType: !7, size: 32, offset: 10144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !852, file: !187, line: 101, baseType: !758, size: 64, offset: 10176)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !852, file: !187, line: 103, baseType: !225, size: 64, offset: 10240)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !852, file: !187, line: 104, baseType: !888, size: 64, offset: 10304)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !200, line: 159, size: 448, elements: !890)
!890 = !{!891, !894, !895, !897, !898, !900}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !889, file: !200, line: 161, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !893)
!893 = !{!849}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !889, file: !200, line: 162, baseType: !892, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !889, file: !200, line: 163, baseType: !896, size: 32, offset: 128)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 32, elements: !893)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !889, file: !200, line: 164, baseType: !896, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !889, file: !200, line: 165, baseType: !899, size: 128, offset: 192)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 128, elements: !893)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !889, file: !200, line: 166, baseType: !901, size: 128, offset: 320)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 128, elements: !893)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !852, file: !187, line: 107, baseType: !292, size: 32, offset: 10368)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !852, file: !187, line: 108, baseType: !87, size: 32, offset: 10400)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !852, file: !187, line: 109, baseType: !191, size: 16, offset: 10432)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !852, file: !187, line: 110, baseType: !191, size: 16, offset: 10448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !852, file: !187, line: 113, baseType: !87, size: 32, offset: 10464)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !852, file: !187, line: 113, baseType: !87, size: 32, offset: 10496)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !852, file: !187, line: 114, baseType: !181, size: 8, offset: 10528)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !852, file: !187, line: 114, baseType: !181, size: 8, offset: 10536)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !852, file: !187, line: 115, baseType: !191, size: 16, offset: 10544)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !852, file: !187, line: 116, baseType: !399, size: 128, offset: 10560)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !852, file: !187, line: 119, baseType: !292, size: 32, offset: 10688)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !852, file: !187, line: 119, baseType: !292, size: 32, offset: 10720)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !852, file: !187, line: 122, baseType: !915, size: 512, offset: 10752)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !916, line: 182, baseType: !917)
!916 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !916, line: 180, size: 512, elements: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !917, file: !916, line: 181, baseType: !180, size: 512)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !852, file: !187, line: 123, baseType: !181, size: 8, offset: 11264)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !852, file: !187, line: 125, baseType: !922, size: 56, offset: 11272)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 56, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 7)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !852, file: !187, line: 126, baseType: !926, size: 4096, offset: 11328)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 4096, elements: !870)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !187, line: 69, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !187, line: 67, size: 512, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !928, file: !187, line: 68, baseType: !180, size: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !844, file: !591, line: 163, baseType: !181, size: 8, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !844, file: !591, line: 163, baseType: !181, size: 8, offset: 328)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !844, file: !591, line: 164, baseType: !191, size: 16, offset: 336)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !844, file: !591, line: 164, baseType: !191, size: 16, offset: 352)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !844, file: !591, line: 164, baseType: !191, size: 16, offset: 368)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !60, line: 147, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!87, !204, !87, !87}
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !60, line: 157, baseType: !80)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !496, file: !60, line: 400, baseType: !943, size: 64, offset: 12992)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !569, !830}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !496, file: !60, line: 415, baseType: !947, size: 64, offset: 13056)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !569, !950, !830, !937, !204, !941}
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !60, line: 149, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!842, !204, !87}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !496, file: !60, line: 425, baseType: !955, size: 64, offset: 13120)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !569, !950, !937, !204, !941}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !496, file: !60, line: 435, baseType: !959, size: 64, offset: 13184)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !569, !830, !950, !204}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !496, file: !60, line: 444, baseType: !963, size: 64, offset: 13248)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !569, !950, !204}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !496, file: !60, line: 455, baseType: !967, size: 64, offset: 13312)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !569, !950, !970, !204}
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !60, line: 148, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !204, !87, !292}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !496, file: !60, line: 464, baseType: !975, size: 64, offset: 13376)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{null, !569, !978, !981, !204}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !204, !87, !204}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!823, !204, !87}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !496, file: !60, line: 470, baseType: !566, size: 64, offset: 13440)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !196, file: !125, line: 277, baseType: !495, size: 64, offset: 10368)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !196, file: !125, line: 278, baseType: !987, size: 64, offset: 10432)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !988, line: 27, baseType: !989)
!988 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !990, line: 45, baseType: !991)
!990 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!991 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !196, file: !125, line: 279, baseType: !987, size: 64, offset: 10496)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !196, file: !125, line: 280, baseType: !7, size: 32, offset: 10560)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !196, file: !125, line: 281, baseType: !7, size: 32, offset: 10592)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !196, file: !125, line: 283, baseType: !254, size: 128, offset: 10624)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !196, file: !125, line: 284, baseType: !254, size: 128, offset: 10752)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !196, file: !125, line: 285, baseType: !998, size: 64, offset: 10880)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !196, file: !125, line: 287, baseType: !1000, size: 64, offset: 10944)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !125, line: 59, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !196, file: !125, line: 288, baseType: !1003, size: 64, offset: 11008)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !125, line: 288, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !196, file: !125, line: 290, baseType: !1006, size: 64, offset: 11072)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 64, elements: !893)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !196, file: !125, line: 291, baseType: !1008, size: 64, offset: 11136)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !187, line: 65, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !187, line: 50, size: 320, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1010, file: !187, line: 51, baseType: !185, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1010, file: !187, line: 53, baseType: !87, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1010, file: !187, line: 54, baseType: !87, size: 32, offset: 96)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1010, file: !187, line: 55, baseType: !87, size: 32, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1010, file: !187, line: 55, baseType: !87, size: 32, offset: 160)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1010, file: !187, line: 56, baseType: !181, size: 8, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1010, file: !187, line: 56, baseType: !181, size: 8, offset: 200)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1010, file: !187, line: 57, baseType: !181, size: 8, offset: 208)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1010, file: !187, line: 57, baseType: !181, size: 8, offset: 216)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1010, file: !187, line: 59, baseType: !191, size: 16, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1010, file: !187, line: 59, baseType: !191, size: 16, offset: 240)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1010, file: !187, line: 59, baseType: !191, size: 16, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1010, file: !187, line: 61, baseType: !191, size: 16, offset: 272)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1010, file: !187, line: 63, baseType: !87, size: 32, offset: 288)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !196, file: !125, line: 293, baseType: !254, size: 128, offset: 11200)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !196, file: !125, line: 294, baseType: !1028, size: 64, offset: 11328)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !125, line: 113, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !125, line: 108, size: 256, elements: !1031)
!1031 = !{!1032, !1034, !1035, !1036, !1037}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1030, file: !125, line: 109, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1030, file: !125, line: 109, baseType: !1033, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1030, file: !125, line: 110, baseType: !195, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1030, file: !125, line: 111, baseType: !87, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1030, file: !125, line: 112, baseType: !292, size: 32, offset: 224)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "prevCos", scope: !166, file: !6, line: 533, baseType: !792, size: 64, offset: 1024)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !166, file: !6, line: 534, baseType: !180, size: 512, offset: 1088)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveModifierData", file: !6, line: 154, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveModifierData", file: !6, line: 147, size: 1536, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !1042, file: !6, line: 148, baseType: !169, size: 896)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1042, file: !6, line: 150, baseType: !195, size: 64, offset: 896)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1042, file: !6, line: 151, baseType: !180, size: 512, offset: 960)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "defaxis", scope: !1042, file: !6, line: 152, baseType: !191, size: 16, offset: 1472)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1042, file: !6, line: 153, baseType: !1049, size: 48, offset: 1488)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 48, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 6)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "LatticeModifierData", file: !6, line: 145, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LatticeModifierData", file: !6, line: 138, size: 1536, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !1054, file: !6, line: 139, baseType: !169, size: 896)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1054, file: !6, line: 141, baseType: !195, size: 64, offset: 896)
