; ModuleID = 'blender/source/blender/blenloader/intern/readblenentry.c'
source_filename = "blender/source/blender/blenloader/intern/readblenentry.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BlendHandle = type opaque
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.ListBase = type { i8*, i8* }
%struct.wmTimer = type opaque
%struct.FileData = type { %struct.ListBase, i32, i32, i32, i32, i32 (%struct.FileData*, i8*, i32)*, i8*, %struct.MemFile*, i32, %struct.gzFile_s*, [1024 x i8], i8, i32, %struct.z_stream_s, %struct.SDNA*, %struct.SDNA*, i8*, i32, i32, i32, i32, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.BHeadSort*, i32, %struct.ListBase*, %struct.BlendFileData**, %struct.ReportList* }
%struct.MemFile = type { %struct.ListBase, i32 }
%struct.gzFile_s = type { i32, i8*, i64 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type { i32 }
%struct.SDNA = type { i8*, i32, i32, i8**, i32, i32, i8**, i16*, i32, i16**, %struct.GHash*, i32 }
%struct.GHash = type opaque
%struct.OldNewMap = type opaque
%struct.BHeadSort = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenloader/intern/readblenentry.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlenFileType", file: !4, line: 54, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenloader/BLO_readfile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "BLENFILETYPE_BLEND", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "BLENFILETYPE_PUB", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "BLENFILETYPE_RUNTIME", value: 3, isUnsigned: true)
!10 = !{!11, !14, !28, !60, !85, !121, !309, !25}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlendHandle", file: !4, line: 52, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlendHandle", file: !4, line: 52, flags: DIFlagFwdDecl)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileData", file: !16, line: 103, baseType: !17)
!16 = !DIFile(filename: "blender/source/blender/blenloader/intern/readfile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !16, line: 49, size: 10752, elements: !18)
!18 = !{!19, !27, !29, !30, !31, !32, !37, !41, !48, !49, !61, !65, !66, !67, !106, !131, !132, !133, !134, !135, !136, !137, !140, !141, !142, !143, !144, !145, !148, !149, !151, !296}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "listbase", scope: !17, file: !16, line: 51, baseType: !20, size: 128)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !21, line: 71, baseType: !22)
!21 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !21, line: 69, size: 128, elements: !23)
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !22, file: !21, line: 70, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !22, file: !21, line: 70, baseType: !25, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !16, line: 52, baseType: !28, size: 32, offset: 128)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !17, file: !16, line: 53, baseType: !28, size: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "buffersize", scope: !17, file: !16, line: 54, baseType: !28, size: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !17, file: !16, line: 55, baseType: !28, size: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !17, file: !16, line: 56, baseType: !33, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!28, !36, !25, !5}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !17, file: !16, line: 59, baseType: !38, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "memfile", scope: !17, file: !16, line: 61, baseType: !42, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemFile", file: !44, line: 44, size: 192, elements: !45)
!44 = !DIFile(filename: "blender/source/blender/blenloader/BLO_undofile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !43, file: !44, line: 45, baseType: !20, size: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !43, file: !44, line: 46, baseType: !5, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !17, file: !16, line: 64, baseType: !28, size: 32, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "gzfiledes", scope: !17, file: !16, line: 65, baseType: !50, size: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !51, line: 1204, baseType: !52)
!51 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !51, line: 1648, size: 192, elements: !54)
!54 = !{!55, !56, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !53, file: !51, line: 1649, baseType: !5, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !51, line: 1650, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !53, file: !51, line: 1651, baseType: !60, size: 64, offset: 128)
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "relabase", scope: !17, file: !16, line: 68, baseType: !62, size: 8192, offset: 576)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1024)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "headerdone", scope: !17, file: !16, line: 71, baseType: !40, size: 8, offset: 8768)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "inbuffer", scope: !17, file: !16, line: 72, baseType: !28, size: 32, offset: 8800)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !17, file: !16, line: 75, baseType: !68, size: 896, offset: 8832)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !51, line: 104, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !51, line: 85, size: 896, elements: !70)
!70 = !{!71, !76, !78, !81, !82, !83, !84, !86, !91, !97, !102, !103, !104, !105}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !69, file: !51, line: 86, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !74, line: 374, baseType: !75)
!74 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !74, line: 365, baseType: !58)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !69, file: !51, line: 87, baseType: !77, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !74, line: 367, baseType: !5)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !69, file: !51, line: 88, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !74, line: 368, baseType: !80)
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !69, file: !51, line: 90, baseType: !72, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !69, file: !51, line: 91, baseType: !77, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !69, file: !51, line: 92, baseType: !79, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !69, file: !51, line: 94, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !69, file: !51, line: 95, baseType: !87, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !51, line: 1714, size: 32, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !88, file: !51, line: 1714, baseType: !28, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !69, file: !51, line: 97, baseType: !92, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !51, line: 80, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !96, !77, !77}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !74, line: 383, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !69, file: !51, line: 98, baseType: !98, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !51, line: 81, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !96, !96}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !69, file: !51, line: 99, baseType: !96, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !69, file: !51, line: 101, baseType: !28, size: 32, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !69, file: !51, line: 102, baseType: !79, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !69, file: !51, line: 103, baseType: !79, size: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "filesdna", scope: !17, file: !16, line: 78, baseType: !107, size: 64, offset: 9728)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDNA", file: !109, line: 37, size: 640, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sdna_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !113, !114, !116, !117, !118, !120, !123, !124, !126, !130}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !109, line: 38, baseType: !85, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !108, file: !109, line: 39, baseType: !28, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nr_names", scope: !108, file: !109, line: 41, baseType: !28, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !108, file: !109, line: 42, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pointerlen", scope: !108, file: !109, line: 44, baseType: !28, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nr_types", scope: !108, file: !109, line: 46, baseType: !28, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !108, file: !109, line: 47, baseType: !119, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "typelens", scope: !108, file: !109, line: 48, baseType: !121, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nr_structs", scope: !108, file: !109, line: 50, baseType: !28, size: 32, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "structs", scope: !108, file: !109, line: 51, baseType: !125, size: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "structs_map", scope: !108, file: !109, line: 57, baseType: !127, size: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !129, line: 48, flags: DIFlagFwdDecl)
!129 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lastfind", scope: !108, file: !109, line: 63, baseType: !28, size: 32, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "memsdna", scope: !17, file: !16, line: 79, baseType: !107, size: 64, offset: 9792)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !17, file: !16, line: 80, baseType: !85, size: 64, offset: 9856)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "fileversion", scope: !17, file: !16, line: 82, baseType: !28, size: 32, offset: 9920)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id_name_offs", scope: !17, file: !16, line: 83, baseType: !28, size: 32, offset: 9952)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !17, file: !16, line: 84, baseType: !28, size: 32, offset: 9984)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !17, file: !16, line: 84, baseType: !28, size: 32, offset: 10016)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "datamap", scope: !17, file: !16, line: 86, baseType: !138, size: 64, offset: 10048)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "OldNewMap", file: !16, line: 39, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "globmap", scope: !17, file: !16, line: 87, baseType: !138, size: 64, offset: 10112)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "libmap", scope: !17, file: !16, line: 88, baseType: !138, size: 64, offset: 10176)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "imamap", scope: !17, file: !16, line: 89, baseType: !138, size: 64, offset: 10240)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "movieclipmap", scope: !17, file: !16, line: 90, baseType: !138, size: 64, offset: 10304)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "packedmap", scope: !17, file: !16, line: 91, baseType: !138, size: 64, offset: 10368)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bheadmap", scope: !17, file: !16, line: 93, baseType: !146, size: 64, offset: 10432)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "BHeadSort", file: !16, line: 93, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tot_bheadmap", scope: !17, file: !16, line: 94, baseType: !28, size: 32, offset: 10496)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mainlist", scope: !17, file: !16, line: 96, baseType: !150, size: 64, offset: 10560)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bfd_r", scope: !17, file: !16, line: 101, baseType: !152, size: 64, offset: 10624)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlendFileData", file: !4, line: 74, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlendFileData", file: !4, line: 60, size: 8640, elements: !156)
!156 = !{!157, !280, !283, !284, !285, !286, !287, !288, !291, !294}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !155, file: !4, line: 61, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !160, line: 53, size: 15232, elements: !161)
!160 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !174, !178, !179, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !274, !277}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !160, line: 54, baseType: !158, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !159, file: !160, line: 54, baseType: !158, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !160, line: 55, baseType: !62, size: 8192, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !159, file: !160, line: 56, baseType: !122, size: 16, offset: 8320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !159, file: !160, line: 56, baseType: !122, size: 16, offset: 8336)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !159, file: !160, line: 57, baseType: !122, size: 16, offset: 8352)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !159, file: !160, line: 57, baseType: !122, size: 16, offset: 8368)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !159, file: !160, line: 58, baseType: !170, size: 64, offset: 8384)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !171, line: 27, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !173, line: 45, baseType: !80)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !159, file: !160, line: 59, baseType: !175, size: 128, offset: 8448)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !159, file: !160, line: 60, baseType: !122, size: 16, offset: 8576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !159, file: !160, line: 62, baseType: !180, size: 64, offset: 8640)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !182, line: 136, size: 17600, elements: !183)
!182 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !{!184, !227, !229, !230, !231, !232, !233}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !181, file: !182, line: 137, baseType: !185, size: 960)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !182, line: 130, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !182, line: 117, size: 960, elements: !187)
!187 = !{!188, !189, !190, !192, !193, !197, !198, !199, !200, !201}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !182, line: 118, baseType: !25, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !182, line: 118, baseType: !25, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !186, file: !182, line: 119, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !186, file: !182, line: 120, baseType: !180, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !182, line: 121, baseType: !194, size: 528, offset: 256)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 528, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 66)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !182, line: 126, baseType: !122, size: 16, offset: 784)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !186, file: !182, line: 127, baseType: !28, size: 32, offset: 800)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !186, file: !182, line: 128, baseType: !28, size: 32, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !186, file: !182, line: 128, baseType: !28, size: 32, offset: 864)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !186, file: !182, line: 129, baseType: !202, size: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !182, line: 75, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !182, line: 62, size: 1024, elements: !205)
!205 = !{!206, !208, !209, !210, !211, !212, !216, !217, !225, !226}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !182, line: 63, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !204, file: !182, line: 63, baseType: !207, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !182, line: 64, baseType: !40, size: 8, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !204, file: !182, line: 64, baseType: !40, size: 8, offset: 136)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !182, line: 65, baseType: !122, size: 16, offset: 144)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !182, line: 66, baseType: !213, size: 512, offset: 160)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 512, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !204, file: !182, line: 67, baseType: !28, size: 32, offset: 672)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !182, line: 69, baseType: !218, size: 256, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !182, line: 60, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !182, line: 48, size: 256, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !219, file: !182, line: 49, baseType: !25, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !219, file: !182, line: 58, baseType: !20, size: 128, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !219, file: !182, line: 59, baseType: !28, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !219, file: !182, line: 59, baseType: !28, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !204, file: !182, line: 70, baseType: !28, size: 32, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !204, file: !182, line: 74, baseType: !28, size: 32, offset: 992)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !181, file: !182, line: 138, baseType: !228, size: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !181, file: !182, line: 139, baseType: !36, size: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !182, line: 140, baseType: !62, size: 8192, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !181, file: !182, line: 141, baseType: !62, size: 8192, offset: 9280)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !181, file: !182, line: 148, baseType: !180, size: 64, offset: 17472)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !181, file: !182, line: 150, baseType: !234, size: 64, offset: 17536)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !182, line: 45, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !159, file: !160, line: 63, baseType: !20, size: 128, offset: 8704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !159, file: !160, line: 64, baseType: !20, size: 128, offset: 8832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !159, file: !160, line: 65, baseType: !20, size: 128, offset: 8960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !159, file: !160, line: 66, baseType: !20, size: 128, offset: 9088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !159, file: !160, line: 67, baseType: !20, size: 128, offset: 9216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !159, file: !160, line: 68, baseType: !20, size: 128, offset: 9344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !159, file: !160, line: 69, baseType: !20, size: 128, offset: 9472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !159, file: !160, line: 70, baseType: !20, size: 128, offset: 9600)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !159, file: !160, line: 71, baseType: !20, size: 128, offset: 9728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !159, file: !160, line: 72, baseType: !20, size: 128, offset: 9856)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !159, file: !160, line: 73, baseType: !20, size: 128, offset: 9984)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !159, file: !160, line: 74, baseType: !20, size: 128, offset: 10112)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !159, file: !160, line: 75, baseType: !20, size: 128, offset: 10240)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !159, file: !160, line: 76, baseType: !20, size: 128, offset: 10368)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !159, file: !160, line: 77, baseType: !20, size: 128, offset: 10496)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !159, file: !160, line: 78, baseType: !20, size: 128, offset: 10624)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !159, file: !160, line: 79, baseType: !20, size: 128, offset: 10752)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !159, file: !160, line: 80, baseType: !20, size: 128, offset: 10880)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !159, file: !160, line: 81, baseType: !20, size: 128, offset: 11008)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !159, file: !160, line: 82, baseType: !20, size: 128, offset: 11136)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !159, file: !160, line: 83, baseType: !20, size: 128, offset: 11264)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !159, file: !160, line: 84, baseType: !20, size: 128, offset: 11392)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !159, file: !160, line: 85, baseType: !20, size: 128, offset: 11520)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !159, file: !160, line: 86, baseType: !20, size: 128, offset: 11648)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !159, file: !160, line: 87, baseType: !20, size: 128, offset: 11776)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !159, file: !160, line: 88, baseType: !20, size: 128, offset: 11904)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !159, file: !160, line: 89, baseType: !20, size: 128, offset: 12032)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !159, file: !160, line: 90, baseType: !20, size: 128, offset: 12160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !159, file: !160, line: 91, baseType: !20, size: 128, offset: 12288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !159, file: !160, line: 92, baseType: !20, size: 128, offset: 12416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !159, file: !160, line: 93, baseType: !20, size: 128, offset: 12544)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !159, file: !160, line: 94, baseType: !20, size: 128, offset: 12672)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !159, file: !160, line: 95, baseType: !20, size: 128, offset: 12800)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !159, file: !160, line: 96, baseType: !20, size: 128, offset: 12928)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !159, file: !160, line: 98, baseType: !271, size: 2048, offset: 13056)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !159, file: !160, line: 101, baseType: !275, size: 64, offset: 15104)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !160, line: 49, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !159, file: !160, line: 103, baseType: !278, size: 64, offset: 15168)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !160, line: 51, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !155, file: !4, line: 62, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserDef", file: !4, line: 47, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "winpos", scope: !155, file: !4, line: 64, baseType: !28, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !155, file: !4, line: 65, baseType: !28, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !155, file: !4, line: 66, baseType: !28, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !155, file: !4, line: 67, baseType: !28, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !155, file: !4, line: 68, baseType: !62, size: 8192, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "curscreen", scope: !155, file: !4, line: 70, baseType: !289, size: 64, offset: 8448)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !4, line: 39, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "curscene", scope: !155, file: !4, line: 71, baseType: !292, size: 64, offset: 8512)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !4, line: 45, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !4, line: 73, baseType: !295, size: 32, offset: 8576)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlenFileType", file: !4, line: 58, baseType: !3)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !17, file: !16, line: 102, baseType: !297, size: 64, offset: 10688)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !299, line: 106, size: 320, elements: !300)
!299 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!300 = !{!301, !302, !303, !304, !305, !306}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !298, file: !299, line: 107, baseType: !20, size: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !298, file: !299, line: 108, baseType: !28, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !298, file: !299, line: 109, baseType: !28, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !299, line: 110, baseType: !28, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !298, file: !299, line: 110, baseType: !28, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !298, file: !299, line: 111, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !299, line: 56, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!310 = !{i32 7, !"Dwarf Version", i32 4}
!311 = !{i32 2, !"Debug Info Version", i32 3}
!312 = !{i32 1, !"wchar_size", i32 4}
!313 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!314 = distinct !DISubprogram(name: "BLO_blendhandle_from_file", scope: !1, file: !1, line: 83, type: !315, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !319)
!315 = !DISubroutineType(types: !316)
!316 = !{!11, !38, !317}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !299, line: 112, baseType: !298)
!319 = !{}
!320 = !DILocalVariable(name: "filepath", arg: 1, scope: !314, file: !1, line: 83, type: !38)
!321 = !DILocation(line: 83, column: 52, scope: !314)
!322 = !DILocalVariable(name: "reports", arg: 2, scope: !314, file: !1, line: 83, type: !317)
!323 = !DILocation(line: 83, column: 74, scope: !314)
!324 = !DILocalVariable(name: "bh", scope: !314, file: !1, line: 85, type: !11)
!325 = !DILocation(line: 85, column: 15, scope: !314)
!326 = !DILocation(line: 87, column: 42, scope: !314)
!327 = !DILocation(line: 87, column: 52, scope: !314)
!328 = !DILocation(line: 87, column: 22, scope: !314)
!329 = !DILocation(line: 87, column: 7, scope: !314)
!330 = !DILocation(line: 87, column: 5, scope: !314)
!331 = !DILocation(line: 89, column: 9, scope: !314)
!332 = !DILocation(line: 89, column: 2, scope: !314)
!333 = distinct !DISubprogram(name: "BLO_blendhandle_from_memory", scope: !1, file: !1, line: 92, type: !334, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !319)
!334 = !DISubroutineType(types: !335)
!335 = !{!11, !336, !28}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!338 = !DILocalVariable(name: "mem", arg: 1, scope: !333, file: !1, line: 92, type: !336)
!339 = !DILocation(line: 92, column: 54, scope: !333)
!340 = !DILocalVariable(name: "memsize", arg: 2, scope: !333, file: !1, line: 92, type: !28)
!341 = !DILocation(line: 92, column: 63, scope: !333)
!342 = !DILocalVariable(name: "bh", scope: !333, file: !1, line: 94, type: !11)
!343 = !DILocation(line: 94, column: 15, scope: !333)
!344 = !DILocation(line: 96, column: 44, scope: !333)
!345 = !DILocation(line: 96, column: 49, scope: !333)
!346 = !DILocation(line: 96, column: 22, scope: !333)
!347 = !DILocation(line: 96, column: 7, scope: !333)
!348 = !DILocation(line: 96, column: 5, scope: !333)
!349 = !DILocation(line: 98, column: 9, scope: !333)
!350 = !DILocation(line: 98, column: 2, scope: !333)
!351 = distinct !DISubprogram(name: "BLO_blendhandle_print_sizes", scope: !1, file: !1, line: 101, type: !352, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !319)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !11, !25}
!354 = !DILocalVariable(name: "bh", arg: 1, scope: !351, file: !1, line: 101, type: !11)
!355 = !DILocation(line: 101, column: 47, scope: !351)
!356 = !DILocalVariable(name: "fp", arg: 2, scope: !351, file: !1, line: 101, type: !25)
!357 = !DILocation(line: 101, column: 57, scope: !351)
!358 = !DILocalVariable(name: "fd", scope: !351, file: !1, line: 103, type: !14)
!359 = !DILocation(line: 103, column: 12, scope: !351)
!360 = !DILocation(line: 103, column: 30, scope: !351)
!361 = !DILocation(line: 103, column: 17, scope: !351)
!362 = !DILocalVariable(name: "bhead", scope: !351, file: !1, line: 104, type: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "BHead", file: !109, line: 72, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BHead", file: !109, line: 68, size: 192, elements: !366)
!366 = !{!367, !368, !369, !370, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !365, file: !109, line: 69, baseType: !28, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !365, file: !109, line: 69, baseType: !28, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "old", scope: !365, file: !109, line: 70, baseType: !25, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "SDNAnr", scope: !365, file: !109, line: 71, baseType: !28, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !365, file: !109, line: 71, baseType: !28, size: 32, offset: 160)
!372 = !DILocation(line: 104, column: 9, scope: !351)
!373 = !DILocation(line: 106, column: 10, scope: !351)
!374 = !DILocation(line: 106, column: 2, scope: !351)
!375 = !DILocation(line: 107, column: 30, scope: !376)
!376 = distinct !DILexicalBlock(scope: !351, file: !1, line: 107, column: 2)
!377 = !DILocation(line: 107, column: 15, scope: !376)
!378 = !DILocation(line: 107, column: 13, scope: !376)
!379 = !DILocation(line: 107, column: 7, scope: !376)
!380 = !DILocation(line: 107, column: 35, scope: !381)
!381 = distinct !DILexicalBlock(scope: !376, file: !1, line: 107, column: 2)
!382 = !DILocation(line: 107, column: 2, scope: !376)
!383 = !DILocation(line: 108, column: 7, scope: !384)
!384 = distinct !DILexicalBlock(scope: !385, file: !1, line: 108, column: 7)
!385 = distinct !DILexicalBlock(scope: !381, file: !1, line: 107, column: 76)
!386 = !DILocation(line: 108, column: 14, scope: !384)
!387 = !DILocation(line: 108, column: 19, scope: !384)
!388 = !DILocation(line: 108, column: 7, scope: !385)
!389 = !DILocation(line: 109, column: 4, scope: !384)
!390 = !DILocalVariable(name: "sp", scope: !391, file: !1, line: 111, type: !392)
!391 = distinct !DILexicalBlock(scope: !384, file: !1, line: 110, column: 8)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!394 = !DILocation(line: 111, column: 17, scope: !391)
!395 = !DILocation(line: 111, column: 22, scope: !391)
!396 = !DILocation(line: 111, column: 26, scope: !391)
!397 = !DILocation(line: 111, column: 36, scope: !391)
!398 = !DILocation(line: 111, column: 44, scope: !391)
!399 = !DILocation(line: 111, column: 51, scope: !391)
!400 = !DILocalVariable(name: "name", scope: !391, file: !1, line: 112, type: !38)
!401 = !DILocation(line: 112, column: 16, scope: !391)
!402 = !DILocation(line: 112, column: 23, scope: !391)
!403 = !DILocation(line: 112, column: 27, scope: !391)
!404 = !DILocation(line: 112, column: 37, scope: !391)
!405 = !DILocation(line: 112, column: 43, scope: !391)
!406 = !DILocalVariable(name: "buf", scope: !391, file: !1, line: 113, type: !407)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 4)
!410 = !DILocation(line: 113, column: 9, scope: !391)
!411 = !DILocation(line: 115, column: 14, scope: !391)
!412 = !DILocation(line: 115, column: 21, scope: !391)
!413 = !DILocation(line: 115, column: 26, scope: !391)
!414 = !DILocation(line: 115, column: 33, scope: !391)
!415 = !DILocation(line: 115, column: 13, scope: !391)
!416 = !DILocation(line: 115, column: 4, scope: !391)
!417 = !DILocation(line: 115, column: 11, scope: !391)
!418 = !DILocation(line: 116, column: 14, scope: !391)
!419 = !DILocation(line: 116, column: 21, scope: !391)
!420 = !DILocation(line: 116, column: 26, scope: !391)
!421 = !DILocation(line: 116, column: 33, scope: !391)
!422 = !DILocation(line: 116, column: 13, scope: !391)
!423 = !DILocation(line: 116, column: 4, scope: !391)
!424 = !DILocation(line: 116, column: 11, scope: !391)
!425 = !DILocation(line: 117, column: 14, scope: !391)
!426 = !DILocation(line: 117, column: 21, scope: !391)
!427 = !DILocation(line: 117, column: 26, scope: !391)
!428 = !DILocation(line: 117, column: 32, scope: !391)
!429 = !DILocation(line: 117, column: 13, scope: !391)
!430 = !DILocation(line: 117, column: 4, scope: !391)
!431 = !DILocation(line: 117, column: 11, scope: !391)
!432 = !DILocation(line: 118, column: 14, scope: !391)
!433 = !DILocation(line: 118, column: 21, scope: !391)
!434 = !DILocation(line: 118, column: 26, scope: !391)
!435 = !DILocation(line: 118, column: 32, scope: !391)
!436 = !DILocation(line: 118, column: 13, scope: !391)
!437 = !DILocation(line: 118, column: 4, scope: !391)
!438 = !DILocation(line: 118, column: 11, scope: !391)
!439 = !DILocation(line: 120, column: 13, scope: !391)
!440 = !DILocation(line: 120, column: 22, scope: !391)
!441 = !DILocation(line: 120, column: 4, scope: !391)
!442 = !DILocation(line: 120, column: 11, scope: !391)
!443 = !DILocation(line: 121, column: 13, scope: !391)
!444 = !DILocation(line: 121, column: 22, scope: !391)
!445 = !DILocation(line: 121, column: 4, scope: !391)
!446 = !DILocation(line: 121, column: 11, scope: !391)
!447 = !DILocation(line: 122, column: 13, scope: !391)
!448 = !DILocation(line: 122, column: 22, scope: !391)
!449 = !DILocation(line: 122, column: 4, scope: !391)
!450 = !DILocation(line: 122, column: 11, scope: !391)
!451 = !DILocation(line: 123, column: 13, scope: !391)
!452 = !DILocation(line: 123, column: 22, scope: !391)
!453 = !DILocation(line: 123, column: 4, scope: !391)
!454 = !DILocation(line: 123, column: 11, scope: !391)
!455 = !DILocation(line: 125, column: 12, scope: !391)
!456 = !DILocation(line: 125, column: 47, scope: !391)
!457 = !DILocation(line: 125, column: 52, scope: !391)
!458 = !DILocation(line: 125, column: 58, scope: !391)
!459 = !DILocation(line: 125, column: 65, scope: !391)
!460 = !DILocation(line: 125, column: 80, scope: !391)
!461 = !DILocation(line: 125, column: 87, scope: !391)
!462 = !DILocation(line: 125, column: 91, scope: !391)
!463 = !DILocation(line: 125, column: 4, scope: !391)
!464 = !DILocation(line: 127, column: 2, scope: !385)
!465 = !DILocation(line: 107, column: 64, scope: !381)
!466 = !DILocation(line: 107, column: 68, scope: !381)
!467 = !DILocation(line: 107, column: 50, scope: !381)
!468 = !DILocation(line: 107, column: 48, scope: !381)
!469 = !DILocation(line: 107, column: 2, scope: !381)
!470 = distinct !{!470, !382, !471}
!471 = !DILocation(line: 127, column: 2, scope: !376)
!472 = !DILocation(line: 128, column: 10, scope: !351)
!473 = !DILocation(line: 128, column: 2, scope: !351)
!474 = !DILocation(line: 129, column: 1, scope: !351)
!475 = distinct !DISubprogram(name: "BLO_blendhandle_get_datablock_names", scope: !1, file: !1, line: 131, type: !476, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !319)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !11, !28, !484}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !480, line: 45, size: 128, elements: !481)
!480 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !480, line: 46, baseType: !478, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !479, file: !480, line: 47, baseType: !25, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!485 = !DILocalVariable(name: "bh", arg: 1, scope: !475, file: !1, line: 131, type: !11)
!486 = !DILocation(line: 131, column: 60, scope: !475)
!487 = !DILocalVariable(name: "ofblocktype", arg: 2, scope: !475, file: !1, line: 131, type: !28)
!488 = !DILocation(line: 131, column: 68, scope: !475)
!489 = !DILocalVariable(name: "tot_names", arg: 3, scope: !475, file: !1, line: 131, type: !484)
!490 = !DILocation(line: 131, column: 86, scope: !475)
!491 = !DILocalVariable(name: "fd", scope: !475, file: !1, line: 133, type: !14)
!492 = !DILocation(line: 133, column: 12, scope: !475)
!493 = !DILocation(line: 133, column: 30, scope: !475)
!494 = !DILocation(line: 133, column: 17, scope: !475)
!495 = !DILocalVariable(name: "names", scope: !475, file: !1, line: 134, type: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !480, line: 48, baseType: !479)
!498 = !DILocation(line: 134, column: 12, scope: !475)
!499 = !DILocalVariable(name: "bhead", scope: !475, file: !1, line: 135, type: !363)
!500 = !DILocation(line: 135, column: 9, scope: !475)
!501 = !DILocalVariable(name: "tot", scope: !475, file: !1, line: 136, type: !28)
!502 = !DILocation(line: 136, column: 6, scope: !475)
!503 = !DILocation(line: 138, column: 30, scope: !504)
!504 = distinct !DILexicalBlock(scope: !475, file: !1, line: 138, column: 2)
!505 = !DILocation(line: 138, column: 15, scope: !504)
!506 = !DILocation(line: 138, column: 13, scope: !504)
!507 = !DILocation(line: 138, column: 7, scope: !504)
!508 = !DILocation(line: 138, column: 35, scope: !509)
!509 = distinct !DILexicalBlock(scope: !504, file: !1, line: 138, column: 2)
!510 = !DILocation(line: 138, column: 2, scope: !504)
!511 = !DILocation(line: 139, column: 7, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 139, column: 7)
!513 = distinct !DILexicalBlock(scope: !509, file: !1, line: 138, column: 76)
!514 = !DILocation(line: 139, column: 14, scope: !512)
!515 = !DILocation(line: 139, column: 22, scope: !512)
!516 = !DILocation(line: 139, column: 19, scope: !512)
!517 = !DILocation(line: 139, column: 7, scope: !513)
!518 = !DILocalVariable(name: "idname", scope: !519, file: !1, line: 140, type: !38)
!519 = distinct !DILexicalBlock(scope: !512, file: !1, line: 139, column: 35)
!520 = !DILocation(line: 140, column: 16, scope: !519)
!521 = !DILocation(line: 140, column: 39, scope: !519)
!522 = !DILocation(line: 140, column: 43, scope: !519)
!523 = !DILocation(line: 140, column: 25, scope: !519)
!524 = !DILocation(line: 142, column: 40, scope: !519)
!525 = !DILocation(line: 142, column: 47, scope: !519)
!526 = !DILocation(line: 142, column: 33, scope: !519)
!527 = !DILocation(line: 142, column: 4, scope: !519)
!528 = !DILocation(line: 143, column: 7, scope: !519)
!529 = !DILocation(line: 144, column: 3, scope: !519)
!530 = !DILocation(line: 145, column: 12, scope: !531)
!531 = distinct !DILexicalBlock(scope: !512, file: !1, line: 145, column: 12)
!532 = !DILocation(line: 145, column: 19, scope: !531)
!533 = !DILocation(line: 145, column: 24, scope: !531)
!534 = !DILocation(line: 145, column: 12, scope: !512)
!535 = !DILocation(line: 146, column: 4, scope: !531)
!536 = !DILocation(line: 147, column: 2, scope: !513)
!537 = !DILocation(line: 138, column: 64, scope: !509)
!538 = !DILocation(line: 138, column: 68, scope: !509)
!539 = !DILocation(line: 138, column: 50, scope: !509)
!540 = !DILocation(line: 138, column: 48, scope: !509)
!541 = !DILocation(line: 138, column: 2, scope: !509)
!542 = distinct !{!542, !510, !543}
!543 = !DILocation(line: 147, column: 2, scope: !504)
!544 = !DILocation(line: 149, column: 15, scope: !475)
!545 = !DILocation(line: 149, column: 3, scope: !475)
!546 = !DILocation(line: 149, column: 13, scope: !475)
!547 = !DILocation(line: 150, column: 9, scope: !475)
!548 = !DILocation(line: 150, column: 2, scope: !475)
!549 = distinct !DISubprogram(name: "BLO_blendhandle_get_previews", scope: !1, file: !1, line: 153, type: !476, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !319)
!550 = !DILocalVariable(name: "bh", arg: 1, scope: !549, file: !1, line: 153, type: !11)
!551 = !DILocation(line: 153, column: 53, scope: !549)
!552 = !DILocalVariable(name: "ofblocktype", arg: 2, scope: !549, file: !1, line: 153, type: !28)
!553 = !DILocation(line: 153, column: 61, scope: !549)
!554 = !DILocalVariable(name: "tot_prev", arg: 3, scope: !549, file: !1, line: 153, type: !484)
!555 = !DILocation(line: 153, column: 79, scope: !549)
!556 = !DILocalVariable(name: "fd", scope: !549, file: !1, line: 155, type: !14)
!557 = !DILocation(line: 155, column: 12, scope: !549)
!558 = !DILocation(line: 155, column: 30, scope: !549)
!559 = !DILocation(line: 155, column: 17, scope: !549)
!560 = !DILocalVariable(name: "previews", scope: !549, file: !1, line: 156, type: !496)
!561 = !DILocation(line: 156, column: 12, scope: !549)
!562 = !DILocalVariable(name: "bhead", scope: !549, file: !1, line: 157, type: !363)
!563 = !DILocation(line: 157, column: 9, scope: !549)
!564 = !DILocalVariable(name: "looking", scope: !549, file: !1, line: 158, type: !28)
!565 = !DILocation(line: 158, column: 6, scope: !549)
!566 = !DILocalVariable(name: "prv", scope: !549, file: !1, line: 159, type: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewImage", file: !182, line: 167, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !182, line: 159, size: 448, elements: !570)
!570 = !{!571, !575, !576, !578, !579, !581}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !569, file: !182, line: 161, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 2)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !569, file: !182, line: 162, baseType: !572, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !569, file: !182, line: 163, baseType: !577, size: 32, offset: 128)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 32, elements: !573)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !569, file: !182, line: 164, baseType: !577, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !569, file: !182, line: 165, baseType: !580, size: 128, offset: 192)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 128, elements: !573)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !569, file: !182, line: 166, baseType: !582, size: 128, offset: 320)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 128, elements: !573)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !182, line: 46, flags: DIFlagFwdDecl)
!585 = !DILocation(line: 159, column: 16, scope: !549)
!586 = !DILocalVariable(name: "new_prv", scope: !549, file: !1, line: 160, type: !567)
!587 = !DILocation(line: 160, column: 16, scope: !549)
!588 = !DILocalVariable(name: "tot", scope: !549, file: !1, line: 161, type: !28)
!589 = !DILocation(line: 161, column: 6, scope: !549)
!590 = !DILocation(line: 163, column: 30, scope: !591)
!591 = distinct !DILexicalBlock(scope: !549, file: !1, line: 163, column: 2)
!592 = !DILocation(line: 163, column: 15, scope: !591)
!593 = !DILocation(line: 163, column: 13, scope: !591)
!594 = !DILocation(line: 163, column: 7, scope: !591)
!595 = !DILocation(line: 163, column: 35, scope: !596)
!596 = distinct !DILexicalBlock(scope: !591, file: !1, line: 163, column: 2)
!597 = !DILocation(line: 163, column: 2, scope: !591)
!598 = !DILocation(line: 164, column: 7, scope: !599)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 164, column: 7)
!600 = distinct !DILexicalBlock(scope: !596, file: !1, line: 163, column: 76)
!601 = !DILocation(line: 164, column: 14, scope: !599)
!602 = !DILocation(line: 164, column: 22, scope: !599)
!603 = !DILocation(line: 164, column: 19, scope: !599)
!604 = !DILocation(line: 164, column: 7, scope: !600)
!605 = !DILocalVariable(name: "idname", scope: !606, file: !1, line: 165, type: !38)
!606 = distinct !DILexicalBlock(scope: !599, file: !1, line: 164, column: 35)
!607 = !DILocation(line: 165, column: 16, scope: !606)
!608 = !DILocation(line: 165, column: 39, scope: !606)
!609 = !DILocation(line: 165, column: 43, scope: !606)
!610 = !DILocation(line: 165, column: 25, scope: !606)
!611 = !DILocation(line: 166, column: 12, scope: !606)
!612 = !DILocation(line: 166, column: 4, scope: !606)
!613 = !DILocation(line: 172, column: 16, scope: !614)
!614 = distinct !DILexicalBlock(scope: !606, file: !1, line: 166, column: 24)
!615 = !DILocation(line: 172, column: 14, scope: !614)
!616 = !DILocation(line: 173, column: 38, scope: !614)
!617 = !DILocation(line: 173, column: 6, scope: !614)
!618 = !DILocation(line: 174, column: 9, scope: !614)
!619 = !DILocation(line: 175, column: 14, scope: !614)
!620 = !DILocation(line: 176, column: 6, scope: !614)
!621 = !DILocation(line: 178, column: 6, scope: !614)
!622 = !DILocation(line: 180, column: 3, scope: !606)
!623 = !DILocation(line: 181, column: 12, scope: !624)
!624 = distinct !DILexicalBlock(scope: !599, file: !1, line: 181, column: 12)
!625 = !DILocation(line: 181, column: 19, scope: !624)
!626 = !DILocation(line: 181, column: 24, scope: !624)
!627 = !DILocation(line: 181, column: 12, scope: !599)
!628 = !DILocation(line: 182, column: 8, scope: !629)
!629 = distinct !DILexicalBlock(scope: !630, file: !1, line: 182, column: 8)
!630 = distinct !DILexicalBlock(scope: !624, file: !1, line: 181, column: 33)
!631 = !DILocation(line: 182, column: 8, scope: !630)
!632 = !DILocation(line: 183, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !1, line: 183, column: 9)
!634 = distinct !DILexicalBlock(scope: !629, file: !1, line: 182, column: 17)
!635 = !DILocation(line: 183, column: 16, scope: !633)
!636 = !DILocation(line: 183, column: 45, scope: !633)
!637 = !DILocation(line: 183, column: 49, scope: !633)
!638 = !DILocation(line: 183, column: 26, scope: !633)
!639 = !DILocation(line: 183, column: 23, scope: !633)
!640 = !DILocation(line: 183, column: 9, scope: !634)
!641 = !DILocation(line: 184, column: 36, scope: !642)
!642 = distinct !DILexicalBlock(scope: !633, file: !1, line: 183, column: 77)
!643 = !DILocation(line: 184, column: 40, scope: !642)
