; ModuleID = 'blender/source/blender/modifiers/intern/MOD_build.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_build.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!6 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_modifier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "eModifierTypeType_None", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "eModifierTypeType_OnlyDeform", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "eModifierTypeType_Constructive", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "eModifierTypeType_Nonconstructive", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "eModifierTypeType_DeformOrConstruct", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "eModifierTypeType_NonGeometrical", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 73, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!17 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!22 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!23 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!24 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!25 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!26 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !28, line: 128, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !28, line: 164, baseType: !7, size: 32, elements: !34)
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !28, line: 159, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !28, line: 134, baseType: !7, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !28, line: 152, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 177, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64}
!63 = !DIEnumerator(name: "MOD_BUILD_FLAG_RANDOMIZE", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "MOD_BUILD_FLAG_REVERSE", value: 2, isUnsigned: true)
!65 = !{!66, !98, !1634, !78, !1637}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "BuildModifierData", file: !61, line: 174, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BuildModifierData", file: !61, line: 166, size: 1024, elements: !69)
!69 = !{!70, !1629, !1630, !1631, !1632, !1633}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !68, file: !61, line: 167, baseType: !71, size: 896)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !73)
!73 = !{!74, !76, !77, !79, !80, !81, !82, !87, !1628}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !61, line: 100, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !72, file: !61, line: 100, baseType: !75, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !61, line: 102, baseType: !78, size: 32, offset: 128)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !72, file: !61, line: 102, baseType: !78, size: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !72, file: !61, line: 103, baseType: !78, size: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !72, file: !61, line: 103, baseType: !78, size: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !61, line: 104, baseType: !83, size: 512, offset: 256)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !72, file: !61, line: 107, baseType: !88, size: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !90, line: 1216, size: 39680, elements: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = !{!92, !159, !162, !939, !942, !943, !944, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !970, !973, !976, !1200, !1203, !1502, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1524, !1525, !1526, !1527, !1528, !1536, !1602, !1609, !1610, !1617, !1620, !1621, !1622, !1623, !1624, !1625}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !89, file: !90, line: 1217, baseType: !93, size: 960)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !94, line: 130, baseType: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !94, line: 117, size: 960, elements: !96)
!96 = !{!97, !99, !100, !102, !121, !125, !127, !128, !129, !130}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !94, line: 118, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !94, line: 118, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !95, file: !94, line: 119, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !95, file: !94, line: 120, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !94, line: 136, size: 17600, elements: !105)
!105 = !{!106, !107, !109, !112, !116, !117, !118}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !104, file: !94, line: 137, baseType: !93, size: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !104, file: !94, line: 138, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !104, file: !94, line: 139, baseType: !110, size: 64, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !94, line: 43, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !94, line: 140, baseType: !113, size: 8192, offset: 1088)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !104, file: !94, line: 141, baseType: !113, size: 8192, offset: 9280)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !104, file: !94, line: 148, baseType: !103, size: 64, offset: 17472)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !104, file: !94, line: 150, baseType: !119, size: 64, offset: 17536)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !94, line: 45, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !94, line: 121, baseType: !122, size: 528, offset: 256)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 66)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !94, line: 126, baseType: !126, size: 16, offset: 784)
!126 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !95, file: !94, line: 127, baseType: !78, size: 32, offset: 800)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !95, file: !94, line: 128, baseType: !78, size: 32, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !95, file: !94, line: 128, baseType: !78, size: 32, offset: 864)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !95, file: !94, line: 129, baseType: !131, size: 64, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !94, line: 75, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !94, line: 62, size: 1024, elements: !134)
!134 = !{!135, !137, !138, !139, !140, !141, !142, !143, !157, !158}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !94, line: 63, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !94, line: 63, baseType: !136, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !94, line: 64, baseType: !84, size: 8, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !133, file: !94, line: 64, baseType: !84, size: 8, offset: 136)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !133, file: !94, line: 65, baseType: !126, size: 16, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !94, line: 66, baseType: !83, size: 512, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !133, file: !94, line: 67, baseType: !78, size: 32, offset: 672)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !94, line: 69, baseType: !144, size: 256, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !94, line: 60, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !94, line: 48, size: 256, elements: !146)
!146 = !{!147, !148, !155, !156}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !145, file: !94, line: 49, baseType: !98, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !145, file: !94, line: 58, baseType: !149, size: 128, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !150, line: 71, baseType: !151)
!150 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !150, line: 69, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !151, file: !150, line: 70, baseType: !98, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !151, file: !150, line: 70, baseType: !98, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !145, file: !94, line: 59, baseType: !78, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !145, file: !94, line: 59, baseType: !78, size: 32, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !133, file: !94, line: 70, baseType: !78, size: 32, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !133, file: !94, line: 74, baseType: !78, size: 32, offset: 992)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !89, file: !90, line: 1218, baseType: !160, size: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !90, line: 58, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !89, file: !90, line: 1220, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !165, line: 115, size: 11392, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !187, !199, !213, !214, !258, !259, !262, !263, !279, !280, !281, !282, !283, !284, !285, !289, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !305, !306, !307, !308, !309, !310, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !370, !371, !372, !373, !374, !375, !376, !377, !378, !381, !384, !388, !389, !390, !391, !392, !395, !398, !886, !887, !893, !894, !895, !896, !897, !898, !900, !903, !906, !908, !927, !928}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 116, baseType: !93, size: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !164, file: !165, line: 117, baseType: !160, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !164, file: !165, line: 119, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !165, line: 57, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 121, baseType: !126, size: 16, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !164, file: !165, line: 121, baseType: !126, size: 16, offset: 1104)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !164, file: !165, line: 122, baseType: !78, size: 32, offset: 1120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !164, file: !165, line: 122, baseType: !78, size: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !164, file: !165, line: 122, baseType: !78, size: 32, offset: 1184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !164, file: !165, line: 123, baseType: !83, size: 512, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !164, file: !165, line: 128, baseType: !184, size: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !186, line: 243, flags: DIFlagFwdDecl)
!186 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !164, file: !165, line: 130, baseType: !188, size: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !165, line: 97, size: 832, elements: !190)
!190 = !{!191, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !189, file: !165, line: 98, baseType: !192, size: 768)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 768, elements: !194)
!193 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!194 = !{!195, !196}
!195 = !DISubrange(count: 8)
!196 = !DISubrange(count: 3)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !165, line: 99, baseType: !78, size: 32, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !189, file: !165, line: 99, baseType: !78, size: 32, offset: 800)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !164, file: !165, line: 131, baseType: !200, size: 64, offset: 2176)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !202, line: 486, size: 1600, elements: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !202, line: 487, baseType: !93, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !201, file: !202, line: 489, baseType: !149, size: 128, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !201, file: !202, line: 490, baseType: !149, size: 128, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !201, file: !202, line: 491, baseType: !149, size: 128, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !201, file: !202, line: 492, baseType: !149, size: 128, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !202, line: 494, baseType: !78, size: 32, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !201, file: !202, line: 495, baseType: !78, size: 32, offset: 1504)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !201, file: !202, line: 497, baseType: !78, size: 32, offset: 1536)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !201, file: !202, line: 498, baseType: !78, size: 32, offset: 1568)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !164, file: !165, line: 132, baseType: !200, size: 64, offset: 2240)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !164, file: !165, line: 133, baseType: !215, size: 64, offset: 2304)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !202, line: 334, size: 1728, elements: !217)
!217 = !{!218, !219, !223, !224, !225, !226, !227, !228, !231, !232, !233, !234, !235, !236, !237, !257}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !216, file: !202, line: 335, baseType: !149, size: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !216, file: !202, line: 336, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !222, line: 48, flags: DIFlagFwdDecl)
!222 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !216, file: !202, line: 338, baseType: !126, size: 16, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !216, file: !202, line: 338, baseType: !126, size: 16, offset: 208)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !216, file: !202, line: 339, baseType: !7, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !216, file: !202, line: 340, baseType: !78, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !216, file: !202, line: 342, baseType: !193, size: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !216, file: !202, line: 343, baseType: !229, size: 96, offset: 320)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 96, elements: !230)
!230 = !{!196}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !216, file: !202, line: 344, baseType: !229, size: 96, offset: 416)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !216, file: !202, line: 347, baseType: !149, size: 128, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !216, file: !202, line: 349, baseType: !78, size: 32, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !216, file: !202, line: 350, baseType: !78, size: 32, offset: 672)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !216, file: !202, line: 351, baseType: !98, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !216, file: !202, line: 352, baseType: !98, size: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !216, file: !202, line: 354, baseType: !238, size: 384, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !202, line: 116, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !202, line: 94, size: 384, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !239, file: !202, line: 96, baseType: !78, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !239, file: !202, line: 96, baseType: !78, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !239, file: !202, line: 97, baseType: !78, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !239, file: !202, line: 97, baseType: !78, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !239, file: !202, line: 99, baseType: !126, size: 16, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !239, file: !202, line: 100, baseType: !126, size: 16, offset: 144)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !239, file: !202, line: 102, baseType: !126, size: 16, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !239, file: !202, line: 105, baseType: !126, size: 16, offset: 176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !239, file: !202, line: 108, baseType: !126, size: 16, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !239, file: !202, line: 109, baseType: !126, size: 16, offset: 208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !239, file: !202, line: 111, baseType: !126, size: 16, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !239, file: !202, line: 112, baseType: !126, size: 16, offset: 240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !239, file: !202, line: 114, baseType: !78, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !239, file: !202, line: 114, baseType: !78, size: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !239, file: !202, line: 115, baseType: !78, size: 32, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !239, file: !202, line: 115, baseType: !78, size: 32, offset: 352)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !216, file: !202, line: 355, baseType: !83, size: 512, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !165, line: 134, baseType: !98, size: 64, offset: 2368)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !164, file: !165, line: 136, baseType: !260, size: 64, offset: 2432)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !90, line: 61, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !164, file: !165, line: 138, baseType: !238, size: 384, offset: 2496)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !164, file: !165, line: 139, baseType: !264, size: 64, offset: 2880)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !202, line: 80, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !202, line: 72, size: 192, elements: !267)
!267 = !{!268, !275, !276, !277, !278}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !266, file: !202, line: 73, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !202, line: 59, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !202, line: 56, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !271, file: !202, line: 57, baseType: !229, size: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !271, file: !202, line: 58, baseType: !78, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !266, file: !202, line: 74, baseType: !78, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !266, file: !202, line: 76, baseType: !78, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !266, file: !202, line: 77, baseType: !78, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !202, line: 79, baseType: !78, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !164, file: !165, line: 141, baseType: !149, size: 128, offset: 2944)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !164, file: !165, line: 142, baseType: !149, size: 128, offset: 3072)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !164, file: !165, line: 143, baseType: !149, size: 128, offset: 3200)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !164, file: !165, line: 144, baseType: !149, size: 128, offset: 3328)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !164, file: !165, line: 146, baseType: !78, size: 32, offset: 3456)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !164, file: !165, line: 147, baseType: !78, size: 32, offset: 3488)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !164, file: !165, line: 150, baseType: !286, size: 64, offset: 3520)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !90, line: 179, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !164, file: !165, line: 151, baseType: !290, size: 64, offset: 3584)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !164, file: !165, line: 152, baseType: !78, size: 32, offset: 3648)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !164, file: !165, line: 153, baseType: !78, size: 32, offset: 3680)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !164, file: !165, line: 156, baseType: !229, size: 96, offset: 3712)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !164, file: !165, line: 156, baseType: !229, size: 96, offset: 3808)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !164, file: !165, line: 156, baseType: !229, size: 96, offset: 3904)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !164, file: !165, line: 157, baseType: !229, size: 96, offset: 4000)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !164, file: !165, line: 158, baseType: !229, size: 96, offset: 4096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !164, file: !165, line: 159, baseType: !229, size: 96, offset: 4192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !164, file: !165, line: 160, baseType: !229, size: 96, offset: 4288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !164, file: !165, line: 160, baseType: !229, size: 96, offset: 4384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !164, file: !165, line: 161, baseType: !302, size: 128, offset: 4480)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 4)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !164, file: !165, line: 161, baseType: !302, size: 128, offset: 4608)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !164, file: !165, line: 162, baseType: !229, size: 96, offset: 4736)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !164, file: !165, line: 162, baseType: !229, size: 96, offset: 4832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !164, file: !165, line: 163, baseType: !193, size: 32, offset: 4928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !164, file: !165, line: 163, baseType: !193, size: 32, offset: 4960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !164, file: !165, line: 164, baseType: !311, size: 512, offset: 4992)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 512, elements: !312)
!312 = !{!304, !304}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !164, file: !165, line: 165, baseType: !311, size: 512, offset: 5504)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !164, file: !165, line: 166, baseType: !311, size: 512, offset: 6016)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !164, file: !165, line: 167, baseType: !311, size: 512, offset: 6528)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !164, file: !165, line: 176, baseType: !311, size: 512, offset: 7040)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !164, file: !165, line: 178, baseType: !7, size: 32, offset: 7552)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 180, baseType: !126, size: 16, offset: 7584)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !164, file: !165, line: 181, baseType: !126, size: 16, offset: 7600)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !164, file: !165, line: 183, baseType: !126, size: 16, offset: 7616)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !164, file: !165, line: 183, baseType: !126, size: 16, offset: 7632)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !164, file: !165, line: 184, baseType: !126, size: 16, offset: 7648)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !164, file: !165, line: 184, baseType: !126, size: 16, offset: 7664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !164, file: !165, line: 185, baseType: !126, size: 16, offset: 7680)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !164, file: !165, line: 186, baseType: !126, size: 16, offset: 7696)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !164, file: !165, line: 187, baseType: !126, size: 16, offset: 7712)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !164, file: !165, line: 188, baseType: !84, size: 8, offset: 7728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !164, file: !165, line: 189, baseType: !84, size: 8, offset: 7736)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !164, file: !165, line: 192, baseType: !78, size: 32, offset: 7744)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !164, file: !165, line: 192, baseType: !78, size: 32, offset: 7776)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !164, file: !165, line: 192, baseType: !78, size: 32, offset: 7808)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !164, file: !165, line: 192, baseType: !78, size: 32, offset: 7840)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !165, line: 194, baseType: !78, size: 32, offset: 7872)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !164, file: !165, line: 202, baseType: !193, size: 32, offset: 7904)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !164, file: !165, line: 202, baseType: !193, size: 32, offset: 7936)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !164, file: !165, line: 202, baseType: !193, size: 32, offset: 7968)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !164, file: !165, line: 211, baseType: !193, size: 32, offset: 8000)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !164, file: !165, line: 212, baseType: !193, size: 32, offset: 8032)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !164, file: !165, line: 213, baseType: !193, size: 32, offset: 8064)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !164, file: !165, line: 214, baseType: !193, size: 32, offset: 8096)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !164, file: !165, line: 215, baseType: !193, size: 32, offset: 8128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !164, file: !165, line: 216, baseType: !193, size: 32, offset: 8160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !164, file: !165, line: 219, baseType: !193, size: 32, offset: 8192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !164, file: !165, line: 220, baseType: !193, size: 32, offset: 8224)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !164, file: !165, line: 221, baseType: !193, size: 32, offset: 8256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !164, file: !165, line: 224, baseType: !347, size: 16, offset: 8288)
!347 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !164, file: !165, line: 224, baseType: !347, size: 16, offset: 8304)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !164, file: !165, line: 226, baseType: !126, size: 16, offset: 8320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !164, file: !165, line: 228, baseType: !84, size: 8, offset: 8336)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !164, file: !165, line: 229, baseType: !84, size: 8, offset: 8344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !164, file: !165, line: 231, baseType: !126, size: 16, offset: 8352)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !164, file: !165, line: 232, baseType: !84, size: 8, offset: 8368)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !164, file: !165, line: 233, baseType: !84, size: 8, offset: 8376)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !164, file: !165, line: 234, baseType: !193, size: 32, offset: 8384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !164, file: !165, line: 235, baseType: !193, size: 32, offset: 8416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !164, file: !165, line: 237, baseType: !149, size: 128, offset: 8448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !164, file: !165, line: 238, baseType: !149, size: 128, offset: 8576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !164, file: !165, line: 239, baseType: !149, size: 128, offset: 8704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !164, file: !165, line: 240, baseType: !149, size: 128, offset: 8832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !164, file: !165, line: 242, baseType: !193, size: 32, offset: 8960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !164, file: !165, line: 244, baseType: !126, size: 16, offset: 8992)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !164, file: !165, line: 245, baseType: !347, size: 16, offset: 9008)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !164, file: !165, line: 246, baseType: !302, size: 128, offset: 9024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !164, file: !165, line: 248, baseType: !78, size: 32, offset: 9152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !164, file: !165, line: 249, baseType: !78, size: 32, offset: 9184)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !164, file: !165, line: 251, baseType: !368, size: 64, offset: 9216)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !165, line: 251, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !164, file: !165, line: 253, baseType: !84, size: 8, offset: 9280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !164, file: !165, line: 254, baseType: !84, size: 8, offset: 9288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !164, file: !165, line: 255, baseType: !126, size: 16, offset: 9296)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !164, file: !165, line: 256, baseType: !229, size: 96, offset: 9312)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !164, file: !165, line: 258, baseType: !149, size: 128, offset: 9408)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !164, file: !165, line: 259, baseType: !149, size: 128, offset: 9536)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !164, file: !165, line: 260, baseType: !149, size: 128, offset: 9664)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !164, file: !165, line: 261, baseType: !149, size: 128, offset: 9792)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !164, file: !165, line: 263, baseType: !379, size: 64, offset: 9920)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !186, line: 244, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !164, file: !165, line: 264, baseType: !382, size: 64, offset: 9984)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !165, line: 53, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !164, file: !165, line: 265, baseType: !385, size: 64, offset: 10048)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !387, line: 43, flags: DIFlagFwdDecl)
!387 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !164, file: !165, line: 267, baseType: !84, size: 8, offset: 10112)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !164, file: !165, line: 268, baseType: !84, size: 8, offset: 10120)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !164, file: !165, line: 269, baseType: !126, size: 16, offset: 10128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !164, file: !165, line: 270, baseType: !193, size: 32, offset: 10144)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !164, file: !165, line: 272, baseType: !393, size: 64, offset: 10176)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !61, line: 732, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !164, file: !165, line: 275, baseType: !396, size: 64, offset: 10240)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !165, line: 275, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !164, file: !165, line: 277, baseType: !399, size: 64, offset: 10304)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !401)
!401 = !{!402, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !454, !457, !459, !460, !462, !463, !464, !465, !471, !476, !477, !481, !482, !483, !484, !485, !498, !510, !524, !528, !532, !536, !545, !557, !561, !565, !569, !573, !577, !578, !579, !580, !581, !582, !586, !587, !588, !589, !593, !594, !595, !596, !597, !602, !603, !604, !605, !606, !610, !611, !612, !613, !614, !621, !632, !637, !643, !653, !659, !670, !677, !684, !688, !693, !697, !702, !703, !704, !711, !717, !718, !719, !724, !725, !734, !843, !847, !855, !859, !863, !867, !875, !885}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !400, file: !28, line: 180, baseType: !403, size: 1600)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !404, line: 73, baseType: !405)
!404 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !404, line: 64, size: 1600, elements: !406)
!406 = !{!407, !422, !426, !427, !428, !429, !432}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !405, file: !404, line: 65, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !404, line: 53, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !404, line: 42, size: 832, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !404, line: 43, baseType: !78, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !410, file: !404, line: 44, baseType: !78, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !404, line: 45, baseType: !78, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !410, file: !404, line: 46, baseType: !78, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !410, file: !404, line: 47, baseType: !78, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !410, file: !404, line: 48, baseType: !78, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !410, file: !404, line: 49, baseType: !78, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !410, file: !404, line: 50, baseType: !78, size: 32, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !404, line: 51, baseType: !83, size: 512, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !404, line: 52, baseType: !98, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !405, file: !404, line: 66, baseType: !423, size: 1312, offset: 64)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1312, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 41)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !405, file: !404, line: 69, baseType: !78, size: 32, offset: 1376)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !405, file: !404, line: 69, baseType: !78, size: 32, offset: 1408)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !405, file: !404, line: 70, baseType: !78, size: 32, offset: 1440)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !405, file: !404, line: 71, baseType: !430, size: 64, offset: 1472)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !404, line: 71, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !405, file: !404, line: 72, baseType: !433, size: 64, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !404, line: 59, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !404, line: 57, size: 8192, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !435, file: !404, line: 58, baseType: !113, size: 8192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !400, file: !28, line: 180, baseType: !403, size: 1600, offset: 1600)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !400, file: !28, line: 180, baseType: !403, size: 1600, offset: 3200)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !400, file: !28, line: 180, baseType: !403, size: 1600, offset: 4800)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !400, file: !28, line: 180, baseType: !403, size: 1600, offset: 6400)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !400, file: !28, line: 181, baseType: !78, size: 32, offset: 8000)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !400, file: !28, line: 181, baseType: !78, size: 32, offset: 8032)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !400, file: !28, line: 181, baseType: !78, size: 32, offset: 8064)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !400, file: !28, line: 181, baseType: !78, size: 32, offset: 8096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !400, file: !28, line: 181, baseType: !78, size: 32, offset: 8128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !400, file: !28, line: 182, baseType: !78, size: 32, offset: 8160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !400, file: !28, line: 183, baseType: !78, size: 32, offset: 8192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !400, file: !28, line: 184, baseType: !450, size: 64, offset: 8256)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !451, line: 124, baseType: !452)
!451 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !451, line: 124, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !400, file: !28, line: 185, baseType: !455, size: 64, offset: 8320)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !28, line: 186, baseType: !458, size: 32, offset: 8384)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !400, file: !28, line: 187, baseType: !193, size: 32, offset: 8416)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !400, file: !28, line: 188, baseType: !461, size: 32, offset: 8448)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !400, file: !28, line: 189, baseType: !78, size: 32, offset: 8480)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !400, file: !28, line: 190, baseType: !286, size: 64, offset: 8512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !400, file: !28, line: 193, baseType: !84, size: 8, offset: 8576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !400, file: !28, line: 196, baseType: !466, size: 64, offset: 8640)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !400)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !400, file: !28, line: 199, baseType: !472, size: 64, offset: 8704)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !469, !475}
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !400, file: !28, line: 202, baseType: !466, size: 64, offset: 8768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !400, file: !28, line: 207, baseType: !478, size: 64, offset: 8832)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!78, !469}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !400, file: !28, line: 208, baseType: !478, size: 64, offset: 8896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !400, file: !28, line: 209, baseType: !478, size: 64, offset: 8960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !400, file: !28, line: 210, baseType: !478, size: 64, offset: 9024)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !400, file: !28, line: 211, baseType: !478, size: 64, offset: 9088)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !400, file: !28, line: 218, baseType: !486, size: 64, offset: 9152)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !469, !78, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !491, line: 65, size: 160, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !490, file: !491, line: 66, baseType: !229, size: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !490, file: !491, line: 67, baseType: !495, size: 48, offset: 96)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 48, elements: !230)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 68, baseType: !84, size: 8, offset: 144)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !490, file: !491, line: 68, baseType: !84, size: 8, offset: 152)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !400, file: !28, line: 219, baseType: !499, size: 64, offset: 9216)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !469, !78, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !491, line: 48, size: 96, elements: !504)
!504 = !{!505, !506, !507, !508, !509}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !503, file: !491, line: 49, baseType: !7, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !503, file: !491, line: 49, baseType: !7, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !503, file: !491, line: 50, baseType: !84, size: 8, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !503, file: !491, line: 50, baseType: !84, size: 8, offset: 72)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !503, file: !491, line: 51, baseType: !126, size: 16, offset: 80)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !400, file: !28, line: 220, baseType: !511, size: 64, offset: 9280)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !469, !78, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !491, line: 42, size: 160, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !515, file: !491, line: 43, baseType: !7, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !515, file: !491, line: 43, baseType: !7, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !515, file: !491, line: 43, baseType: !7, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !515, file: !491, line: 43, baseType: !7, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !515, file: !491, line: 44, baseType: !126, size: 16, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !515, file: !491, line: 45, baseType: !84, size: 8, offset: 144)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !515, file: !491, line: 45, baseType: !84, size: 8, offset: 152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !400, file: !28, line: 227, baseType: !525, size: 64, offset: 9344)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!489, !469}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !400, file: !28, line: 228, baseType: !529, size: 64, offset: 9408)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!502, !469}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !400, file: !28, line: 229, baseType: !533, size: 64, offset: 9472)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!514, !469}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !400, file: !28, line: 230, baseType: !537, size: 64, offset: 9536)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !469}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !491, line: 88, size: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !541, file: !491, line: 89, baseType: !7, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !541, file: !491, line: 90, baseType: !7, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !400, file: !28, line: 231, baseType: !546, size: 64, offset: 9600)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !469}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !491, line: 79, size: 96, elements: !551)
!551 = !{!552, !553, !554, !555, !556}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !550, file: !491, line: 81, baseType: !78, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !550, file: !491, line: 82, baseType: !78, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !550, file: !491, line: 83, baseType: !126, size: 16, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !491, line: 84, baseType: !84, size: 8, offset: 80)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !550, file: !491, line: 84, baseType: !84, size: 8, offset: 88)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !400, file: !28, line: 236, baseType: !558, size: 64, offset: 9664)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !469, !489}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !400, file: !28, line: 237, baseType: !562, size: 64, offset: 9728)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !469, !502}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !400, file: !28, line: 238, baseType: !566, size: 64, offset: 9792)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !469, !514}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !400, file: !28, line: 239, baseType: !570, size: 64, offset: 9856)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !469, !540}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !400, file: !28, line: 240, baseType: !574, size: 64, offset: 9920)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !469, !549}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !400, file: !28, line: 245, baseType: !525, size: 64, offset: 9984)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !400, file: !28, line: 246, baseType: !529, size: 64, offset: 10048)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !400, file: !28, line: 247, baseType: !533, size: 64, offset: 10112)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !400, file: !28, line: 248, baseType: !537, size: 64, offset: 10176)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !400, file: !28, line: 249, baseType: !546, size: 64, offset: 10240)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !400, file: !28, line: 255, baseType: !583, size: 64, offset: 10304)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!98, !469, !78, !78}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !400, file: !28, line: 256, baseType: !583, size: 64, offset: 10368)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !400, file: !28, line: 257, baseType: !583, size: 64, offset: 10432)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !400, file: !28, line: 258, baseType: !583, size: 64, offset: 10496)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !400, file: !28, line: 264, baseType: !590, size: 64, offset: 10560)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!98, !469, !78}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !400, file: !28, line: 265, baseType: !590, size: 64, offset: 10624)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !400, file: !28, line: 266, baseType: !590, size: 64, offset: 10688)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !400, file: !28, line: 267, baseType: !590, size: 64, offset: 10752)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !400, file: !28, line: 268, baseType: !590, size: 64, offset: 10816)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !400, file: !28, line: 272, baseType: !598, size: 64, offset: 10880)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!601, !469}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !400, file: !28, line: 273, baseType: !598, size: 64, offset: 10944)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !400, file: !28, line: 274, baseType: !598, size: 64, offset: 11008)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !400, file: !28, line: 275, baseType: !598, size: 64, offset: 11072)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !400, file: !28, line: 276, baseType: !598, size: 64, offset: 11136)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !400, file: !28, line: 279, baseType: !607, size: 64, offset: 11200)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !469, !78, !601, !78}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !400, file: !28, line: 280, baseType: !607, size: 64, offset: 11264)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !400, file: !28, line: 281, baseType: !607, size: 64, offset: 11328)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !400, file: !28, line: 284, baseType: !478, size: 64, offset: 11392)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !400, file: !28, line: 285, baseType: !478, size: 64, offset: 11456)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !400, file: !28, line: 286, baseType: !615, size: 64, offset: 11520)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!618, !469}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !400, file: !28, line: 287, baseType: !622, size: 64, offset: 11584)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!625, !469}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !628)
!628 = !{!629, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !627, file: !28, line: 118, baseType: !630, size: 128)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !303)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !627, file: !28, line: 119, baseType: !630, size: 128, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !400, file: !28, line: 288, baseType: !633, size: 64, offset: 11648)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!636, !469}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !400, file: !28, line: 289, baseType: !638, size: 64, offset: 11712)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !469, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !400, file: !28, line: 290, baseType: !644, size: 64, offset: 11776)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!647, !469}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !649, file: !28, line: 124, baseType: !126, size: 16)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !649, file: !28, line: 125, baseType: !84, size: 8, offset: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !400, file: !28, line: 291, baseType: !654, size: 64, offset: 11840)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !469}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !400, file: !28, line: 299, baseType: !660, size: 64, offset: 11904)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !469, !663, !98, !669}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !98, !78, !666, !666, !667}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !400, file: !28, line: 309, baseType: !671, size: 64, offset: 11968)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !469, !674, !98}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !98, !78, !666, !666}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !400, file: !28, line: 317, baseType: !678, size: 64, offset: 12032)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !469, !681, !98, !669}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !98, !78, !78, !666, !666}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !400, file: !28, line: 327, baseType: !685, size: 64, offset: 12096)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !469, !674, !98, !669}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !400, file: !28, line: 337, baseType: !689, size: 64, offset: 12160)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !469, !692, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !400, file: !28, line: 344, baseType: !694, size: 64, offset: 12224)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !469, !78, !692}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !400, file: !28, line: 347, baseType: !698, size: 64, offset: 12288)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !469, !701}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !400, file: !28, line: 350, baseType: !694, size: 64, offset: 12352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !400, file: !28, line: 351, baseType: !694, size: 64, offset: 12416)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !400, file: !28, line: 355, baseType: !705, size: 64, offset: 12480)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !163, !469}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !400, file: !28, line: 359, baseType: !712, size: 64, offset: 12544)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!715, !163, !469}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !400, file: !28, line: 364, baseType: !466, size: 64, offset: 12608)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !400, file: !28, line: 367, baseType: !466, size: 64, offset: 12672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !400, file: !28, line: 373, baseType: !720, size: 64, offset: 12736)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !469, !723, !723}
!723 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !400, file: !28, line: 376, baseType: !466, size: 64, offset: 12800)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !400, file: !28, line: 385, baseType: !726, size: 64, offset: 12864)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !469, !729, !723, !730}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!78, !78, !98}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !400, file: !28, line: 391, baseType: !735, size: 64, offset: 12928)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !469, !738, !838, !98, !842}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !743, !837, !78}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !491, line: 160, size: 384, elements: !745)
!745 = !{!746, !750, !832, !833, !834, !835, !836}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !744, file: !491, line: 161, baseType: !747, size: 256)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 256, elements: !748)
!748 = !{!304, !749}
!749 = !DISubrange(count: 2)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !744, file: !491, line: 162, baseType: !751, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !753, line: 77, size: 15424, elements: !754)
!753 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!754 = !{!755, !756, !757, !760, !763, !766, !769, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !821, !822, !826}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !752, file: !753, line: 78, baseType: !93, size: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !753, line: 80, baseType: !113, size: 8192, offset: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !752, file: !753, line: 82, baseType: !758, size: 64, offset: 9152)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !753, line: 43, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !752, file: !753, line: 83, baseType: !761, size: 64, offset: 9216)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !94, line: 46, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !752, file: !753, line: 86, baseType: !764, size: 64, offset: 9280)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !753, line: 41, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !752, file: !753, line: 87, baseType: !767, size: 64, offset: 9344)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !753, line: 44, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !752, file: !753, line: 89, baseType: !770, size: 512, offset: 9408)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 512, elements: !771)
!771 = !{!195}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !752, file: !753, line: 90, baseType: !126, size: 16, offset: 9920)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !752, file: !753, line: 90, baseType: !126, size: 16, offset: 9936)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !752, file: !753, line: 92, baseType: !126, size: 16, offset: 9952)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !753, line: 92, baseType: !126, size: 16, offset: 9968)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !752, file: !753, line: 93, baseType: !126, size: 16, offset: 9984)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !752, file: !753, line: 93, baseType: !126, size: 16, offset: 10000)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !752, file: !753, line: 94, baseType: !78, size: 32, offset: 10016)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !752, file: !753, line: 97, baseType: !126, size: 16, offset: 10048)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !752, file: !753, line: 97, baseType: !126, size: 16, offset: 10064)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !752, file: !753, line: 98, baseType: !126, size: 16, offset: 10080)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !752, file: !753, line: 98, baseType: !126, size: 16, offset: 10096)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !752, file: !753, line: 99, baseType: !126, size: 16, offset: 10112)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !752, file: !753, line: 99, baseType: !126, size: 16, offset: 10128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !752, file: !753, line: 100, baseType: !7, size: 32, offset: 10144)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !752, file: !753, line: 101, baseType: !658, size: 64, offset: 10176)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !752, file: !753, line: 103, baseType: !119, size: 64, offset: 10240)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !752, file: !753, line: 104, baseType: !789, size: 64, offset: 10304)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !94, line: 159, size: 448, elements: !791)
!791 = !{!792, !795, !796, !798, !799, !801}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !790, file: !94, line: 161, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !794)
!794 = !{!749}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !790, file: !94, line: 162, baseType: !793, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !790, file: !94, line: 163, baseType: !797, size: 32, offset: 128)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 32, elements: !794)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !790, file: !94, line: 164, baseType: !797, size: 32, offset: 160)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !790, file: !94, line: 165, baseType: !800, size: 128, offset: 192)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 128, elements: !794)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !790, file: !94, line: 166, baseType: !802, size: 128, offset: 320)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 128, elements: !794)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !752, file: !753, line: 107, baseType: !193, size: 32, offset: 10368)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !752, file: !753, line: 108, baseType: !78, size: 32, offset: 10400)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !752, file: !753, line: 109, baseType: !126, size: 16, offset: 10432)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !752, file: !753, line: 110, baseType: !126, size: 16, offset: 10448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !752, file: !753, line: 113, baseType: !78, size: 32, offset: 10464)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !752, file: !753, line: 113, baseType: !78, size: 32, offset: 10496)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !752, file: !753, line: 114, baseType: !84, size: 8, offset: 10528)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !752, file: !753, line: 114, baseType: !84, size: 8, offset: 10536)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !752, file: !753, line: 115, baseType: !126, size: 16, offset: 10544)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !752, file: !753, line: 116, baseType: !302, size: 128, offset: 10560)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !752, file: !753, line: 119, baseType: !193, size: 32, offset: 10688)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !752, file: !753, line: 119, baseType: !193, size: 32, offset: 10720)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !752, file: !753, line: 122, baseType: !816, size: 512, offset: 10752)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !817, line: 182, baseType: !818)
!817 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !817, line: 180, size: 512, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !817, line: 181, baseType: !83, size: 512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !752, file: !753, line: 123, baseType: !84, size: 8, offset: 11264)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !752, file: !753, line: 125, baseType: !823, size: 56, offset: 11272)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 56, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 7)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !752, file: !753, line: 126, baseType: !827, size: 4096, offset: 11328)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 4096, elements: !771)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !753, line: 69, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !753, line: 67, size: 512, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !829, file: !753, line: 68, baseType: !83, size: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !744, file: !491, line: 163, baseType: !84, size: 8, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !744, file: !491, line: 163, baseType: !84, size: 8, offset: 328)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !744, file: !491, line: 164, baseType: !126, size: 16, offset: 336)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !744, file: !491, line: 164, baseType: !126, size: 16, offset: 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !744, file: !491, line: 164, baseType: !126, size: 16, offset: 368)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!78, !98, !78, !78}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !400, file: !28, line: 400, baseType: !844, size: 64, offset: 12992)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !469, !730}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !400, file: !28, line: 415, baseType: !848, size: 64, offset: 13056)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !469, !851, !730, !838, !98, !842}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!742, !98, !78}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !400, file: !28, line: 425, baseType: !856, size: 64, offset: 13120)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !469, !851, !838, !98, !842}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !400, file: !28, line: 435, baseType: !860, size: 64, offset: 13184)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !469, !730, !851, !98}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !400, file: !28, line: 444, baseType: !864, size: 64, offset: 13248)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !469, !851, !98}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !400, file: !28, line: 455, baseType: !868, size: 64, offset: 13312)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !469, !851, !871, !98}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !98, !78, !193}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !400, file: !28, line: 464, baseType: !876, size: 64, offset: 13376)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !469, !879, !882, !98}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !98, !78, !98}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!723, !98, !78}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !400, file: !28, line: 470, baseType: !466, size: 64, offset: 13440)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !164, file: !165, line: 277, baseType: !399, size: 64, offset: 10368)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !164, file: !165, line: 278, baseType: !888, size: 64, offset: 10432)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !889, line: 27, baseType: !890)
!889 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !891, line: 45, baseType: !892)
!891 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!892 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !164, file: !165, line: 279, baseType: !888, size: 64, offset: 10496)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 280, baseType: !7, size: 32, offset: 10560)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !164, file: !165, line: 281, baseType: !7, size: 32, offset: 10592)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !164, file: !165, line: 283, baseType: !149, size: 128, offset: 10624)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !164, file: !165, line: 284, baseType: !149, size: 128, offset: 10752)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !164, file: !165, line: 285, baseType: !899, size: 64, offset: 10880)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !164, file: !165, line: 287, baseType: !901, size: 64, offset: 10944)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !165, line: 59, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !164, file: !165, line: 288, baseType: !904, size: 64, offset: 11008)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !165, line: 288, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !164, file: !165, line: 290, baseType: !907, size: 64, offset: 11072)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !794)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !164, file: !165, line: 291, baseType: !909, size: 64, offset: 11136)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !753, line: 65, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !753, line: 50, size: 320, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !911, file: !753, line: 51, baseType: !88, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !911, file: !753, line: 53, baseType: !78, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !911, file: !753, line: 54, baseType: !78, size: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !911, file: !753, line: 55, baseType: !78, size: 32, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !911, file: !753, line: 55, baseType: !78, size: 32, offset: 160)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !911, file: !753, line: 56, baseType: !84, size: 8, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !911, file: !753, line: 56, baseType: !84, size: 8, offset: 200)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !911, file: !753, line: 57, baseType: !84, size: 8, offset: 208)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !911, file: !753, line: 57, baseType: !84, size: 8, offset: 216)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !911, file: !753, line: 59, baseType: !126, size: 16, offset: 224)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !911, file: !753, line: 59, baseType: !126, size: 16, offset: 240)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !911, file: !753, line: 59, baseType: !126, size: 16, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !911, file: !753, line: 61, baseType: !126, size: 16, offset: 272)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !911, file: !753, line: 63, baseType: !78, size: 32, offset: 288)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !164, file: !165, line: 293, baseType: !149, size: 128, offset: 11200)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !164, file: !165, line: 294, baseType: !929, size: 64, offset: 11328)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !165, line: 113, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !165, line: 108, size: 256, elements: !932)
!932 = !{!933, !935, !936, !937, !938}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !165, line: 109, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !931, file: !165, line: 109, baseType: !934, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !931, file: !165, line: 110, baseType: !163, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !931, file: !165, line: 111, baseType: !78, size: 32, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !931, file: !165, line: 112, baseType: !193, size: 32, offset: 224)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !89, file: !90, line: 1221, baseType: !940, size: 64, offset: 1088)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !90, line: 52, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !89, file: !90, line: 1223, baseType: !88, size: 64, offset: 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !89, file: !90, line: 1225, baseType: !149, size: 128, offset: 1216)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !89, file: !90, line: 1226, baseType: !945, size: 64, offset: 1344)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !90, line: 69, size: 320, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !946, file: !90, line: 70, baseType: !945, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !946, file: !90, line: 70, baseType: !945, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !946, file: !90, line: 71, baseType: !7, size: 32, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !946, file: !90, line: 71, baseType: !7, size: 32, offset: 160)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !946, file: !90, line: 72, baseType: !78, size: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !946, file: !90, line: 73, baseType: !126, size: 16, offset: 224)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !946, file: !90, line: 73, baseType: !126, size: 16, offset: 240)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !946, file: !90, line: 74, baseType: !163, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !89, file: !90, line: 1227, baseType: !163, size: 64, offset: 1408)
