; ModuleID = 'blender/source/blender/render/intern/source/volumetric.c'
source_filename = "blender/source/blender/render/intern/source/volumetric.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !54, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/volumetric.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 339, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!7 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!14 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!15 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!16 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!17 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !19, line: 213, baseType: !20, size: 32, elements: !21)
!19 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!22 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!23 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!24 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!25 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!26 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!27 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!28 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!29 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!30 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!31 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!32 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!33 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!34 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!35 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!36 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!37 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!38 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!39 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!40 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!41 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!42 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!43 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!44 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!45 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!46 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!47 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!48 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!49 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!50 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!51 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!52 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!53 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!54 = !{!55, !1756, !90}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "VlakRen", file: !57, line: 411, baseType: !58)
!57 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VlakRen", file: !57, line: 400, size: 512, elements: !59)
!59 = !{!60, !75, !76, !77, !78, !79, !1752, !1753, !1754, !1755}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !58, file: !57, line: 401, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VertRen", file: !57, line: 372, size: 384, elements: !63)
!63 = !{!64, !69, !70, !72, !73, !74}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !62, file: !57, line: 373, baseType: !65, size: 96)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 96, elements: !67)
!66 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !62, file: !57, line: 374, baseType: !65, size: 96, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "orco", scope: !62, file: !57, line: 375, baseType: !71, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !62, file: !57, line: 376, baseType: !5, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !62, file: !57, line: 378, baseType: !66, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !62, file: !57, line: 379, baseType: !20, size: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !58, file: !57, line: 401, baseType: !61, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !58, file: !57, line: 401, baseType: !61, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !58, file: !57, line: 401, baseType: !61, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !58, file: !57, line: 402, baseType: !65, size: 96, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !58, file: !57, line: 403, baseType: !80, size: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !82, line: 93, size: 7552, elements: !83)
!82 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !{!84, !155, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !204, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !273, !274, !275, !276, !277, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1751}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 94, baseType: !85, size: 960)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !86, line: 130, baseType: !87)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !86, line: 117, size: 960, elements: !88)
!88 = !{!89, !91, !92, !94, !114, !118, !120, !121, !122, !123}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !86, line: 118, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !86, line: 118, baseType: !90, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !87, file: !86, line: 119, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !87, file: !86, line: 120, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !86, line: 136, size: 17600, elements: !97)
!97 = !{!98, !99, !101, !104, !109, !110, !111}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !96, file: !86, line: 137, baseType: !85, size: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !96, file: !86, line: 138, baseType: !100, size: 64, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !96, file: !86, line: 139, baseType: !102, size: 64, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !86, line: 43, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !86, line: 140, baseType: !105, size: 8192, offset: 1088)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8192, elements: !107)
!106 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!107 = !{!108}
!108 = !DISubrange(count: 1024)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !96, file: !86, line: 141, baseType: !105, size: 8192, offset: 9280)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !96, file: !86, line: 148, baseType: !95, size: 64, offset: 17472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !96, file: !86, line: 150, baseType: !112, size: 64, offset: 17536)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !86, line: 45, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !86, line: 121, baseType: !115, size: 528, offset: 256)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 528, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 66)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !86, line: 126, baseType: !119, size: 16, offset: 784)
!119 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !87, file: !86, line: 127, baseType: !20, size: 32, offset: 800)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !87, file: !86, line: 128, baseType: !20, size: 32, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !87, file: !86, line: 128, baseType: !20, size: 32, offset: 864)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !87, file: !86, line: 129, baseType: !124, size: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !86, line: 75, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !86, line: 62, size: 1024, elements: !127)
!127 = !{!128, !130, !131, !132, !133, !134, !138, !139, !153, !154}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !86, line: 63, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !86, line: 63, baseType: !129, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !86, line: 64, baseType: !106, size: 8, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !126, file: !86, line: 64, baseType: !106, size: 8, offset: 136)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !86, line: 65, baseType: !119, size: 16, offset: 144)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !86, line: 66, baseType: !135, size: 512, offset: 160)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 512, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !126, file: !86, line: 67, baseType: !20, size: 32, offset: 672)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !86, line: 69, baseType: !140, size: 256, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !86, line: 60, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !86, line: 48, size: 256, elements: !142)
!142 = !{!143, !144, !151, !152}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !141, file: !86, line: 49, baseType: !90, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !141, file: !86, line: 58, baseType: !145, size: 128, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !146, line: 71, baseType: !147)
!146 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !146, line: 69, size: 128, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !147, file: !146, line: 70, baseType: !90, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !147, file: !146, line: 70, baseType: !90, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !141, file: !86, line: 59, baseType: !20, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !141, file: !86, line: 59, baseType: !20, size: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !126, file: !86, line: 70, baseType: !20, size: 32, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !126, file: !86, line: 74, baseType: !20, size: 32, offset: 992)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !81, file: !82, line: 95, baseType: !156, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !82, line: 48, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !81, file: !82, line: 97, baseType: !119, size: 16, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !82, line: 97, baseType: !119, size: 16, offset: 1040)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !81, file: !82, line: 99, baseType: !66, size: 32, offset: 1056)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !81, file: !82, line: 99, baseType: !66, size: 32, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !81, file: !82, line: 99, baseType: !66, size: 32, offset: 1120)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !81, file: !82, line: 100, baseType: !66, size: 32, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !81, file: !82, line: 100, baseType: !66, size: 32, offset: 1184)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !81, file: !82, line: 100, baseType: !66, size: 32, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !81, file: !82, line: 101, baseType: !66, size: 32, offset: 1248)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !81, file: !82, line: 101, baseType: !66, size: 32, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !81, file: !82, line: 101, baseType: !66, size: 32, offset: 1312)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !81, file: !82, line: 102, baseType: !66, size: 32, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !81, file: !82, line: 102, baseType: !66, size: 32, offset: 1376)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !81, file: !82, line: 102, baseType: !66, size: 32, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !81, file: !82, line: 103, baseType: !66, size: 32, offset: 1440)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !81, file: !82, line: 103, baseType: !66, size: 32, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !81, file: !82, line: 103, baseType: !66, size: 32, offset: 1504)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !81, file: !82, line: 103, baseType: !66, size: 32, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !81, file: !82, line: 103, baseType: !66, size: 32, offset: 1568)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !81, file: !82, line: 104, baseType: !66, size: 32, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !81, file: !82, line: 104, baseType: !66, size: 32, offset: 1632)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !81, file: !82, line: 104, baseType: !66, size: 32, offset: 1664)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !81, file: !82, line: 104, baseType: !66, size: 32, offset: 1696)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !81, file: !82, line: 104, baseType: !66, size: 32, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !81, file: !82, line: 105, baseType: !66, size: 32, offset: 1760)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !81, file: !82, line: 108, baseType: !184, size: 704, offset: 1792)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !82, line: 53, size: 704, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !184, file: !82, line: 54, baseType: !66, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !184, file: !82, line: 55, baseType: !66, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !184, file: !82, line: 56, baseType: !66, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !184, file: !82, line: 57, baseType: !66, size: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !184, file: !82, line: 59, baseType: !65, size: 96, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !184, file: !82, line: 60, baseType: !65, size: 96, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !184, file: !82, line: 61, baseType: !65, size: 96, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !184, file: !82, line: 63, baseType: !66, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !184, file: !82, line: 64, baseType: !66, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !184, file: !82, line: 65, baseType: !66, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !184, file: !82, line: 67, baseType: !119, size: 16, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !184, file: !82, line: 68, baseType: !119, size: 16, offset: 528)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !184, file: !82, line: 69, baseType: !119, size: 16, offset: 544)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !184, file: !82, line: 70, baseType: !119, size: 16, offset: 560)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !184, file: !82, line: 72, baseType: !66, size: 32, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !184, file: !82, line: 73, baseType: !66, size: 32, offset: 608)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !184, file: !82, line: 74, baseType: !66, size: 32, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !184, file: !82, line: 75, baseType: !66, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !81, file: !82, line: 109, baseType: !205, size: 128, offset: 2496)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !82, line: 79, size: 128, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !82, line: 80, baseType: !20, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !205, file: !82, line: 81, baseType: !20, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !205, file: !82, line: 82, baseType: !20, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !205, file: !82, line: 83, baseType: !20, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !81, file: !82, line: 111, baseType: !66, size: 32, offset: 2624)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !81, file: !82, line: 111, baseType: !66, size: 32, offset: 2656)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !81, file: !82, line: 112, baseType: !66, size: 32, offset: 2688)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !81, file: !82, line: 112, baseType: !66, size: 32, offset: 2720)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !81, file: !82, line: 113, baseType: !66, size: 32, offset: 2752)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !81, file: !82, line: 114, baseType: !66, size: 32, offset: 2784)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !81, file: !82, line: 114, baseType: !66, size: 32, offset: 2816)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !81, file: !82, line: 115, baseType: !119, size: 16, offset: 2848)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !81, file: !82, line: 115, baseType: !119, size: 16, offset: 2864)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !81, file: !82, line: 116, baseType: !119, size: 16, offset: 2880)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !81, file: !82, line: 117, baseType: !106, size: 8, offset: 2896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !81, file: !82, line: 117, baseType: !106, size: 8, offset: 2904)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !81, file: !82, line: 119, baseType: !66, size: 32, offset: 2912)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !81, file: !82, line: 119, baseType: !66, size: 32, offset: 2944)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !81, file: !82, line: 120, baseType: !119, size: 16, offset: 2976)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !81, file: !82, line: 120, baseType: !119, size: 16, offset: 2992)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !81, file: !82, line: 121, baseType: !66, size: 32, offset: 3008)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !81, file: !82, line: 121, baseType: !66, size: 32, offset: 3040)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !81, file: !82, line: 122, baseType: !66, size: 32, offset: 3072)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !81, file: !82, line: 123, baseType: !66, size: 32, offset: 3104)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !81, file: !82, line: 124, baseType: !119, size: 16, offset: 3136)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !81, file: !82, line: 125, baseType: !119, size: 16, offset: 3152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !81, file: !82, line: 127, baseType: !20, size: 32, offset: 3168)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !81, file: !82, line: 127, baseType: !20, size: 32, offset: 3200)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !81, file: !82, line: 128, baseType: !20, size: 32, offset: 3232)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !81, file: !82, line: 128, baseType: !20, size: 32, offset: 3264)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !81, file: !82, line: 129, baseType: !119, size: 16, offset: 3296)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !81, file: !82, line: 129, baseType: !119, size: 16, offset: 3312)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !81, file: !82, line: 129, baseType: !119, size: 16, offset: 3328)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !81, file: !82, line: 129, baseType: !119, size: 16, offset: 3344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !81, file: !82, line: 130, baseType: !66, size: 32, offset: 3360)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !81, file: !82, line: 130, baseType: !66, size: 32, offset: 3392)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !81, file: !82, line: 130, baseType: !66, size: 32, offset: 3424)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !81, file: !82, line: 130, baseType: !66, size: 32, offset: 3456)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !81, file: !82, line: 131, baseType: !66, size: 32, offset: 3488)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !81, file: !82, line: 131, baseType: !66, size: 32, offset: 3520)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !81, file: !82, line: 131, baseType: !66, size: 32, offset: 3552)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !81, file: !82, line: 131, baseType: !66, size: 32, offset: 3584)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !81, file: !82, line: 132, baseType: !66, size: 32, offset: 3616)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !81, file: !82, line: 132, baseType: !66, size: 32, offset: 3648)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !81, file: !82, line: 133, baseType: !135, size: 512, offset: 3680)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !81, file: !82, line: 135, baseType: !66, size: 32, offset: 4192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !81, file: !82, line: 136, baseType: !66, size: 32, offset: 4224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !81, file: !82, line: 137, baseType: !66, size: 32, offset: 4256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !81, file: !82, line: 138, baseType: !20, size: 32, offset: 4288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !81, file: !82, line: 141, baseType: !106, size: 8, offset: 4320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !81, file: !82, line: 141, baseType: !106, size: 8, offset: 4328)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !81, file: !82, line: 141, baseType: !106, size: 8, offset: 4336)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !81, file: !82, line: 141, baseType: !106, size: 8, offset: 4344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !81, file: !82, line: 142, baseType: !119, size: 16, offset: 4352)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !81, file: !82, line: 142, baseType: !119, size: 16, offset: 4368)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !81, file: !82, line: 142, baseType: !119, size: 16, offset: 4384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !81, file: !82, line: 145, baseType: !106, size: 8, offset: 4400)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !81, file: !82, line: 145, baseType: !106, size: 8, offset: 4408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !81, file: !82, line: 148, baseType: !119, size: 16, offset: 4416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !81, file: !82, line: 148, baseType: !119, size: 16, offset: 4432)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !81, file: !82, line: 149, baseType: !66, size: 32, offset: 4448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !81, file: !82, line: 149, baseType: !66, size: 32, offset: 4480)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !81, file: !82, line: 152, baseType: !270, size: 128, offset: 4512)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 4)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !81, file: !82, line: 153, baseType: !66, size: 32, offset: 4640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !81, file: !82, line: 154, baseType: !66, size: 32, offset: 4672)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !81, file: !82, line: 157, baseType: !119, size: 16, offset: 4704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !81, file: !82, line: 157, baseType: !119, size: 16, offset: 4720)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !81, file: !82, line: 160, baseType: !278, size: 64, offset: 4736)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !280, line: 113, size: 6208, elements: !281)
!280 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = !{!282, !283, !284, !285, !286, !287, !291}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !279, file: !280, line: 114, baseType: !119, size: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !279, file: !280, line: 114, baseType: !119, size: 16, offset: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !279, file: !280, line: 115, baseType: !106, size: 8, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !279, file: !280, line: 115, baseType: !106, size: 8, offset: 40)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !279, file: !280, line: 116, baseType: !106, size: 8, offset: 48)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !279, file: !280, line: 117, baseType: !288, size: 8, offset: 56)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 1)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !279, file: !280, line: 119, baseType: !292, size: 6144, offset: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 6144, elements: !302)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !280, line: 109, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !280, line: 106, size: 192, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !294, file: !280, line: 107, baseType: !66, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !294, file: !280, line: 107, baseType: !66, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !294, file: !280, line: 107, baseType: !66, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !294, file: !280, line: 107, baseType: !66, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !294, file: !280, line: 107, baseType: !66, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !294, file: !280, line: 108, baseType: !20, size: 32, offset: 160)
!302 = !{!303}
!303 = !DISubrange(count: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !81, file: !82, line: 161, baseType: !278, size: 64, offset: 4800)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !81, file: !82, line: 162, baseType: !106, size: 8, offset: 4864)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !81, file: !82, line: 162, baseType: !106, size: 8, offset: 4872)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !81, file: !82, line: 163, baseType: !106, size: 8, offset: 4880)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !81, file: !82, line: 163, baseType: !106, size: 8, offset: 4888)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !81, file: !82, line: 164, baseType: !119, size: 16, offset: 4896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !81, file: !82, line: 164, baseType: !119, size: 16, offset: 4912)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !81, file: !82, line: 165, baseType: !66, size: 32, offset: 4928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !81, file: !82, line: 165, baseType: !66, size: 32, offset: 4960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !81, file: !82, line: 167, baseType: !314, size: 1152, offset: 4992)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 1152, elements: !1709)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !280, line: 57, size: 2496, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !1503, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !316, file: !280, line: 59, baseType: !119, size: 16)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !316, file: !280, line: 59, baseType: !119, size: 16, offset: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !316, file: !280, line: 59, baseType: !119, size: 16, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !316, file: !280, line: 59, baseType: !119, size: 16, offset: 48)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !316, file: !280, line: 60, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !4, line: 115, size: 11392, elements: !325)
!325 = !{!326, !327, !328, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !345, !355, !369, !370, !411, !412, !415, !416, !432, !433, !434, !435, !436, !437, !438, !440, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !518, !519, !520, !521, !522, !523, !524, !525, !526, !529, !532, !541, !542, !543, !544, !545, !548, !551, !554, !555, !561, !562, !563, !564, !565, !566, !568, !571, !574, !578, !1491, !1492}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !324, file: !4, line: 116, baseType: !85, size: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !324, file: !4, line: 117, baseType: !156, size: 64, offset: 960)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !324, file: !4, line: 119, baseType: !329, size: 64, offset: 1024)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !4, line: 57, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !4, line: 121, baseType: !119, size: 16, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !324, file: !4, line: 121, baseType: !119, size: 16, offset: 1104)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !324, file: !4, line: 122, baseType: !20, size: 32, offset: 1120)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !324, file: !4, line: 122, baseType: !20, size: 32, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !324, file: !4, line: 122, baseType: !20, size: 32, offset: 1184)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !324, file: !4, line: 123, baseType: !135, size: 512, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !324, file: !4, line: 124, baseType: !323, size: 64, offset: 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !324, file: !4, line: 124, baseType: !323, size: 64, offset: 1792)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !324, file: !4, line: 127, baseType: !323, size: 64, offset: 1856)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !324, file: !4, line: 127, baseType: !323, size: 64, offset: 1920)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !324, file: !4, line: 127, baseType: !323, size: 64, offset: 1984)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !324, file: !4, line: 128, baseType: !343, size: 64, offset: 2048)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !82, line: 49, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !324, file: !4, line: 130, baseType: !346, size: 64, offset: 2112)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !4, line: 97, size: 832, elements: !348)
!348 = !{!349, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !347, file: !4, line: 98, baseType: !350, size: 768)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 768, elements: !351)
!351 = !{!352, !68}
!352 = !DISubrange(count: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !4, line: 99, baseType: !20, size: 32, offset: 768)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !347, file: !4, line: 99, baseType: !20, size: 32, offset: 800)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !324, file: !4, line: 131, baseType: !356, size: 64, offset: 2176)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !358, line: 486, size: 1600, elements: !359)
!358 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !357, file: !358, line: 487, baseType: !85, size: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !357, file: !358, line: 489, baseType: !145, size: 128, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !357, file: !358, line: 490, baseType: !145, size: 128, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !357, file: !358, line: 491, baseType: !145, size: 128, offset: 1216)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !357, file: !358, line: 492, baseType: !145, size: 128, offset: 1344)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !357, file: !358, line: 494, baseType: !20, size: 32, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !357, file: !358, line: 495, baseType: !20, size: 32, offset: 1504)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !357, file: !358, line: 497, baseType: !20, size: 32, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !357, file: !358, line: 498, baseType: !20, size: 32, offset: 1568)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !324, file: !4, line: 132, baseType: !356, size: 64, offset: 2240)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !324, file: !4, line: 133, baseType: !371, size: 64, offset: 2304)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !358, line: 334, size: 1728, elements: !373)
!373 = !{!374, !375, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !410}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !372, file: !358, line: 335, baseType: !145, size: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !372, file: !358, line: 336, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !358, line: 47, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !358, line: 338, baseType: !119, size: 16, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !372, file: !358, line: 338, baseType: !119, size: 16, offset: 208)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !372, file: !358, line: 339, baseType: !5, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !372, file: !358, line: 340, baseType: !20, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !372, file: !358, line: 342, baseType: !66, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !372, file: !358, line: 343, baseType: !65, size: 96, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !372, file: !358, line: 344, baseType: !65, size: 96, offset: 416)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !372, file: !358, line: 347, baseType: !145, size: 128, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !372, file: !358, line: 349, baseType: !20, size: 32, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !372, file: !358, line: 350, baseType: !20, size: 32, offset: 672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !372, file: !358, line: 351, baseType: !90, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !372, file: !358, line: 352, baseType: !90, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !372, file: !358, line: 354, baseType: !391, size: 384, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !358, line: 116, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !358, line: 94, size: 384, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !392, file: !358, line: 96, baseType: !20, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !392, file: !358, line: 96, baseType: !20, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !392, file: !358, line: 97, baseType: !20, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !392, file: !358, line: 97, baseType: !20, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !392, file: !358, line: 99, baseType: !119, size: 16, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !392, file: !358, line: 100, baseType: !119, size: 16, offset: 144)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !392, file: !358, line: 102, baseType: !119, size: 16, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !392, file: !358, line: 105, baseType: !119, size: 16, offset: 176)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !392, file: !358, line: 108, baseType: !119, size: 16, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !392, file: !358, line: 109, baseType: !119, size: 16, offset: 208)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !392, file: !358, line: 111, baseType: !119, size: 16, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !392, file: !358, line: 112, baseType: !119, size: 16, offset: 240)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !392, file: !358, line: 114, baseType: !20, size: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !392, file: !358, line: 114, baseType: !20, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !392, file: !358, line: 115, baseType: !20, size: 32, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !392, file: !358, line: 115, baseType: !20, size: 32, offset: 352)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !372, file: !358, line: 355, baseType: !135, size: 512, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !4, line: 134, baseType: !90, size: 64, offset: 2368)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !324, file: !4, line: 136, baseType: !413, size: 64, offset: 2432)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !19, line: 61, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !324, file: !4, line: 138, baseType: !391, size: 384, offset: 2496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !324, file: !4, line: 139, baseType: !417, size: 64, offset: 2880)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !358, line: 80, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !358, line: 72, size: 192, elements: !420)
!420 = !{!421, !428, !429, !430, !431}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !419, file: !358, line: 73, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !358, line: 59, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !358, line: 56, size: 128, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !424, file: !358, line: 57, baseType: !65, size: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !424, file: !358, line: 58, baseType: !20, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !419, file: !358, line: 74, baseType: !20, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !419, file: !358, line: 76, baseType: !20, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !419, file: !358, line: 77, baseType: !20, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !358, line: 79, baseType: !20, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !324, file: !4, line: 141, baseType: !145, size: 128, offset: 2944)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !324, file: !4, line: 142, baseType: !145, size: 128, offset: 3072)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !324, file: !4, line: 143, baseType: !145, size: 128, offset: 3200)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !324, file: !4, line: 144, baseType: !145, size: 128, offset: 3328)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !324, file: !4, line: 146, baseType: !20, size: 32, offset: 3456)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !324, file: !4, line: 147, baseType: !20, size: 32, offset: 3488)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !324, file: !4, line: 150, baseType: !439, size: 64, offset: 3520)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !324, file: !4, line: 151, baseType: !441, size: 64, offset: 3584)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !324, file: !4, line: 152, baseType: !20, size: 32, offset: 3648)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !324, file: !4, line: 153, baseType: !20, size: 32, offset: 3680)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !324, file: !4, line: 156, baseType: !65, size: 96, offset: 3712)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !324, file: !4, line: 156, baseType: !65, size: 96, offset: 3808)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !324, file: !4, line: 156, baseType: !65, size: 96, offset: 3904)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !324, file: !4, line: 157, baseType: !65, size: 96, offset: 4000)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !324, file: !4, line: 158, baseType: !65, size: 96, offset: 4096)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !324, file: !4, line: 159, baseType: !65, size: 96, offset: 4192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !324, file: !4, line: 160, baseType: !65, size: 96, offset: 4288)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !324, file: !4, line: 160, baseType: !65, size: 96, offset: 4384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !324, file: !4, line: 161, baseType: !270, size: 128, offset: 4480)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !324, file: !4, line: 161, baseType: !270, size: 128, offset: 4608)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !324, file: !4, line: 162, baseType: !65, size: 96, offset: 4736)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !324, file: !4, line: 162, baseType: !65, size: 96, offset: 4832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !324, file: !4, line: 163, baseType: !66, size: 32, offset: 4928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !324, file: !4, line: 163, baseType: !66, size: 32, offset: 4960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !324, file: !4, line: 164, baseType: !459, size: 512, offset: 4992)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 512, elements: !460)
!460 = !{!272, !272}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !324, file: !4, line: 165, baseType: !459, size: 512, offset: 5504)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !324, file: !4, line: 166, baseType: !459, size: 512, offset: 6016)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !324, file: !4, line: 167, baseType: !459, size: 512, offset: 6528)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !324, file: !4, line: 176, baseType: !459, size: 512, offset: 7040)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !324, file: !4, line: 178, baseType: !5, size: 32, offset: 7552)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !4, line: 180, baseType: !119, size: 16, offset: 7584)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !324, file: !4, line: 181, baseType: !119, size: 16, offset: 7600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !324, file: !4, line: 183, baseType: !119, size: 16, offset: 7616)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !324, file: !4, line: 183, baseType: !119, size: 16, offset: 7632)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !324, file: !4, line: 184, baseType: !119, size: 16, offset: 7648)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !324, file: !4, line: 184, baseType: !119, size: 16, offset: 7664)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !324, file: !4, line: 185, baseType: !119, size: 16, offset: 7680)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !324, file: !4, line: 186, baseType: !119, size: 16, offset: 7696)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !324, file: !4, line: 187, baseType: !119, size: 16, offset: 7712)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !324, file: !4, line: 188, baseType: !106, size: 8, offset: 7728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !324, file: !4, line: 189, baseType: !106, size: 8, offset: 7736)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !324, file: !4, line: 192, baseType: !20, size: 32, offset: 7744)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !324, file: !4, line: 192, baseType: !20, size: 32, offset: 7776)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !324, file: !4, line: 192, baseType: !20, size: 32, offset: 7808)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !324, file: !4, line: 192, baseType: !20, size: 32, offset: 7840)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !324, file: !4, line: 194, baseType: !20, size: 32, offset: 7872)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !324, file: !4, line: 202, baseType: !66, size: 32, offset: 7904)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !324, file: !4, line: 202, baseType: !66, size: 32, offset: 7936)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !324, file: !4, line: 202, baseType: !66, size: 32, offset: 7968)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !324, file: !4, line: 211, baseType: !66, size: 32, offset: 8000)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !324, file: !4, line: 212, baseType: !66, size: 32, offset: 8032)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !324, file: !4, line: 213, baseType: !66, size: 32, offset: 8064)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !324, file: !4, line: 214, baseType: !66, size: 32, offset: 8096)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !324, file: !4, line: 215, baseType: !66, size: 32, offset: 8128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !324, file: !4, line: 216, baseType: !66, size: 32, offset: 8160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !324, file: !4, line: 219, baseType: !66, size: 32, offset: 8192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !324, file: !4, line: 220, baseType: !66, size: 32, offset: 8224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !324, file: !4, line: 221, baseType: !66, size: 32, offset: 8256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !324, file: !4, line: 224, baseType: !495, size: 16, offset: 8288)
!495 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !324, file: !4, line: 224, baseType: !495, size: 16, offset: 8304)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !324, file: !4, line: 226, baseType: !119, size: 16, offset: 8320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !324, file: !4, line: 228, baseType: !106, size: 8, offset: 8336)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !324, file: !4, line: 229, baseType: !106, size: 8, offset: 8344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !324, file: !4, line: 231, baseType: !119, size: 16, offset: 8352)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !324, file: !4, line: 232, baseType: !106, size: 8, offset: 8368)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !324, file: !4, line: 233, baseType: !106, size: 8, offset: 8376)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !324, file: !4, line: 234, baseType: !66, size: 32, offset: 8384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !324, file: !4, line: 235, baseType: !66, size: 32, offset: 8416)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !324, file: !4, line: 237, baseType: !145, size: 128, offset: 8448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !324, file: !4, line: 238, baseType: !145, size: 128, offset: 8576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !324, file: !4, line: 239, baseType: !145, size: 128, offset: 8704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !324, file: !4, line: 240, baseType: !145, size: 128, offset: 8832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !324, file: !4, line: 242, baseType: !66, size: 32, offset: 8960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !324, file: !4, line: 244, baseType: !119, size: 16, offset: 8992)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !324, file: !4, line: 245, baseType: !495, size: 16, offset: 9008)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !324, file: !4, line: 246, baseType: !270, size: 128, offset: 9024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !324, file: !4, line: 248, baseType: !20, size: 32, offset: 9152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !324, file: !4, line: 249, baseType: !20, size: 32, offset: 9184)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !324, file: !4, line: 251, baseType: !516, size: 64, offset: 9216)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !4, line: 251, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !324, file: !4, line: 253, baseType: !106, size: 8, offset: 9280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !324, file: !4, line: 254, baseType: !106, size: 8, offset: 9288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !324, file: !4, line: 255, baseType: !119, size: 16, offset: 9296)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !324, file: !4, line: 256, baseType: !65, size: 96, offset: 9312)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !324, file: !4, line: 258, baseType: !145, size: 128, offset: 9408)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !324, file: !4, line: 259, baseType: !145, size: 128, offset: 9536)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !324, file: !4, line: 260, baseType: !145, size: 128, offset: 9664)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !324, file: !4, line: 261, baseType: !145, size: 128, offset: 9792)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !324, file: !4, line: 263, baseType: !527, size: 64, offset: 9920)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !4, line: 52, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !324, file: !4, line: 264, baseType: !530, size: 64, offset: 9984)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !4, line: 53, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !324, file: !4, line: 265, baseType: !533, size: 64, offset: 10048)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !535, line: 51, size: 1216, elements: !536)
!535 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!536 = !{!537, !538, !539, !540}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !534, file: !535, line: 52, baseType: !85, size: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !534, file: !535, line: 54, baseType: !145, size: 128, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !534, file: !535, line: 59, baseType: !5, size: 32, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !534, file: !535, line: 60, baseType: !65, size: 96, offset: 1120)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !324, file: !4, line: 267, baseType: !106, size: 8, offset: 10112)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !324, file: !4, line: 268, baseType: !106, size: 8, offset: 10120)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !324, file: !4, line: 269, baseType: !119, size: 16, offset: 10128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !324, file: !4, line: 270, baseType: !66, size: 32, offset: 10144)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !324, file: !4, line: 272, baseType: !546, size: 64, offset: 10176)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !4, line: 54, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !324, file: !4, line: 275, baseType: !549, size: 64, offset: 10240)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !4, line: 275, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !324, file: !4, line: 277, baseType: !552, size: 64, offset: 10304)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 56, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !324, file: !4, line: 277, baseType: !552, size: 64, offset: 10368)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !324, file: !4, line: 278, baseType: !556, size: 64, offset: 10432)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !557, line: 27, baseType: !558)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !559, line: 45, baseType: !560)
!559 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!560 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !324, file: !4, line: 279, baseType: !556, size: 64, offset: 10496)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !324, file: !4, line: 280, baseType: !5, size: 32, offset: 10560)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !324, file: !4, line: 281, baseType: !5, size: 32, offset: 10592)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !324, file: !4, line: 283, baseType: !145, size: 128, offset: 10624)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !324, file: !4, line: 284, baseType: !145, size: 128, offset: 10752)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !324, file: !4, line: 285, baseType: !567, size: 64, offset: 10880)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !324, file: !4, line: 287, baseType: !569, size: 64, offset: 10944)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !4, line: 59, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !324, file: !4, line: 288, baseType: !572, size: 64, offset: 11008)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !4, line: 288, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !324, file: !4, line: 290, baseType: !575, size: 64, offset: 11072)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 2)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !324, file: !4, line: 291, baseType: !579, size: 64, offset: 11136)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !581, line: 65, baseType: !582)
!581 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !581, line: 50, size: 320, elements: !583)
!583 = !{!584, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !582, file: !581, line: 51, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !19, line: 1216, size: 39680, elements: !587)
!587 = !{!588, !589, !590, !591, !690, !691, !692, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !719, !1058, !1061, !1351, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1373, !1374, !1375, !1376, !1377, !1385, !1452, !1459, !1460, !1467, !1470, !1471, !1472, !1473, !1474, !1475}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !586, file: !19, line: 1217, baseType: !85, size: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !586, file: !19, line: 1218, baseType: !156, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !586, file: !19, line: 1220, baseType: !323, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !586, file: !19, line: 1221, baseType: !592, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !594, line: 52, size: 4224, elements: !595)
!594 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !671, !687}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !593, file: !594, line: 53, baseType: !85, size: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !593, file: !594, line: 54, baseType: !156, size: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !593, file: !594, line: 56, baseType: !119, size: 16, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !593, file: !594, line: 56, baseType: !119, size: 16, offset: 1040)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !593, file: !594, line: 57, baseType: !119, size: 16, offset: 1056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !593, file: !594, line: 57, baseType: !119, size: 16, offset: 1072)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !593, file: !594, line: 59, baseType: !66, size: 32, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !593, file: !594, line: 59, baseType: !66, size: 32, offset: 1120)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !593, file: !594, line: 59, baseType: !66, size: 32, offset: 1152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !593, file: !594, line: 60, baseType: !66, size: 32, offset: 1184)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !593, file: !594, line: 60, baseType: !66, size: 32, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !593, file: !594, line: 60, baseType: !66, size: 32, offset: 1248)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !593, file: !594, line: 61, baseType: !66, size: 32, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !593, file: !594, line: 61, baseType: !66, size: 32, offset: 1312)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !593, file: !594, line: 61, baseType: !66, size: 32, offset: 1344)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !593, file: !594, line: 68, baseType: !66, size: 32, offset: 1376)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !593, file: !594, line: 68, baseType: !66, size: 32, offset: 1408)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !593, file: !594, line: 68, baseType: !66, size: 32, offset: 1440)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !593, file: !594, line: 69, baseType: !66, size: 32, offset: 1472)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !593, file: !594, line: 69, baseType: !66, size: 32, offset: 1504)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !593, file: !594, line: 74, baseType: !66, size: 32, offset: 1536)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !593, file: !594, line: 79, baseType: !66, size: 32, offset: 1568)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !593, file: !594, line: 81, baseType: !119, size: 16, offset: 1600)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !593, file: !594, line: 91, baseType: !119, size: 16, offset: 1616)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !593, file: !594, line: 92, baseType: !119, size: 16, offset: 1632)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !593, file: !594, line: 93, baseType: !119, size: 16, offset: 1648)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !593, file: !594, line: 94, baseType: !119, size: 16, offset: 1664)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !593, file: !594, line: 94, baseType: !119, size: 16, offset: 1680)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !593, file: !594, line: 94, baseType: !119, size: 16, offset: 1696)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !593, file: !594, line: 94, baseType: !119, size: 16, offset: 1712)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !593, file: !594, line: 96, baseType: !66, size: 32, offset: 1728)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !593, file: !594, line: 96, baseType: !66, size: 32, offset: 1760)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !593, file: !594, line: 96, baseType: !66, size: 32, offset: 1792)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !593, file: !594, line: 96, baseType: !66, size: 32, offset: 1824)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !593, file: !594, line: 98, baseType: !66, size: 32, offset: 1856)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !593, file: !594, line: 98, baseType: !66, size: 32, offset: 1888)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !593, file: !594, line: 98, baseType: !66, size: 32, offset: 1920)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !593, file: !594, line: 98, baseType: !66, size: 32, offset: 1952)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !593, file: !594, line: 99, baseType: !66, size: 32, offset: 1984)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !593, file: !594, line: 99, baseType: !66, size: 32, offset: 2016)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !593, file: !594, line: 100, baseType: !66, size: 32, offset: 2048)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !593, file: !594, line: 100, baseType: !66, size: 32, offset: 2080)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !593, file: !594, line: 103, baseType: !119, size: 16, offset: 2112)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !593, file: !594, line: 103, baseType: !119, size: 16, offset: 2128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !593, file: !594, line: 103, baseType: !119, size: 16, offset: 2144)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !593, file: !594, line: 103, baseType: !119, size: 16, offset: 2160)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !593, file: !594, line: 106, baseType: !66, size: 32, offset: 2176)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !593, file: !594, line: 106, baseType: !66, size: 32, offset: 2208)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !593, file: !594, line: 106, baseType: !66, size: 32, offset: 2240)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !593, file: !594, line: 106, baseType: !66, size: 32, offset: 2272)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !593, file: !594, line: 107, baseType: !119, size: 16, offset: 2304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !593, file: !594, line: 107, baseType: !119, size: 16, offset: 2320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !593, file: !594, line: 107, baseType: !119, size: 16, offset: 2336)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !593, file: !594, line: 107, baseType: !119, size: 16, offset: 2352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !593, file: !594, line: 108, baseType: !66, size: 32, offset: 2368)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !593, file: !594, line: 108, baseType: !66, size: 32, offset: 2400)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !593, file: !594, line: 109, baseType: !66, size: 32, offset: 2432)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !593, file: !594, line: 109, baseType: !66, size: 32, offset: 2464)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !593, file: !594, line: 110, baseType: !66, size: 32, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !593, file: !594, line: 110, baseType: !66, size: 32, offset: 2528)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !593, file: !594, line: 110, baseType: !66, size: 32, offset: 2560)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !593, file: !594, line: 111, baseType: !119, size: 16, offset: 2592)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !593, file: !594, line: 111, baseType: !119, size: 16, offset: 2608)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !593, file: !594, line: 112, baseType: !119, size: 16, offset: 2624)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !593, file: !594, line: 112, baseType: !119, size: 16, offset: 2640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !593, file: !594, line: 112, baseType: !119, size: 16, offset: 2656)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !594, line: 115, baseType: !119, size: 16, offset: 2672)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !593, file: !594, line: 118, baseType: !71, size: 64, offset: 2688)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !593, file: !594, line: 118, baseType: !71, size: 64, offset: 2752)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !593, file: !594, line: 121, baseType: !343, size: 64, offset: 2816)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !593, file: !594, line: 122, baseType: !314, size: 1152, offset: 2880)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !593, file: !594, line: 123, baseType: !119, size: 16, offset: 4032)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !593, file: !594, line: 123, baseType: !119, size: 16, offset: 4048)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !593, file: !594, line: 123, baseType: !670, size: 32, offset: 4064)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !593, file: !594, line: 126, baseType: !672, size: 64, offset: 4096)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !86, line: 159, size: 448, elements: !674)
!674 = !{!675, !677, !678, !679, !680, !683}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !673, file: !86, line: 161, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !673, file: !86, line: 162, baseType: !676, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !673, file: !86, line: 163, baseType: !670, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !673, file: !86, line: 164, baseType: !670, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !673, file: !86, line: 165, baseType: !681, size: 128, offset: 192)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 128, elements: !576)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !673, file: !86, line: 166, baseType: !684, size: 128, offset: 320)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 128, elements: !576)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !86, line: 46, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !593, file: !594, line: 129, baseType: !688, size: 64, offset: 4160)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !82, line: 47, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !586, file: !19, line: 1223, baseType: !585, size: 64, offset: 1152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !586, file: !19, line: 1225, baseType: !145, size: 128, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !586, file: !19, line: 1226, baseType: !693, size: 64, offset: 1344)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !19, line: 69, size: 320, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !694, file: !19, line: 70, baseType: !693, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !694, file: !19, line: 70, baseType: !693, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !694, file: !19, line: 71, baseType: !5, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !694, file: !19, line: 71, baseType: !5, size: 32, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !19, line: 72, baseType: !20, size: 32, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !694, file: !19, line: 73, baseType: !119, size: 16, offset: 224)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !694, file: !19, line: 73, baseType: !119, size: 16, offset: 240)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !694, file: !19, line: 74, baseType: !323, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !586, file: !19, line: 1227, baseType: !323, size: 64, offset: 1408)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !586, file: !19, line: 1229, baseType: !65, size: 96, offset: 1472)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !586, file: !19, line: 1230, baseType: !65, size: 96, offset: 1568)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !586, file: !19, line: 1231, baseType: !65, size: 96, offset: 1664)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !586, file: !19, line: 1231, baseType: !65, size: 96, offset: 1760)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !586, file: !19, line: 1233, baseType: !5, size: 32, offset: 1856)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !586, file: !19, line: 1234, baseType: !20, size: 32, offset: 1888)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !586, file: !19, line: 1235, baseType: !5, size: 32, offset: 1920)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !586, file: !19, line: 1237, baseType: !119, size: 16, offset: 1952)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !586, file: !19, line: 1239, baseType: !106, size: 8, offset: 1968)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !586, file: !19, line: 1240, baseType: !288, size: 8, offset: 1976)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !586, file: !19, line: 1242, baseType: !688, size: 64, offset: 1984)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !586, file: !19, line: 1244, baseType: !717, size: 64, offset: 2048)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !19, line: 59, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !586, file: !19, line: 1246, baseType: !720, size: 64, offset: 2112)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !19, line: 1067, size: 5184, elements: !722)
!722 = !{!723, !753, !754, !769, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !791, !930, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !979, !980, !981, !982, !983, !984, !985, !986, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1041}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !721, file: !19, line: 1068, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !19, line: 934, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !19, line: 925, size: 576, elements: !727)
!727 = !{!728, !745, !746, !747, !748, !749, !752}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !726, file: !19, line: 926, baseType: !729, size: 320)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !19, line: 830, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !19, line: 813, size: 320, elements: !731)
!731 = !{!732, !735, !738, !739, !742, !743, !744}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !730, file: !19, line: 814, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !19, line: 51, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !730, file: !19, line: 815, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !19, line: 815, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !730, file: !19, line: 818, baseType: !90, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !730, file: !19, line: 819, baseType: !740, size: 32, offset: 192)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 32, elements: !271)
!741 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !730, file: !19, line: 822, baseType: !20, size: 32, offset: 224)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !730, file: !19, line: 826, baseType: !20, size: 32, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !730, file: !19, line: 829, baseType: !20, size: 32, offset: 288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !726, file: !19, line: 928, baseType: !119, size: 16, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !19, line: 928, baseType: !119, size: 16, offset: 336)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !726, file: !19, line: 929, baseType: !20, size: 32, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !726, file: !19, line: 930, baseType: !682, size: 64, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !726, file: !19, line: 931, baseType: !750, size: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !19, line: 931, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !726, file: !19, line: 933, baseType: !90, size: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !721, file: !19, line: 1069, baseType: !724, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !721, file: !19, line: 1070, baseType: !755, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !19, line: 916, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !19, line: 891, size: 704, elements: !758)
!758 = !{!759, !760, !761, !763, !764, !765, !766, !767, !768}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !757, file: !19, line: 892, baseType: !729, size: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !757, file: !19, line: 896, baseType: !20, size: 32, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !757, file: !19, line: 900, baseType: !762, size: 96, offset: 352)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !67)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !757, file: !19, line: 903, baseType: !66, size: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !757, file: !19, line: 906, baseType: !20, size: 32, offset: 480)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !757, file: !19, line: 909, baseType: !66, size: 32, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !757, file: !19, line: 912, baseType: !66, size: 32, offset: 544)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !757, file: !19, line: 914, baseType: !323, size: 64, offset: 576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !757, file: !19, line: 915, baseType: !90, size: 64, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !721, file: !19, line: 1071, baseType: !770, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !19, line: 920, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !19, line: 918, size: 320, elements: !773)
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !772, file: !19, line: 919, baseType: !729, size: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !721, file: !19, line: 1075, baseType: !66, size: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !721, file: !19, line: 1077, baseType: !66, size: 32, offset: 288)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !721, file: !19, line: 1078, baseType: !66, size: 32, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !721, file: !19, line: 1079, baseType: !119, size: 16, offset: 352)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !721, file: !19, line: 1082, baseType: !119, size: 16, offset: 368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !721, file: !19, line: 1085, baseType: !106, size: 8, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !721, file: !19, line: 1086, baseType: !106, size: 8, offset: 392)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !721, file: !19, line: 1087, baseType: !106, size: 8, offset: 400)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !721, file: !19, line: 1088, baseType: !106, size: 8, offset: 408)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !721, file: !19, line: 1090, baseType: !66, size: 32, offset: 416)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !721, file: !19, line: 1093, baseType: !119, size: 16, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !721, file: !19, line: 1096, baseType: !106, size: 8, offset: 464)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !721, file: !19, line: 1098, baseType: !788, size: 40, offset: 472)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 40, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 5)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !721, file: !19, line: 1101, baseType: !792, size: 832, offset: 512)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !19, line: 836, size: 832, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802, !926, !927, !928, !929}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !792, file: !19, line: 837, baseType: !729, size: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !19, line: 839, baseType: !119, size: 16, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !792, file: !19, line: 839, baseType: !119, size: 16, offset: 336)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !792, file: !19, line: 842, baseType: !119, size: 16, offset: 352)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !792, file: !19, line: 842, baseType: !119, size: 16, offset: 368)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !792, file: !19, line: 843, baseType: !670, size: 32, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !792, file: !19, line: 845, baseType: !20, size: 32, offset: 416)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !792, file: !19, line: 847, baseType: !90, size: 64, offset: 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !792, file: !19, line: 848, baseType: !803, size: 64, offset: 512)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !581, line: 77, size: 15424, elements: !805)
!805 = !{!806, !807, !808, !811, !812, !815, !877, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !915, !916, !920}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !804, file: !581, line: 78, baseType: !85, size: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !581, line: 80, baseType: !105, size: 8192, offset: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !804, file: !581, line: 82, baseType: !809, size: 64, offset: 9152)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !581, line: 43, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !804, file: !581, line: 83, baseType: !685, size: 64, offset: 9216)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !804, file: !581, line: 86, baseType: !813, size: 64, offset: 9280)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !581, line: 41, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !804, file: !581, line: 87, baseType: !816, size: 64, offset: 9344)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !818, line: 110, size: 1152, elements: !819)
!818 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!819 = !{!820, !821, !822, !823, !824, !825, !826, !828, !829, !830, !839, !840, !841, !842, !844, !873, !874, !875, !876}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !817, file: !818, line: 111, baseType: !816, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !817, file: !818, line: 111, baseType: !816, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !817, file: !818, line: 114, baseType: !20, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !817, file: !818, line: 114, baseType: !20, size: 32, offset: 160)
