; ModuleID = 'blender/source/blender/editors/space_image/space_image.c'
source_filename = "blender/source/blender/editors/space_image/space_image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ARegion = type { %struct.ARegion*, %struct.ARegion*, %struct.View2D, %struct.rcti, %struct.rcti, i16, i16, i16, i16, i16, i16, float, i16, i16, i16, i16, i16, i16, i16, i16, %struct.ARegionType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmTimer*, i8*, i8* }
%struct.View2D = type { %struct.rctf, %struct.rctf, %struct.rcti, %struct.rcti, %struct.rcti, [2 x float], [2 x float], float, float, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, float*, i32, i32, %struct.SmoothView2DStore*, %struct.wmTimer* }
%struct.rctf = type { float, float, float, float }
%struct.SmoothView2DStore = type opaque
%struct.rcti = type { i32, i32, i32, i32 }

!1293 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!1294 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!1295 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!1296 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!1297 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!1298 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!1299 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!1300 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!1301 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!1302 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!1303 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!1304 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!1305 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!1306 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!1307 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!1308 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!1309 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!1310 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!1311 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!1312 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!1313 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!1314 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!1315 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!1316 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!1317 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!1318 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!1319 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!1320 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!1321 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!1322 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!1323 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!1324 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!1325 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!1326 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!1327 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!1328 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!1329 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!1330 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!1331 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!1332 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!1333 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!1334 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!1335 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!1336 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!1337 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!1338 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1339, line: 133, baseType: !7, size: 32, elements: !1340)
!1339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1340 = !{!1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350}
!1341 = !DIEnumerator(name: "IMA_FIELDS", value: 1, isUnsigned: true)
!1342 = !DIEnumerator(name: "IMA_STD_FIELD", value: 2, isUnsigned: true)
!1343 = !DIEnumerator(name: "IMA_DO_PREMUL", value: 4, isUnsigned: true)
!1344 = !DIEnumerator(name: "IMA_REFLECT", value: 16, isUnsigned: true)
!1345 = !DIEnumerator(name: "IMA_NOCOLLECT", value: 32, isUnsigned: true)
!1346 = !DIEnumerator(name: "IMA_OLD_PREMUL", value: 128, isUnsigned: true)
!1347 = !DIEnumerator(name: "IMA_USED_FOR_RENDER", value: 512, isUnsigned: true)
!1348 = !DIEnumerator(name: "IMA_USER_FRAME_IN_RANGE", value: 1024, isUnsigned: true)
!1349 = !DIEnumerator(name: "IMA_VIEW_AS_RENDER", value: 2048, isUnsigned: true)
!1350 = !DIEnumerator(name: "IMA_IGNORE_ALPHA", value: 4096, isUnsigned: true)
!1351 = !{!1352, !1353, !1358, !3001, !1404, !3207, !1375}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceImage", file: !18, line: 743, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceImage", file: !18, line: 710, size: 84672, elements: !1356)
!1356 = !{!1357, !1381, !1382, !1383, !1384, !1385, !1532, !2932, !2933, !2975, !2976, !2977, !2978, !2979, !2980, !2981, !2982, !2983, !2984, !2985, !2986, !2987, !2988, !2989, !2990, !2991, !2992}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1355, file: !18, line: 711, baseType: !1358, size: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !18, line: 91, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !18, line: 85, size: 448, elements: !1361)
!1361 = !{!1362, !1364, !1365, !1372, !1374, !1376}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1360, file: !18, line: 86, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1360, file: !18, line: 86, baseType: !1363, size: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1360, file: !18, line: 87, baseType: !1366, size: 128, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1367, line: 71, baseType: !1368)
!1367 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1367, line: 69, size: 128, elements: !1369)
!1369 = !{!1370, !1371}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1368, file: !1367, line: 70, baseType: !1352, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1368, file: !1367, line: 70, baseType: !1352, size: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1360, file: !18, line: 88, baseType: !1373, size: 32, offset: 256)
!1373 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1360, file: !18, line: 89, baseType: !1375, size: 32, offset: 288)
!1375 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1360, file: !18, line: 90, baseType: !1377, size: 128, offset: 320)
!1377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1378, size: 128, elements: !1379)
!1378 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1379 = !{!1380}
!1380 = !DISubrange(count: 8)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1355, file: !18, line: 711, baseType: !1358, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1355, file: !18, line: 712, baseType: !1366, size: 128, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1355, file: !18, line: 713, baseType: !1373, size: 32, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1355, file: !18, line: 715, baseType: !1373, size: 32, offset: 288)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1355, file: !18, line: 717, baseType: !1386, size: 64, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1339, line: 77, size: 15424, elements: !1388)
!1388 = !{!1389, !1452, !1453, !1456, !1459, !1462, !1465, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1483, !1484, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1513, !1514, !1515, !1521, !1522, !1526}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1387, file: !1339, line: 78, baseType: !1390, size: 960)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1391, line: 130, baseType: !1392)
!1391 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1391, line: 117, size: 960, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1398, !1418, !1422, !1423, !1424, !1425, !1426}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1392, file: !1391, line: 118, baseType: !1352, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1392, file: !1391, line: 118, baseType: !1352, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1392, file: !1391, line: 119, baseType: !1397, size: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1392, file: !1391, line: 120, baseType: !1399, size: 64, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1391, line: 136, size: 17600, elements: !1401)
!1401 = !{!1402, !1403, !1405, !1408, !1413, !1414, !1415}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1400, file: !1391, line: 137, baseType: !1390, size: 960)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1400, file: !1391, line: 138, baseType: !1404, size: 64, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1400, file: !1391, line: 139, baseType: !1406, size: 64, offset: 1024)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1391, line: 43, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1400, file: !1391, line: 140, baseType: !1409, size: 8192, offset: 1088)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 8192, elements: !1411)
!1410 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1411 = !{!1412}
!1412 = !DISubrange(count: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1400, file: !1391, line: 141, baseType: !1409, size: 8192, offset: 9280)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1400, file: !1391, line: 148, baseType: !1399, size: 64, offset: 17472)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1400, file: !1391, line: 150, baseType: !1416, size: 64, offset: 17536)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1391, line: 45, flags: DIFlagFwdDecl)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1392, file: !1391, line: 121, baseType: !1419, size: 528, offset: 256)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 528, elements: !1420)
!1420 = !{!1421}
!1421 = !DISubrange(count: 66)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1392, file: !1391, line: 126, baseType: !1378, size: 16, offset: 784)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1392, file: !1391, line: 127, baseType: !1373, size: 32, offset: 800)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1392, file: !1391, line: 128, baseType: !1373, size: 32, offset: 832)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1392, file: !1391, line: 128, baseType: !1373, size: 32, offset: 864)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1392, file: !1391, line: 129, baseType: !1427, size: 64, offset: 896)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1391, line: 75, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1391, line: 62, size: 1024, elements: !1430)
!1430 = !{!1431, !1433, !1434, !1435, !1436, !1437, !1441, !1442, !1450, !1451}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1429, file: !1391, line: 63, baseType: !1432, size: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1429, file: !1391, line: 63, baseType: !1432, size: 64, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1429, file: !1391, line: 64, baseType: !1410, size: 8, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1429, file: !1391, line: 64, baseType: !1410, size: 8, offset: 136)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1429, file: !1391, line: 65, baseType: !1378, size: 16, offset: 144)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1429, file: !1391, line: 66, baseType: !1438, size: 512, offset: 160)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 512, elements: !1439)
!1439 = !{!1440}
!1440 = !DISubrange(count: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1429, file: !1391, line: 67, baseType: !1373, size: 32, offset: 672)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1429, file: !1391, line: 69, baseType: !1443, size: 256, offset: 704)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1391, line: 60, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1391, line: 48, size: 256, elements: !1445)
!1445 = !{!1446, !1447, !1448, !1449}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1444, file: !1391, line: 49, baseType: !1352, size: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1444, file: !1391, line: 58, baseType: !1366, size: 128, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1444, file: !1391, line: 59, baseType: !1373, size: 32, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1444, file: !1391, line: 59, baseType: !1373, size: 32, offset: 224)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1429, file: !1391, line: 70, baseType: !1373, size: 32, offset: 960)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1429, file: !1391, line: 74, baseType: !1373, size: 32, offset: 992)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1387, file: !1339, line: 80, baseType: !1409, size: 8192, offset: 960)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1387, file: !1339, line: 82, baseType: !1454, size: 64, offset: 9152)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1339, line: 43, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1387, file: !1339, line: 83, baseType: !1457, size: 64, offset: 9216)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1391, line: 46, flags: DIFlagFwdDecl)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1387, file: !1339, line: 86, baseType: !1460, size: 64, offset: 9280)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1339, line: 41, flags: DIFlagFwdDecl)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1387, file: !1339, line: 87, baseType: !1463, size: 64, offset: 9344)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1339, line: 44, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1387, file: !1339, line: 89, baseType: !1466, size: 512, offset: 9408)
!1466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1463, size: 512, elements: !1379)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1387, file: !1339, line: 90, baseType: !1378, size: 16, offset: 9920)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1387, file: !1339, line: 90, baseType: !1378, size: 16, offset: 9936)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1387, file: !1339, line: 92, baseType: !1378, size: 16, offset: 9952)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1387, file: !1339, line: 92, baseType: !1378, size: 16, offset: 9968)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1387, file: !1339, line: 93, baseType: !1378, size: 16, offset: 9984)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1387, file: !1339, line: 93, baseType: !1378, size: 16, offset: 10000)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1387, file: !1339, line: 94, baseType: !1373, size: 32, offset: 10016)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1387, file: !1339, line: 97, baseType: !1378, size: 16, offset: 10048)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1387, file: !1339, line: 97, baseType: !1378, size: 16, offset: 10064)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1387, file: !1339, line: 98, baseType: !1378, size: 16, offset: 10080)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1387, file: !1339, line: 98, baseType: !1378, size: 16, offset: 10096)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1387, file: !1339, line: 99, baseType: !1378, size: 16, offset: 10112)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1387, file: !1339, line: 99, baseType: !1378, size: 16, offset: 10128)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1387, file: !1339, line: 100, baseType: !7, size: 32, offset: 10144)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1387, file: !1339, line: 101, baseType: !1482, size: 64, offset: 10176)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1387, file: !1339, line: 103, baseType: !1416, size: 64, offset: 10240)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1387, file: !1339, line: 104, baseType: !1485, size: 64, offset: 10304)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1391, line: 159, size: 448, elements: !1487)
!1487 = !{!1488, !1492, !1493, !1495, !1496, !1498}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1486, file: !1391, line: 161, baseType: !1489, size: 64)
!1489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1490)
!1490 = !{!1491}
!1491 = !DISubrange(count: 2)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1486, file: !1391, line: 162, baseType: !1489, size: 64, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1486, file: !1391, line: 163, baseType: !1494, size: 32, offset: 128)
!1494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1378, size: 32, elements: !1490)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1486, file: !1391, line: 164, baseType: !1494, size: 32, offset: 160)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1486, file: !1391, line: 165, baseType: !1497, size: 128, offset: 192)
!1497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1482, size: 128, elements: !1490)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1486, file: !1391, line: 166, baseType: !1499, size: 128, offset: 320)
!1499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 128, elements: !1490)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1387, file: !1339, line: 107, baseType: !1375, size: 32, offset: 10368)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1387, file: !1339, line: 108, baseType: !1373, size: 32, offset: 10400)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1387, file: !1339, line: 109, baseType: !1378, size: 16, offset: 10432)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1387, file: !1339, line: 110, baseType: !1378, size: 16, offset: 10448)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1387, file: !1339, line: 113, baseType: !1373, size: 32, offset: 10464)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1387, file: !1339, line: 113, baseType: !1373, size: 32, offset: 10496)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1387, file: !1339, line: 114, baseType: !1410, size: 8, offset: 10528)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1387, file: !1339, line: 114, baseType: !1410, size: 8, offset: 10536)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1387, file: !1339, line: 115, baseType: !1378, size: 16, offset: 10544)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1387, file: !1339, line: 116, baseType: !1510, size: 128, offset: 10560)
!1510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 128, elements: !1511)
!1511 = !{!1512}
!1512 = !DISubrange(count: 4)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1387, file: !1339, line: 119, baseType: !1375, size: 32, offset: 10688)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1387, file: !1339, line: 119, baseType: !1375, size: 32, offset: 10720)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1387, file: !1339, line: 122, baseType: !1516, size: 512, offset: 10752)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1517, line: 182, baseType: !1518)
!1517 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1517, line: 180, size: 512, elements: !1519)
!1519 = !{!1520}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1518, file: !1517, line: 181, baseType: !1438, size: 512)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1387, file: !1339, line: 123, baseType: !1410, size: 8, offset: 11264)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1387, file: !1339, line: 125, baseType: !1523, size: 56, offset: 11272)
!1523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 56, elements: !1524)
!1524 = !{!1525}
!1525 = !DISubrange(count: 7)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1387, file: !1339, line: 126, baseType: !1527, size: 4096, offset: 11328)
!1527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1528, size: 4096, elements: !1379)
!1528 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1339, line: 69, baseType: !1529)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1339, line: 67, size: 512, elements: !1530)
!1530 = !{!1531}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1529, file: !1339, line: 68, baseType: !1438, size: 512)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1355, file: !18, line: 718, baseType: !1533, size: 320, offset: 384)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1339, line: 50, size: 320, elements: !1534)
!1534 = !{!1535, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1533, file: !1339, line: 51, baseType: !1536, size: 64)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1538, line: 1216, size: 39680, elements: !1539)
!1538 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1539 = !{!1540, !1541, !1545, !1813, !1816, !1817, !1818, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1844, !1919, !2277, !2502, !2505, !2794, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2816, !2817, !2818, !2819, !2820, !2828, !2895, !2902, !2903, !2910, !2911, !2912, !2913, !2914, !2915, !2916}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1537, file: !1538, line: 1217, baseType: !1390, size: 960)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1537, file: !1538, line: 1218, baseType: !1542, size: 64, offset: 960)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64)
!1543 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1544, line: 39, flags: DIFlagFwdDecl)
!1544 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1537, file: !1538, line: 1220, baseType: !1546, size: 64, offset: 1024)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !265, line: 115, size: 11392, elements: !1548)
!1548 = !{!1549, !1550, !1551, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1568, !1578, !1592, !1593, !1637, !1638, !1641, !1642, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1668, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1757, !1760, !1763, !1764, !1765, !1766, !1767, !1770, !1773, !1776, !1777, !1783, !1784, !1785, !1786, !1787, !1788, !1790, !1793, !1796, !1798, !1801, !1802}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1547, file: !265, line: 116, baseType: !1390, size: 960)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1547, file: !265, line: 117, baseType: !1542, size: 64, offset: 960)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1547, file: !265, line: 119, baseType: !1552, size: 64, offset: 1024)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64)
!1553 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !265, line: 57, flags: DIFlagFwdDecl)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1547, file: !265, line: 121, baseType: !1378, size: 16, offset: 1088)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1547, file: !265, line: 121, baseType: !1378, size: 16, offset: 1104)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1547, file: !265, line: 122, baseType: !1373, size: 32, offset: 1120)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1547, file: !265, line: 122, baseType: !1373, size: 32, offset: 1152)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1547, file: !265, line: 122, baseType: !1373, size: 32, offset: 1184)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1547, file: !265, line: 123, baseType: !1438, size: 512, offset: 1216)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1547, file: !265, line: 124, baseType: !1546, size: 64, offset: 1728)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1547, file: !265, line: 124, baseType: !1546, size: 64, offset: 1792)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1547, file: !265, line: 127, baseType: !1546, size: 64, offset: 1856)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1547, file: !265, line: 127, baseType: !1546, size: 64, offset: 1920)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1547, file: !265, line: 127, baseType: !1546, size: 64, offset: 1984)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1547, file: !265, line: 128, baseType: !1566, size: 64, offset: 2048)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1567 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1544, line: 41, flags: DIFlagFwdDecl)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1547, file: !265, line: 130, baseType: !1569, size: 64, offset: 2112)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !265, line: 97, size: 832, elements: !1571)
!1571 = !{!1572, !1576, !1577}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1570, file: !265, line: 98, baseType: !1573, size: 768)
!1573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 768, elements: !1574)
!1574 = !{!1380, !1575}
!1575 = !DISubrange(count: 3)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1570, file: !265, line: 99, baseType: !1373, size: 32, offset: 768)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1570, file: !265, line: 99, baseType: !1373, size: 32, offset: 800)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1547, file: !265, line: 131, baseType: !1579, size: 64, offset: 2176)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1581, line: 486, size: 1600, elements: !1582)
!1581 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1582 = !{!1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1580, file: !1581, line: 487, baseType: !1390, size: 960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1580, file: !1581, line: 489, baseType: !1366, size: 128, offset: 960)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1580, file: !1581, line: 490, baseType: !1366, size: 128, offset: 1088)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1580, file: !1581, line: 491, baseType: !1366, size: 128, offset: 1216)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1580, file: !1581, line: 492, baseType: !1366, size: 128, offset: 1344)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1580, file: !1581, line: 494, baseType: !1373, size: 32, offset: 1472)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1580, file: !1581, line: 495, baseType: !1373, size: 32, offset: 1504)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1580, file: !1581, line: 497, baseType: !1373, size: 32, offset: 1536)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1580, file: !1581, line: 498, baseType: !1373, size: 32, offset: 1568)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1547, file: !265, line: 132, baseType: !1579, size: 64, offset: 2240)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1547, file: !265, line: 133, baseType: !1594, size: 64, offset: 2304)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1581, line: 334, size: 1728, elements: !1596)
!1596 = !{!1597, !1598, !1602, !1603, !1604, !1605, !1606, !1607, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1636}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1595, file: !1581, line: 335, baseType: !1366, size: 128)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1595, file: !1581, line: 336, baseType: !1599, size: 64, offset: 128)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64)
!1600 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1601, line: 51, flags: DIFlagFwdDecl)
!1601 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1595, file: !1581, line: 338, baseType: !1378, size: 16, offset: 192)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1595, file: !1581, line: 338, baseType: !1378, size: 16, offset: 208)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1595, file: !1581, line: 339, baseType: !7, size: 32, offset: 224)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1595, file: !1581, line: 340, baseType: !1373, size: 32, offset: 256)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1595, file: !1581, line: 342, baseType: !1375, size: 32, offset: 288)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1595, file: !1581, line: 343, baseType: !1608, size: 96, offset: 320)
!1608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 96, elements: !1609)
!1609 = !{!1575}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1595, file: !1581, line: 344, baseType: !1608, size: 96, offset: 416)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1595, file: !1581, line: 347, baseType: !1366, size: 128, offset: 512)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1595, file: !1581, line: 349, baseType: !1373, size: 32, offset: 640)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1595, file: !1581, line: 350, baseType: !1373, size: 32, offset: 672)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1595, file: !1581, line: 351, baseType: !1352, size: 64, offset: 704)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1595, file: !1581, line: 352, baseType: !1352, size: 64, offset: 768)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1595, file: !1581, line: 354, baseType: !1617, size: 384, offset: 832)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1581, line: 116, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1581, line: 94, size: 384, elements: !1619)
!1619 = !{!1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1618, file: !1581, line: 96, baseType: !1373, size: 32)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1618, file: !1581, line: 96, baseType: !1373, size: 32, offset: 32)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1618, file: !1581, line: 97, baseType: !1373, size: 32, offset: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1618, file: !1581, line: 97, baseType: !1373, size: 32, offset: 96)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1618, file: !1581, line: 99, baseType: !1378, size: 16, offset: 128)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1618, file: !1581, line: 100, baseType: !1378, size: 16, offset: 144)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1618, file: !1581, line: 102, baseType: !1378, size: 16, offset: 160)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1618, file: !1581, line: 105, baseType: !1378, size: 16, offset: 176)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1618, file: !1581, line: 108, baseType: !1378, size: 16, offset: 192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1618, file: !1581, line: 109, baseType: !1378, size: 16, offset: 208)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1618, file: !1581, line: 111, baseType: !1378, size: 16, offset: 224)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1618, file: !1581, line: 112, baseType: !1378, size: 16, offset: 240)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1618, file: !1581, line: 114, baseType: !1373, size: 32, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1618, file: !1581, line: 114, baseType: !1373, size: 32, offset: 288)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1618, file: !1581, line: 115, baseType: !1373, size: 32, offset: 320)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1618, file: !1581, line: 115, baseType: !1373, size: 32, offset: 352)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1595, file: !1581, line: 355, baseType: !1438, size: 512, offset: 1216)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1547, file: !265, line: 134, baseType: !1352, size: 64, offset: 2368)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1547, file: !265, line: 136, baseType: !1639, size: 64, offset: 2432)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64)
!1640 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !265, line: 58, flags: DIFlagFwdDecl)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1547, file: !265, line: 138, baseType: !1617, size: 384, offset: 2496)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1547, file: !265, line: 139, baseType: !1643, size: 64, offset: 2880)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1581, line: 80, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1581, line: 72, size: 192, elements: !1646)
!1646 = !{!1647, !1654, !1655, !1656, !1657}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1645, file: !1581, line: 73, baseType: !1648, size: 64)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1581, line: 59, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1581, line: 56, size: 128, elements: !1651)
!1651 = !{!1652, !1653}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1650, file: !1581, line: 57, baseType: !1608, size: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1650, file: !1581, line: 58, baseType: !1373, size: 32, offset: 96)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1645, file: !1581, line: 74, baseType: !1373, size: 32, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1645, file: !1581, line: 76, baseType: !1373, size: 32, offset: 96)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1645, file: !1581, line: 77, baseType: !1373, size: 32, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1645, file: !1581, line: 79, baseType: !1373, size: 32, offset: 160)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1547, file: !265, line: 141, baseType: !1366, size: 128, offset: 2944)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1547, file: !265, line: 142, baseType: !1366, size: 128, offset: 3072)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1547, file: !265, line: 143, baseType: !1366, size: 128, offset: 3200)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1547, file: !265, line: 144, baseType: !1366, size: 128, offset: 3328)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1547, file: !265, line: 146, baseType: !1373, size: 32, offset: 3456)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1547, file: !265, line: 147, baseType: !1373, size: 32, offset: 3488)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1547, file: !265, line: 150, baseType: !1665, size: 64, offset: 3520)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64)
!1667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1544, line: 53, flags: DIFlagFwdDecl)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1547, file: !265, line: 151, baseType: !1669, size: 64, offset: 3584)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1547, file: !265, line: 152, baseType: !1373, size: 32, offset: 3648)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1547, file: !265, line: 153, baseType: !1373, size: 32, offset: 3680)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1547, file: !265, line: 156, baseType: !1608, size: 96, offset: 3712)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1547, file: !265, line: 156, baseType: !1608, size: 96, offset: 3808)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1547, file: !265, line: 156, baseType: !1608, size: 96, offset: 3904)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1547, file: !265, line: 157, baseType: !1608, size: 96, offset: 4000)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1547, file: !265, line: 158, baseType: !1608, size: 96, offset: 4096)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1547, file: !265, line: 159, baseType: !1608, size: 96, offset: 4192)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1547, file: !265, line: 160, baseType: !1608, size: 96, offset: 4288)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1547, file: !265, line: 160, baseType: !1608, size: 96, offset: 4384)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1547, file: !265, line: 161, baseType: !1510, size: 128, offset: 4480)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1547, file: !265, line: 161, baseType: !1510, size: 128, offset: 4608)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1547, file: !265, line: 162, baseType: !1608, size: 96, offset: 4736)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1547, file: !265, line: 162, baseType: !1608, size: 96, offset: 4832)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1547, file: !265, line: 163, baseType: !1375, size: 32, offset: 4928)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1547, file: !265, line: 163, baseType: !1375, size: 32, offset: 4960)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1547, file: !265, line: 164, baseType: !1687, size: 512, offset: 4992)
!1687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 512, elements: !1688)
!1688 = !{!1512, !1512}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1547, file: !265, line: 165, baseType: !1687, size: 512, offset: 5504)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1547, file: !265, line: 166, baseType: !1687, size: 512, offset: 6016)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1547, file: !265, line: 167, baseType: !1687, size: 512, offset: 6528)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1547, file: !265, line: 176, baseType: !1687, size: 512, offset: 7040)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1547, file: !265, line: 178, baseType: !7, size: 32, offset: 7552)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1547, file: !265, line: 180, baseType: !1378, size: 16, offset: 7584)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1547, file: !265, line: 181, baseType: !1378, size: 16, offset: 7600)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1547, file: !265, line: 183, baseType: !1378, size: 16, offset: 7616)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1547, file: !265, line: 183, baseType: !1378, size: 16, offset: 7632)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1547, file: !265, line: 184, baseType: !1378, size: 16, offset: 7648)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1547, file: !265, line: 184, baseType: !1378, size: 16, offset: 7664)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1547, file: !265, line: 185, baseType: !1378, size: 16, offset: 7680)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1547, file: !265, line: 186, baseType: !1378, size: 16, offset: 7696)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1547, file: !265, line: 187, baseType: !1378, size: 16, offset: 7712)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1547, file: !265, line: 188, baseType: !1410, size: 8, offset: 7728)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1547, file: !265, line: 189, baseType: !1410, size: 8, offset: 7736)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1547, file: !265, line: 192, baseType: !1373, size: 32, offset: 7744)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1547, file: !265, line: 192, baseType: !1373, size: 32, offset: 7776)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1547, file: !265, line: 192, baseType: !1373, size: 32, offset: 7808)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1547, file: !265, line: 192, baseType: !1373, size: 32, offset: 7840)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1547, file: !265, line: 194, baseType: !1373, size: 32, offset: 7872)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1547, file: !265, line: 202, baseType: !1375, size: 32, offset: 7904)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1547, file: !265, line: 202, baseType: !1375, size: 32, offset: 7936)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1547, file: !265, line: 202, baseType: !1375, size: 32, offset: 7968)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1547, file: !265, line: 211, baseType: !1375, size: 32, offset: 8000)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1547, file: !265, line: 212, baseType: !1375, size: 32, offset: 8032)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1547, file: !265, line: 213, baseType: !1375, size: 32, offset: 8064)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1547, file: !265, line: 214, baseType: !1375, size: 32, offset: 8096)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1547, file: !265, line: 215, baseType: !1375, size: 32, offset: 8128)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1547, file: !265, line: 216, baseType: !1375, size: 32, offset: 8160)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1547, file: !265, line: 219, baseType: !1375, size: 32, offset: 8192)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1547, file: !265, line: 220, baseType: !1375, size: 32, offset: 8224)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1547, file: !265, line: 221, baseType: !1375, size: 32, offset: 8256)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1547, file: !265, line: 224, baseType: !1723, size: 16, offset: 8288)
!1723 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1547, file: !265, line: 224, baseType: !1723, size: 16, offset: 8304)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1547, file: !265, line: 226, baseType: !1378, size: 16, offset: 8320)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1547, file: !265, line: 228, baseType: !1410, size: 8, offset: 8336)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1547, file: !265, line: 229, baseType: !1410, size: 8, offset: 8344)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1547, file: !265, line: 231, baseType: !1378, size: 16, offset: 8352)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1547, file: !265, line: 232, baseType: !1410, size: 8, offset: 8368)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1547, file: !265, line: 233, baseType: !1410, size: 8, offset: 8376)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1547, file: !265, line: 234, baseType: !1375, size: 32, offset: 8384)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1547, file: !265, line: 235, baseType: !1375, size: 32, offset: 8416)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1547, file: !265, line: 237, baseType: !1366, size: 128, offset: 8448)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1547, file: !265, line: 238, baseType: !1366, size: 128, offset: 8576)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1547, file: !265, line: 239, baseType: !1366, size: 128, offset: 8704)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1547, file: !265, line: 240, baseType: !1366, size: 128, offset: 8832)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1547, file: !265, line: 242, baseType: !1375, size: 32, offset: 8960)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1547, file: !265, line: 244, baseType: !1378, size: 16, offset: 8992)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1547, file: !265, line: 245, baseType: !1723, size: 16, offset: 9008)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1547, file: !265, line: 246, baseType: !1510, size: 128, offset: 9024)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1547, file: !265, line: 248, baseType: !1373, size: 32, offset: 9152)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1547, file: !265, line: 249, baseType: !1373, size: 32, offset: 9184)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1547, file: !265, line: 251, baseType: !1744, size: 64, offset: 9216)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64)
!1745 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !265, line: 251, flags: DIFlagFwdDecl)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1547, file: !265, line: 253, baseType: !1410, size: 8, offset: 9280)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1547, file: !265, line: 254, baseType: !1410, size: 8, offset: 9288)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1547, file: !265, line: 255, baseType: !1378, size: 16, offset: 9296)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1547, file: !265, line: 256, baseType: !1608, size: 96, offset: 9312)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1547, file: !265, line: 258, baseType: !1366, size: 128, offset: 9408)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1547, file: !265, line: 259, baseType: !1366, size: 128, offset: 9536)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1547, file: !265, line: 260, baseType: !1366, size: 128, offset: 9664)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1547, file: !265, line: 261, baseType: !1366, size: 128, offset: 9792)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1547, file: !265, line: 263, baseType: !1755, size: 64, offset: 9920)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64)
!1756 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !265, line: 52, flags: DIFlagFwdDecl)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1547, file: !265, line: 264, baseType: !1758, size: 64, offset: 9984)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64)
!1759 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !265, line: 53, flags: DIFlagFwdDecl)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1547, file: !265, line: 265, baseType: !1761, size: 64, offset: 10048)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1581, line: 46, flags: DIFlagFwdDecl)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1547, file: !265, line: 267, baseType: !1410, size: 8, offset: 10112)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1547, file: !265, line: 268, baseType: !1410, size: 8, offset: 10120)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1547, file: !265, line: 269, baseType: !1378, size: 16, offset: 10128)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1547, file: !265, line: 270, baseType: !1375, size: 32, offset: 10144)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1547, file: !265, line: 272, baseType: !1768, size: 64, offset: 10176)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64)
!1769 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !265, line: 54, flags: DIFlagFwdDecl)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1547, file: !265, line: 275, baseType: !1771, size: 64, offset: 10240)
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64)
!1772 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !265, line: 275, flags: DIFlagFwdDecl)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1547, file: !265, line: 277, baseType: !1774, size: 64, offset: 10304)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64)
!1775 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !1544, line: 40, flags: DIFlagFwdDecl)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1547, file: !265, line: 277, baseType: !1774, size: 64, offset: 10368)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1547, file: !265, line: 278, baseType: !1778, size: 64, offset: 10432)
!1778 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1779, line: 27, baseType: !1780)
!1779 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1781, line: 45, baseType: !1782)
!1781 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1782 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1547, file: !265, line: 279, baseType: !1778, size: 64, offset: 10496)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1547, file: !265, line: 280, baseType: !7, size: 32, offset: 10560)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1547, file: !265, line: 281, baseType: !7, size: 32, offset: 10592)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1547, file: !265, line: 283, baseType: !1366, size: 128, offset: 10624)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1547, file: !265, line: 284, baseType: !1366, size: 128, offset: 10752)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1547, file: !265, line: 285, baseType: !1789, size: 64, offset: 10880)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1547, file: !265, line: 287, baseType: !1791, size: 64, offset: 10944)
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64)
!1792 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !265, line: 59, flags: DIFlagFwdDecl)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1547, file: !265, line: 288, baseType: !1794, size: 64, offset: 11008)
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1795, size: 64)
!1795 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !265, line: 288, flags: DIFlagFwdDecl)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1547, file: !265, line: 290, baseType: !1797, size: 64, offset: 11072)
!1797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 64, elements: !1490)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1547, file: !265, line: 291, baseType: !1799, size: 64, offset: 11136)
!1799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1800, size: 64)
!1800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1339, line: 65, baseType: !1533)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1547, file: !265, line: 293, baseType: !1366, size: 128, offset: 11200)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1547, file: !265, line: 294, baseType: !1803, size: 64, offset: 11328)
!1803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1804, size: 64)
!1804 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !265, line: 113, baseType: !1805)
!1805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !265, line: 108, size: 256, elements: !1806)
!1806 = !{!1807, !1809, !1810, !1811, !1812}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1805, file: !265, line: 109, baseType: !1808, size: 64)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1805, size: 64)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1805, file: !265, line: 109, baseType: !1808, size: 64, offset: 64)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1805, file: !265, line: 110, baseType: !1546, size: 64, offset: 128)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1805, file: !265, line: 111, baseType: !1373, size: 32, offset: 192)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1805, file: !265, line: 112, baseType: !1375, size: 32, offset: 224)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1537, file: !1538, line: 1221, baseType: !1814, size: 64, offset: 1088)
!1814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1815, size: 64)
!1815 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1538, line: 52, flags: DIFlagFwdDecl)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1537, file: !1538, line: 1223, baseType: !1536, size: 64, offset: 1152)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1537, file: !1538, line: 1225, baseType: !1366, size: 128, offset: 1216)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1537, file: !1538, line: 1226, baseType: !1819, size: 64, offset: 1344)
!1819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1820, size: 64)
!1820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1538, line: 69, size: 320, elements: !1821)
!1821 = !{!1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829}
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1820, file: !1538, line: 70, baseType: !1819, size: 64)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1820, file: !1538, line: 70, baseType: !1819, size: 64, offset: 64)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1820, file: !1538, line: 71, baseType: !7, size: 32, offset: 128)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1820, file: !1538, line: 71, baseType: !7, size: 32, offset: 160)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1820, file: !1538, line: 72, baseType: !1373, size: 32, offset: 192)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1820, file: !1538, line: 73, baseType: !1378, size: 16, offset: 224)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1820, file: !1538, line: 73, baseType: !1378, size: 16, offset: 240)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1820, file: !1538, line: 74, baseType: !1546, size: 64, offset: 256)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1537, file: !1538, line: 1227, baseType: !1546, size: 64, offset: 1408)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1537, file: !1538, line: 1229, baseType: !1608, size: 96, offset: 1472)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1537, file: !1538, line: 1230, baseType: !1608, size: 96, offset: 1568)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1537, file: !1538, line: 1231, baseType: !1608, size: 96, offset: 1664)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1537, file: !1538, line: 1231, baseType: !1608, size: 96, offset: 1760)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1537, file: !1538, line: 1233, baseType: !7, size: 32, offset: 1856)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1537, file: !1538, line: 1234, baseType: !1373, size: 32, offset: 1888)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1537, file: !1538, line: 1235, baseType: !7, size: 32, offset: 1920)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1537, file: !1538, line: 1237, baseType: !1378, size: 16, offset: 1952)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1537, file: !1538, line: 1239, baseType: !1410, size: 8, offset: 1968)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1537, file: !1538, line: 1240, baseType: !1841, size: 8, offset: 1976)
!1841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 8, elements: !1842)
!1842 = !{!1843}
!1843 = !DISubrange(count: 1)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1537, file: !1538, line: 1242, baseType: !1845, size: 64, offset: 1984)
!1845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1846, size: 64)
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1847, line: 328, size: 3456, elements: !1848)
!1847 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1848 = !{!1849, !1850, !1851, !1855, !1856, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1885, !1886, !1887, !1890, !1895, !1896, !1899, !1903, !1907, !1911, !1915, !1916, !1917, !1918}
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1846, file: !1847, line: 329, baseType: !1390, size: 960)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1846, file: !1847, line: 330, baseType: !1542, size: 64, offset: 960)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1846, file: !1847, line: 332, baseType: !1852, size: 64, offset: 1024)
!1852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1853, size: 64)
!1853 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1854, line: 45, flags: DIFlagFwdDecl)
!1854 = !DIFile(filename: "blender/source/blender/editors/include/ED_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1846, file: !1847, line: 333, baseType: !1438, size: 512, offset: 1088)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1846, file: !1847, line: 335, baseType: !1857, size: 64, offset: 1600)
!1857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1858, size: 64)
!1858 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1859, line: 41, flags: DIFlagFwdDecl)
!1859 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1846, file: !1847, line: 337, baseType: !1639, size: 64, offset: 1664)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1846, file: !1847, line: 338, baseType: !1797, size: 64, offset: 1728)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1846, file: !1847, line: 340, baseType: !1366, size: 128, offset: 1792)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1846, file: !1847, line: 340, baseType: !1366, size: 128, offset: 1920)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1846, file: !1847, line: 342, baseType: !1373, size: 32, offset: 2048)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1846, file: !1847, line: 342, baseType: !1373, size: 32, offset: 2080)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1846, file: !1847, line: 343, baseType: !1373, size: 32, offset: 2112)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1846, file: !1847, line: 345, baseType: !1373, size: 32, offset: 2144)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1846, file: !1847, line: 346, baseType: !1373, size: 32, offset: 2176)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1846, file: !1847, line: 347, baseType: !1378, size: 16, offset: 2208)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1846, file: !1847, line: 348, baseType: !1378, size: 16, offset: 2224)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1846, file: !1847, line: 349, baseType: !1373, size: 32, offset: 2240)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1846, file: !1847, line: 351, baseType: !1373, size: 32, offset: 2272)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1846, file: !1847, line: 353, baseType: !1378, size: 16, offset: 2304)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1846, file: !1847, line: 354, baseType: !1378, size: 16, offset: 2320)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1846, file: !1847, line: 355, baseType: !1373, size: 32, offset: 2336)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1846, file: !1847, line: 357, baseType: !1877, size: 128, offset: 2368)
!1877 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1878, line: 95, baseType: !1879)
!1878 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1878, line: 92, size: 128, elements: !1880)
!1880 = !{!1881, !1882, !1883, !1884}
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1879, file: !1878, line: 93, baseType: !1375, size: 32)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1879, file: !1878, line: 93, baseType: !1375, size: 32, offset: 32)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1879, file: !1878, line: 94, baseType: !1375, size: 32, offset: 64)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1879, file: !1878, line: 94, baseType: !1375, size: 32, offset: 96)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1846, file: !1847, line: 363, baseType: !1366, size: 128, offset: 2496)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1846, file: !1847, line: 363, baseType: !1366, size: 128, offset: 2624)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1846, file: !1847, line: 368, baseType: !1888, size: 64, offset: 2752)
!1888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1889, size: 64)
!1889 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1847, line: 48, flags: DIFlagFwdDecl)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1846, file: !1847, line: 372, baseType: !1891, size: 32, offset: 2816)
!1891 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1847, line: 274, baseType: !1892)
!1892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1847, line: 271, size: 32, elements: !1893)
!1893 = !{!1894}
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1892, file: !1847, line: 273, baseType: !7, size: 32)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1846, file: !1847, line: 373, baseType: !1373, size: 32, offset: 2848)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1846, file: !1847, line: 382, baseType: !1897, size: 64, offset: 2880)
!1897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1898, size: 64)
!1898 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1847, line: 46, flags: DIFlagFwdDecl)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1846, file: !1847, line: 385, baseType: !1900, size: 64, offset: 2944)
!1900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1901, size: 64)
!1901 = !DISubroutineType(types: !1902)
!1902 = !{null, !1352, !1375}
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1846, file: !1847, line: 386, baseType: !1904, size: 64, offset: 3008)
!1904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1905, size: 64)
!1905 = !DISubroutineType(types: !1906)
!1906 = !{null, !1352, !1669}
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1846, file: !1847, line: 387, baseType: !1908, size: 64, offset: 3072)
!1908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1909, size: 64)
!1909 = !DISubroutineType(types: !1910)
!1910 = !{!1373, !1352}
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1846, file: !1847, line: 388, baseType: !1912, size: 64, offset: 3136)
!1912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1913, size: 64)
!1913 = !DISubroutineType(types: !1914)
!1914 = !{null, !1352}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1846, file: !1847, line: 389, baseType: !1352, size: 64, offset: 3200)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1846, file: !1847, line: 389, baseType: !1352, size: 64, offset: 3264)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1846, file: !1847, line: 389, baseType: !1352, size: 64, offset: 3328)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1846, file: !1847, line: 389, baseType: !1352, size: 64, offset: 3392)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1537, file: !1538, line: 1244, baseType: !1920, size: 64, offset: 2048)
!1920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1921, size: 64)
!1921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1922, line: 200, size: 17024, elements: !1923)
!1922 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1923 = !{!1924, !1925, !1926, !1927, !2270, !2271, !2272, !2273, !2274, !2275, !2276}
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1921, file: !1922, line: 201, baseType: !1789, size: 64)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1921, file: !1922, line: 202, baseType: !1366, size: 128, offset: 64)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1921, file: !1922, line: 203, baseType: !1366, size: 128, offset: 192)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1921, file: !1922, line: 206, baseType: !1928, size: 64, offset: 320)
!1928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1929, size: 64)
!1929 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1922, line: 190, baseType: !1930)
!1930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1922, line: 126, size: 2816, elements: !1931)
!1931 = !{!1932, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !2023, !2024, !2025, !2026, !2231, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2269}
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1930, file: !1922, line: 127, baseType: !1933, size: 64)
!1933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1930, size: 64)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1930, file: !1922, line: 127, baseType: !1933, size: 64, offset: 64)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1930, file: !1922, line: 128, baseType: !1352, size: 64, offset: 128)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1930, file: !1922, line: 129, baseType: !1352, size: 64, offset: 192)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1930, file: !1922, line: 130, baseType: !1438, size: 512, offset: 256)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1930, file: !1922, line: 132, baseType: !1373, size: 32, offset: 768)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1930, file: !1922, line: 132, baseType: !1373, size: 32, offset: 800)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1930, file: !1922, line: 133, baseType: !1373, size: 32, offset: 832)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1930, file: !1922, line: 134, baseType: !1373, size: 32, offset: 864)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1930, file: !1922, line: 134, baseType: !1373, size: 32, offset: 896)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1930, file: !1922, line: 134, baseType: !1373, size: 32, offset: 928)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1930, file: !1922, line: 135, baseType: !1373, size: 32, offset: 960)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1930, file: !1922, line: 135, baseType: !1373, size: 32, offset: 992)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1930, file: !1922, line: 136, baseType: !1373, size: 32, offset: 1024)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1930, file: !1922, line: 136, baseType: !1373, size: 32, offset: 1056)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1930, file: !1922, line: 137, baseType: !1373, size: 32, offset: 1088)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1930, file: !1922, line: 137, baseType: !1373, size: 32, offset: 1120)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1930, file: !1922, line: 138, baseType: !1375, size: 32, offset: 1152)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1930, file: !1922, line: 139, baseType: !1375, size: 32, offset: 1184)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1930, file: !1922, line: 139, baseType: !1375, size: 32, offset: 1216)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1930, file: !1922, line: 141, baseType: !1378, size: 16, offset: 1248)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1930, file: !1922, line: 142, baseType: !1378, size: 16, offset: 1264)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1930, file: !1922, line: 143, baseType: !1373, size: 32, offset: 1280)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1930, file: !1922, line: 144, baseType: !1373, size: 32, offset: 1312)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1930, file: !1922, line: 146, baseType: !1958, size: 64, offset: 1344)
!1958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1959, size: 64)
!1959 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1922, line: 114, baseType: !1960)
!1960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1922, line: 99, size: 7232, elements: !1961)
!1961 = !{!1962, !1964, !1965, !1966, !1967, !1968, !1969, !1980, !1984, !1996, !2005, !2012, !2022}
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1960, file: !1922, line: 100, baseType: !1963, size: 64)
!1963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1960, size: 64)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1960, file: !1922, line: 100, baseType: !1963, size: 64, offset: 64)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1960, file: !1922, line: 101, baseType: !1373, size: 32, offset: 128)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1960, file: !1922, line: 101, baseType: !1373, size: 32, offset: 160)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1960, file: !1922, line: 102, baseType: !1373, size: 32, offset: 192)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1960, file: !1922, line: 102, baseType: !1373, size: 32, offset: 224)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1960, file: !1922, line: 103, baseType: !1970, size: 64, offset: 256)
!1970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1971, size: 64)
!1971 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1922, line: 59, baseType: !1972)
!1972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1922, line: 56, size: 2112, elements: !1973)
!1973 = !{!1974, !1978, !1979}
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1972, file: !1922, line: 57, baseType: !1975, size: 2048)
!1975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 2048, elements: !1976)
!1976 = !{!1977}
!1977 = !DISubrange(count: 256)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1972, file: !1922, line: 58, baseType: !1373, size: 32, offset: 2048)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1972, file: !1922, line: 58, baseType: !1373, size: 32, offset: 2080)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1960, file: !1922, line: 106, baseType: !1981, size: 6144, offset: 320)
!1981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 6144, elements: !1982)
!1982 = !{!1983}
!1983 = !DISubrange(count: 768)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1960, file: !1922, line: 107, baseType: !1985, size: 64, offset: 6464)
!1985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1986, size: 64)
!1986 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1922, line: 97, baseType: !1987)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1922, line: 83, size: 8320, elements: !1988)
!1988 = !{!1989, !1990, !1991, !1992, !1993, !1994, !1995}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1987, file: !1922, line: 84, baseType: !1981, size: 6144)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1987, file: !1922, line: 87, baseType: !1975, size: 2048, offset: 6144)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1987, file: !1922, line: 88, baseType: !1460, size: 64, offset: 8192)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1987, file: !1922, line: 90, baseType: !1378, size: 16, offset: 8256)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1987, file: !1922, line: 92, baseType: !1378, size: 16, offset: 8272)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1987, file: !1922, line: 93, baseType: !1378, size: 16, offset: 8288)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1987, file: !1922, line: 95, baseType: !1378, size: 16, offset: 8304)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1960, file: !1922, line: 108, baseType: !1997, size: 64, offset: 6528)
!1997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1998, size: 64)
!1998 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1922, line: 66, baseType: !1999)
!1999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1922, line: 61, size: 128, elements: !2000)
!2000 = !{!2001, !2002, !2003, !2004}
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1999, file: !1922, line: 62, baseType: !1373, size: 32)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1999, file: !1922, line: 63, baseType: !1373, size: 32, offset: 32)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1999, file: !1922, line: 64, baseType: !1373, size: 32, offset: 64)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1999, file: !1922, line: 65, baseType: !1373, size: 32, offset: 96)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1960, file: !1922, line: 109, baseType: !2006, size: 64, offset: 6592)
!2006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2007, size: 64)
!2007 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1922, line: 71, baseType: !2008)
!2008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1922, line: 68, size: 64, elements: !2009)
!2009 = !{!2010, !2011}
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !2008, file: !1922, line: 69, baseType: !1373, size: 32)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !2008, file: !1922, line: 70, baseType: !1373, size: 32, offset: 32)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1960, file: !1922, line: 110, baseType: !2013, size: 64, offset: 6656)
!2013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2014, size: 64)
!2014 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1922, line: 81, baseType: !2015)
!2015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1922, line: 73, size: 352, elements: !2016)
!2016 = !{!2017, !2018, !2019, !2020, !2021}
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !2015, file: !1922, line: 74, baseType: !1608, size: 96)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !2015, file: !1922, line: 75, baseType: !1608, size: 96, offset: 96)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !2015, file: !1922, line: 76, baseType: !1608, size: 96, offset: 192)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2015, file: !1922, line: 77, baseType: !1373, size: 32, offset: 288)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2015, file: !1922, line: 78, baseType: !1373, size: 32, offset: 320)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1960, file: !1922, line: 113, baseType: !1516, size: 512, offset: 6720)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1930, file: !1922, line: 148, baseType: !1566, size: 64, offset: 1408)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1930, file: !1922, line: 151, baseType: !1536, size: 64, offset: 1472)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1930, file: !1922, line: 152, baseType: !1546, size: 64, offset: 1536)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1930, file: !1922, line: 153, baseType: !2027, size: 64, offset: 1600)
!2027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2028, size: 64)
!2028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !2029, line: 64, size: 19136, elements: !2030)
!2029 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2030 = !{!2031, !2032, !2033, !2034, !2035, !2036, !2038, !2039, !2040, !2041, !2044, !2045, !2217, !2218, !2226, !2227, !2228, !2229, !2230}
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2028, file: !2029, line: 65, baseType: !1390, size: 960)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !2028, file: !2029, line: 66, baseType: !1542, size: 64, offset: 960)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2028, file: !2029, line: 68, baseType: !1409, size: 8192, offset: 1024)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !2028, file: !2029, line: 70, baseType: !1373, size: 32, offset: 9216)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !2028, file: !2029, line: 71, baseType: !1373, size: 32, offset: 9248)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !2028, file: !2029, line: 72, baseType: !2037, size: 64, offset: 9280)
!2037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1373, size: 64, elements: !1490)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !2028, file: !2029, line: 74, baseType: !1375, size: 32, offset: 9344)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !2028, file: !2029, line: 74, baseType: !1375, size: 32, offset: 9376)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !2028, file: !2029, line: 76, baseType: !1460, size: 64, offset: 9408)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !2028, file: !2029, line: 77, baseType: !2042, size: 64, offset: 9472)
!2042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2043, size: 64)
!2043 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !2029, line: 77, flags: DIFlagFwdDecl)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !2028, file: !2029, line: 78, baseType: !1639, size: 64, offset: 9536)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !2028, file: !2029, line: 80, baseType: !2046, size: 2624, offset: 9600)
!2046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !2047, line: 340, size: 2624, elements: !2048)
!2047 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2048 = !{!2049, !2077, !2095, !2096, !2097, !2112, !2170, !2171, !2197, !2198, !2199, !2200, !2206}
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !2046, file: !2047, line: 341, baseType: !2050, size: 576)
!2050 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !2047, line: 251, baseType: !2051)
!2051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !2047, line: 207, size: 576, elements: !2052)
!2052 = !{!2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076}
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2051, file: !2047, line: 208, baseType: !1373, size: 32)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !2051, file: !2047, line: 211, baseType: !1378, size: 16, offset: 32)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !2051, file: !2047, line: 212, baseType: !1378, size: 16, offset: 48)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !2051, file: !2047, line: 213, baseType: !1375, size: 32, offset: 64)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !2051, file: !2047, line: 214, baseType: !1378, size: 16, offset: 96)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !2051, file: !2047, line: 215, baseType: !1378, size: 16, offset: 112)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !2051, file: !2047, line: 216, baseType: !1378, size: 16, offset: 128)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !2051, file: !2047, line: 217, baseType: !1378, size: 16, offset: 144)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !2051, file: !2047, line: 218, baseType: !1378, size: 16, offset: 160)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !2051, file: !2047, line: 219, baseType: !1378, size: 16, offset: 176)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !2051, file: !2047, line: 220, baseType: !1375, size: 32, offset: 192)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !2051, file: !2047, line: 222, baseType: !1378, size: 16, offset: 224)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !2051, file: !2047, line: 225, baseType: !1378, size: 16, offset: 240)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !2051, file: !2047, line: 228, baseType: !1373, size: 32, offset: 256)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !2051, file: !2047, line: 229, baseType: !1373, size: 32, offset: 288)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !2051, file: !2047, line: 233, baseType: !1373, size: 32, offset: 320)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !2051, file: !2047, line: 236, baseType: !1378, size: 16, offset: 352)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2051, file: !2047, line: 236, baseType: !1378, size: 16, offset: 368)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !2051, file: !2047, line: 241, baseType: !1375, size: 32, offset: 384)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !2051, file: !2047, line: 244, baseType: !1373, size: 32, offset: 416)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !2051, file: !2047, line: 244, baseType: !1373, size: 32, offset: 448)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !2051, file: !2047, line: 245, baseType: !1375, size: 32, offset: 480)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !2051, file: !2047, line: 248, baseType: !1375, size: 32, offset: 512)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !2051, file: !2047, line: 250, baseType: !1373, size: 32, offset: 544)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !2046, file: !2047, line: 342, baseType: !2078, size: 448, offset: 576)
!2078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !2047, line: 79, baseType: !2079)
!2079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !2047, line: 61, size: 448, elements: !2080)
!2080 = !{!2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094}
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !2079, file: !2047, line: 62, baseType: !1352, size: 64)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !2079, file: !2047, line: 64, baseType: !1378, size: 16, offset: 64)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2079, file: !2047, line: 65, baseType: !1378, size: 16, offset: 80)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !2079, file: !2047, line: 67, baseType: !1375, size: 32, offset: 96)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !2079, file: !2047, line: 68, baseType: !1375, size: 32, offset: 128)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !2079, file: !2047, line: 69, baseType: !1375, size: 32, offset: 160)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !2079, file: !2047, line: 70, baseType: !1378, size: 16, offset: 192)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !2079, file: !2047, line: 71, baseType: !1378, size: 16, offset: 208)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !2079, file: !2047, line: 72, baseType: !1797, size: 64, offset: 224)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !2079, file: !2047, line: 75, baseType: !1375, size: 32, offset: 288)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !2079, file: !2047, line: 75, baseType: !1375, size: 32, offset: 320)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !2079, file: !2047, line: 75, baseType: !1375, size: 32, offset: 352)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !2079, file: !2047, line: 78, baseType: !1375, size: 32, offset: 384)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !2079, file: !2047, line: 78, baseType: !1375, size: 32, offset: 416)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !2046, file: !2047, line: 343, baseType: !1366, size: 128, offset: 1024)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !2046, file: !2047, line: 344, baseType: !1366, size: 128, offset: 1152)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !2046, file: !2047, line: 345, baseType: !2098, size: 192, offset: 1280)
!2098 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !2047, line: 278, baseType: !2099)
!2099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !2047, line: 270, size: 192, elements: !2100)
!2100 = !{!2101, !2102, !2103, !2104, !2105}
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2099, file: !2047, line: 271, baseType: !1373, size: 32)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2099, file: !2047, line: 273, baseType: !1375, size: 32, offset: 32)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !2099, file: !2047, line: 275, baseType: !1373, size: 32, offset: 64)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !2099, file: !2047, line: 276, baseType: !1373, size: 32, offset: 96)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !2099, file: !2047, line: 277, baseType: !2106, size: 64, offset: 128)
!2106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2107, size: 64)
!2107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !2047, line: 55, size: 576, elements: !2108)
!2108 = !{!2109, !2110, !2111}
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !2107, file: !2047, line: 56, baseType: !1373, size: 32)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2107, file: !2047, line: 57, baseType: !1375, size: 32, offset: 32)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !2107, file: !2047, line: 58, baseType: !1687, size: 512, offset: 64)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !2046, file: !2047, line: 346, baseType: !2113, size: 384, offset: 1472)
!2113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !2047, line: 268, baseType: !2114)
!2114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !2047, line: 253, size: 384, elements: !2115)
