; ModuleID = 'blender/source/blender/editors/space_buttons/space_buttons.c'
source_filename = "blender/source/blender/editors/space_buttons/space_buttons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!193 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CW", value: 411, isUnsigned: true)
!194 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CCW", value: 412, isUnsigned: true)
!195 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CW", value: 413, isUnsigned: true)
!196 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CCW", value: 414, isUnsigned: true)
!197 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CW", value: 415, isUnsigned: true)
!198 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CCW", value: 416, isUnsigned: true)
!199 = !DIEnumerator(name: "NDOF_BUTTON_ROTATE", value: 417, isUnsigned: true)
!200 = !DIEnumerator(name: "NDOF_BUTTON_PANZOOM", value: 418, isUnsigned: true)
!201 = !DIEnumerator(name: "NDOF_BUTTON_DOMINANT", value: 419, isUnsigned: true)
!202 = !DIEnumerator(name: "NDOF_BUTTON_PLUS", value: 420, isUnsigned: true)
!203 = !DIEnumerator(name: "NDOF_BUTTON_MINUS", value: 421, isUnsigned: true)
!204 = !DIEnumerator(name: "NDOF_BUTTON_ESC", value: 422, isUnsigned: true)
!205 = !DIEnumerator(name: "NDOF_BUTTON_ALT", value: 423, isUnsigned: true)
!206 = !DIEnumerator(name: "NDOF_BUTTON_SHIFT", value: 424, isUnsigned: true)
!207 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!208 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!209 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!210 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!211 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!212 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!213 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!214 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!215 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!216 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!217 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!218 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!219 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!220 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!221 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!222 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!223 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!224 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!225 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!226 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!227 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!228 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!229 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!230 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!231 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!232 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!233 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!234 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!235 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!236 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!237 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!238 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!239 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!240 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!241 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!242 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!243 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!244 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!245 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!246 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceButtons_Context", file: !4, line: 174, baseType: !5, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!249 = !DIEnumerator(name: "BCONTEXT_RENDER", value: 0, isUnsigned: true)
!250 = !DIEnumerator(name: "BCONTEXT_SCENE", value: 1, isUnsigned: true)
!251 = !DIEnumerator(name: "BCONTEXT_WORLD", value: 2, isUnsigned: true)
!252 = !DIEnumerator(name: "BCONTEXT_OBJECT", value: 3, isUnsigned: true)
!253 = !DIEnumerator(name: "BCONTEXT_DATA", value: 4, isUnsigned: true)
!254 = !DIEnumerator(name: "BCONTEXT_MATERIAL", value: 5, isUnsigned: true)
!255 = !DIEnumerator(name: "BCONTEXT_TEXTURE", value: 6, isUnsigned: true)
!256 = !DIEnumerator(name: "BCONTEXT_PARTICLE", value: 7, isUnsigned: true)
!257 = !DIEnumerator(name: "BCONTEXT_PHYSICS", value: 8, isUnsigned: true)
!258 = !DIEnumerator(name: "BCONTEXT_BONE", value: 9, isUnsigned: true)
!259 = !DIEnumerator(name: "BCONTEXT_MODIFIER", value: 10, isUnsigned: true)
!260 = !DIEnumerator(name: "BCONTEXT_CONSTRAINT", value: 11, isUnsigned: true)
!261 = !DIEnumerator(name: "BCONTEXT_BONE_CONSTRAINT", value: 12, isUnsigned: true)
!262 = !DIEnumerator(name: "BCONTEXT_RENDER_LAYER", value: 13, isUnsigned: true)
!263 = !DIEnumerator(name: "BCONTEXT_TOT", value: 14, isUnsigned: true)
!264 = !{!265, !289, !278}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !268)
!268 = !{!269, !271, !272, !280, !282, !284}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !4, line: 86, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !4, line: 86, baseType: !270, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !267, file: !4, line: 87, baseType: !273, size: 128, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !274, line: 71, baseType: !275)
!274 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !274, line: 69, size: 128, elements: !276)
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !275, file: !274, line: 70, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !275, file: !274, line: 70, baseType: !278, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !267, file: !4, line: 88, baseType: !281, size: 32, offset: 256)
!281 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !267, file: !4, line: 89, baseType: !283, size: 32, offset: 288)
!283 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !267, file: !4, line: 90, baseType: !285, size: 128, offset: 320)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 128, elements: !287)
!286 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!287 = !{!288}
!288 = !DISubrange(count: 8)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceButs", file: !4, line: 143, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceButs", file: !4, line: 121, size: 2176, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !4, line: 122, baseType: !265, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !291, file: !4, line: 122, baseType: !265, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !291, file: !4, line: 123, baseType: !273, size: 128, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !291, file: !4, line: 124, baseType: !281, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !291, file: !4, line: 125, baseType: !283, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !291, file: !4, line: 127, baseType: !285, size: 128, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !291, file: !4, line: 129, baseType: !300, size: 1280, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !301, line: 71, baseType: !302)
!301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !301, line: 40, size: 1280, elements: !303)
!303 = !{!304, !313, !314, !322, !323, !324, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !345, !346, !347, !350}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !302, file: !301, line: 41, baseType: !305, size: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !306, line: 95, baseType: !307)
!306 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !306, line: 92, size: 128, elements: !308)
!308 = !{!309, !310, !311, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !307, file: !306, line: 93, baseType: !283, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !307, file: !306, line: 93, baseType: !283, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !307, file: !306, line: 94, baseType: !283, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !307, file: !306, line: 94, baseType: !283, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !302, file: !301, line: 41, baseType: !305, size: 128, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !302, file: !301, line: 42, baseType: !315, size: 128, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !306, line: 89, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !306, line: 86, size: 128, elements: !317)
!317 = !{!318, !319, !320, !321}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !316, file: !306, line: 87, baseType: !281, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !316, file: !306, line: 87, baseType: !281, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !316, file: !306, line: 88, baseType: !281, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !316, file: !306, line: 88, baseType: !281, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !302, file: !301, line: 42, baseType: !315, size: 128, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !302, file: !301, line: 43, baseType: !315, size: 128, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !302, file: !301, line: 45, baseType: !325, size: 64, offset: 640)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 64, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 2)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !302, file: !301, line: 45, baseType: !325, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !302, file: !301, line: 46, baseType: !283, size: 32, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !302, file: !301, line: 46, baseType: !283, size: 32, offset: 800)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !302, file: !301, line: 48, baseType: !286, size: 16, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !302, file: !301, line: 49, baseType: !286, size: 16, offset: 848)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !302, file: !301, line: 51, baseType: !286, size: 16, offset: 864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !302, file: !301, line: 52, baseType: !286, size: 16, offset: 880)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !302, file: !301, line: 53, baseType: !286, size: 16, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !301, line: 55, baseType: !286, size: 16, offset: 912)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !302, file: !301, line: 56, baseType: !286, size: 16, offset: 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !302, file: !301, line: 58, baseType: !286, size: 16, offset: 944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !302, file: !301, line: 58, baseType: !286, size: 16, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !302, file: !301, line: 59, baseType: !286, size: 16, offset: 976)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !302, file: !301, line: 59, baseType: !286, size: 16, offset: 992)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !302, file: !301, line: 61, baseType: !286, size: 16, offset: 1008)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !302, file: !301, line: 63, baseType: !344, size: 64, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !302, file: !301, line: 64, baseType: !281, size: 32, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !302, file: !301, line: 65, baseType: !281, size: 32, offset: 1120)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !302, file: !301, line: 68, baseType: !348, size: 64, offset: 1152)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !301, line: 68, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !302, file: !301, line: 69, baseType: !351, size: 64, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !353, line: 490, size: 768, elements: !354)
!353 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!354 = !{!355, !356, !357, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !353, line: 491, baseType: !351, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !352, file: !353, line: 491, baseType: !351, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !352, file: !353, line: 493, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !360, line: 169, size: 2048, elements: !361)
!360 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !{!362, !363, !364, !365, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1693, !1696, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !360, line: 170, baseType: !358, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !359, file: !360, line: 170, baseType: !358, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !359, file: !360, line: 172, baseType: !278, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !359, file: !360, line: 174, baseType: !366, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !368)
!368 = !{!369, !432, !433, !434, !435, !436, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !367, file: !30, line: 50, baseType: !370, size: 960)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !371, line: 130, baseType: !372)
!371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !371, line: 117, size: 960, elements: !373)
!373 = !{!374, !375, !376, !378, !398, !402, !403, !404, !405, !406}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !371, line: 118, baseType: !278, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !372, file: !371, line: 118, baseType: !278, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !372, file: !371, line: 119, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !372, file: !371, line: 120, baseType: !379, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !371, line: 136, size: 17600, elements: !381)
!381 = !{!382, !383, !385, !388, !393, !394, !395}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !380, file: !371, line: 137, baseType: !370, size: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !380, file: !371, line: 138, baseType: !384, size: 64, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !380, file: !371, line: 139, baseType: !386, size: 64, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !371, line: 43, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !371, line: 140, baseType: !389, size: 8192, offset: 1088)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 8192, elements: !391)
!390 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !{!392}
!392 = !DISubrange(count: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !380, file: !371, line: 141, baseType: !389, size: 8192, offset: 9280)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !380, file: !371, line: 148, baseType: !379, size: 64, offset: 17472)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !380, file: !371, line: 150, baseType: !396, size: 64, offset: 17536)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !371, line: 45, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !371, line: 121, baseType: !399, size: 528, offset: 256)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 528, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 66)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !371, line: 126, baseType: !286, size: 16, offset: 784)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !372, file: !371, line: 127, baseType: !281, size: 32, offset: 800)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !372, file: !371, line: 128, baseType: !281, size: 32, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !372, file: !371, line: 128, baseType: !281, size: 32, offset: 864)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !372, file: !371, line: 129, baseType: !407, size: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !371, line: 75, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !371, line: 62, size: 1024, elements: !410)
!410 = !{!411, !413, !414, !415, !416, !417, !421, !422, !430, !431}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !409, file: !371, line: 63, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !409, file: !371, line: 63, baseType: !412, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !409, file: !371, line: 64, baseType: !390, size: 8, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !409, file: !371, line: 64, baseType: !390, size: 8, offset: 136)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !409, file: !371, line: 65, baseType: !286, size: 16, offset: 144)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !409, file: !371, line: 66, baseType: !418, size: 512, offset: 160)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 512, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !409, file: !371, line: 67, baseType: !281, size: 32, offset: 672)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !371, line: 69, baseType: !423, size: 256, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !371, line: 60, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !371, line: 48, size: 256, elements: !425)
!425 = !{!426, !427, !428, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !424, file: !371, line: 49, baseType: !278, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !424, file: !371, line: 58, baseType: !273, size: 128, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !424, file: !371, line: 59, baseType: !281, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !424, file: !371, line: 59, baseType: !281, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !409, file: !371, line: 70, baseType: !281, size: 32, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !409, file: !371, line: 74, baseType: !281, size: 32, offset: 992)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !367, file: !30, line: 52, baseType: !273, size: 128, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !367, file: !30, line: 53, baseType: !273, size: 128, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !367, file: !30, line: 54, baseType: !273, size: 128, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !367, file: !30, line: 55, baseType: !273, size: 128, offset: 1344)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !367, file: !30, line: 57, baseType: !437, size: 64, offset: 1472)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !439, line: 1216, size: 39680, elements: !440)
!439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !{!441, !442, !446, !450, !453, !454, !455, !467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !480, !484, !554, !987, !1202, !1205, !1486, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1508, !1509, !1510, !1511, !1512, !1520, !1587, !1594, !1595, !1602, !1603, !1609, !1610, !1611, !1612, !1613}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !438, file: !439, line: 1217, baseType: !370, size: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !438, file: !439, line: 1218, baseType: !443, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !445, line: 43, flags: DIFlagFwdDecl)
!445 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !438, file: !439, line: 1220, baseType: !447, size: 64, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !449, line: 44, flags: DIFlagFwdDecl)
!449 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!450 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !438, file: !439, line: 1221, baseType: !451, size: 64, offset: 1088)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !439, line: 52, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !438, file: !439, line: 1223, baseType: !437, size: 64, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !438, file: !439, line: 1225, baseType: !273, size: 128, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !438, file: !439, line: 1226, baseType: !456, size: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !439, line: 69, size: 320, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !439, line: 70, baseType: !456, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !439, line: 70, baseType: !456, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !457, file: !439, line: 71, baseType: !5, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !457, file: !439, line: 71, baseType: !5, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !439, line: 72, baseType: !281, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !457, file: !439, line: 73, baseType: !286, size: 16, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !457, file: !439, line: 73, baseType: !286, size: 16, offset: 240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !457, file: !439, line: 74, baseType: !447, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !438, file: !439, line: 1227, baseType: !447, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !438, file: !439, line: 1229, baseType: !469, size: 96, offset: 1472)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 96, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 3)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !438, file: !439, line: 1230, baseType: !469, size: 96, offset: 1568)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !438, file: !439, line: 1231, baseType: !469, size: 96, offset: 1664)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !438, file: !439, line: 1231, baseType: !469, size: 96, offset: 1760)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !438, file: !439, line: 1233, baseType: !5, size: 32, offset: 1856)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !438, file: !439, line: 1234, baseType: !281, size: 32, offset: 1888)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !438, file: !439, line: 1235, baseType: !5, size: 32, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !438, file: !439, line: 1237, baseType: !286, size: 16, offset: 1952)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !438, file: !439, line: 1239, baseType: !390, size: 8, offset: 1968)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !438, file: !439, line: 1240, baseType: !481, size: 8, offset: 1976)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 8, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 1)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !438, file: !439, line: 1242, baseType: !485, size: 64, offset: 1984)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !487, line: 328, size: 3456, elements: !488)
!487 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!488 = !{!489, !490, !491, !494, !495, !499, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !524, !529, !530, !533, !537, !542, !546, !550, !551, !552, !553}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !486, file: !487, line: 329, baseType: !370, size: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !486, file: !487, line: 330, baseType: !443, size: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !486, file: !487, line: 332, baseType: !492, size: 64, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !487, line: 332, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !486, file: !487, line: 333, baseType: !418, size: 512, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !486, file: !487, line: 335, baseType: !496, size: 64, offset: 1600)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !498, line: 41, flags: DIFlagFwdDecl)
!498 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!499 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !486, file: !487, line: 337, baseType: !500, size: 64, offset: 1664)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !502, line: 45, flags: DIFlagFwdDecl)
!502 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !486, file: !487, line: 338, baseType: !325, size: 64, offset: 1728)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !486, file: !487, line: 340, baseType: !273, size: 128, offset: 1792)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !486, file: !487, line: 340, baseType: !273, size: 128, offset: 1920)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !487, line: 342, baseType: !281, size: 32, offset: 2048)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !486, file: !487, line: 342, baseType: !281, size: 32, offset: 2080)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !486, file: !487, line: 343, baseType: !281, size: 32, offset: 2112)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !486, file: !487, line: 345, baseType: !281, size: 32, offset: 2144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !486, file: !487, line: 346, baseType: !281, size: 32, offset: 2176)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !486, file: !487, line: 347, baseType: !286, size: 16, offset: 2208)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !486, file: !487, line: 348, baseType: !286, size: 16, offset: 2224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !486, file: !487, line: 349, baseType: !281, size: 32, offset: 2240)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !486, file: !487, line: 351, baseType: !281, size: 32, offset: 2272)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !486, file: !487, line: 353, baseType: !286, size: 16, offset: 2304)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !486, file: !487, line: 354, baseType: !286, size: 16, offset: 2320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !486, file: !487, line: 355, baseType: !281, size: 32, offset: 2336)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !486, file: !487, line: 357, baseType: !305, size: 128, offset: 2368)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !486, file: !487, line: 363, baseType: !273, size: 128, offset: 2496)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !486, file: !487, line: 363, baseType: !273, size: 128, offset: 2624)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !486, file: !487, line: 368, baseType: !522, size: 64, offset: 2752)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !487, line: 48, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !486, file: !487, line: 372, baseType: !525, size: 32, offset: 2816)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !487, line: 274, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !487, line: 271, size: 32, elements: !527)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !526, file: !487, line: 273, baseType: !5, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !486, file: !487, line: 373, baseType: !281, size: 32, offset: 2848)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !486, file: !487, line: 382, baseType: !531, size: 64, offset: 2880)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !487, line: 46, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !486, file: !487, line: 385, baseType: !534, size: 64, offset: 2944)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !278, !283}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !486, file: !487, line: 386, baseType: !538, size: 64, offset: 3008)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !278, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !486, file: !487, line: 387, baseType: !543, size: 64, offset: 3072)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!281, !278}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !486, file: !487, line: 388, baseType: !547, size: 64, offset: 3136)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !278}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !486, file: !487, line: 389, baseType: !278, size: 64, offset: 3200)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !486, file: !487, line: 389, baseType: !278, size: 64, offset: 3264)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !486, file: !487, line: 389, baseType: !278, size: 64, offset: 3328)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !486, file: !487, line: 389, baseType: !278, size: 64, offset: 3392)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !438, file: !439, line: 1244, baseType: !555, size: 64, offset: 2048)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !557, line: 200, size: 17024, elements: !558)
!557 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!558 = !{!559, !561, !562, !563, !980, !981, !982, !983, !984, !985, !986}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !556, file: !557, line: 201, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !556, file: !557, line: 202, baseType: !273, size: 128, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !556, file: !557, line: 203, baseType: !273, size: 128, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !556, file: !557, line: 206, baseType: !564, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !557, line: 190, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !557, line: 126, size: 2816, elements: !567)
!567 = !{!568, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !667, !670, !671, !672, !952, !955, !956, !957, !958, !959, !960, !961, !962, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !979}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !557, line: 127, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !566, file: !557, line: 127, baseType: !569, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !566, file: !557, line: 128, baseType: !278, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !566, file: !557, line: 129, baseType: !278, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !566, file: !557, line: 130, baseType: !418, size: 512, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !557, line: 132, baseType: !281, size: 32, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !566, file: !557, line: 132, baseType: !281, size: 32, offset: 800)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !566, file: !557, line: 133, baseType: !281, size: 32, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !566, file: !557, line: 134, baseType: !281, size: 32, offset: 864)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !566, file: !557, line: 134, baseType: !281, size: 32, offset: 896)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !566, file: !557, line: 134, baseType: !281, size: 32, offset: 928)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !566, file: !557, line: 135, baseType: !281, size: 32, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !566, file: !557, line: 135, baseType: !281, size: 32, offset: 992)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !566, file: !557, line: 136, baseType: !281, size: 32, offset: 1024)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !566, file: !557, line: 136, baseType: !281, size: 32, offset: 1056)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !566, file: !557, line: 137, baseType: !281, size: 32, offset: 1088)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !566, file: !557, line: 137, baseType: !281, size: 32, offset: 1120)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !566, file: !557, line: 138, baseType: !283, size: 32, offset: 1152)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !566, file: !557, line: 139, baseType: !283, size: 32, offset: 1184)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !566, file: !557, line: 139, baseType: !283, size: 32, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !566, file: !557, line: 141, baseType: !286, size: 16, offset: 1248)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !566, file: !557, line: 142, baseType: !286, size: 16, offset: 1264)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !566, file: !557, line: 143, baseType: !281, size: 32, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !566, file: !557, line: 144, baseType: !281, size: 32, offset: 1312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !566, file: !557, line: 146, baseType: !594, size: 64, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !557, line: 114, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !557, line: 99, size: 7232, elements: !597)
!597 = !{!598, !600, !601, !602, !603, !604, !605, !616, !620, !635, !644, !651, !661}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !557, line: 100, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !596, file: !557, line: 100, baseType: !599, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !596, file: !557, line: 101, baseType: !281, size: 32, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !596, file: !557, line: 101, baseType: !281, size: 32, offset: 160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !596, file: !557, line: 102, baseType: !281, size: 32, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !596, file: !557, line: 102, baseType: !281, size: 32, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !596, file: !557, line: 103, baseType: !606, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !557, line: 59, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !557, line: 56, size: 2112, elements: !609)
!609 = !{!610, !614, !615}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !608, file: !557, line: 57, baseType: !611, size: 2048)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 2048, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !608, file: !557, line: 58, baseType: !281, size: 32, offset: 2048)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !608, file: !557, line: 58, baseType: !281, size: 32, offset: 2080)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !596, file: !557, line: 106, baseType: !617, size: 6144, offset: 320)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 6144, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !596, file: !557, line: 107, baseType: !621, size: 64, offset: 6464)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !557, line: 97, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !557, line: 83, size: 8320, elements: !624)
!624 = !{!625, !626, !627, !631, !632, !633, !634}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !623, file: !557, line: 84, baseType: !617, size: 6144)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !623, file: !557, line: 87, baseType: !611, size: 2048, offset: 6144)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !623, file: !557, line: 88, baseType: !628, size: 64, offset: 8192)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !630, line: 41, flags: DIFlagFwdDecl)
!630 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !623, file: !557, line: 90, baseType: !286, size: 16, offset: 8256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !623, file: !557, line: 92, baseType: !286, size: 16, offset: 8272)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !623, file: !557, line: 93, baseType: !286, size: 16, offset: 8288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !623, file: !557, line: 95, baseType: !286, size: 16, offset: 8304)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !596, file: !557, line: 108, baseType: !636, size: 64, offset: 6528)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !557, line: 66, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !557, line: 61, size: 128, elements: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !638, file: !557, line: 62, baseType: !281, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !638, file: !557, line: 63, baseType: !281, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !638, file: !557, line: 64, baseType: !281, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !638, file: !557, line: 65, baseType: !281, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !596, file: !557, line: 109, baseType: !645, size: 64, offset: 6592)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !557, line: 71, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !557, line: 68, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !647, file: !557, line: 69, baseType: !281, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !647, file: !557, line: 70, baseType: !281, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !596, file: !557, line: 110, baseType: !652, size: 64, offset: 6656)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !557, line: 81, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !557, line: 73, size: 352, elements: !655)
!655 = !{!656, !657, !658, !659, !660}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !654, file: !557, line: 74, baseType: !469, size: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !654, file: !557, line: 75, baseType: !469, size: 96, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !654, file: !557, line: 76, baseType: !469, size: 96, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !654, file: !557, line: 77, baseType: !281, size: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !654, file: !557, line: 78, baseType: !281, size: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !596, file: !557, line: 113, baseType: !662, size: 512, offset: 6720)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !663, line: 182, baseType: !664)
!663 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !663, line: 180, size: 512, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !663, line: 181, baseType: !418, size: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !566, file: !557, line: 148, baseType: !668, size: 64, offset: 1408)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !557, line: 49, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !566, file: !557, line: 151, baseType: !437, size: 64, offset: 1472)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !566, file: !557, line: 152, baseType: !447, size: 64, offset: 1536)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !566, file: !557, line: 153, baseType: !673, size: 64, offset: 1600)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !445, line: 64, size: 19136, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !683, !684, !685, !686, !689, !690, !938, !939, !947, !948, !949, !950, !951}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !674, file: !445, line: 65, baseType: !370, size: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !674, file: !445, line: 66, baseType: !443, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !445, line: 68, baseType: !389, size: 8192, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !674, file: !445, line: 70, baseType: !281, size: 32, offset: 9216)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !674, file: !445, line: 71, baseType: !281, size: 32, offset: 9248)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !674, file: !445, line: 72, baseType: !682, size: 64, offset: 9280)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 64, elements: !326)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !674, file: !445, line: 74, baseType: !283, size: 32, offset: 9344)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !674, file: !445, line: 74, baseType: !283, size: 32, offset: 9376)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !674, file: !445, line: 76, baseType: !628, size: 64, offset: 9408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !674, file: !445, line: 77, baseType: !687, size: 64, offset: 9472)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !445, line: 77, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !674, file: !445, line: 78, baseType: !500, size: 64, offset: 9536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !674, file: !445, line: 80, baseType: !691, size: 2624, offset: 9600)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !502, line: 340, size: 2624, elements: !692)
!692 = !{!693, !721, !739, !740, !741, !759, !817, !818, !918, !919, !920, !921, !927}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !691, file: !502, line: 341, baseType: !694, size: 576)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !502, line: 251, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !502, line: 207, size: 576, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !695, file: !502, line: 208, baseType: !281, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !695, file: !502, line: 211, baseType: !286, size: 16, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !695, file: !502, line: 212, baseType: !286, size: 16, offset: 48)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !695, file: !502, line: 213, baseType: !283, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !695, file: !502, line: 214, baseType: !286, size: 16, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !695, file: !502, line: 215, baseType: !286, size: 16, offset: 112)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !695, file: !502, line: 216, baseType: !286, size: 16, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !695, file: !502, line: 217, baseType: !286, size: 16, offset: 144)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !695, file: !502, line: 218, baseType: !286, size: 16, offset: 160)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !695, file: !502, line: 219, baseType: !286, size: 16, offset: 176)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !695, file: !502, line: 220, baseType: !283, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !695, file: !502, line: 222, baseType: !286, size: 16, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !695, file: !502, line: 225, baseType: !286, size: 16, offset: 240)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !695, file: !502, line: 228, baseType: !281, size: 32, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !695, file: !502, line: 229, baseType: !281, size: 32, offset: 288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !695, file: !502, line: 233, baseType: !281, size: 32, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !695, file: !502, line: 236, baseType: !286, size: 16, offset: 352)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !695, file: !502, line: 236, baseType: !286, size: 16, offset: 368)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !695, file: !502, line: 241, baseType: !283, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !695, file: !502, line: 244, baseType: !281, size: 32, offset: 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !695, file: !502, line: 244, baseType: !281, size: 32, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !695, file: !502, line: 245, baseType: !283, size: 32, offset: 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !695, file: !502, line: 248, baseType: !283, size: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !695, file: !502, line: 250, baseType: !281, size: 32, offset: 544)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !691, file: !502, line: 342, baseType: !722, size: 448, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !502, line: 79, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !502, line: 61, size: 448, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !723, file: !502, line: 62, baseType: !278, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !723, file: !502, line: 64, baseType: !286, size: 16, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !723, file: !502, line: 65, baseType: !286, size: 16, offset: 80)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !723, file: !502, line: 67, baseType: !283, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !723, file: !502, line: 68, baseType: !283, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !723, file: !502, line: 69, baseType: !283, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !723, file: !502, line: 70, baseType: !286, size: 16, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !723, file: !502, line: 71, baseType: !286, size: 16, offset: 208)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !723, file: !502, line: 72, baseType: !325, size: 64, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !723, file: !502, line: 75, baseType: !283, size: 32, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !723, file: !502, line: 75, baseType: !283, size: 32, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !723, file: !502, line: 75, baseType: !283, size: 32, offset: 352)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !723, file: !502, line: 78, baseType: !283, size: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !723, file: !502, line: 78, baseType: !283, size: 32, offset: 416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !691, file: !502, line: 343, baseType: !273, size: 128, offset: 1024)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !691, file: !502, line: 344, baseType: !273, size: 128, offset: 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !691, file: !502, line: 345, baseType: !742, size: 192, offset: 1280)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !502, line: 278, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !502, line: 270, size: 192, elements: !744)
!744 = !{!745, !746, !747, !748, !749}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !502, line: 271, baseType: !281, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !743, file: !502, line: 273, baseType: !283, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !743, file: !502, line: 275, baseType: !281, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !743, file: !502, line: 276, baseType: !281, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !743, file: !502, line: 277, baseType: !750, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !502, line: 55, size: 576, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !751, file: !502, line: 56, baseType: !281, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !751, file: !502, line: 57, baseType: !283, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !751, file: !502, line: 58, baseType: !756, size: 512, offset: 64)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 512, elements: !757)
!757 = !{!758, !758}
!758 = !DISubrange(count: 4)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !691, file: !502, line: 346, baseType: !760, size: 384, offset: 1472)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !502, line: 268, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !502, line: 253, size: 384, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !811, !812, !813, !814, !815, !816}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !761, file: !502, line: 254, baseType: !281, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !761, file: !502, line: 255, baseType: !281, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !761, file: !502, line: 255, baseType: !281, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !761, file: !502, line: 258, baseType: !283, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !761, file: !502, line: 259, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !502, line: 164, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !502, line: 108, size: 1664, elements: !771)
!771 = !{!772, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !770, file: !502, line: 109, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !770, file: !502, line: 109, baseType: !773, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !502, line: 111, baseType: !418, size: 512, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !770, file: !502, line: 119, baseType: !325, size: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !770, file: !502, line: 119, baseType: !325, size: 64, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !770, file: !502, line: 125, baseType: !325, size: 64, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !770, file: !502, line: 125, baseType: !325, size: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !770, file: !502, line: 127, baseType: !325, size: 64, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !770, file: !502, line: 130, baseType: !281, size: 32, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !770, file: !502, line: 131, baseType: !281, size: 32, offset: 992)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !770, file: !502, line: 132, baseType: !784, size: 64, offset: 1024)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !502, line: 106, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !502, line: 81, size: 512, elements: !787)
!787 = !{!788, !789, !792, !793, !794, !795}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !786, file: !502, line: 82, baseType: !325, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !786, file: !502, line: 97, baseType: !790, size: 256, offset: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 256, elements: !791)
!791 = !{!758, !327}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !786, file: !502, line: 102, baseType: !325, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !786, file: !502, line: 102, baseType: !325, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !786, file: !502, line: 104, baseType: !281, size: 32, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !786, file: !502, line: 105, baseType: !281, size: 32, offset: 480)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !770, file: !502, line: 135, baseType: !469, size: 96, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !770, file: !502, line: 136, baseType: !283, size: 32, offset: 1184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !770, file: !502, line: 139, baseType: !281, size: 32, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !770, file: !502, line: 139, baseType: !281, size: 32, offset: 1248)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !770, file: !502, line: 139, baseType: !281, size: 32, offset: 1280)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !770, file: !502, line: 140, baseType: !469, size: 96, offset: 1312)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !770, file: !502, line: 143, baseType: !286, size: 16, offset: 1408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !770, file: !502, line: 144, baseType: !286, size: 16, offset: 1424)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !770, file: !502, line: 145, baseType: !286, size: 16, offset: 1440)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !770, file: !502, line: 148, baseType: !286, size: 16, offset: 1456)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !770, file: !502, line: 149, baseType: !281, size: 32, offset: 1472)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !770, file: !502, line: 150, baseType: !283, size: 32, offset: 1504)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !770, file: !502, line: 152, baseType: !500, size: 64, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !770, file: !502, line: 163, baseType: !283, size: 32, offset: 1600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !770, file: !502, line: 163, baseType: !283, size: 32, offset: 1632)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !761, file: !502, line: 261, baseType: !283, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !761, file: !502, line: 261, baseType: !283, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !761, file: !502, line: 261, baseType: !283, size: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !761, file: !502, line: 263, baseType: !281, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !761, file: !502, line: 266, baseType: !281, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !761, file: !502, line: 267, baseType: !283, size: 32, offset: 352)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !691, file: !502, line: 347, baseType: !768, size: 64, offset: 1856)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !691, file: !502, line: 348, baseType: !819, size: 64, offset: 1920)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !502, line: 205, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !502, line: 186, size: 1024, elements: !822)
!822 = !{!823, !825, !826, !827, !829, !830, !831, !839, !840, !841, !916, !917}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !821, file: !502, line: 187, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !821, file: !502, line: 187, baseType: !824, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !502, line: 189, baseType: !418, size: 512, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !821, file: !502, line: 191, baseType: !828, size: 64, offset: 640)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !821, file: !502, line: 193, baseType: !281, size: 32, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !821, file: !502, line: 193, baseType: !281, size: 32, offset: 736)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !821, file: !502, line: 195, baseType: !832, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !502, line: 184, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !502, line: 166, size: 320, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !834, file: !502, line: 180, baseType: !790, size: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !834, file: !502, line: 182, baseType: !281, size: 32, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !834, file: !502, line: 183, baseType: !281, size: 32, offset: 288)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !821, file: !502, line: 196, baseType: !281, size: 32, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !502, line: 198, baseType: !281, size: 32, offset: 864)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !821, file: !502, line: 200, baseType: !842, size: 64, offset: 896)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !630, line: 77, size: 15424, elements: !844)
!844 = !{!845, !846, !847, !850, !853, !854, !857, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !875, !876, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !902, !903, !904, !905, !906, !910}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !843, file: !630, line: 78, baseType: !370, size: 960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !843, file: !630, line: 80, baseType: !389, size: 8192, offset: 960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !843, file: !630, line: 82, baseType: !848, size: 64, offset: 9152)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !630, line: 43, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !843, file: !630, line: 83, baseType: !851, size: 64, offset: 9216)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !371, line: 46, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !843, file: !630, line: 86, baseType: !628, size: 64, offset: 9280)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !843, file: !630, line: 87, baseType: !855, size: 64, offset: 9344)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !630, line: 44, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !843, file: !630, line: 89, baseType: !858, size: 512, offset: 9408)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 512, elements: !287)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !843, file: !630, line: 90, baseType: !286, size: 16, offset: 9920)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !843, file: !630, line: 90, baseType: !286, size: 16, offset: 9936)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !843, file: !630, line: 92, baseType: !286, size: 16, offset: 9952)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !630, line: 92, baseType: !286, size: 16, offset: 9968)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !843, file: !630, line: 93, baseType: !286, size: 16, offset: 9984)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !843, file: !630, line: 93, baseType: !286, size: 16, offset: 10000)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !843, file: !630, line: 94, baseType: !281, size: 32, offset: 10016)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !843, file: !630, line: 97, baseType: !286, size: 16, offset: 10048)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !843, file: !630, line: 97, baseType: !286, size: 16, offset: 10064)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !843, file: !630, line: 98, baseType: !286, size: 16, offset: 10080)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !843, file: !630, line: 98, baseType: !286, size: 16, offset: 10096)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !843, file: !630, line: 99, baseType: !286, size: 16, offset: 10112)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !843, file: !630, line: 99, baseType: !286, size: 16, offset: 10128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !843, file: !630, line: 100, baseType: !5, size: 32, offset: 10144)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !843, file: !630, line: 101, baseType: !874, size: 64, offset: 10176)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !843, file: !630, line: 103, baseType: !396, size: 64, offset: 10240)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !843, file: !630, line: 104, baseType: !877, size: 64, offset: 10304)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !371, line: 159, size: 448, elements: !879)
!879 = !{!880, !882, !883, !885, !886, !888}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !878, file: !371, line: 161, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !326)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !878, file: !371, line: 162, baseType: !881, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !878, file: !371, line: 163, baseType: !884, size: 32, offset: 128)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 32, elements: !326)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !878, file: !371, line: 164, baseType: !884, size: 32, offset: 160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !878, file: !371, line: 165, baseType: !887, size: 128, offset: 192)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 128, elements: !326)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !878, file: !371, line: 166, baseType: !889, size: 128, offset: 320)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 128, elements: !326)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !843, file: !630, line: 107, baseType: !283, size: 32, offset: 10368)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !843, file: !630, line: 108, baseType: !281, size: 32, offset: 10400)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !843, file: !630, line: 109, baseType: !286, size: 16, offset: 10432)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !843, file: !630, line: 110, baseType: !286, size: 16, offset: 10448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !843, file: !630, line: 113, baseType: !281, size: 32, offset: 10464)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !843, file: !630, line: 113, baseType: !281, size: 32, offset: 10496)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !843, file: !630, line: 114, baseType: !390, size: 8, offset: 10528)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !843, file: !630, line: 114, baseType: !390, size: 8, offset: 10536)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !843, file: !630, line: 115, baseType: !286, size: 16, offset: 10544)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !843, file: !630, line: 116, baseType: !900, size: 128, offset: 10560)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 128, elements: !901)
!901 = !{!758}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !843, file: !630, line: 119, baseType: !283, size: 32, offset: 10688)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !843, file: !630, line: 119, baseType: !283, size: 32, offset: 10720)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !843, file: !630, line: 122, baseType: !662, size: 512, offset: 10752)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !843, file: !630, line: 123, baseType: !390, size: 8, offset: 11264)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !843, file: !630, line: 125, baseType: !907, size: 56, offset: 11272)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 56, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 7)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !843, file: !630, line: 126, baseType: !911, size: 4096, offset: 11328)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 4096, elements: !287)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !630, line: 69, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !630, line: 67, size: 512, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !913, file: !630, line: 68, baseType: !418, size: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !821, file: !502, line: 201, baseType: !283, size: 32, offset: 960)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !821, file: !502, line: 204, baseType: !281, size: 32, offset: 992)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !691, file: !502, line: 350, baseType: !273, size: 128, offset: 1984)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !691, file: !502, line: 351, baseType: !281, size: 32, offset: 2112)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !691, file: !502, line: 351, baseType: !281, size: 32, offset: 2144)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !691, file: !502, line: 353, baseType: !922, size: 64, offset: 2176)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !502, line: 297, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !502, line: 295, size: 2048, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !924, file: !502, line: 296, baseType: !611, size: 2048)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !691, file: !502, line: 355, baseType: !928, size: 384, offset: 2240)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !502, line: 338, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !502, line: 322, size: 384, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !937}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !929, file: !502, line: 323, baseType: !281, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !929, file: !502, line: 325, baseType: !286, size: 16, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !929, file: !502, line: 326, baseType: !286, size: 16, offset: 48)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !929, file: !502, line: 331, baseType: !273, size: 128, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !929, file: !502, line: 334, baseType: !273, size: 128, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !929, file: !502, line: 335, baseType: !281, size: 32, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !929, file: !502, line: 337, baseType: !281, size: 32, offset: 352)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !674, file: !445, line: 81, baseType: !278, size: 64, offset: 12224)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !674, file: !445, line: 85, baseType: !940, size: 6208, offset: 12288)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !445, line: 55, size: 6208, elements: !941)
!941 = !{!942, !943, !944, !945, !946}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !940, file: !445, line: 56, baseType: !617, size: 6144)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !940, file: !445, line: 58, baseType: !286, size: 16, offset: 6144)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !940, file: !445, line: 59, baseType: !286, size: 16, offset: 6160)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !940, file: !445, line: 60, baseType: !286, size: 16, offset: 6176)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !940, file: !445, line: 61, baseType: !286, size: 16, offset: 6192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !674, file: !445, line: 86, baseType: !281, size: 32, offset: 18496)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !674, file: !445, line: 88, baseType: !281, size: 32, offset: 18528)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !674, file: !445, line: 90, baseType: !281, size: 32, offset: 18560)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !674, file: !445, line: 94, baseType: !281, size: 32, offset: 18592)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !674, file: !445, line: 100, baseType: !662, size: 512, offset: 18624)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !566, file: !557, line: 154, baseType: !953, size: 64, offset: 1664)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !449, line: 264, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !566, file: !557, line: 156, baseType: !628, size: 64, offset: 1728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !566, file: !557, line: 158, baseType: !283, size: 32, offset: 1792)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !566, file: !557, line: 159, baseType: !283, size: 32, offset: 1824)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !566, file: !557, line: 162, baseType: !569, size: 64, offset: 1856)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !566, file: !557, line: 162, baseType: !569, size: 64, offset: 1920)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !566, file: !557, line: 162, baseType: !569, size: 64, offset: 1984)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !566, file: !557, line: 164, baseType: !273, size: 128, offset: 2048)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !566, file: !557, line: 166, baseType: !963, size: 64, offset: 2176)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !557, line: 51, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !566, file: !557, line: 167, baseType: !278, size: 64, offset: 2240)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !566, file: !557, line: 168, baseType: !283, size: 32, offset: 2304)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !566, file: !557, line: 170, baseType: !283, size: 32, offset: 2336)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !566, file: !557, line: 170, baseType: !283, size: 32, offset: 2368)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !566, file: !557, line: 171, baseType: !283, size: 32, offset: 2400)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !566, file: !557, line: 173, baseType: !278, size: 64, offset: 2432)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !566, file: !557, line: 175, baseType: !281, size: 32, offset: 2496)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !566, file: !557, line: 176, baseType: !281, size: 32, offset: 2528)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !566, file: !557, line: 179, baseType: !281, size: 32, offset: 2560)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !566, file: !557, line: 180, baseType: !283, size: 32, offset: 2592)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !566, file: !557, line: 183, baseType: !281, size: 32, offset: 2624)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !566, file: !557, line: 185, baseType: !390, size: 8, offset: 2656)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !566, file: !557, line: 186, baseType: !978, size: 24, offset: 2664)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 24, elements: !470)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !566, file: !557, line: 189, baseType: !273, size: 128, offset: 2688)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !556, file: !557, line: 207, baseType: !389, size: 8192, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !556, file: !557, line: 208, baseType: !389, size: 8192, offset: 8576)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !556, file: !557, line: 210, baseType: !281, size: 32, offset: 16768)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !556, file: !557, line: 210, baseType: !281, size: 32, offset: 16800)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !556, file: !557, line: 211, baseType: !281, size: 32, offset: 16832)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !556, file: !557, line: 211, baseType: !281, size: 32, offset: 16864)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !556, file: !557, line: 212, baseType: !305, size: 128, offset: 16896)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !438, file: !439, line: 1246, baseType: !988, size: 64, offset: 2112)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !439, line: 1067, size: 5184, elements: !990)
!990 = !{!991, !1021, !1022, !1037, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1059, !1075, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1185}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !989, file: !439, line: 1068, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !439, line: 934, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !439, line: 925, size: 576, elements: !995)
!995 = !{!996, !1013, !1014, !1015, !1016, !1017, !1020}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !994, file: !439, line: 926, baseType: !997, size: 320)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !439, line: 830, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !439, line: 813, size: 320, elements: !999)
!999 = !{!1000, !1003, !1006, !1007, !1010, !1011, !1012}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !998, file: !439, line: 814, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !439, line: 51, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !998, file: !439, line: 815, baseType: !1004, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !439, line: 815, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !998, file: !439, line: 818, baseType: !278, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !998, file: !439, line: 819, baseType: !1008, size: 32, offset: 192)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 32, elements: !901)
!1009 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !998, file: !439, line: 822, baseType: !281, size: 32, offset: 224)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !998, file: !439, line: 826, baseType: !281, size: 32, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !998, file: !439, line: 829, baseType: !281, size: 32, offset: 288)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !994, file: !439, line: 928, baseType: !286, size: 16, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !994, file: !439, line: 928, baseType: !286, size: 16, offset: 336)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !994, file: !439, line: 929, baseType: !281, size: 32, offset: 352)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !994, file: !439, line: 930, baseType: !874, size: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !994, file: !439, line: 931, baseType: !1018, size: 64, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !439, line: 931, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !994, file: !439, line: 933, baseType: !278, size: 64, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !989, file: !439, line: 1069, baseType: !992, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !989, file: !439, line: 1070, baseType: !1023, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !439, line: 916, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !439, line: 891, size: 704, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1031, !1032, !1033, !1034, !1035, !1036}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1025, file: !439, line: 892, baseType: !997, size: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1025, file: !439, line: 896, baseType: !281, size: 32, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1025, file: !439, line: 900, baseType: !1030, size: 96, offset: 352)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 96, elements: !470)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1025, file: !439, line: 903, baseType: !283, size: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1025, file: !439, line: 906, baseType: !281, size: 32, offset: 480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1025, file: !439, line: 909, baseType: !283, size: 32, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1025, file: !439, line: 912, baseType: !283, size: 32, offset: 544)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1025, file: !439, line: 914, baseType: !447, size: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1025, file: !439, line: 915, baseType: !278, size: 64, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !989, file: !439, line: 1071, baseType: !1038, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !439, line: 920, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !439, line: 918, size: 320, elements: !1041)
!1041 = !{!1042}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1040, file: !439, line: 919, baseType: !997, size: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !989, file: !439, line: 1075, baseType: !283, size: 32, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !989, file: !439, line: 1077, baseType: !283, size: 32, offset: 288)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !989, file: !439, line: 1078, baseType: !283, size: 32, offset: 320)
