; ModuleID = 'blender/source/blender/imbuf/intern/allocimbuf.c'
source_filename = "blender/source/blender/imbuf/intern/allocimbuf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type { %struct.ImMetaData*, %struct.ImMetaData*, i8*, i8*, i32 }
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type { %struct.ColorSpace*, %struct.ColorSpace*, i32, [64 x i8], [512 x i8], %struct.OCIO_ConstProcessorRcPtr*, %struct.OCIO_ConstProcessorRcPtr*, i8, i8 }
%struct.OCIO_ConstProcessorRcPtr = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

@refcounter_spin = internal global i32 0, align 4, !dbg !0
@MEM_freeN = external dso_local global void (i8*)*, align 8
@MEM_mapallocN = external dso_local global i8* (i64, i8*)*, align 8
@__func__.addzbufImBuf = private unnamed_addr constant [13 x i8] c"addzbufImBuf\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "refcounter_spin", scope: !2, file: !3, line: 53, type: !11, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !10, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/imbuf/intern/allocimbuf.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !{!0}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !12, line: 127, baseType: !13)
!12 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !14, line: 9, baseType: !15)
!14 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 26, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !18, line: 42, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !{i32 7, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{i32 1, !"wchar_size", i32 4}
!23 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!24 = distinct !DISubprogram(name: "imb_refcounter_lock_init", scope: !3, file: !3, line: 55, type: !25, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!25 = !DISubroutineType(types: !26)
!26 = !{null}
!27 = !DILocation(line: 57, column: 2, scope: !24)
!28 = !DILocation(line: 58, column: 1, scope: !24)
!29 = distinct !DISubprogram(name: "imb_refcounter_lock_exit", scope: !3, file: !3, line: 60, type: !25, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!30 = !DILocation(line: 62, column: 2, scope: !29)
!31 = !DILocation(line: 63, column: 1, scope: !29)
!32 = distinct !DISubprogram(name: "imb_freemipmapImBuf", scope: !3, file: !3, line: 65, type: !33, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !37, line: 141, baseType: !38)
!37 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !37, line: 70, size: 19840, elements: !39)
!39 = !{!40, !42, !43, !45, !46, !48, !49, !50, !51, !53, !56, !61, !62, !63, !64, !65, !67, !69, !70, !71, !75, !76, !77, !78, !79, !91, !92, !93, !97, !98, !101, !102, !104, !105, !106, !128, !129, !130, !133, !134, !143}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !37, line: 71, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !38, file: !37, line: 71, baseType: !41, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !37, line: 74, baseType: !44, size: 32, offset: 128)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !37, line: 74, baseType: !44, size: 32, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !38, file: !37, line: 79, baseType: !47, size: 8, offset: 192)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !38, file: !37, line: 80, baseType: !44, size: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !38, file: !37, line: 83, baseType: !44, size: 32, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !38, file: !37, line: 84, baseType: !44, size: 32, offset: 288)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !38, file: !37, line: 87, baseType: !52, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !38, file: !37, line: 88, baseType: !54, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !38, file: !37, line: 93, baseType: !57, size: 128, offset: 448)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !59)
!58 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!59 = !{!60}
!60 = !DISubrange(count: 2)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !38, file: !37, line: 96, baseType: !44, size: 32, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !38, file: !37, line: 96, baseType: !44, size: 32, offset: 608)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !38, file: !37, line: 97, baseType: !44, size: 32, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !38, file: !37, line: 97, baseType: !44, size: 32, offset: 672)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !38, file: !37, line: 98, baseType: !66, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !38, file: !37, line: 101, baseType: !68, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !38, file: !37, line: 102, baseType: !54, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !38, file: !37, line: 105, baseType: !55, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !38, file: !37, line: 108, baseType: !72, size: 1280, offset: 960)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1280, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 20)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !38, file: !37, line: 109, baseType: !44, size: 32, offset: 2240)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !38, file: !37, line: 109, baseType: !44, size: 32, offset: 2272)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !38, file: !37, line: 112, baseType: !44, size: 32, offset: 2304)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !38, file: !37, line: 113, baseType: !44, size: 32, offset: 2336)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !38, file: !37, line: 114, baseType: !80, size: 64, offset: 2368)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !82, line: 38, size: 320, elements: !83)
!82 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_metadata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !{!84, !85, !86, !89, !90}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !82, line: 39, baseType: !80, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !81, file: !82, line: 39, baseType: !80, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !81, file: !82, line: 40, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !81, file: !82, line: 41, baseType: !87, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !81, file: !82, line: 42, baseType: !44, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !38, file: !37, line: 115, baseType: !6, size: 64, offset: 2432)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !38, file: !37, line: 118, baseType: !44, size: 32, offset: 2496)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 119, baseType: !94, size: 8192, offset: 2528)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8192, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !38, file: !37, line: 120, baseType: !94, size: 8192, offset: 10720)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !38, file: !37, line: 123, baseType: !99, size: 64, offset: 18944)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !37, line: 123, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !38, file: !37, line: 124, baseType: !44, size: 32, offset: 19008)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !38, file: !37, line: 127, baseType: !103, size: 64, offset: 19072)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !38, file: !37, line: 128, baseType: !19, size: 32, offset: 19136)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !38, file: !37, line: 129, baseType: !19, size: 32, offset: 19168)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !38, file: !37, line: 132, baseType: !107, size: 64, offset: 19200)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !109, line: 47, size: 4992, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_colormanagement_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !113, !114, !118, !122, !125, !126, !127}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !109, line: 48, baseType: !107, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !108, file: !109, line: 48, baseType: !107, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !108, file: !109, line: 49, baseType: !44, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !109, line: 50, baseType: !115, size: 512, offset: 160)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 512, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !108, file: !109, line: 51, baseType: !119, size: 4096, offset: 672)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 4096, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "to_scene_linear", scope: !108, file: !109, line: 53, baseType: !123, size: 64, offset: 4800)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "OCIO_ConstProcessorRcPtr", file: !109, line: 41, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "from_scene_linear", scope: !108, file: !109, line: 54, baseType: !123, size: 64, offset: 4864)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "is_invertible", scope: !108, file: !109, line: 56, baseType: !47, size: 8, offset: 4928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "is_data", scope: !108, file: !109, line: 57, baseType: !47, size: 8, offset: 4936)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !38, file: !37, line: 133, baseType: !107, size: 64, offset: 19264)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !38, file: !37, line: 134, baseType: !52, size: 64, offset: 19328)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !38, file: !37, line: 135, baseType: !131, size: 64, offset: 19392)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !37, line: 135, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !38, file: !37, line: 136, baseType: !44, size: 32, offset: 19456)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !38, file: !37, line: 137, baseType: !135, size: 128, offset: 19488)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !136, line: 89, baseType: !137)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !136, line: 86, size: 128, elements: !138)
!138 = !{!139, !140, !141, !142}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !137, file: !136, line: 87, baseType: !44, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !137, file: !136, line: 87, baseType: !44, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !137, file: !136, line: 88, baseType: !44, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !137, file: !136, line: 88, baseType: !44, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !38, file: !37, line: 140, baseType: !144, size: 192, offset: 19648)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !37, line: 55, size: 192, elements: !145)
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !144, file: !37, line: 56, baseType: !19, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !144, file: !37, line: 57, baseType: !19, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !37, line: 58, baseType: !103, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !144, file: !37, line: 59, baseType: !19, size: 32, offset: 128)
!150 = !DILocalVariable(name: "ibuf", arg: 1, scope: !32, file: !3, line: 65, type: !35)
!151 = !DILocation(line: 65, column: 33, scope: !32)
!152 = !DILocalVariable(name: "a", scope: !32, file: !3, line: 67, type: !44)
!153 = !DILocation(line: 67, column: 6, scope: !32)
!154 = !DILocation(line: 69, column: 9, scope: !155)
!155 = distinct !DILexicalBlock(scope: !32, file: !3, line: 69, column: 2)
!156 = !DILocation(line: 69, column: 7, scope: !155)
!157 = !DILocation(line: 69, column: 14, scope: !158)
!158 = distinct !DILexicalBlock(scope: !155, file: !3, line: 69, column: 2)
!159 = !DILocation(line: 69, column: 18, scope: !158)
!160 = !DILocation(line: 69, column: 24, scope: !158)
!161 = !DILocation(line: 69, column: 16, scope: !158)
!162 = !DILocation(line: 69, column: 2, scope: !155)
!163 = !DILocation(line: 70, column: 7, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !3, line: 70, column: 7)
!165 = distinct !DILexicalBlock(scope: !158, file: !3, line: 69, column: 37)
!166 = !DILocation(line: 70, column: 13, scope: !164)
!167 = !DILocation(line: 70, column: 20, scope: !164)
!168 = !DILocation(line: 70, column: 22, scope: !164)
!169 = !DILocation(line: 70, column: 7, scope: !165)
!170 = !DILocation(line: 71, column: 18, scope: !164)
!171 = !DILocation(line: 71, column: 24, scope: !164)
!172 = !DILocation(line: 71, column: 31, scope: !164)
!173 = !DILocation(line: 71, column: 33, scope: !164)
!174 = !DILocation(line: 71, column: 4, scope: !164)
!175 = !DILocation(line: 72, column: 3, scope: !165)
!176 = !DILocation(line: 72, column: 9, scope: !165)
!177 = !DILocation(line: 72, column: 16, scope: !165)
!178 = !DILocation(line: 72, column: 18, scope: !165)
!179 = !DILocation(line: 72, column: 23, scope: !165)
!180 = !DILocation(line: 73, column: 2, scope: !165)
!181 = !DILocation(line: 69, column: 33, scope: !158)
!182 = !DILocation(line: 69, column: 2, scope: !158)
!183 = distinct !{!183, !162, !184}
!184 = !DILocation(line: 73, column: 2, scope: !155)
!185 = !DILocation(line: 75, column: 2, scope: !32)
!186 = !DILocation(line: 75, column: 8, scope: !32)
!187 = !DILocation(line: 75, column: 15, scope: !32)
!188 = !DILocation(line: 76, column: 1, scope: !32)
!189 = distinct !DISubprogram(name: "IMB_freeImBuf", scope: !3, file: !3, line: 166, type: !33, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!190 = !DILocalVariable(name: "ibuf", arg: 1, scope: !189, file: !3, line: 166, type: !35)
!191 = !DILocation(line: 166, column: 27, scope: !189)
!192 = !DILocation(line: 168, column: 6, scope: !193)
!193 = distinct !DILexicalBlock(scope: !189, file: !3, line: 168, column: 6)
!194 = !DILocation(line: 168, column: 6, scope: !189)
!195 = !DILocalVariable(name: "needs_free", scope: !196, file: !3, line: 169, type: !47)
!196 = distinct !DILexicalBlock(scope: !193, file: !3, line: 168, column: 12)
!197 = !DILocation(line: 169, column: 8, scope: !196)
!198 = !DILocation(line: 171, column: 3, scope: !196)
!199 = !DILocation(line: 172, column: 7, scope: !200)
!200 = distinct !DILexicalBlock(scope: !196, file: !3, line: 172, column: 7)
!201 = !DILocation(line: 172, column: 13, scope: !200)
!202 = !DILocation(line: 172, column: 24, scope: !200)
!203 = !DILocation(line: 172, column: 7, scope: !196)
!204 = !DILocation(line: 173, column: 4, scope: !205)
!205 = distinct !DILexicalBlock(scope: !200, file: !3, line: 172, column: 29)
!206 = !DILocation(line: 173, column: 10, scope: !205)
!207 = !DILocation(line: 173, column: 20, scope: !205)
!208 = !DILocation(line: 174, column: 3, scope: !205)
!209 = !DILocation(line: 176, column: 15, scope: !210)
!210 = distinct !DILexicalBlock(scope: !200, file: !3, line: 175, column: 8)
!211 = !DILocation(line: 178, column: 3, scope: !196)
!212 = !DILocation(line: 180, column: 7, scope: !213)
