; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_edit.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "modal_items", scope: !2, file: !3, line: 861, type: !2920, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "viewrotate_modal_keymap", scope: !3, file: !3, line: 859, type: !4, scopeLine: 860, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !31, retainedNodes: !2756)
!3 = !DIFile(filename: "blender/source/blender/editors/space_view3d/view3d_edit.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyConfig", file: !8, line: 318, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !8, line: 310, size: 1344, elements: !10)
!10 = !{!11, !13, !14, !19, !20, !28, !30}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !8, line: 311, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !9, file: !8, line: 311, baseType: !12, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 313, baseType: !15, size: 512, offset: 128)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !{!18}
!18 = !DISubrange(count: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !9, file: !8, line: 314, baseType: !15, size: 512, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !9, file: !8, line: 316, baseType: !21, size: 128, offset: 1152)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !22, line: 71, baseType: !23)
!22 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !22, line: 69, size: 128, elements: !24)
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !23, file: !22, line: 70, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !23, file: !22, line: 70, baseType: !26, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !9, file: !8, line: 317, baseType: !29, size: 32, offset: 1280)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !9, file: !8, line: 317, baseType: !29, size: 32, offset: 1312)
!31 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !32, retainedTypes: !533, globals: !2752, splitDebugInlining: false, nameTableKind: None)
!32 = !{!33, !64, !72, !88, !93, !104, !305, !313, !331, !365, !374, !382, !387, !397, !410, !415, !419, !425, !447, !455, !460, !474, !479, !490, !516, !529}
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserpref_UI_Flag", file: !34, line: 630, baseType: !29, size: 32, elements: !35)
!34 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!36 = !DIEnumerator(name: "USER_WHEELZOOMDIR", value: 4)
!37 = !DIEnumerator(name: "USER_FILTERFILEEXTS", value: 8)
!38 = !DIEnumerator(name: "USER_DRAWVIEWINFO", value: 16)
!39 = !DIEnumerator(name: "USER_PLAINMENUS", value: 32)
!40 = !DIEnumerator(name: "USER_ALLWINCODECS", value: 256)
!41 = !DIEnumerator(name: "USER_MENUOPENAUTO", value: 512)
!42 = !DIEnumerator(name: "USER_ZBUF_CURSOR", value: 1024)
!43 = !DIEnumerator(name: "USER_AUTOPERSP", value: 2048)
!44 = !DIEnumerator(name: "USER_LOCKAROUND", value: 4096)
!45 = !DIEnumerator(name: "USER_GLOBALUNDO", value: 8192)
!46 = !DIEnumerator(name: "USER_ORBIT_SELECTION", value: 16384)
!47 = !DIEnumerator(name: "USER_ZBUF_ORBIT", value: 32768)
!48 = !DIEnumerator(name: "USER_HIDE_DOT", value: 65536)
!49 = !DIEnumerator(name: "USER_SHOW_ROTVIEWICON", value: 131072)
!50 = !DIEnumerator(name: "USER_SHOW_VIEWPORTNAME", value: 262144)
!51 = !DIEnumerator(name: "USER_CAM_LOCK_NO_PARENT", value: 524288)
!52 = !DIEnumerator(name: "USER_ZOOM_TO_MOUSEPOS", value: 1048576)
!53 = !DIEnumerator(name: "USER_SHOW_FPS", value: 2097152)
!54 = !DIEnumerator(name: "USER_MMB_PASTE", value: 4194304)
!55 = !DIEnumerator(name: "USER_MENUFIXEDORDER", value: 8388608)
!56 = !DIEnumerator(name: "USER_CONTINUOUS_MOUSE", value: 16777216)
!57 = !DIEnumerator(name: "USER_ZOOM_INVERT", value: 33554432)
!58 = !DIEnumerator(name: "USER_ZOOM_HORIZ", value: 67108864)
!59 = !DIEnumerator(name: "USER_SPLASH_DISABLE", value: 134217728)
!60 = !DIEnumerator(name: "USER_HIDE_RECENT", value: 268435456)
!61 = !DIEnumerator(name: "USER_SHOW_THUMBNAILS", value: 536870912)
!62 = !DIEnumerator(name: "USER_QUIT_PROMPT", value: 1073741824)
!63 = !DIEnumerator(name: "USER_HIDE_SYSTEM_BOOKMARKS", value: -2147483648)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 519, baseType: !66, size: 32, elements: !67)
!65 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 648, baseType: !66, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!74 = !DIEnumerator(name: "OB_LOCK_LOCX", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "OB_LOCK_LOCY", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "OB_LOCK_LOCZ", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "OB_LOCK_LOC", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "OB_LOCK_ROTX", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "OB_LOCK_ROTY", value: 16, isUnsigned: true)
!80 = !DIEnumerator(name: "OB_LOCK_ROTZ", value: 32, isUnsigned: true)
!81 = !DIEnumerator(name: "OB_LOCK_ROT", value: 56, isUnsigned: true)
!82 = !DIEnumerator(name: "OB_LOCK_SCALEX", value: 64, isUnsigned: true)
!83 = !DIEnumerator(name: "OB_LOCK_SCALEY", value: 128, isUnsigned: true)
!84 = !DIEnumerator(name: "OB_LOCK_SCALEZ", value: 256, isUnsigned: true)
!85 = !DIEnumerator(name: "OB_LOCK_SCALE", value: 448, isUnsigned: true)
!86 = !DIEnumerator(name: "OB_LOCK_ROTW", value: 512, isUnsigned: true)
!87 = !DIEnumerator(name: "OB_LOCK_ROT4D", value: 1024, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eModifyKey_Modes", file: !89, line: 178, baseType: !66, size: 32, elements: !90)
!89 = !DIFile(filename: "blender/source/blender/editors/include/ED_keyframing.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!90 = !{!91, !92}
!91 = !DIEnumerator(name: "MODIFYKEY_MODE_INSERT", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "MODIFYKEY_MODE_DELETE", value: 1, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 361, baseType: !66, size: 32, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103}
!96 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!102 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!103 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 54, baseType: !66, size: 32, elements: !106)
!105 = !DIFile(filename: "blender/source/blender/windowmanager/wm_event_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!107 = !DIEnumerator(name: "EVENT_NONE", value: 0, isUnsigned: true)
!108 = !DIEnumerator(name: "LEFTMOUSE", value: 1, isUnsigned: true)
!109 = !DIEnumerator(name: "MIDDLEMOUSE", value: 2, isUnsigned: true)
!110 = !DIEnumerator(name: "RIGHTMOUSE", value: 3, isUnsigned: true)
!111 = !DIEnumerator(name: "MOUSEMOVE", value: 4, isUnsigned: true)
!112 = !DIEnumerator(name: "ACTIONMOUSE", value: 5, isUnsigned: true)
!113 = !DIEnumerator(name: "SELECTMOUSE", value: 6, isUnsigned: true)
!114 = !DIEnumerator(name: "BUTTON4MOUSE", value: 7, isUnsigned: true)
!115 = !DIEnumerator(name: "BUTTON5MOUSE", value: 8, isUnsigned: true)
!116 = !DIEnumerator(name: "BUTTON6MOUSE", value: 18, isUnsigned: true)
!117 = !DIEnumerator(name: "BUTTON7MOUSE", value: 19, isUnsigned: true)
!118 = !DIEnumerator(name: "MOUSEPAN", value: 14, isUnsigned: true)
!119 = !DIEnumerator(name: "MOUSEZOOM", value: 15, isUnsigned: true)
!120 = !DIEnumerator(name: "MOUSEROTATE", value: 16, isUnsigned: true)
!121 = !DIEnumerator(name: "WHEELUPMOUSE", value: 10, isUnsigned: true)
!122 = !DIEnumerator(name: "WHEELDOWNMOUSE", value: 11, isUnsigned: true)
!123 = !DIEnumerator(name: "WHEELINMOUSE", value: 12, isUnsigned: true)
!124 = !DIEnumerator(name: "WHEELOUTMOUSE", value: 13, isUnsigned: true)
!125 = !DIEnumerator(name: "INBETWEEN_MOUSEMOVE", value: 17, isUnsigned: true)
!126 = !DIEnumerator(name: "AKEY", value: 97, isUnsigned: true)
!127 = !DIEnumerator(name: "BKEY", value: 98, isUnsigned: true)
!128 = !DIEnumerator(name: "CKEY", value: 99, isUnsigned: true)
!129 = !DIEnumerator(name: "DKEY", value: 100, isUnsigned: true)
!130 = !DIEnumerator(name: "EKEY", value: 101, isUnsigned: true)
!131 = !DIEnumerator(name: "FKEY", value: 102, isUnsigned: true)
!132 = !DIEnumerator(name: "GKEY", value: 103, isUnsigned: true)
!133 = !DIEnumerator(name: "HKEY", value: 104, isUnsigned: true)
!134 = !DIEnumerator(name: "IKEY", value: 105, isUnsigned: true)
!135 = !DIEnumerator(name: "JKEY", value: 106, isUnsigned: true)
!136 = !DIEnumerator(name: "KKEY", value: 107, isUnsigned: true)
!137 = !DIEnumerator(name: "LKEY", value: 108, isUnsigned: true)
!138 = !DIEnumerator(name: "MKEY", value: 109, isUnsigned: true)
!139 = !DIEnumerator(name: "NKEY", value: 110, isUnsigned: true)
!140 = !DIEnumerator(name: "OKEY", value: 111, isUnsigned: true)
!141 = !DIEnumerator(name: "PKEY", value: 112, isUnsigned: true)
!142 = !DIEnumerator(name: "QKEY", value: 113, isUnsigned: true)
!143 = !DIEnumerator(name: "RKEY", value: 114, isUnsigned: true)
!144 = !DIEnumerator(name: "SKEY", value: 115, isUnsigned: true)
!145 = !DIEnumerator(name: "TKEY", value: 116, isUnsigned: true)
!146 = !DIEnumerator(name: "UKEY", value: 117, isUnsigned: true)
!147 = !DIEnumerator(name: "VKEY", value: 118, isUnsigned: true)
!148 = !DIEnumerator(name: "WKEY", value: 119, isUnsigned: true)
!149 = !DIEnumerator(name: "XKEY", value: 120, isUnsigned: true)
!150 = !DIEnumerator(name: "YKEY", value: 121, isUnsigned: true)
!151 = !DIEnumerator(name: "ZKEY", value: 122, isUnsigned: true)
!152 = !DIEnumerator(name: "ZEROKEY", value: 48, isUnsigned: true)
!153 = !DIEnumerator(name: "ONEKEY", value: 49, isUnsigned: true)
!154 = !DIEnumerator(name: "TWOKEY", value: 50, isUnsigned: true)
!155 = !DIEnumerator(name: "THREEKEY", value: 51, isUnsigned: true)
!156 = !DIEnumerator(name: "FOURKEY", value: 52, isUnsigned: true)
!157 = !DIEnumerator(name: "FIVEKEY", value: 53, isUnsigned: true)
!158 = !DIEnumerator(name: "SIXKEY", value: 54, isUnsigned: true)
!159 = !DIEnumerator(name: "SEVENKEY", value: 55, isUnsigned: true)
!160 = !DIEnumerator(name: "EIGHTKEY", value: 56, isUnsigned: true)
!161 = !DIEnumerator(name: "NINEKEY", value: 57, isUnsigned: true)
!162 = !DIEnumerator(name: "CAPSLOCKKEY", value: 211, isUnsigned: true)
!163 = !DIEnumerator(name: "LEFTCTRLKEY", value: 212, isUnsigned: true)
!164 = !DIEnumerator(name: "LEFTALTKEY", value: 213, isUnsigned: true)
!165 = !DIEnumerator(name: "RIGHTALTKEY", value: 214, isUnsigned: true)
!166 = !DIEnumerator(name: "RIGHTCTRLKEY", value: 215, isUnsigned: true)
!167 = !DIEnumerator(name: "RIGHTSHIFTKEY", value: 216, isUnsigned: true)
!168 = !DIEnumerator(name: "LEFTSHIFTKEY", value: 217, isUnsigned: true)
!169 = !DIEnumerator(name: "ESCKEY", value: 218, isUnsigned: true)
!170 = !DIEnumerator(name: "TABKEY", value: 219, isUnsigned: true)
!171 = !DIEnumerator(name: "RETKEY", value: 220, isUnsigned: true)
!172 = !DIEnumerator(name: "SPACEKEY", value: 221, isUnsigned: true)
!173 = !DIEnumerator(name: "LINEFEEDKEY", value: 222, isUnsigned: true)
!174 = !DIEnumerator(name: "BACKSPACEKEY", value: 223, isUnsigned: true)
!175 = !DIEnumerator(name: "DELKEY", value: 224, isUnsigned: true)
!176 = !DIEnumerator(name: "SEMICOLONKEY", value: 225, isUnsigned: true)
!177 = !DIEnumerator(name: "PERIODKEY", value: 226, isUnsigned: true)
!178 = !DIEnumerator(name: "COMMAKEY", value: 227, isUnsigned: true)
!179 = !DIEnumerator(name: "QUOTEKEY", value: 228, isUnsigned: true)
!180 = !DIEnumerator(name: "ACCENTGRAVEKEY", value: 229, isUnsigned: true)
!181 = !DIEnumerator(name: "MINUSKEY", value: 230, isUnsigned: true)
!182 = !DIEnumerator(name: "SLASHKEY", value: 232, isUnsigned: true)
!183 = !DIEnumerator(name: "BACKSLASHKEY", value: 233, isUnsigned: true)
!184 = !DIEnumerator(name: "EQUALKEY", value: 234, isUnsigned: true)
!185 = !DIEnumerator(name: "LEFTBRACKETKEY", value: 235, isUnsigned: true)
!186 = !DIEnumerator(name: "RIGHTBRACKETKEY", value: 236, isUnsigned: true)
!187 = !DIEnumerator(name: "LEFTARROWKEY", value: 137, isUnsigned: true)
!188 = !DIEnumerator(name: "DOWNARROWKEY", value: 138, isUnsigned: true)
!189 = !DIEnumerator(name: "RIGHTARROWKEY", value: 139, isUnsigned: true)
!190 = !DIEnumerator(name: "UPARROWKEY", value: 140, isUnsigned: true)
!191 = !DIEnumerator(name: "PAD0", value: 150, isUnsigned: true)
!192 = !DIEnumerator(name: "PAD1", value: 151, isUnsigned: true)
!193 = !DIEnumerator(name: "PAD2", value: 152, isUnsigned: true)
!194 = !DIEnumerator(name: "PAD3", value: 153, isUnsigned: true)
!195 = !DIEnumerator(name: "PAD4", value: 154, isUnsigned: true)
!196 = !DIEnumerator(name: "PAD5", value: 155, isUnsigned: true)
!197 = !DIEnumerator(name: "PAD6", value: 156, isUnsigned: true)
!198 = !DIEnumerator(name: "PAD7", value: 157, isUnsigned: true)
!199 = !DIEnumerator(name: "PAD8", value: 158, isUnsigned: true)
!200 = !DIEnumerator(name: "PAD9", value: 159, isUnsigned: true)
!201 = !DIEnumerator(name: "PADPERIOD", value: 199, isUnsigned: true)
!202 = !DIEnumerator(name: "PADASTERKEY", value: 160, isUnsigned: true)
!203 = !DIEnumerator(name: "PADSLASHKEY", value: 161, isUnsigned: true)
!204 = !DIEnumerator(name: "PADMINUS", value: 162, isUnsigned: true)
!205 = !DIEnumerator(name: "PADENTER", value: 163, isUnsigned: true)
!206 = !DIEnumerator(name: "PADPLUSKEY", value: 164, isUnsigned: true)
!207 = !DIEnumerator(name: "PAUSEKEY", value: 165, isUnsigned: true)
!208 = !DIEnumerator(name: "INSERTKEY", value: 166, isUnsigned: true)
!209 = !DIEnumerator(name: "HOMEKEY", value: 167, isUnsigned: true)
!210 = !DIEnumerator(name: "PAGEUPKEY", value: 168, isUnsigned: true)
!211 = !DIEnumerator(name: "PAGEDOWNKEY", value: 169, isUnsigned: true)
!212 = !DIEnumerator(name: "ENDKEY", value: 170, isUnsigned: true)
!213 = !DIEnumerator(name: "UNKNOWNKEY", value: 171, isUnsigned: true)
!214 = !DIEnumerator(name: "OSKEY", value: 172, isUnsigned: true)
!215 = !DIEnumerator(name: "GRLESSKEY", value: 173, isUnsigned: true)
!216 = !DIEnumerator(name: "MEDIAPLAY", value: 174, isUnsigned: true)
!217 = !DIEnumerator(name: "MEDIASTOP", value: 175, isUnsigned: true)
!218 = !DIEnumerator(name: "MEDIAFIRST", value: 176, isUnsigned: true)
!219 = !DIEnumerator(name: "MEDIALAST", value: 177, isUnsigned: true)
!220 = !DIEnumerator(name: "F1KEY", value: 300, isUnsigned: true)
!221 = !DIEnumerator(name: "F2KEY", value: 301, isUnsigned: true)
!222 = !DIEnumerator(name: "F3KEY", value: 302, isUnsigned: true)
!223 = !DIEnumerator(name: "F4KEY", value: 303, isUnsigned: true)
!224 = !DIEnumerator(name: "F5KEY", value: 304, isUnsigned: true)
!225 = !DIEnumerator(name: "F6KEY", value: 305, isUnsigned: true)
!226 = !DIEnumerator(name: "F7KEY", value: 306, isUnsigned: true)
!227 = !DIEnumerator(name: "F8KEY", value: 307, isUnsigned: true)
!228 = !DIEnumerator(name: "F9KEY", value: 308, isUnsigned: true)
!229 = !DIEnumerator(name: "F10KEY", value: 309, isUnsigned: true)
!230 = !DIEnumerator(name: "F11KEY", value: 310, isUnsigned: true)
!231 = !DIEnumerator(name: "F12KEY", value: 311, isUnsigned: true)
!232 = !DIEnumerator(name: "F13KEY", value: 312, isUnsigned: true)
!233 = !DIEnumerator(name: "F14KEY", value: 313, isUnsigned: true)
!234 = !DIEnumerator(name: "F15KEY", value: 314, isUnsigned: true)
!235 = !DIEnumerator(name: "F16KEY", value: 315, isUnsigned: true)
!236 = !DIEnumerator(name: "F17KEY", value: 316, isUnsigned: true)
!237 = !DIEnumerator(name: "F18KEY", value: 317, isUnsigned: true)
!238 = !DIEnumerator(name: "F19KEY", value: 318, isUnsigned: true)
!239 = !DIEnumerator(name: "NDOF_MOTION", value: 400, isUnsigned: true)
!240 = !DIEnumerator(name: "NDOF_BUTTON_NONE", value: 400, isUnsigned: true)
!241 = !DIEnumerator(name: "NDOF_BUTTON_MENU", value: 401, isUnsigned: true)
!242 = !DIEnumerator(name: "NDOF_BUTTON_FIT", value: 402, isUnsigned: true)
!243 = !DIEnumerator(name: "NDOF_BUTTON_TOP", value: 403, isUnsigned: true)
!244 = !DIEnumerator(name: "NDOF_BUTTON_BOTTOM", value: 404, isUnsigned: true)
!245 = !DIEnumerator(name: "NDOF_BUTTON_LEFT", value: 405, isUnsigned: true)
!246 = !DIEnumerator(name: "NDOF_BUTTON_RIGHT", value: 406, isUnsigned: true)
!247 = !DIEnumerator(name: "NDOF_BUTTON_FRONT", value: 407, isUnsigned: true)
!248 = !DIEnumerator(name: "NDOF_BUTTON_BACK", value: 408, isUnsigned: true)
!249 = !DIEnumerator(name: "NDOF_BUTTON_ISO1", value: 409, isUnsigned: true)
!250 = !DIEnumerator(name: "NDOF_BUTTON_ISO2", value: 410, isUnsigned: true)
!251 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CW", value: 411, isUnsigned: true)
!252 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CCW", value: 412, isUnsigned: true)
!253 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CW", value: 413, isUnsigned: true)
!254 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CCW", value: 414, isUnsigned: true)
!255 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CW", value: 415, isUnsigned: true)
!256 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CCW", value: 416, isUnsigned: true)
!257 = !DIEnumerator(name: "NDOF_BUTTON_ROTATE", value: 417, isUnsigned: true)
!258 = !DIEnumerator(name: "NDOF_BUTTON_PANZOOM", value: 418, isUnsigned: true)
!259 = !DIEnumerator(name: "NDOF_BUTTON_DOMINANT", value: 419, isUnsigned: true)
!260 = !DIEnumerator(name: "NDOF_BUTTON_PLUS", value: 420, isUnsigned: true)
!261 = !DIEnumerator(name: "NDOF_BUTTON_MINUS", value: 421, isUnsigned: true)
!262 = !DIEnumerator(name: "NDOF_BUTTON_ESC", value: 422, isUnsigned: true)
!263 = !DIEnumerator(name: "NDOF_BUTTON_ALT", value: 423, isUnsigned: true)
!264 = !DIEnumerator(name: "NDOF_BUTTON_SHIFT", value: 424, isUnsigned: true)
!265 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!266 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!267 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!268 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!269 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!270 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!271 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!272 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!273 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!274 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!275 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!276 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!277 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!278 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!279 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!280 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!281 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!282 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!283 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!284 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!285 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!286 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!287 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!288 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!289 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!290 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!291 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!292 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!293 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!294 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!295 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!296 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!297 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!298 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!299 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!300 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!301 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!302 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!303 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!304 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 470, baseType: !66, size: 32, elements: !307)
!306 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIEnumerator(name: "P_NOT_STARTED", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "P_STARTING", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "P_IN_PROGRESS", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "P_FINISHING", value: 3, isUnsigned: true)
!312 = !DIEnumerator(name: "P_FINISHED", value: 4, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNdof_Flag", file: !34, line: 805, baseType: !66, size: 32, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!315 = !DIEnumerator(name: "NDOF_SHOW_GUIDE", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "NDOF_FLY_HELICOPTER", value: 2, isUnsigned: true)
!317 = !DIEnumerator(name: "NDOF_LOCK_HORIZON", value: 4, isUnsigned: true)
!318 = !DIEnumerator(name: "NDOF_SHOULD_PAN", value: 8, isUnsigned: true)
!319 = !DIEnumerator(name: "NDOF_SHOULD_ZOOM", value: 16, isUnsigned: true)
!320 = !DIEnumerator(name: "NDOF_SHOULD_ROTATE", value: 32, isUnsigned: true)
!321 = !DIEnumerator(name: "NDOF_MODE_ORBIT", value: 64, isUnsigned: true)
!322 = !DIEnumerator(name: "NDOF_PAN_YZ_SWAP_AXIS", value: 128, isUnsigned: true)
!323 = !DIEnumerator(name: "NDOF_ZOOM_INVERT", value: 256, isUnsigned: true)
!324 = !DIEnumerator(name: "NDOF_ROTX_INVERT_AXIS", value: 512, isUnsigned: true)
!325 = !DIEnumerator(name: "NDOF_ROTY_INVERT_AXIS", value: 1024, isUnsigned: true)
!326 = !DIEnumerator(name: "NDOF_ROTZ_INVERT_AXIS", value: 2048, isUnsigned: true)
!327 = !DIEnumerator(name: "NDOF_PANX_INVERT_AXIS", value: 4096, isUnsigned: true)
!328 = !DIEnumerator(name: "NDOF_PANY_INVERT_AXIS", value: 8192, isUnsigned: true)
!329 = !DIEnumerator(name: "NDOF_PANZ_INVERT_AXIS", value: 16384, isUnsigned: true)
!330 = !DIEnumerator(name: "NDOF_TURNTABLE", value: 32768, isUnsigned: true)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyFlag", file: !332, line: 151, baseType: !66, size: 32, elements: !333)
!332 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!334 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!335 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!336 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!337 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!338 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!339 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!340 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!341 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!342 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!343 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!344 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!345 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!346 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!347 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!348 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!349 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!350 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!351 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!352 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!353 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!354 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!355 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!356 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!357 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!358 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!359 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!360 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!361 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!362 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!363 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!364 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 330, baseType: !66, size: 32, elements: !367)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !{!368, !369, !370, !371, !372, !373}
!368 = !DIEnumerator(name: "V3D_BGPIC_EXPANDED", value: 2, isUnsigned: true)
!369 = !DIEnumerator(name: "V3D_BGPIC_CAMERACLIP", value: 4, isUnsigned: true)
!370 = !DIEnumerator(name: "V3D_BGPIC_DISABLED", value: 8, isUnsigned: true)
!371 = !DIEnumerator(name: "V3D_BGPIC_FOREGROUND", value: 16, isUnsigned: true)
!372 = !DIEnumerator(name: "V3D_BGPIC_CAMERA_ASPECT", value: 32, isUnsigned: true)
!373 = !DIEnumerator(name: "V3D_BGPIC_CAMERA_CROP", value: 64, isUnsigned: true)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 351, baseType: !66, size: 32, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!377 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!378 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!379 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!380 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!381 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserpref_UI_Flag2", file: !34, line: 664, baseType: !66, size: 32, elements: !383)
!383 = !{!384, !385, !386}
!384 = !DIEnumerator(name: "USER_KEEP_SESSION", value: 1, isUnsigned: true)
!385 = !DIEnumerator(name: "USER_REGION_OVERLAP", value: 2, isUnsigned: true)
!386 = !DIEnumerator(name: "USER_TRACKPAD_NATURAL", value: 4, isUnsigned: true)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !65, line: 666, baseType: !66, size: 32, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396}
!389 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!390 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!391 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!392 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!393 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!394 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!395 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!396 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 339, baseType: !66, size: 32, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!399 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!400 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!401 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!402 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!403 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!404 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!405 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!406 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!407 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!408 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!409 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!410 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 619, baseType: !66, size: 32, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIEnumerator(name: "OB_RESTRICT_VIEW", value: 1, isUnsigned: true)
!413 = !DIEnumerator(name: "OB_RESTRICT_SELECT", value: 2, isUnsigned: true)
!414 = !DIEnumerator(name: "OB_RESTRICT_RENDER", value: 4, isUnsigned: true)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 103, baseType: !66, size: 32, elements: !416)
!416 = !{!417, !418}
!417 = !DIEnumerator(name: "BOUNDBOX_DISABLED", value: 1, isUnsigned: true)
!418 = !DIEnumerator(name: "BOUNDBOX_DIRTY", value: 2, isUnsigned: true)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 1669, baseType: !66, size: 32, elements: !421)
!420 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!421 = !{!422, !423, !424}
!422 = !DIEnumerator(name: "PAINT_SHOW_BRUSH", value: 1, isUnsigned: true)
!423 = !DIEnumerator(name: "PAINT_FAST_NAVIGATE", value: 2, isUnsigned: true)
!424 = !DIEnumerator(name: "PAINT_SHOW_BRUSH_ON_SURFACE", value: 4, isUnsigned: true)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserPref_Flag", file: !34, line: 569, baseType: !66, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!427 = !DIEnumerator(name: "USER_AUTOSAVE", value: 1, isUnsigned: true)
!428 = !DIEnumerator(name: "USER_SCENEGLOBAL", value: 16, isUnsigned: true)
!429 = !DIEnumerator(name: "USER_TRACKBALL", value: 32, isUnsigned: true)
!430 = !DIEnumerator(name: "USER_MAT_ON_OB", value: 256, isUnsigned: true)
!431 = !DIEnumerator(name: "USER_TOOLTIPS", value: 2048, isUnsigned: true)
!432 = !DIEnumerator(name: "USER_TWOBUTTONMOUSE", value: 4096, isUnsigned: true)
!433 = !DIEnumerator(name: "USER_NONUMPAD", value: 8192, isUnsigned: true)
!434 = !DIEnumerator(name: "USER_LMOUSESELECT", value: 16384, isUnsigned: true)
!435 = !DIEnumerator(name: "USER_FILECOMPRESS", value: 32768, isUnsigned: true)
!436 = !DIEnumerator(name: "USER_SAVE_PREVIEWS", value: 65536, isUnsigned: true)
!437 = !DIEnumerator(name: "USER_CUSTOM_RANGE", value: 131072, isUnsigned: true)
!438 = !DIEnumerator(name: "USER_ADD_EDITMODE", value: 262144, isUnsigned: true)
!439 = !DIEnumerator(name: "USER_ADD_VIEWALIGNED", value: 524288, isUnsigned: true)
!440 = !DIEnumerator(name: "USER_RELPATHS", value: 1048576, isUnsigned: true)
!441 = !DIEnumerator(name: "USER_RELEASECONFIRM", value: 2097152, isUnsigned: true)
!442 = !DIEnumerator(name: "USER_SCRIPT_AUTOEXEC_DISABLE", value: 4194304, isUnsigned: true)
!443 = !DIEnumerator(name: "USER_FILENOUI", value: 8388608, isUnsigned: true)
!444 = !DIEnumerator(name: "USER_NONEGFRAMES", value: 16777216, isUnsigned: true)
!445 = !DIEnumerator(name: "USER_TXT_TABSTOSPACES_DISABLE", value: 33554432, isUnsigned: true)
!446 = !DIEnumerator(name: "USER_TOOLTIPS_PYTHON", value: 67108864, isUnsigned: true)
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 420, baseType: !66, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454}
!449 = !DIEnumerator(name: "OB_POSX", value: 0, isUnsigned: true)
!450 = !DIEnumerator(name: "OB_POSY", value: 1, isUnsigned: true)
!451 = !DIEnumerator(name: "OB_POSZ", value: 2, isUnsigned: true)
!452 = !DIEnumerator(name: "OB_NEGX", value: 3, isUnsigned: true)
!453 = !DIEnumerator(name: "OB_NEGY", value: 4, isUnsigned: true)
!454 = !DIEnumerator(name: "OB_NEGZ", value: 5, isUnsigned: true)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 844, baseType: !66, size: 32, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIEnumerator(name: "VIEW_PASS", value: 0, isUnsigned: true)
!458 = !DIEnumerator(name: "VIEW_APPLY", value: 1, isUnsigned: true)
!459 = !DIEnumerator(name: "VIEW_CONFIRM", value: 2, isUnsigned: true)
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 141, baseType: !66, size: 32, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!462 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!463 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!464 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!465 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!466 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!467 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!468 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!469 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!470 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!471 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!472 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!473 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eViewZoom_Style", file: !34, line: 611, baseType: !66, size: 32, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIEnumerator(name: "USER_ZOOM_CONT", value: 0, isUnsigned: true)
!477 = !DIEnumerator(name: "USER_ZOOM_SCALE", value: 1, isUnsigned: true)
!478 = !DIEnumerator(name: "USER_ZOOM_DOLLY", value: 2, isUnsigned: true)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !8, line: 67, baseType: !66, size: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489}
!481 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!482 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!483 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!484 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!485 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!486 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!487 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!488 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!489 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !491, line: 187, baseType: !66, size: 32, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!493 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!494 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!495 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!496 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!497 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!498 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!499 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!500 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!501 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!502 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!503 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!504 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!505 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!506 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!507 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!508 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!509 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!510 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!511 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!512 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!513 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!514 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!515 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 394, baseType: !66, size: 32, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!518 = !DIEnumerator(name: "GESTURE_MODAL_CANCEL", value: 1, isUnsigned: true)
!519 = !DIEnumerator(name: "GESTURE_MODAL_CONFIRM", value: 2, isUnsigned: true)
!520 = !DIEnumerator(name: "GESTURE_MODAL_SELECT", value: 3, isUnsigned: true)
!521 = !DIEnumerator(name: "GESTURE_MODAL_DESELECT", value: 4, isUnsigned: true)
!522 = !DIEnumerator(name: "GESTURE_MODAL_NOP", value: 5, isUnsigned: true)
!523 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_ADD", value: 6, isUnsigned: true)
!524 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SUB", value: 7, isUnsigned: true)
!525 = !DIEnumerator(name: "GESTURE_MODAL_BEGIN", value: 8, isUnsigned: true)
!526 = !DIEnumerator(name: "GESTURE_MODAL_IN", value: 9, isUnsigned: true)
!527 = !DIEnumerator(name: "GESTURE_MODAL_OUT", value: 10, isUnsigned: true)
!528 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SIZE", value: 11, isUnsigned: true)
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eViewNavigation_Method", file: !34, line: 618, baseType: !66, size: 32, elements: !530)
!530 = !{!531, !532}
!531 = !DIEnumerator(name: "VIEW_NAVIGATION_WALK", value: 0, isUnsigned: true)
!532 = !DIEnumerator(name: "VIEW_NAVIGATION_FLY", value: 1, isUnsigned: true)
!533 = !{!26, !534, !535, !536, !539, !2659, !2750, !629}
!534 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!535 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLint", file: !538, line: 273, baseType: !29)
!538 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionView3D", file: !366, line: 148, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RegionView3D", file: !366, line: 85, size: 7040, elements: !542)
!542 = !{!543, !547, !548, !549, !550, !551, !552, !553, !557, !558, !569, !571, !574, !593, !594, !597, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !541, file: !366, line: 87, baseType: !544, size: 512)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 512, elements: !545)
!545 = !{!546, !546}
!546 = !DISubrange(count: 4)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat", scope: !541, file: !366, line: 88, baseType: !544, size: 512, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewinv", scope: !541, file: !366, line: 89, baseType: !544, size: 512, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "persmat", scope: !541, file: !366, line: 90, baseType: !544, size: 512, offset: 1536)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "persinv", scope: !541, file: !366, line: 91, baseType: !544, size: 512, offset: 2048)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewmatob", scope: !541, file: !366, line: 94, baseType: !544, size: 512, offset: 2560)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "persmatob", scope: !541, file: !366, line: 95, baseType: !544, size: 512, offset: 3072)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !541, file: !366, line: 99, baseType: !554, size: 768, offset: 3584)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 768, elements: !555)
!555 = !{!556, !546}
!556 = !DISubrange(count: 6)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "clip_local", scope: !541, file: !366, line: 100, baseType: !554, size: 768, offset: 4352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "clipbb", scope: !541, file: !366, line: 101, baseType: !559, size: 64, offset: 5120)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !65, line: 97, size: 832, elements: !561)
!561 = !{!562, !567, !568}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !560, file: !65, line: 98, baseType: !563, size: 768)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 768, elements: !564)
!564 = !{!565, !566}
!565 = !DISubrange(count: 8)
!566 = !DISubrange(count: 3)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !65, line: 99, baseType: !29, size: 32, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !560, file: !65, line: 99, baseType: !29, size: 32, offset: 800)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "localvd", scope: !541, file: !366, line: 103, baseType: !570, size: 64, offset: 5184)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "render_engine", scope: !541, file: !366, line: 104, baseType: !572, size: 64, offset: 5248)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderEngine", file: !366, line: 44, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !541, file: !366, line: 105, baseType: !575, size: 64, offset: 5312)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ViewDepths", file: !577, line: 77, size: 320, elements: !578)
!577 = !DIFile(filename: "blender/source/blender/editors/include/ED_view3d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!578 = !{!579, !581, !582, !584, !585, !587, !591}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !576, file: !577, line: 78, baseType: !580, size: 16)
!580 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !576, file: !577, line: 78, baseType: !580, size: 16, offset: 16)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !576, file: !577, line: 79, baseType: !583, size: 16, offset: 32)
!583 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !576, file: !577, line: 79, baseType: !583, size: 16, offset: 48)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !576, file: !577, line: 80, baseType: !586, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "depth_range", scope: !576, file: !577, line: 81, baseType: !588, size: 128, offset: 128)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 128, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 2)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "damaged", scope: !576, file: !577, line: 83, baseType: !592, size: 8, offset: 256)
!592 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "gpuoffscreen", scope: !541, file: !366, line: 106, baseType: !26, size: 64, offset: 5376)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !541, file: !366, line: 109, baseType: !595, size: 64, offset: 5440)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView3DStore", file: !366, line: 46, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !541, file: !366, line: 110, baseType: !598, size: 64, offset: 5504)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !306, line: 490, size: 768, elements: !600)
!600 = !{!601, !602, !603, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !306, line: 491, baseType: !598, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !599, file: !306, line: 491, baseType: !598, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !599, file: !306, line: 493, baseType: !604, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !8, line: 169, size: 2048, elements: !606)
!606 = !{!607, !608, !609, !610, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556, !2557, !2558, !2559, !2601, !2604, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !605, file: !8, line: 170, baseType: !604, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !605, file: !8, line: 170, baseType: !604, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !605, file: !8, line: 172, baseType: !26, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !605, file: !8, line: 174, baseType: !611, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !94, line: 49, size: 1984, elements: !613)
!613 = !{!614, !673, !674, !675, !676, !677, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !612, file: !94, line: 50, baseType: !615, size: 960)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !616, line: 130, baseType: !617)
!616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !616, line: 117, size: 960, elements: !618)
!618 = !{!619, !620, !621, !623, !642, !646, !647, !648, !649, !650}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !616, line: 118, baseType: !26, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !617, file: !616, line: 118, baseType: !26, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !617, file: !616, line: 119, baseType: !622, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !617, file: !616, line: 120, baseType: !624, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !616, line: 136, size: 17600, elements: !626)
!626 = !{!627, !628, !630, !633, !637, !638, !639}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !625, file: !616, line: 137, baseType: !615, size: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !625, file: !616, line: 138, baseType: !629, size: 64, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !625, file: !616, line: 139, baseType: !631, size: 64, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !616, line: 43, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !616, line: 140, baseType: !634, size: 8192, offset: 1088)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8192, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 1024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !625, file: !616, line: 141, baseType: !634, size: 8192, offset: 9280)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !625, file: !616, line: 148, baseType: !624, size: 64, offset: 17472)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !625, file: !616, line: 150, baseType: !640, size: 64, offset: 17536)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !616, line: 45, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !616, line: 121, baseType: !643, size: 528, offset: 256)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 528, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 66)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !617, file: !616, line: 126, baseType: !583, size: 16, offset: 784)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !617, file: !616, line: 127, baseType: !29, size: 32, offset: 800)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !617, file: !616, line: 128, baseType: !29, size: 32, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !617, file: !616, line: 128, baseType: !29, size: 32, offset: 864)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !617, file: !616, line: 129, baseType: !651, size: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !616, line: 75, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !616, line: 62, size: 1024, elements: !654)
!654 = !{!655, !657, !658, !659, !660, !661, !662, !663, !671, !672}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !616, line: 63, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !653, file: !616, line: 63, baseType: !656, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !653, file: !616, line: 64, baseType: !16, size: 8, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !653, file: !616, line: 64, baseType: !16, size: 8, offset: 136)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !653, file: !616, line: 65, baseType: !583, size: 16, offset: 144)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !616, line: 66, baseType: !15, size: 512, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !653, file: !616, line: 67, baseType: !29, size: 32, offset: 672)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !653, file: !616, line: 69, baseType: !664, size: 256, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !616, line: 60, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !616, line: 48, size: 256, elements: !666)
!666 = !{!667, !668, !669, !670}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !665, file: !616, line: 49, baseType: !26, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !665, file: !616, line: 58, baseType: !21, size: 128, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !665, file: !616, line: 59, baseType: !29, size: 32, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !665, file: !616, line: 59, baseType: !29, size: 32, offset: 224)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !653, file: !616, line: 70, baseType: !29, size: 32, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !653, file: !616, line: 74, baseType: !29, size: 32, offset: 992)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !612, file: !94, line: 52, baseType: !21, size: 128, offset: 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !612, file: !94, line: 53, baseType: !21, size: 128, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !612, file: !94, line: 54, baseType: !21, size: 128, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !612, file: !94, line: 55, baseType: !21, size: 128, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !612, file: !94, line: 57, baseType: !678, size: 64, offset: 1472)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !420, line: 1216, size: 39680, elements: !680)
!680 = !{!681, !682, !685, !1027, !1030, !1031, !1032, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1058, !1131, !1558, !2151, !2154, !2401, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2423, !2424, !2425, !2426, !2427, !2435, !2501, !2508, !2509, !2516, !2517, !2518, !2519, !2520, !2521, !2522}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !679, file: !420, line: 1217, baseType: !615, size: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !679, file: !420, line: 1218, baseType: !683, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !491, line: 37, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !679, file: !420, line: 1220, baseType: !686, size: 64, offset: 1024)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !65, line: 115, size: 11392, elements: !688)
!688 = !{!689, !690, !691, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !778, !779, !793, !794, !835, !836, !839, !840, !856, !857, !858, !859, !860, !861, !862, !866, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !943, !944, !945, !946, !947, !948, !949, !950, !951, !954, !957, !960, !961, !962, !963, !964, !967, !970, !973, !974, !980, !981, !982, !983, !984, !985, !987, !990, !993, !995, !1015, !1016}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !687, file: !65, line: 116, baseType: !615, size: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !687, file: !65, line: 117, baseType: !683, size: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !687, file: !65, line: 119, baseType: !692, size: 64, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !694, line: 155, size: 1856, elements: !695)
!694 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!695 = !{!696, !699, !702, !705, !708, !709, !710, !714, !718, !719, !723, !726, !727, !728, !729, !732, !735, !736, !737, !738, !739, !743, !744, !745, !747, !748, !752, !753, !756, !759, !760, !761, !762}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !693, file: !694, line: 157, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !694, line: 157, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !693, file: !694, line: 158, baseType: !700, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !694, line: 49, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !693, file: !694, line: 159, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !694, line: 159, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !693, file: !694, line: 160, baseType: !706, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !694, line: 160, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !693, file: !694, line: 161, baseType: !29, size: 32, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !693, file: !694, line: 161, baseType: !29, size: 32, offset: 288)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !693, file: !694, line: 162, baseType: !711, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 96, elements: !713)
!713 = !{!566}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !693, file: !694, line: 163, baseType: !715, size: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !717, line: 184, flags: DIFlagFwdDecl)
!717 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_object.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!718 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !693, file: !694, line: 164, baseType: !586, size: 64, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !693, file: !694, line: 167, baseType: !720, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !694, line: 44, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !693, file: !694, line: 170, baseType: !724, size: 64, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !694, line: 39, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !693, file: !694, line: 171, baseType: !29, size: 32, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !693, file: !694, line: 172, baseType: !29, size: 32, offset: 672)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !693, file: !694, line: 173, baseType: !592, size: 8, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !693, file: !694, line: 175, baseType: !730, size: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !694, line: 175, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !693, file: !694, line: 178, baseType: !733, size: 64, offset: 832)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !694, line: 55, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !693, file: !694, line: 179, baseType: !592, size: 8, offset: 896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !693, file: !694, line: 182, baseType: !592, size: 8, offset: 904)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !693, file: !694, line: 183, baseType: !711, size: 64, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !693, file: !694, line: 184, baseType: !711, size: 64, offset: 1024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !693, file: !694, line: 185, baseType: !740, size: 64, offset: 1088)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 288, elements: !742)
!742 = !{!566, !566}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !693, file: !694, line: 188, baseType: !592, size: 8, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !693, file: !694, line: 191, baseType: !66, size: 32, offset: 1184)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !693, file: !694, line: 191, baseType: !746, size: 64, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !693, file: !694, line: 191, baseType: !66, size: 32, offset: 1280)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !693, file: !694, line: 192, baseType: !749, size: 64, offset: 1344)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !751, line: 47, flags: DIFlagFwdDecl)
!751 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!752 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !693, file: !694, line: 195, baseType: !711, size: 64, offset: 1408)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !693, file: !694, line: 197, baseType: !754, size: 64, offset: 1472)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !694, line: 197, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !693, file: !694, line: 198, baseType: !757, size: 64, offset: 1536)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !694, line: 59, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !693, file: !694, line: 201, baseType: !592, size: 8, offset: 1600)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !693, file: !694, line: 202, baseType: !712, size: 96, offset: 1632)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !693, file: !694, line: 204, baseType: !712, size: 96, offset: 1728)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !693, file: !694, line: 205, baseType: !29, size: 32, offset: 1824)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !65, line: 121, baseType: !583, size: 16, offset: 1088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !687, file: !65, line: 121, baseType: !583, size: 16, offset: 1104)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !687, file: !65, line: 122, baseType: !29, size: 32, offset: 1120)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !687, file: !65, line: 122, baseType: !29, size: 32, offset: 1152)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !687, file: !65, line: 122, baseType: !29, size: 32, offset: 1184)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !687, file: !65, line: 123, baseType: !15, size: 512, offset: 1216)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !687, file: !65, line: 124, baseType: !686, size: 64, offset: 1728)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !687, file: !65, line: 124, baseType: !686, size: 64, offset: 1792)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !687, file: !65, line: 127, baseType: !686, size: 64, offset: 1856)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !687, file: !65, line: 127, baseType: !686, size: 64, offset: 1920)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !687, file: !65, line: 127, baseType: !686, size: 64, offset: 1984)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !687, file: !65, line: 128, baseType: !775, size: 64, offset: 2048)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !777, line: 44, flags: DIFlagFwdDecl)
!777 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!778 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !687, file: !65, line: 130, baseType: !559, size: 64, offset: 2112)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !687, file: !65, line: 131, baseType: !780, size: 64, offset: 2176)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !782, line: 486, size: 1600, elements: !783)
!782 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !781, file: !782, line: 487, baseType: !615, size: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !781, file: !782, line: 489, baseType: !21, size: 128, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !781, file: !782, line: 490, baseType: !21, size: 128, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !781, file: !782, line: 491, baseType: !21, size: 128, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !781, file: !782, line: 492, baseType: !21, size: 128, offset: 1344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !781, file: !782, line: 494, baseType: !29, size: 32, offset: 1472)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !781, file: !782, line: 495, baseType: !29, size: 32, offset: 1504)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !781, file: !782, line: 497, baseType: !29, size: 32, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !781, file: !782, line: 498, baseType: !29, size: 32, offset: 1568)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !687, file: !65, line: 132, baseType: !780, size: 64, offset: 2240)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !687, file: !65, line: 133, baseType: !795, size: 64, offset: 2304)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !782, line: 334, size: 1728, elements: !797)
!797 = !{!798, !799, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !834}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !796, file: !782, line: 335, baseType: !21, size: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !796, file: !782, line: 336, baseType: !800, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !777, line: 51, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !796, file: !782, line: 338, baseType: !583, size: 16, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !796, file: !782, line: 338, baseType: !583, size: 16, offset: 208)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !796, file: !782, line: 339, baseType: !66, size: 32, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !796, file: !782, line: 340, baseType: !29, size: 32, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !796, file: !782, line: 342, baseType: !534, size: 32, offset: 288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !796, file: !782, line: 343, baseType: !712, size: 96, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !796, file: !782, line: 344, baseType: !712, size: 96, offset: 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !796, file: !782, line: 347, baseType: !21, size: 128, offset: 512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !796, file: !782, line: 349, baseType: !29, size: 32, offset: 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !796, file: !782, line: 350, baseType: !29, size: 32, offset: 672)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !796, file: !782, line: 351, baseType: !26, size: 64, offset: 704)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !796, file: !782, line: 352, baseType: !26, size: 64, offset: 768)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !796, file: !782, line: 354, baseType: !815, size: 384, offset: 832)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !782, line: 116, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !782, line: 94, size: 384, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !816, file: !782, line: 96, baseType: !29, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !816, file: !782, line: 96, baseType: !29, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !816, file: !782, line: 97, baseType: !29, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !816, file: !782, line: 97, baseType: !29, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !816, file: !782, line: 99, baseType: !583, size: 16, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !816, file: !782, line: 100, baseType: !583, size: 16, offset: 144)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !816, file: !782, line: 102, baseType: !583, size: 16, offset: 160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !816, file: !782, line: 105, baseType: !583, size: 16, offset: 176)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !816, file: !782, line: 108, baseType: !583, size: 16, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !816, file: !782, line: 109, baseType: !583, size: 16, offset: 208)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !816, file: !782, line: 111, baseType: !583, size: 16, offset: 224)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !816, file: !782, line: 112, baseType: !583, size: 16, offset: 240)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !816, file: !782, line: 114, baseType: !29, size: 32, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !816, file: !782, line: 114, baseType: !29, size: 32, offset: 288)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !816, file: !782, line: 115, baseType: !29, size: 32, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !816, file: !782, line: 115, baseType: !29, size: 32, offset: 352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !796, file: !782, line: 355, baseType: !15, size: 512, offset: 1216)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !687, file: !65, line: 134, baseType: !26, size: 64, offset: 2368)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !687, file: !65, line: 136, baseType: !837, size: 64, offset: 2432)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !65, line: 58, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !687, file: !65, line: 138, baseType: !815, size: 384, offset: 2496)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !687, file: !65, line: 139, baseType: !841, size: 64, offset: 2880)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !782, line: 80, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !782, line: 72, size: 192, elements: !844)
!844 = !{!845, !852, !853, !854, !855}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !843, file: !782, line: 73, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !782, line: 59, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !782, line: 56, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !848, file: !782, line: 57, baseType: !712, size: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !848, file: !782, line: 58, baseType: !29, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !843, file: !782, line: 74, baseType: !29, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !843, file: !782, line: 76, baseType: !29, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !843, file: !782, line: 77, baseType: !29, size: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !782, line: 79, baseType: !29, size: 32, offset: 160)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !687, file: !65, line: 141, baseType: !21, size: 128, offset: 2944)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !687, file: !65, line: 142, baseType: !21, size: 128, offset: 3072)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !687, file: !65, line: 143, baseType: !21, size: 128, offset: 3200)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !687, file: !65, line: 144, baseType: !21, size: 128, offset: 3328)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !687, file: !65, line: 146, baseType: !29, size: 32, offset: 3456)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !687, file: !65, line: 147, baseType: !29, size: 32, offset: 3488)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !687, file: !65, line: 150, baseType: !863, size: 64, offset: 3520)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !777, line: 46, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !687, file: !65, line: 151, baseType: !867, size: 64, offset: 3584)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !687, file: !65, line: 152, baseType: !29, size: 32, offset: 3648)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !687, file: !65, line: 153, baseType: !29, size: 32, offset: 3680)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !687, file: !65, line: 156, baseType: !712, size: 96, offset: 3712)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !687, file: !65, line: 156, baseType: !712, size: 96, offset: 3808)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !687, file: !65, line: 156, baseType: !712, size: 96, offset: 3904)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !687, file: !65, line: 157, baseType: !712, size: 96, offset: 4000)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !687, file: !65, line: 158, baseType: !712, size: 96, offset: 4096)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !687, file: !65, line: 159, baseType: !712, size: 96, offset: 4192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !687, file: !65, line: 160, baseType: !712, size: 96, offset: 4288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !687, file: !65, line: 160, baseType: !712, size: 96, offset: 4384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !687, file: !65, line: 161, baseType: !879, size: 128, offset: 4480)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 128, elements: !880)
!880 = !{!546}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !687, file: !65, line: 161, baseType: !879, size: 128, offset: 4608)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !687, file: !65, line: 162, baseType: !712, size: 96, offset: 4736)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !687, file: !65, line: 162, baseType: !712, size: 96, offset: 4832)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !687, file: !65, line: 163, baseType: !534, size: 32, offset: 4928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !687, file: !65, line: 163, baseType: !534, size: 32, offset: 4960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !687, file: !65, line: 164, baseType: !544, size: 512, offset: 4992)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !687, file: !65, line: 165, baseType: !544, size: 512, offset: 5504)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !687, file: !65, line: 166, baseType: !544, size: 512, offset: 6016)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !687, file: !65, line: 167, baseType: !544, size: 512, offset: 6528)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !687, file: !65, line: 176, baseType: !544, size: 512, offset: 7040)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !687, file: !65, line: 178, baseType: !66, size: 32, offset: 7552)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !687, file: !65, line: 180, baseType: !583, size: 16, offset: 7584)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !687, file: !65, line: 181, baseType: !583, size: 16, offset: 7600)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !687, file: !65, line: 183, baseType: !583, size: 16, offset: 7616)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !687, file: !65, line: 183, baseType: !583, size: 16, offset: 7632)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !687, file: !65, line: 184, baseType: !583, size: 16, offset: 7648)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !687, file: !65, line: 184, baseType: !583, size: 16, offset: 7664)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !687, file: !65, line: 185, baseType: !583, size: 16, offset: 7680)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !687, file: !65, line: 186, baseType: !583, size: 16, offset: 7696)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !687, file: !65, line: 187, baseType: !583, size: 16, offset: 7712)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !687, file: !65, line: 188, baseType: !16, size: 8, offset: 7728)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !687, file: !65, line: 189, baseType: !16, size: 8, offset: 7736)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !687, file: !65, line: 192, baseType: !29, size: 32, offset: 7744)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !687, file: !65, line: 192, baseType: !29, size: 32, offset: 7776)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !687, file: !65, line: 192, baseType: !29, size: 32, offset: 7808)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !687, file: !65, line: 192, baseType: !29, size: 32, offset: 7840)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !687, file: !65, line: 194, baseType: !29, size: 32, offset: 7872)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !687, file: !65, line: 202, baseType: !534, size: 32, offset: 7904)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !687, file: !65, line: 202, baseType: !534, size: 32, offset: 7936)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !687, file: !65, line: 202, baseType: !534, size: 32, offset: 7968)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !687, file: !65, line: 211, baseType: !534, size: 32, offset: 8000)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !687, file: !65, line: 212, baseType: !534, size: 32, offset: 8032)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !687, file: !65, line: 213, baseType: !534, size: 32, offset: 8064)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !687, file: !65, line: 214, baseType: !534, size: 32, offset: 8096)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !687, file: !65, line: 215, baseType: !534, size: 32, offset: 8128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !687, file: !65, line: 216, baseType: !534, size: 32, offset: 8160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !687, file: !65, line: 219, baseType: !534, size: 32, offset: 8192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !687, file: !65, line: 220, baseType: !534, size: 32, offset: 8224)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !687, file: !65, line: 221, baseType: !534, size: 32, offset: 8256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !687, file: !65, line: 224, baseType: !580, size: 16, offset: 8288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !687, file: !65, line: 224, baseType: !580, size: 16, offset: 8304)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !687, file: !65, line: 226, baseType: !583, size: 16, offset: 8320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !687, file: !65, line: 228, baseType: !16, size: 8, offset: 8336)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !687, file: !65, line: 229, baseType: !16, size: 8, offset: 8344)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !687, file: !65, line: 231, baseType: !583, size: 16, offset: 8352)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !687, file: !65, line: 232, baseType: !16, size: 8, offset: 8368)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !687, file: !65, line: 233, baseType: !16, size: 8, offset: 8376)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !687, file: !65, line: 234, baseType: !534, size: 32, offset: 8384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !687, file: !65, line: 235, baseType: !534, size: 32, offset: 8416)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !687, file: !65, line: 237, baseType: !21, size: 128, offset: 8448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !687, file: !65, line: 238, baseType: !21, size: 128, offset: 8576)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !687, file: !65, line: 239, baseType: !21, size: 128, offset: 8704)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !687, file: !65, line: 240, baseType: !21, size: 128, offset: 8832)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !687, file: !65, line: 242, baseType: !534, size: 32, offset: 8960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !687, file: !65, line: 244, baseType: !583, size: 16, offset: 8992)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !687, file: !65, line: 245, baseType: !580, size: 16, offset: 9008)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !687, file: !65, line: 246, baseType: !879, size: 128, offset: 9024)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !687, file: !65, line: 248, baseType: !29, size: 32, offset: 9152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !687, file: !65, line: 249, baseType: !29, size: 32, offset: 9184)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !687, file: !65, line: 251, baseType: !941, size: 64, offset: 9216)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !65, line: 251, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !687, file: !65, line: 253, baseType: !16, size: 8, offset: 9280)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !687, file: !65, line: 254, baseType: !16, size: 8, offset: 9288)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !687, file: !65, line: 255, baseType: !583, size: 16, offset: 9296)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !687, file: !65, line: 256, baseType: !712, size: 96, offset: 9312)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !687, file: !65, line: 258, baseType: !21, size: 128, offset: 9408)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !687, file: !65, line: 259, baseType: !21, size: 128, offset: 9536)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !687, file: !65, line: 260, baseType: !21, size: 128, offset: 9664)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !687, file: !65, line: 261, baseType: !21, size: 128, offset: 9792)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !687, file: !65, line: 263, baseType: !952, size: 64, offset: 9920)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !65, line: 52, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !687, file: !65, line: 264, baseType: !955, size: 64, offset: 9984)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !65, line: 53, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !687, file: !65, line: 265, baseType: !958, size: 64, offset: 10048)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !782, line: 46, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !687, file: !65, line: 267, baseType: !16, size: 8, offset: 10112)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !687, file: !65, line: 268, baseType: !16, size: 8, offset: 10120)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !687, file: !65, line: 269, baseType: !583, size: 16, offset: 10128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !687, file: !65, line: 270, baseType: !534, size: 32, offset: 10144)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !687, file: !65, line: 272, baseType: !965, size: 64, offset: 10176)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !65, line: 54, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !687, file: !65, line: 275, baseType: !968, size: 64, offset: 10240)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !65, line: 275, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !687, file: !65, line: 277, baseType: !971, size: 64, offset: 10304)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !65, line: 56, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !687, file: !65, line: 277, baseType: !971, size: 64, offset: 10368)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !687, file: !65, line: 278, baseType: !975, size: 64, offset: 10432)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !976, line: 27, baseType: !977)
!976 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !978, line: 45, baseType: !979)
!978 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!979 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !687, file: !65, line: 279, baseType: !975, size: 64, offset: 10496)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !687, file: !65, line: 280, baseType: !66, size: 32, offset: 10560)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !687, file: !65, line: 281, baseType: !66, size: 32, offset: 10592)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !687, file: !65, line: 283, baseType: !21, size: 128, offset: 10624)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !687, file: !65, line: 284, baseType: !21, size: 128, offset: 10752)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !687, file: !65, line: 285, baseType: !986, size: 64, offset: 10880)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !687, file: !65, line: 287, baseType: !988, size: 64, offset: 10944)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
