; ModuleID = 'blender/source/blender/editors/space_action/space_action.c'
source_filename = "blender/source/blender/editors/space_action/space_action.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!273 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!274 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!275 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!276 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!277 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!278 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!279 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!280 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!281 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!282 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!283 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!284 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!285 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!286 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!287 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!288 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!289 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!290 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!291 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!292 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!293 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!294 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!295 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!296 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!297 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!298 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!299 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!300 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!301 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!302 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!303 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!304 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Units", file: !100, line: 73, baseType: !5, size: 32, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312}
!307 = !DIEnumerator(name: "V2D_UNIT_SECONDS", value: 0, isUnsigned: true)
!308 = !DIEnumerator(name: "V2D_UNIT_FRAMES", value: 1, isUnsigned: true)
!309 = !DIEnumerator(name: "V2D_UNIT_FRAMESCALE", value: 2, isUnsigned: true)
!310 = !DIEnumerator(name: "V2D_UNIT_VALUES", value: 3, isUnsigned: true)
!311 = !DIEnumerator(name: "V2D_UNIT_DEGREES", value: 4, isUnsigned: true)
!312 = !DIEnumerator(name: "V2D_UNIT_TIME", value: 5, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Clamp", file: !100, line: 86, baseType: !5, size: 32, elements: !314)
!314 = !{!315, !316}
!315 = !DIEnumerator(name: "V2D_GRID_NOCLAMP", value: 0, isUnsigned: true)
!316 = !DIEnumerator(name: "V2D_GRID_CLAMP", value: 1, isUnsigned: true)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Gridlines", file: !100, line: 92, baseType: !5, size: 32, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325}
!319 = !DIEnumerator(name: "V2D_HORIZONTAL_LINES", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "V2D_VERTICAL_LINES", value: 2, isUnsigned: true)
!321 = !DIEnumerator(name: "V2D_HORIZONTAL_AXIS", value: 4, isUnsigned: true)
!322 = !DIEnumerator(name: "V2D_VERTICAL_AXIS", value: 8, isUnsigned: true)
!323 = !DIEnumerator(name: "V2D_HORIZONTAL_FINELINES", value: 16, isUnsigned: true)
!324 = !DIEnumerator(name: "V2D_GRIDLINES_MAJOR", value: 15, isUnsigned: true)
!325 = !DIEnumerator(name: "V2D_GRIDLINES_ALL", value: 31, isUnsigned: true)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimEditDraw_CurrentFrame", file: !327, line: 508, baseType: !5, size: 32, elements: !328)
!327 = !DIFile(filename: "blender/source/blender/editors/include/ED_anim_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!328 = !{!329, !330, !331, !332}
!329 = !DIEnumerator(name: "DRAWCFRA_PLAIN", value: 0, isUnsigned: true)
!330 = !DIEnumerator(name: "DRAWCFRA_SHOW_NUMBOX", value: 1, isUnsigned: true)
!331 = !DIEnumerator(name: "DRAWCFRA_UNIT_SECONDS", value: 2, isUnsigned: true)
!332 = !DIEnumerator(name: "DRAWCFRA_WIDE", value: 4, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !334, line: 44, baseType: !5, size: 32, elements: !335)
!334 = !DIFile(filename: "blender/source/blender/editors/include/ED_markers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!335 = !{!336, !337, !338}
!336 = !DIEnumerator(name: "DRAW_MARKERS_LINES", value: 1, isUnsigned: true)
!337 = !DIEnumerator(name: "DRAW_MARKERS_LOCAL", value: 2, isUnsigned: true)
!338 = !DIEnumerator(name: "DRAW_MARKERS_MARGIN", value: 4, isUnsigned: true)
!339 = !{!340, !341, !363, !1835}
!340 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !344)
!344 = !{!345, !347, !348, !356, !357, !358}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !4, line: 86, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !343, file: !4, line: 86, baseType: !346, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !343, file: !4, line: 87, baseType: !349, size: 128, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !350, line: 71, baseType: !351)
!350 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !350, line: 69, size: 128, elements: !352)
!352 = !{!353, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !351, file: !350, line: 70, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !351, file: !350, line: 70, baseType: !354, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !343, file: !4, line: 88, baseType: !101, size: 32, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !343, file: !4, line: 89, baseType: !340, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !343, file: !4, line: 90, baseType: !359, size: 128, offset: 320)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 128, elements: !361)
!360 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!361 = !{!362}
!362 = !DISubrange(count: 8)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceAction", file: !41, line: 605, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceAction", file: !41, line: 589, size: 2752, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !1803, !1817, !1831, !1832, !1833, !1834}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !41, line: 590, baseType: !346, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !365, file: !41, line: 590, baseType: !346, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !365, file: !41, line: 591, baseType: !349, size: 128, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !365, file: !41, line: 592, baseType: !101, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !365, file: !41, line: 593, baseType: !340, size: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !365, file: !41, line: 595, baseType: !359, size: 128, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !365, file: !41, line: 597, baseType: !374, size: 1280, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !375, line: 71, baseType: !376)
!375 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !375, line: 40, size: 1280, elements: !377)
!377 = !{!378, !387, !388, !396, !397, !398, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !419, !420, !421, !424}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !376, file: !375, line: 41, baseType: !379, size: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !380, line: 95, baseType: !381)
!380 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !380, line: 92, size: 128, elements: !382)
!382 = !{!383, !384, !385, !386}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !381, file: !380, line: 93, baseType: !340, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !381, file: !380, line: 93, baseType: !340, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !381, file: !380, line: 94, baseType: !340, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !381, file: !380, line: 94, baseType: !340, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !376, file: !375, line: 41, baseType: !379, size: 128, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !376, file: !375, line: 42, baseType: !389, size: 128, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !380, line: 89, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !380, line: 86, size: 128, elements: !391)
!391 = !{!392, !393, !394, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !390, file: !380, line: 87, baseType: !101, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !390, file: !380, line: 87, baseType: !101, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !390, file: !380, line: 88, baseType: !101, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !390, file: !380, line: 88, baseType: !101, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !376, file: !375, line: 42, baseType: !389, size: 128, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !376, file: !375, line: 43, baseType: !389, size: 128, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !376, file: !375, line: 45, baseType: !399, size: 64, offset: 640)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 64, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 2)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !376, file: !375, line: 45, baseType: !399, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !376, file: !375, line: 46, baseType: !340, size: 32, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !376, file: !375, line: 46, baseType: !340, size: 32, offset: 800)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !376, file: !375, line: 48, baseType: !360, size: 16, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !376, file: !375, line: 49, baseType: !360, size: 16, offset: 848)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !376, file: !375, line: 51, baseType: !360, size: 16, offset: 864)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !376, file: !375, line: 52, baseType: !360, size: 16, offset: 880)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !376, file: !375, line: 53, baseType: !360, size: 16, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !375, line: 55, baseType: !360, size: 16, offset: 912)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !376, file: !375, line: 56, baseType: !360, size: 16, offset: 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !376, file: !375, line: 58, baseType: !360, size: 16, offset: 944)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !376, file: !375, line: 58, baseType: !360, size: 16, offset: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !376, file: !375, line: 59, baseType: !360, size: 16, offset: 976)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !376, file: !375, line: 59, baseType: !360, size: 16, offset: 992)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !376, file: !375, line: 61, baseType: !360, size: 16, offset: 1008)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !376, file: !375, line: 63, baseType: !418, size: 64, offset: 1024)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !376, file: !375, line: 64, baseType: !101, size: 32, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !376, file: !375, line: 65, baseType: !101, size: 32, offset: 1120)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !376, file: !375, line: 68, baseType: !422, size: 64, offset: 1152)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !375, line: 68, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !376, file: !375, line: 69, baseType: !425, size: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !427, line: 490, size: 768, elements: !428)
!427 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!428 = !{!429, !430, !431, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !427, line: 491, baseType: !425, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !426, file: !427, line: 491, baseType: !425, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !426, file: !427, line: 493, baseType: !432, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !434, line: 169, size: 2048, elements: !435)
!434 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!435 = !{!436, !437, !438, !439, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1769, !1772, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !434, line: 170, baseType: !432, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !434, line: 170, baseType: !432, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !433, file: !434, line: 172, baseType: !354, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !433, file: !434, line: 174, baseType: !440, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !442)
!442 = !{!443, !506, !507, !508, !509, !510, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !441, file: !30, line: 50, baseType: !444, size: 960)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !445, line: 130, baseType: !446)
!445 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !445, line: 117, size: 960, elements: !447)
!447 = !{!448, !449, !450, !452, !472, !476, !477, !478, !479, !480}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !445, line: 118, baseType: !354, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !446, file: !445, line: 118, baseType: !354, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !446, file: !445, line: 119, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !446, file: !445, line: 120, baseType: !453, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !445, line: 136, size: 17600, elements: !455)
!455 = !{!456, !457, !459, !462, !467, !468, !469}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !454, file: !445, line: 137, baseType: !444, size: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !454, file: !445, line: 138, baseType: !458, size: 64, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !454, file: !445, line: 139, baseType: !460, size: 64, offset: 1024)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !445, line: 43, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !445, line: 140, baseType: !463, size: 8192, offset: 1088)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 8192, elements: !465)
!464 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!465 = !{!466}
!466 = !DISubrange(count: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !454, file: !445, line: 141, baseType: !463, size: 8192, offset: 9280)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !454, file: !445, line: 148, baseType: !453, size: 64, offset: 17472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !454, file: !445, line: 150, baseType: !470, size: 64, offset: 17536)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !445, line: 45, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !446, file: !445, line: 121, baseType: !473, size: 528, offset: 256)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 528, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 66)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !446, file: !445, line: 126, baseType: !360, size: 16, offset: 784)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !446, file: !445, line: 127, baseType: !101, size: 32, offset: 800)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !446, file: !445, line: 128, baseType: !101, size: 32, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !446, file: !445, line: 128, baseType: !101, size: 32, offset: 864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !446, file: !445, line: 129, baseType: !481, size: 64, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !445, line: 75, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !445, line: 62, size: 1024, elements: !484)
!484 = !{!485, !487, !488, !489, !490, !491, !495, !496, !504, !505}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !445, line: 63, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !483, file: !445, line: 63, baseType: !486, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !445, line: 64, baseType: !464, size: 8, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !483, file: !445, line: 64, baseType: !464, size: 8, offset: 136)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !445, line: 65, baseType: !360, size: 16, offset: 144)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !445, line: 66, baseType: !492, size: 512, offset: 160)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 512, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !483, file: !445, line: 67, baseType: !101, size: 32, offset: 672)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !483, file: !445, line: 69, baseType: !497, size: 256, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !445, line: 60, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !445, line: 48, size: 256, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !498, file: !445, line: 49, baseType: !354, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !498, file: !445, line: 58, baseType: !349, size: 128, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !498, file: !445, line: 59, baseType: !101, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !498, file: !445, line: 59, baseType: !101, size: 32, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !483, file: !445, line: 70, baseType: !101, size: 32, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !483, file: !445, line: 74, baseType: !101, size: 32, offset: 992)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !441, file: !30, line: 52, baseType: !349, size: 128, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !441, file: !30, line: 53, baseType: !349, size: 128, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !441, file: !30, line: 54, baseType: !349, size: 128, offset: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !441, file: !30, line: 55, baseType: !349, size: 128, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !441, file: !30, line: 57, baseType: !511, size: 64, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !513, line: 1216, size: 39680, elements: !514)
!513 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!514 = !{!515, !516, !520, !523, !526, !527, !528, !540, !541, !545, !546, !547, !548, !549, !550, !551, !552, !553, !557, !626, !1062, !1277, !1280, !1562, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1584, !1585, !1586, !1587, !1588, !1596, !1663, !1670, !1671, !1678, !1679, !1685, !1686, !1687, !1688, !1689}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !512, file: !513, line: 1217, baseType: !444, size: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !512, file: !513, line: 1218, baseType: !517, size: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !519, line: 45, flags: DIFlagFwdDecl)
!519 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!520 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !512, file: !513, line: 1220, baseType: !521, size: 64, offset: 1024)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !519, line: 49, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !512, file: !513, line: 1221, baseType: !524, size: 64, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !513, line: 52, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !512, file: !513, line: 1223, baseType: !511, size: 64, offset: 1152)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !512, file: !513, line: 1225, baseType: !349, size: 128, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !512, file: !513, line: 1226, baseType: !529, size: 64, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !513, line: 69, size: 320, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !513, line: 70, baseType: !529, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !530, file: !513, line: 70, baseType: !529, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !530, file: !513, line: 71, baseType: !5, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !530, file: !513, line: 71, baseType: !5, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !513, line: 72, baseType: !101, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !530, file: !513, line: 73, baseType: !360, size: 16, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !530, file: !513, line: 73, baseType: !360, size: 16, offset: 240)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !530, file: !513, line: 74, baseType: !521, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !512, file: !513, line: 1227, baseType: !521, size: 64, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !512, file: !513, line: 1229, baseType: !542, size: 96, offset: 1472)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 96, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 3)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !512, file: !513, line: 1230, baseType: !542, size: 96, offset: 1568)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !512, file: !513, line: 1231, baseType: !542, size: 96, offset: 1664)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !512, file: !513, line: 1231, baseType: !542, size: 96, offset: 1760)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !512, file: !513, line: 1233, baseType: !5, size: 32, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !512, file: !513, line: 1234, baseType: !101, size: 32, offset: 1888)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !512, file: !513, line: 1235, baseType: !5, size: 32, offset: 1920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !513, line: 1237, baseType: !360, size: 16, offset: 1952)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !512, file: !513, line: 1239, baseType: !464, size: 8, offset: 1968)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !512, file: !513, line: 1240, baseType: !554, size: 8, offset: 1976)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 8, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 1)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !512, file: !513, line: 1242, baseType: !558, size: 64, offset: 1984)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !560, line: 328, size: 3456, elements: !561)
!560 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!561 = !{!562, !563, !564, !567, !568, !572, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !596, !601, !602, !605, !609, !614, !618, !622, !623, !624, !625}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !559, file: !560, line: 329, baseType: !444, size: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !559, file: !560, line: 330, baseType: !517, size: 64, offset: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !559, file: !560, line: 332, baseType: !565, size: 64, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !560, line: 332, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !559, file: !560, line: 333, baseType: !492, size: 512, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !559, file: !560, line: 335, baseType: !569, size: 64, offset: 1600)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !571, line: 41, flags: DIFlagFwdDecl)
!571 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !559, file: !560, line: 337, baseType: !573, size: 64, offset: 1664)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !513, line: 61, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !559, file: !560, line: 338, baseType: !399, size: 64, offset: 1728)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !559, file: !560, line: 340, baseType: !349, size: 128, offset: 1792)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !559, file: !560, line: 340, baseType: !349, size: 128, offset: 1920)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !559, file: !560, line: 342, baseType: !101, size: 32, offset: 2048)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !559, file: !560, line: 342, baseType: !101, size: 32, offset: 2080)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !559, file: !560, line: 343, baseType: !101, size: 32, offset: 2112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !559, file: !560, line: 345, baseType: !101, size: 32, offset: 2144)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !559, file: !560, line: 346, baseType: !101, size: 32, offset: 2176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !559, file: !560, line: 347, baseType: !360, size: 16, offset: 2208)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !559, file: !560, line: 348, baseType: !360, size: 16, offset: 2224)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !559, file: !560, line: 349, baseType: !101, size: 32, offset: 2240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !559, file: !560, line: 351, baseType: !101, size: 32, offset: 2272)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !559, file: !560, line: 353, baseType: !360, size: 16, offset: 2304)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !559, file: !560, line: 354, baseType: !360, size: 16, offset: 2320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !559, file: !560, line: 355, baseType: !101, size: 32, offset: 2336)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !559, file: !560, line: 357, baseType: !379, size: 128, offset: 2368)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !559, file: !560, line: 363, baseType: !349, size: 128, offset: 2496)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !559, file: !560, line: 363, baseType: !349, size: 128, offset: 2624)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !559, file: !560, line: 368, baseType: !594, size: 64, offset: 2752)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !560, line: 48, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !559, file: !560, line: 372, baseType: !597, size: 32, offset: 2816)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !560, line: 274, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !560, line: 271, size: 32, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !598, file: !560, line: 273, baseType: !5, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !559, file: !560, line: 373, baseType: !101, size: 32, offset: 2848)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !559, file: !560, line: 382, baseType: !603, size: 64, offset: 2880)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !560, line: 46, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !559, file: !560, line: 385, baseType: !606, size: 64, offset: 2944)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !354, !340}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !559, file: !560, line: 386, baseType: !610, size: 64, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !354, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !559, file: !560, line: 387, baseType: !615, size: 64, offset: 3072)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!101, !354}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !559, file: !560, line: 388, baseType: !619, size: 64, offset: 3136)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !354}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !559, file: !560, line: 389, baseType: !354, size: 64, offset: 3200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !559, file: !560, line: 389, baseType: !354, size: 64, offset: 3264)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !559, file: !560, line: 389, baseType: !354, size: 64, offset: 3328)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !559, file: !560, line: 389, baseType: !354, size: 64, offset: 3392)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !512, file: !513, line: 1244, baseType: !627, size: 64, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !629, line: 200, size: 17024, elements: !630)
!629 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!630 = !{!631, !633, !634, !635, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !628, file: !629, line: 201, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !628, file: !629, line: 202, baseType: !349, size: 128, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !628, file: !629, line: 203, baseType: !349, size: 128, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !628, file: !629, line: 206, baseType: !636, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !629, line: 190, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !629, line: 126, size: 2816, elements: !639)
!639 = !{!640, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !739, !742, !743, !744, !1026, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1054}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !629, line: 127, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !638, file: !629, line: 127, baseType: !641, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !638, file: !629, line: 128, baseType: !354, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !638, file: !629, line: 129, baseType: !354, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !638, file: !629, line: 130, baseType: !492, size: 512, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !638, file: !629, line: 132, baseType: !101, size: 32, offset: 768)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !629, line: 132, baseType: !101, size: 32, offset: 800)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !638, file: !629, line: 133, baseType: !101, size: 32, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !638, file: !629, line: 134, baseType: !101, size: 32, offset: 864)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !638, file: !629, line: 134, baseType: !101, size: 32, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !638, file: !629, line: 134, baseType: !101, size: 32, offset: 928)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !638, file: !629, line: 135, baseType: !101, size: 32, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !638, file: !629, line: 135, baseType: !101, size: 32, offset: 992)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !638, file: !629, line: 136, baseType: !101, size: 32, offset: 1024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !638, file: !629, line: 136, baseType: !101, size: 32, offset: 1056)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !638, file: !629, line: 137, baseType: !101, size: 32, offset: 1088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !638, file: !629, line: 137, baseType: !101, size: 32, offset: 1120)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !638, file: !629, line: 138, baseType: !340, size: 32, offset: 1152)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !638, file: !629, line: 139, baseType: !340, size: 32, offset: 1184)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !638, file: !629, line: 139, baseType: !340, size: 32, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !638, file: !629, line: 141, baseType: !360, size: 16, offset: 1248)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !638, file: !629, line: 142, baseType: !360, size: 16, offset: 1264)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !638, file: !629, line: 143, baseType: !101, size: 32, offset: 1280)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !638, file: !629, line: 144, baseType: !101, size: 32, offset: 1312)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !638, file: !629, line: 146, baseType: !666, size: 64, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !629, line: 114, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !629, line: 99, size: 7232, elements: !669)
!669 = !{!670, !672, !673, !674, !675, !676, !677, !688, !692, !707, !716, !723, !733}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !668, file: !629, line: 100, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !668, file: !629, line: 100, baseType: !671, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !668, file: !629, line: 101, baseType: !101, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !668, file: !629, line: 101, baseType: !101, size: 32, offset: 160)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !668, file: !629, line: 102, baseType: !101, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !668, file: !629, line: 102, baseType: !101, size: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !668, file: !629, line: 103, baseType: !678, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !629, line: 59, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !629, line: 56, size: 2112, elements: !681)
!681 = !{!682, !686, !687}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !629, line: 57, baseType: !683, size: 2048)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 2048, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !680, file: !629, line: 58, baseType: !101, size: 32, offset: 2048)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !680, file: !629, line: 58, baseType: !101, size: 32, offset: 2080)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !668, file: !629, line: 106, baseType: !689, size: 6144, offset: 320)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 6144, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !668, file: !629, line: 107, baseType: !693, size: 64, offset: 6464)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !629, line: 97, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !629, line: 83, size: 8320, elements: !696)
!696 = !{!697, !698, !699, !703, !704, !705, !706}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !695, file: !629, line: 84, baseType: !689, size: 6144)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !695, file: !629, line: 87, baseType: !683, size: 2048, offset: 6144)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !695, file: !629, line: 88, baseType: !700, size: 64, offset: 8192)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !702, line: 41, flags: DIFlagFwdDecl)
!702 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !695, file: !629, line: 90, baseType: !360, size: 16, offset: 8256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !695, file: !629, line: 92, baseType: !360, size: 16, offset: 8272)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !695, file: !629, line: 93, baseType: !360, size: 16, offset: 8288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !695, file: !629, line: 95, baseType: !360, size: 16, offset: 8304)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !668, file: !629, line: 108, baseType: !708, size: 64, offset: 6528)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !629, line: 66, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !629, line: 61, size: 128, elements: !711)
!711 = !{!712, !713, !714, !715}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !710, file: !629, line: 62, baseType: !101, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !710, file: !629, line: 63, baseType: !101, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !710, file: !629, line: 64, baseType: !101, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !710, file: !629, line: 65, baseType: !101, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !668, file: !629, line: 109, baseType: !717, size: 64, offset: 6592)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !629, line: 71, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !629, line: 68, size: 64, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !719, file: !629, line: 69, baseType: !101, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !719, file: !629, line: 70, baseType: !101, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !668, file: !629, line: 110, baseType: !724, size: 64, offset: 6656)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !629, line: 81, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !629, line: 73, size: 352, elements: !727)
!727 = !{!728, !729, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !726, file: !629, line: 74, baseType: !542, size: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !726, file: !629, line: 75, baseType: !542, size: 96, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !726, file: !629, line: 76, baseType: !542, size: 96, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !726, file: !629, line: 77, baseType: !101, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !629, line: 78, baseType: !101, size: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !668, file: !629, line: 113, baseType: !734, size: 512, offset: 6720)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !735, line: 182, baseType: !736)
!735 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !735, line: 180, size: 512, elements: !737)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !736, file: !735, line: 181, baseType: !492, size: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !638, file: !629, line: 148, baseType: !740, size: 64, offset: 1408)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !519, line: 46, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !638, file: !629, line: 151, baseType: !511, size: 64, offset: 1472)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !638, file: !629, line: 152, baseType: !521, size: 64, offset: 1536)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !638, file: !629, line: 153, baseType: !745, size: 64, offset: 1600)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !747, line: 64, size: 19136, elements: !748)
!747 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!748 = !{!749, !750, !751, !752, !753, !754, !756, !757, !758, !759, !762, !763, !1012, !1013, !1021, !1022, !1023, !1024, !1025}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !746, file: !747, line: 65, baseType: !444, size: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !746, file: !747, line: 66, baseType: !517, size: 64, offset: 960)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !746, file: !747, line: 68, baseType: !463, size: 8192, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !746, file: !747, line: 70, baseType: !101, size: 32, offset: 9216)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !746, file: !747, line: 71, baseType: !101, size: 32, offset: 9248)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !746, file: !747, line: 72, baseType: !755, size: 64, offset: 9280)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !400)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !746, file: !747, line: 74, baseType: !340, size: 32, offset: 9344)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !746, file: !747, line: 74, baseType: !340, size: 32, offset: 9376)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !746, file: !747, line: 76, baseType: !700, size: 64, offset: 9408)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !746, file: !747, line: 77, baseType: !760, size: 64, offset: 9472)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !747, line: 77, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !746, file: !747, line: 78, baseType: !573, size: 64, offset: 9536)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !746, file: !747, line: 80, baseType: !764, size: 2624, offset: 9600)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !765, line: 340, size: 2624, elements: !766)
!765 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!766 = !{!767, !795, !813, !814, !815, !833, !891, !892, !992, !993, !994, !995, !1001}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !764, file: !765, line: 341, baseType: !768, size: 576)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !765, line: 251, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !765, line: 207, size: 576, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !769, file: !765, line: 208, baseType: !101, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !769, file: !765, line: 211, baseType: !360, size: 16, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !769, file: !765, line: 212, baseType: !360, size: 16, offset: 48)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !769, file: !765, line: 213, baseType: !340, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !769, file: !765, line: 214, baseType: !360, size: 16, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !769, file: !765, line: 215, baseType: !360, size: 16, offset: 112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !769, file: !765, line: 216, baseType: !360, size: 16, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !769, file: !765, line: 217, baseType: !360, size: 16, offset: 144)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !769, file: !765, line: 218, baseType: !360, size: 16, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !769, file: !765, line: 219, baseType: !360, size: 16, offset: 176)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !769, file: !765, line: 220, baseType: !340, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !769, file: !765, line: 222, baseType: !360, size: 16, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !769, file: !765, line: 225, baseType: !360, size: 16, offset: 240)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !769, file: !765, line: 228, baseType: !101, size: 32, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !769, file: !765, line: 229, baseType: !101, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !769, file: !765, line: 233, baseType: !101, size: 32, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !769, file: !765, line: 236, baseType: !360, size: 16, offset: 352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !769, file: !765, line: 236, baseType: !360, size: 16, offset: 368)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !769, file: !765, line: 241, baseType: !340, size: 32, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !769, file: !765, line: 244, baseType: !101, size: 32, offset: 416)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !769, file: !765, line: 244, baseType: !101, size: 32, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !769, file: !765, line: 245, baseType: !340, size: 32, offset: 480)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !769, file: !765, line: 248, baseType: !340, size: 32, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !769, file: !765, line: 250, baseType: !101, size: 32, offset: 544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !764, file: !765, line: 342, baseType: !796, size: 448, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !765, line: 79, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !765, line: 61, size: 448, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !797, file: !765, line: 62, baseType: !354, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !797, file: !765, line: 64, baseType: !360, size: 16, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !797, file: !765, line: 65, baseType: !360, size: 16, offset: 80)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !797, file: !765, line: 67, baseType: !340, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !797, file: !765, line: 68, baseType: !340, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !797, file: !765, line: 69, baseType: !340, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !797, file: !765, line: 70, baseType: !360, size: 16, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !797, file: !765, line: 71, baseType: !360, size: 16, offset: 208)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !797, file: !765, line: 72, baseType: !399, size: 64, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !797, file: !765, line: 75, baseType: !340, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !797, file: !765, line: 75, baseType: !340, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !797, file: !765, line: 75, baseType: !340, size: 32, offset: 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !797, file: !765, line: 78, baseType: !340, size: 32, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !797, file: !765, line: 78, baseType: !340, size: 32, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !764, file: !765, line: 343, baseType: !349, size: 128, offset: 1024)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !764, file: !765, line: 344, baseType: !349, size: 128, offset: 1152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !764, file: !765, line: 345, baseType: !816, size: 192, offset: 1280)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !765, line: 278, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !765, line: 270, size: 192, elements: !818)
!818 = !{!819, !820, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !817, file: !765, line: 271, baseType: !101, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !817, file: !765, line: 273, baseType: !340, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !817, file: !765, line: 275, baseType: !101, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !817, file: !765, line: 276, baseType: !101, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !817, file: !765, line: 277, baseType: !824, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !765, line: 55, size: 576, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !825, file: !765, line: 56, baseType: !101, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !825, file: !765, line: 57, baseType: !340, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !825, file: !765, line: 58, baseType: !830, size: 512, offset: 64)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 512, elements: !831)
!831 = !{!832, !832}
!832 = !DISubrange(count: 4)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !764, file: !765, line: 346, baseType: !834, size: 384, offset: 1472)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !765, line: 268, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !765, line: 253, size: 384, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !885, !886, !887, !888, !889, !890}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !835, file: !765, line: 254, baseType: !101, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !835, file: !765, line: 255, baseType: !101, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !835, file: !765, line: 255, baseType: !101, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !835, file: !765, line: 258, baseType: !340, size: 32, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !835, file: !765, line: 259, baseType: !842, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !765, line: 164, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !765, line: 108, size: 1664, elements: !845)
!845 = !{!846, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !844, file: !765, line: 109, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !844, file: !765, line: 109, baseType: !847, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !765, line: 111, baseType: !492, size: 512, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !844, file: !765, line: 119, baseType: !399, size: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !844, file: !765, line: 119, baseType: !399, size: 64, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !844, file: !765, line: 125, baseType: !399, size: 64, offset: 768)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !844, file: !765, line: 125, baseType: !399, size: 64, offset: 832)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !844, file: !765, line: 127, baseType: !399, size: 64, offset: 896)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !844, file: !765, line: 130, baseType: !101, size: 32, offset: 960)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !844, file: !765, line: 131, baseType: !101, size: 32, offset: 992)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !844, file: !765, line: 132, baseType: !858, size: 64, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !765, line: 106, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !765, line: 81, size: 512, elements: !861)
!861 = !{!862, !863, !866, !867, !868, !869}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !860, file: !765, line: 82, baseType: !399, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !860, file: !765, line: 97, baseType: !864, size: 256, offset: 64)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 256, elements: !865)
!865 = !{!832, !401}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !860, file: !765, line: 102, baseType: !399, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !860, file: !765, line: 102, baseType: !399, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !860, file: !765, line: 104, baseType: !101, size: 32, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !860, file: !765, line: 105, baseType: !101, size: 32, offset: 480)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !844, file: !765, line: 135, baseType: !542, size: 96, offset: 1088)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !844, file: !765, line: 136, baseType: !340, size: 32, offset: 1184)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !844, file: !765, line: 139, baseType: !101, size: 32, offset: 1216)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !844, file: !765, line: 139, baseType: !101, size: 32, offset: 1248)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !844, file: !765, line: 139, baseType: !101, size: 32, offset: 1280)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !844, file: !765, line: 140, baseType: !542, size: 96, offset: 1312)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !844, file: !765, line: 143, baseType: !360, size: 16, offset: 1408)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !844, file: !765, line: 144, baseType: !360, size: 16, offset: 1424)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !844, file: !765, line: 145, baseType: !360, size: 16, offset: 1440)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !844, file: !765, line: 148, baseType: !360, size: 16, offset: 1456)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !844, file: !765, line: 149, baseType: !101, size: 32, offset: 1472)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !844, file: !765, line: 150, baseType: !340, size: 32, offset: 1504)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !844, file: !765, line: 152, baseType: !573, size: 64, offset: 1536)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !844, file: !765, line: 163, baseType: !340, size: 32, offset: 1600)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !844, file: !765, line: 163, baseType: !340, size: 32, offset: 1632)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !835, file: !765, line: 261, baseType: !340, size: 32, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !835, file: !765, line: 261, baseType: !340, size: 32, offset: 224)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !835, file: !765, line: 261, baseType: !340, size: 32, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !835, file: !765, line: 263, baseType: !101, size: 32, offset: 288)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !835, file: !765, line: 266, baseType: !101, size: 32, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !835, file: !765, line: 267, baseType: !340, size: 32, offset: 352)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !764, file: !765, line: 347, baseType: !842, size: 64, offset: 1856)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !764, file: !765, line: 348, baseType: !893, size: 64, offset: 1920)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !765, line: 205, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !765, line: 186, size: 1024, elements: !896)
!896 = !{!897, !899, !900, !901, !903, !904, !905, !913, !914, !915, !990, !991}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !895, file: !765, line: 187, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !895, file: !765, line: 187, baseType: !898, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !895, file: !765, line: 189, baseType: !492, size: 512, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !895, file: !765, line: 191, baseType: !902, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !895, file: !765, line: 193, baseType: !101, size: 32, offset: 704)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !895, file: !765, line: 193, baseType: !101, size: 32, offset: 736)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !895, file: !765, line: 195, baseType: !906, size: 64, offset: 768)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !765, line: 184, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !765, line: 166, size: 320, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !908, file: !765, line: 180, baseType: !864, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !908, file: !765, line: 182, baseType: !101, size: 32, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !908, file: !765, line: 183, baseType: !101, size: 32, offset: 288)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !895, file: !765, line: 196, baseType: !101, size: 32, offset: 832)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !895, file: !765, line: 198, baseType: !101, size: 32, offset: 864)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !895, file: !765, line: 200, baseType: !916, size: 64, offset: 896)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !702, line: 77, size: 15424, elements: !918)
!918 = !{!919, !920, !921, !924, !927, !928, !931, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !949, !950, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !976, !977, !978, !979, !980, !984}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !917, file: !702, line: 78, baseType: !444, size: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !917, file: !702, line: 80, baseType: !463, size: 8192, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !917, file: !702, line: 82, baseType: !922, size: 64, offset: 9152)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !702, line: 43, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !917, file: !702, line: 83, baseType: !925, size: 64, offset: 9216)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !445, line: 46, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !917, file: !702, line: 86, baseType: !700, size: 64, offset: 9280)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !917, file: !702, line: 87, baseType: !929, size: 64, offset: 9344)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !702, line: 44, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !917, file: !702, line: 89, baseType: !932, size: 512, offset: 9408)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 512, elements: !361)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !917, file: !702, line: 90, baseType: !360, size: 16, offset: 9920)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !917, file: !702, line: 90, baseType: !360, size: 16, offset: 9936)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !917, file: !702, line: 92, baseType: !360, size: 16, offset: 9952)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !917, file: !702, line: 92, baseType: !360, size: 16, offset: 9968)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !917, file: !702, line: 93, baseType: !360, size: 16, offset: 9984)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !917, file: !702, line: 93, baseType: !360, size: 16, offset: 10000)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !917, file: !702, line: 94, baseType: !101, size: 32, offset: 10016)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !917, file: !702, line: 97, baseType: !360, size: 16, offset: 10048)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !917, file: !702, line: 97, baseType: !360, size: 16, offset: 10064)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !917, file: !702, line: 98, baseType: !360, size: 16, offset: 10080)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !917, file: !702, line: 98, baseType: !360, size: 16, offset: 10096)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !917, file: !702, line: 99, baseType: !360, size: 16, offset: 10112)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !917, file: !702, line: 99, baseType: !360, size: 16, offset: 10128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !917, file: !702, line: 100, baseType: !5, size: 32, offset: 10144)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !917, file: !702, line: 101, baseType: !948, size: 64, offset: 10176)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !917, file: !702, line: 103, baseType: !470, size: 64, offset: 10240)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !917, file: !702, line: 104, baseType: !951, size: 64, offset: 10304)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !445, line: 159, size: 448, elements: !953)
!953 = !{!954, !956, !957, !959, !960, !962}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !952, file: !445, line: 161, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !400)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !952, file: !445, line: 162, baseType: !955, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !952, file: !445, line: 163, baseType: !958, size: 32, offset: 128)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 32, elements: !400)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !952, file: !445, line: 164, baseType: !958, size: 32, offset: 160)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !952, file: !445, line: 165, baseType: !961, size: 128, offset: 192)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 128, elements: !400)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !952, file: !445, line: 166, baseType: !963, size: 128, offset: 320)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 128, elements: !400)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !917, file: !702, line: 107, baseType: !340, size: 32, offset: 10368)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !917, file: !702, line: 108, baseType: !101, size: 32, offset: 10400)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !917, file: !702, line: 109, baseType: !360, size: 16, offset: 10432)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !917, file: !702, line: 110, baseType: !360, size: 16, offset: 10448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !917, file: !702, line: 113, baseType: !101, size: 32, offset: 10464)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !917, file: !702, line: 113, baseType: !101, size: 32, offset: 10496)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !917, file: !702, line: 114, baseType: !464, size: 8, offset: 10528)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !917, file: !702, line: 114, baseType: !464, size: 8, offset: 10536)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !917, file: !702, line: 115, baseType: !360, size: 16, offset: 10544)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !917, file: !702, line: 116, baseType: !974, size: 128, offset: 10560)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 128, elements: !975)
!975 = !{!832}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !917, file: !702, line: 119, baseType: !340, size: 32, offset: 10688)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !917, file: !702, line: 119, baseType: !340, size: 32, offset: 10720)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !917, file: !702, line: 122, baseType: !734, size: 512, offset: 10752)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !917, file: !702, line: 123, baseType: !464, size: 8, offset: 11264)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !917, file: !702, line: 125, baseType: !981, size: 56, offset: 11272)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 56, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 7)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !917, file: !702, line: 126, baseType: !985, size: 4096, offset: 11328)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 4096, elements: !361)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !702, line: 69, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !702, line: 67, size: 512, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !987, file: !702, line: 68, baseType: !492, size: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !895, file: !765, line: 201, baseType: !340, size: 32, offset: 960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !895, file: !765, line: 204, baseType: !101, size: 32, offset: 992)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !764, file: !765, line: 350, baseType: !349, size: 128, offset: 1984)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !764, file: !765, line: 351, baseType: !101, size: 32, offset: 2112)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !764, file: !765, line: 351, baseType: !101, size: 32, offset: 2144)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !764, file: !765, line: 353, baseType: !996, size: 64, offset: 2176)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !765, line: 297, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !765, line: 295, size: 2048, elements: !999)
!999 = !{!1000}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !998, file: !765, line: 296, baseType: !683, size: 2048)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !764, file: !765, line: 355, baseType: !1002, size: 384, offset: 2240)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !765, line: 338, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !765, line: 322, size: 384, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1003, file: !765, line: 323, baseType: !101, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1003, file: !765, line: 325, baseType: !360, size: 16, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1003, file: !765, line: 326, baseType: !360, size: 16, offset: 48)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1003, file: !765, line: 331, baseType: !349, size: 128, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1003, file: !765, line: 334, baseType: !349, size: 128, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1003, file: !765, line: 335, baseType: !101, size: 32, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1003, file: !765, line: 337, baseType: !101, size: 32, offset: 352)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !746, file: !747, line: 81, baseType: !354, size: 64, offset: 12224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !746, file: !747, line: 85, baseType: !1014, size: 6208, offset: 12288)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !747, line: 55, size: 6208, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1014, file: !747, line: 56, baseType: !689, size: 6144)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1014, file: !747, line: 58, baseType: !360, size: 16, offset: 6144)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1014, file: !747, line: 59, baseType: !360, size: 16, offset: 6160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1014, file: !747, line: 60, baseType: !360, size: 16, offset: 6176)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1014, file: !747, line: 61, baseType: !360, size: 16, offset: 6192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !746, file: !747, line: 86, baseType: !101, size: 32, offset: 18496)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !746, file: !747, line: 88, baseType: !101, size: 32, offset: 18528)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !746, file: !747, line: 90, baseType: !101, size: 32, offset: 18560)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !746, file: !747, line: 94, baseType: !101, size: 32, offset: 18592)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !746, file: !747, line: 100, baseType: !734, size: 512, offset: 18624)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !638, file: !629, line: 154, baseType: !1027, size: 64, offset: 1664)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1029, line: 264, flags: DIFlagFwdDecl)
!1029 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !638, file: !629, line: 156, baseType: !700, size: 64, offset: 1728)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !638, file: !629, line: 158, baseType: !340, size: 32, offset: 1792)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !638, file: !629, line: 159, baseType: !340, size: 32, offset: 1824)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !638, file: !629, line: 162, baseType: !641, size: 64, offset: 1856)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !638, file: !629, line: 162, baseType: !641, size: 64, offset: 1920)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !638, file: !629, line: 162, baseType: !641, size: 64, offset: 1984)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !638, file: !629, line: 164, baseType: !349, size: 128, offset: 2048)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !638, file: !629, line: 166, baseType: !1038, size: 64, offset: 2176)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !629, line: 51, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !638, file: !629, line: 167, baseType: !354, size: 64, offset: 2240)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !638, file: !629, line: 168, baseType: !340, size: 32, offset: 2304)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !638, file: !629, line: 170, baseType: !340, size: 32, offset: 2336)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !638, file: !629, line: 170, baseType: !340, size: 32, offset: 2368)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !638, file: !629, line: 171, baseType: !340, size: 32, offset: 2400)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !638, file: !629, line: 173, baseType: !354, size: 64, offset: 2432)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !638, file: !629, line: 175, baseType: !101, size: 32, offset: 2496)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !638, file: !629, line: 176, baseType: !101, size: 32, offset: 2528)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !638, file: !629, line: 179, baseType: !101, size: 32, offset: 2560)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !638, file: !629, line: 180, baseType: !340, size: 32, offset: 2592)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !638, file: !629, line: 183, baseType: !101, size: 32, offset: 2624)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !638, file: !629, line: 185, baseType: !464, size: 8, offset: 2656)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !638, file: !629, line: 186, baseType: !1053, size: 24, offset: 2664)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 24, elements: !543)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !638, file: !629, line: 189, baseType: !349, size: 128, offset: 2688)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !628, file: !629, line: 207, baseType: !463, size: 8192, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !628, file: !629, line: 208, baseType: !463, size: 8192, offset: 8576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !628, file: !629, line: 210, baseType: !101, size: 32, offset: 16768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !628, file: !629, line: 210, baseType: !101, size: 32, offset: 16800)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !628, file: !629, line: 211, baseType: !101, size: 32, offset: 16832)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !628, file: !629, line: 211, baseType: !101, size: 32, offset: 16864)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !628, file: !629, line: 212, baseType: !379, size: 128, offset: 16896)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !512, file: !513, line: 1246, baseType: !1063, size: 64, offset: 2112)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !513, line: 1067, size: 5184, elements: !1065)
!1065 = !{!1066, !1096, !1097, !1112, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1134, !1150, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1260}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1064, file: !513, line: 1068, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !513, line: 934, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !513, line: 925, size: 576, elements: !1070)
!1070 = !{!1071, !1088, !1089, !1090, !1091, !1092, !1095}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1069, file: !513, line: 926, baseType: !1072, size: 320)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !513, line: 830, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !513, line: 813, size: 320, elements: !1074)
!1074 = !{!1075, !1078, !1081, !1082, !1085, !1086, !1087}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1073, file: !513, line: 814, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !513, line: 51, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1073, file: !513, line: 815, baseType: !1079, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !513, line: 815, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1073, file: !513, line: 818, baseType: !354, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1073, file: !513, line: 819, baseType: !1083, size: 32, offset: 192)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 32, elements: !975)
!1084 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1073, file: !513, line: 822, baseType: !101, size: 32, offset: 224)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1073, file: !513, line: 826, baseType: !101, size: 32, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1073, file: !513, line: 829, baseType: !101, size: 32, offset: 288)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1069, file: !513, line: 928, baseType: !360, size: 16, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1069, file: !513, line: 928, baseType: !360, size: 16, offset: 336)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1069, file: !513, line: 929, baseType: !101, size: 32, offset: 352)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1069, file: !513, line: 930, baseType: !948, size: 64, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1069, file: !513, line: 931, baseType: !1093, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !513, line: 931, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1069, file: !513, line: 933, baseType: !354, size: 64, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1064, file: !513, line: 1069, baseType: !1067, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1064, file: !513, line: 1070, baseType: !1098, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !513, line: 916, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !513, line: 891, size: 704, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1106, !1107, !1108, !1109, !1110, !1111}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1100, file: !513, line: 892, baseType: !1072, size: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1100, file: !513, line: 896, baseType: !101, size: 32, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1100, file: !513, line: 900, baseType: !1105, size: 96, offset: 352)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 96, elements: !543)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1100, file: !513, line: 903, baseType: !340, size: 32, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1100, file: !513, line: 906, baseType: !101, size: 32, offset: 480)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1100, file: !513, line: 909, baseType: !340, size: 32, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1100, file: !513, line: 912, baseType: !340, size: 32, offset: 544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1100, file: !513, line: 914, baseType: !521, size: 64, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1100, file: !513, line: 915, baseType: !354, size: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1064, file: !513, line: 1071, baseType: !1113, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !513, line: 920, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !513, line: 918, size: 320, elements: !1116)
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1115, file: !513, line: 919, baseType: !1072, size: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1064, file: !513, line: 1075, baseType: !340, size: 32, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1064, file: !513, line: 1077, baseType: !340, size: 32, offset: 288)
