; ModuleID = 'blender/source/blender/bmesh/operators/bmo_join_triangles.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_join_triangles.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!62 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74}
!68 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 76, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!78 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!119 = !{!120, !121, !122, !126, !130, !196, !198, !180, !200, !140, !153}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !50, line: 79, baseType: !49)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !50, line: 158, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !120}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !50, line: 159, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!120, !120}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !133)
!133 = !{!134, !145, !151, !156, !157}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !43, line: 91, baseType: !135, size: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !137)
!137 = !{!138, !139, !141, !143, !144}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !43, line: 65, baseType: !120, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !136, file: !43, line: 66, baseType: !140, size: 32, offset: 64)
!140 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !136, file: !43, line: 73, baseType: !142, size: 8, offset: 96)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !136, file: !43, line: 74, baseType: !142, size: 8, offset: 104)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !136, file: !43, line: 80, baseType: !142, size: 8, offset: 112)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !132, file: !43, line: 92, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !147, file: !43, line: 181, baseType: !150, size: 16)
!150 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !132, file: !43, line: 94, baseType: !152, size: 96, offset: 192)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 96, elements: !154)
!153 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!154 = !{!155}
!155 = !DISubrange(count: 3)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !132, file: !43, line: 95, baseType: !152, size: 96, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !132, file: !43, line: 102, baseType: !158, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !160)
!160 = !{!161, !162, !163, !165, !166, !189, !195}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !159, file: !43, line: 111, baseType: !135, size: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !159, file: !43, line: 112, baseType: !146, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !159, file: !43, line: 114, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !159, file: !43, line: 114, baseType: !164, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !159, file: !43, line: 118, baseType: !167, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !169)
!169 = !{!170, !171, !172, !173, !185, !186, !187, !188}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !168, file: !43, line: 126, baseType: !135, size: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !168, file: !43, line: 129, baseType: !164, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !168, file: !43, line: 130, baseType: !158, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !168, file: !43, line: 131, baseType: !174, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !176)
!176 = !{!177, !178, !179, !182, !183, !184}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !175, file: !43, line: 165, baseType: !135, size: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !175, file: !43, line: 166, baseType: !146, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !175, file: !43, line: 172, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !168)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !175, file: !43, line: 174, baseType: !140, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !175, file: !43, line: 175, baseType: !152, size: 96, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !175, file: !43, line: 176, baseType: !150, size: 16, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !168, file: !43, line: 135, baseType: !167, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !168, file: !43, line: 135, baseType: !167, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !43, line: 139, baseType: !167, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !168, file: !43, line: 139, baseType: !167, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !159, file: !43, line: 122, baseType: !190, size: 128, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !43, line: 107, baseType: !158, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !43, line: 107, baseType: !158, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !159, file: !43, line: 122, baseType: !190, size: 128, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !159)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !175)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!202 = !{i32 7, !"Dwarf Version", i32 4}
!203 = !{i32 2, !"Debug Info Version", i32 3}
!204 = !{i32 1, !"wchar_size", i32 4}
!205 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!206 = distinct !DISubprogram(name: "bmo_join_triangles_exec", scope: !1, file: !1, line: 194, type: !207, scopeLine: 195, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209, !349}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !225, !226, !227, !228, !230, !232, !234, !235, !236, !237, !238, !239, !240, !241, !293, !332, !333, !334, !335, !336, !337, !338, !339, !346, !347, !348}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !211, file: !43, line: 187, baseType: !140, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !211, file: !43, line: 187, baseType: !140, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !211, file: !43, line: 187, baseType: !140, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !211, file: !43, line: 187, baseType: !140, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !211, file: !43, line: 188, baseType: !140, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !211, file: !43, line: 188, baseType: !140, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !211, file: !43, line: 188, baseType: !140, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !211, file: !43, line: 193, baseType: !142, size: 8, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !211, file: !43, line: 197, baseType: !142, size: 8, offset: 232)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !211, file: !43, line: 201, baseType: !223, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !76, line: 71, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !211, file: !43, line: 201, baseType: !223, size: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !211, file: !43, line: 201, baseType: !223, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !211, file: !43, line: 201, baseType: !223, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !211, file: !43, line: 208, baseType: !229, size: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !211, file: !43, line: 209, baseType: !231, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !211, file: !43, line: 210, baseType: !233, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !211, file: !43, line: 213, baseType: !140, size: 32, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !211, file: !43, line: 214, baseType: !140, size: 32, offset: 736)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !211, file: !43, line: 215, baseType: !140, size: 32, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !211, file: !43, line: 218, baseType: !223, size: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !211, file: !43, line: 218, baseType: !223, size: 64, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !211, file: !43, line: 218, baseType: !223, size: 64, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !211, file: !43, line: 220, baseType: !140, size: 32, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !211, file: !43, line: 221, baseType: !242, size: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !244)
!244 = !{!245, !281, !282, !286, !289, !290, !292}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !243, file: !4, line: 191, baseType: !246, size: 5120)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 5120, elements: !279)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !248)
!248 = !{!249, !252, !254, !264, !265}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !247, file: !4, line: 148, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !247, file: !4, line: 149, baseType: !253, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !247, file: !4, line: 150, baseType: !255, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !257)
!257 = !{!258, !260, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !256, file: !4, line: 139, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !256, file: !4, line: 140, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !256, file: !4, line: 141, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !247, file: !4, line: 152, baseType: !140, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !4, line: 162, baseType: !266, size: 128, offset: 192)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !4, line: 155, size: 128, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !274}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !266, file: !4, line: 156, baseType: !140, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !266, file: !4, line: 157, baseType: !153, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !266, file: !4, line: 158, baseType: !120, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !266, file: !4, line: 159, baseType: !152, size: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !266, file: !4, line: 160, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !266, file: !4, line: 161, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !277, line: 48, baseType: !278)
!277 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !277, line: 48, flags: DIFlagFwdDecl)
!279 = !{!280}
!280 = !DISubrange(count: 16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !243, file: !4, line: 192, baseType: !246, size: 5120, offset: 5120)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !243, file: !4, line: 193, baseType: !283, size: 64, offset: 10240)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !209, !242}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !243, file: !4, line: 194, baseType: !287, size: 64, offset: 10304)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !4, line: 195, baseType: !140, size: 32, offset: 10368)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !243, file: !4, line: 196, baseType: !291, size: 32, offset: 10400)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !4, line: 197, baseType: !140, size: 32, offset: 10432)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !211, file: !43, line: 223, baseType: !294, size: 1600, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !76, line: 73, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !76, line: 64, size: 1600, elements: !296)
!296 = !{!297, !315, !319, !320, !321, !322, !323}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !295, file: !76, line: 65, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !76, line: 53, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !76, line: 42, size: 832, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !314}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !76, line: 43, baseType: !140, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !300, file: !76, line: 44, baseType: !140, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !300, file: !76, line: 45, baseType: !140, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !300, file: !76, line: 46, baseType: !140, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !300, file: !76, line: 47, baseType: !140, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !300, file: !76, line: 48, baseType: !140, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !300, file: !76, line: 49, baseType: !140, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !300, file: !76, line: 50, baseType: !140, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !76, line: 51, baseType: !311, size: 512, offset: 256)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 512, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !76, line: 52, baseType: !120, size: 64, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !295, file: !76, line: 66, baseType: !316, size: 1312, offset: 64)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 1312, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 41)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !295, file: !76, line: 69, baseType: !140, size: 32, offset: 1376)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !295, file: !76, line: 69, baseType: !140, size: 32, offset: 1408)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !295, file: !76, line: 70, baseType: !140, size: 32, offset: 1440)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !295, file: !76, line: 71, baseType: !223, size: 64, offset: 1472)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !295, file: !76, line: 72, baseType: !324, size: 64, offset: 1536)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !76, line: 59, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !76, line: 57, size: 8192, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !326, file: !76, line: 58, baseType: !329, size: 8192)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 8192, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 1024)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !211, file: !43, line: 223, baseType: !294, size: 1600, offset: 2752)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !211, file: !43, line: 223, baseType: !294, size: 1600, offset: 4352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !211, file: !43, line: 223, baseType: !294, size: 1600, offset: 5952)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !211, file: !43, line: 233, baseType: !150, size: 16, offset: 7552)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !211, file: !43, line: 236, baseType: !140, size: 32, offset: 7584)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !211, file: !43, line: 238, baseType: !140, size: 32, offset: 7616)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !211, file: !43, line: 238, baseType: !140, size: 32, offset: 7648)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !211, file: !43, line: 239, baseType: !340, size: 128, offset: 7680)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !341, line: 71, baseType: !342)
!341 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !341, line: 69, size: 128, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !342, file: !341, line: 70, baseType: !120, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !342, file: !341, line: 70, baseType: !120, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !211, file: !43, line: 241, baseType: !198, size: 64, offset: 7808)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !211, file: !43, line: 243, baseType: !340, size: 128, offset: 7872)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !211, file: !43, line: 245, baseType: !120, size: 64, offset: 8000)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !243)
!351 = !{}
!352 = !DILocalVariable(name: "bm", arg: 1, scope: !206, file: !1, line: 194, type: !209)
!353 = !DILocation(line: 194, column: 37, scope: !206)
!354 = !DILocalVariable(name: "op", arg: 2, scope: !206, file: !1, line: 194, type: !349)
!355 = !DILocation(line: 194, column: 53, scope: !206)
!356 = !DILocalVariable(name: "do_sharp", scope: !206, file: !1, line: 196, type: !357)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!358 = !DILocation(line: 196, column: 13, scope: !206)
!359 = !DILocation(line: 196, column: 42, scope: !206)
!360 = !DILocation(line: 196, column: 46, scope: !206)
!361 = !DILocation(line: 196, column: 24, scope: !206)
!362 = !DILocalVariable(name: "do_uv", scope: !206, file: !1, line: 197, type: !357)
!363 = !DILocation(line: 197, column: 13, scope: !206)
!364 = !DILocation(line: 197, column: 42, scope: !206)
!365 = !DILocation(line: 197, column: 46, scope: !206)
!366 = !DILocation(line: 197, column: 24, scope: !206)
!367 = !DILocalVariable(name: "do_tf", scope: !206, file: !1, line: 198, type: !357)
!368 = !DILocation(line: 198, column: 13, scope: !206)
!369 = !DILocation(line: 198, column: 24, scope: !206)
!370 = !DILocalVariable(name: "do_vcol", scope: !206, file: !1, line: 199, type: !357)
!371 = !DILocation(line: 199, column: 13, scope: !206)
!372 = !DILocation(line: 199, column: 42, scope: !206)
!373 = !DILocation(line: 199, column: 46, scope: !206)
!374 = !DILocation(line: 199, column: 24, scope: !206)
!375 = !DILocalVariable(name: "do_mat", scope: !206, file: !1, line: 200, type: !357)
!376 = !DILocation(line: 200, column: 13, scope: !206)
!377 = !DILocation(line: 200, column: 42, scope: !206)
!378 = !DILocation(line: 200, column: 46, scope: !206)
!379 = !DILocation(line: 200, column: 24, scope: !206)
!380 = !DILocalVariable(name: "limit", scope: !206, file: !1, line: 201, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!382 = !DILocation(line: 201, column: 14, scope: !206)
!383 = !DILocation(line: 201, column: 43, scope: !206)
!384 = !DILocation(line: 201, column: 47, scope: !206)
!385 = !DILocation(line: 201, column: 24, scope: !206)
!386 = !DILocalVariable(name: "iter", scope: !206, file: !1, line: 203, type: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !50, line: 186, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !50, line: 164, size: 512, elements: !389)
!389 = !{!390, !470, !471, !472, !473}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !50, line: 179, baseType: !391, size: 320)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !388, file: !50, line: 166, size: 320, elements: !392)
!392 = !{!393, !408, !414, !422, !430, !436, !442, !448, !452, !458, !464}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !391, file: !50, line: 167, baseType: !394, size: 192)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !50, line: 113, size: 192, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !394, file: !50, line: 114, baseType: !397, size: 192)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !398, line: 80, baseType: !399)
!398 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !398, line: 76, size: 192, elements: !400)
!400 = !{!401, !404, !407}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !399, file: !398, line: 77, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !398, line: 47, baseType: !224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !399, file: !398, line: 78, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !398, line: 45, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !399, file: !398, line: 79, baseType: !5, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !391, file: !50, line: 169, baseType: !409, size: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !50, line: 116, size: 192, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !409, file: !50, line: 117, baseType: !130, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !409, file: !50, line: 118, baseType: !196, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !409, file: !50, line: 118, baseType: !196, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !391, file: !50, line: 170, baseType: !415, size: 320)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !50, line: 120, size: 320, elements: !416)
!416 = !{!417, !418, !419, !420, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !415, file: !50, line: 121, baseType: !130, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !415, file: !50, line: 122, baseType: !180, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !415, file: !50, line: 122, baseType: !180, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !415, file: !50, line: 123, baseType: !196, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !415, file: !50, line: 123, baseType: !196, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !391, file: !50, line: 171, baseType: !423, size: 320)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !50, line: 125, size: 320, elements: !424)
!424 = !{!425, !426, !427, !428, !429}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !423, file: !50, line: 126, baseType: !130, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !423, file: !50, line: 127, baseType: !180, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !423, file: !50, line: 127, baseType: !180, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !423, file: !50, line: 128, baseType: !196, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !423, file: !50, line: 128, baseType: !196, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !391, file: !50, line: 172, baseType: !431, size: 192)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !50, line: 130, size: 192, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !431, file: !50, line: 131, baseType: !196, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !431, file: !50, line: 132, baseType: !180, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !431, file: !50, line: 132, baseType: !180, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !391, file: !50, line: 173, baseType: !437, size: 192)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !50, line: 134, size: 192, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !437, file: !50, line: 135, baseType: !180, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !437, file: !50, line: 136, baseType: !180, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !437, file: !50, line: 136, baseType: !180, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !391, file: !50, line: 174, baseType: !443, size: 192)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !50, line: 138, size: 192, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !443, file: !50, line: 139, baseType: !196, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !443, file: !50, line: 140, baseType: !180, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !443, file: !50, line: 140, baseType: !180, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !391, file: !50, line: 175, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !50, line: 142, size: 64, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !449, file: !50, line: 143, baseType: !196, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !391, file: !50, line: 176, baseType: !453, size: 192)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !50, line: 145, size: 192, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !453, file: !50, line: 146, baseType: !198, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !453, file: !50, line: 147, baseType: !180, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !453, file: !50, line: 147, baseType: !180, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !391, file: !50, line: 177, baseType: !459, size: 192)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !50, line: 149, size: 192, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !459, file: !50, line: 150, baseType: !198, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !459, file: !50, line: 151, baseType: !180, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !459, file: !50, line: 151, baseType: !180, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !391, file: !50, line: 178, baseType: !465, size: 192)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !50, line: 153, size: 192, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !465, file: !50, line: 154, baseType: !198, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !465, file: !50, line: 155, baseType: !180, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !465, file: !50, line: 155, baseType: !180, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !388, file: !50, line: 181, baseType: !122, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !388, file: !50, line: 182, baseType: !126, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !388, file: !50, line: 184, baseType: !140, size: 32, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !388, file: !50, line: 185, baseType: !142, size: 8, offset: 480)
!474 = !DILocation(line: 203, column: 9, scope: !206)
!475 = !DILocalVariable(name: "siter", scope: !206, file: !1, line: 204, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !478)
!478 = !{!479, !482, !483, !492, !493}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !477, file: !4, line: 458, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !247)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !477, file: !4, line: 459, baseType: !140, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !477, file: !4, line: 460, baseType: !484, size: 192, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !277, line: 54, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !277, line: 50, size: 192, elements: !486)
!486 = !{!487, !488, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !485, file: !277, line: 51, baseType: !275, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !485, file: !277, line: 52, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !277, line: 52, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !485, file: !277, line: 53, baseType: !5, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !477, file: !4, line: 461, baseType: !273, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !477, file: !4, line: 462, baseType: !142, size: 8, offset: 384)
!494 = !DILocation(line: 204, column: 10, scope: !206)
!495 = !DILocalVariable(name: "f", scope: !206, file: !1, line: 205, type: !198)
!496 = !DILocation(line: 205, column: 10, scope: !206)
!497 = !DILocalVariable(name: "e", scope: !206, file: !1, line: 206, type: !196)
!498 = !DILocation(line: 206, column: 10, scope: !206)
!499 = !DILocalVariable(name: "e_next", scope: !206, file: !1, line: 206, type: !196)
!500 = !DILocation(line: 206, column: 14, scope: !206)
!501 = !DILocalVariable(name: "jedges", scope: !206, file: !1, line: 208, type: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SortPointerByFloat", file: !504, line: 35, size: 128, elements: !505)
!504 = !DIFile(filename: "blender/source/blender/blenlib/BLI_sort_utils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sort_value", scope: !503, file: !504, line: 36, baseType: !153, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !503, file: !504, line: 37, baseType: !120, size: 64, offset: 64)
!508 = !DILocation(line: 208, column: 29, scope: !206)
!509 = !DILocalVariable(name: "i", scope: !206, file: !1, line: 209, type: !5)
!510 = !DILocation(line: 209, column: 11, scope: !206)
!511 = !DILocalVariable(name: "totedge", scope: !206, file: !1, line: 209, type: !5)
!512 = !DILocation(line: 209, column: 14, scope: !206)
!513 = !DILocalVariable(name: "totedge_tag", scope: !206, file: !1, line: 210, type: !5)
!514 = !DILocation(line: 210, column: 15, scope: !206)
!515 = !DILocation(line: 213, column: 2, scope: !516)
!516 = distinct !DILexicalBlock(scope: !206, file: !1, line: 213, column: 2)
!517 = !DILocation(line: 213, column: 2, scope: !518)
!518 = distinct !DILexicalBlock(scope: !516, file: !1, line: 213, column: 2)
!519 = !DILocation(line: 214, column: 7, scope: !520)
!520 = distinct !DILexicalBlock(scope: !521, file: !1, line: 214, column: 7)
!521 = distinct !DILexicalBlock(scope: !518, file: !1, line: 213, column: 55)
!522 = !DILocation(line: 214, column: 10, scope: !520)
!523 = !DILocation(line: 214, column: 14, scope: !520)
!524 = !DILocation(line: 214, column: 7, scope: !521)
!525 = !DILocation(line: 215, column: 4, scope: !526)
!526 = distinct !DILexicalBlock(scope: !520, file: !1, line: 214, column: 20)
!527 = !DILocation(line: 216, column: 3, scope: !526)
!528 = !DILocation(line: 217, column: 2, scope: !521)
!529 = distinct !{!529, !515, !530}
!530 = !DILocation(line: 217, column: 2, scope: !516)
!531 = !DILocation(line: 220, column: 2, scope: !532)
!532 = distinct !DILexicalBlock(scope: !206, file: !1, line: 220, column: 2)
!533 = !DILocation(line: 220, column: 2, scope: !534)
!534 = distinct !DILexicalBlock(scope: !532, file: !1, line: 220, column: 2)
!535 = !DILocalVariable(name: "f_a", scope: !536, file: !1, line: 221, type: !198)
!536 = distinct !DILexicalBlock(scope: !534, file: !1, line: 220, column: 48)
!537 = !DILocation(line: 221, column: 11, scope: !536)
!538 = !DILocalVariable(name: "f_b", scope: !536, file: !1, line: 221, type: !198)
!539 = !DILocation(line: 221, column: 17, scope: !536)
!540 = !DILocation(line: 222, column: 25, scope: !541)
!541 = distinct !DILexicalBlock(scope: !536, file: !1, line: 222, column: 7)
!542 = !DILocation(line: 222, column: 7, scope: !541)
!543 = !DILocation(line: 222, column: 40, scope: !541)
!544 = !DILocation(line: 223, column: 8, scope: !541)
!545 = !DILocation(line: 223, column: 48, scope: !541)
!546 = !DILocation(line: 223, column: 51, scope: !541)
!547 = !DILocation(line: 222, column: 7, scope: !536)
!548 = !DILocation(line: 225, column: 4, scope: !549)
!549 = distinct !DILexicalBlock(scope: !541, file: !1, line: 224, column: 3)
!550 = !DILocation(line: 226, column: 15, scope: !549)
!551 = !DILocation(line: 227, column: 3, scope: !549)
!552 = !DILocation(line: 228, column: 2, scope: !536)
!553 = distinct !{!553, !531, !554}
!554 = !DILocation(line: 228, column: 2, scope: !532)
!555 = !DILocation(line: 230, column: 6, scope: !556)
!556 = distinct !DILexicalBlock(scope: !206, file: !1, line: 230, column: 6)
!557 = !DILocation(line: 230, column: 18, scope: !556)
!558 = !DILocation(line: 230, column: 6, scope: !206)
!559 = !DILocation(line: 231, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !556, file: !1, line: 230, column: 24)
!561 = !DILocation(line: 235, column: 11, scope: !206)
!562 = !DILocation(line: 235, column: 41, scope: !206)
!563 = !DILocation(line: 235, column: 39, scope: !206)
!564 = !DILocation(line: 235, column: 9, scope: !206)
!565 = !DILocation(line: 237, column: 4, scope: !206)
!566 = !DILocation(line: 238, column: 2, scope: !567)
!567 = distinct !DILexicalBlock(scope: !206, file: !1, line: 238, column: 2)
!568 = !DILocation(line: 238, column: 2, scope: !569)
!569 = distinct !DILexicalBlock(scope: !567, file: !1, line: 238, column: 2)
!570 = !DILocalVariable(name: "v1", scope: !571, file: !1, line: 239, type: !130)
!571 = distinct !DILexicalBlock(scope: !569, file: !1, line: 238, column: 48)
!572 = !DILocation(line: 239, column: 11, scope: !571)
!573 = !DILocalVariable(name: "v2", scope: !571, file: !1, line: 239, type: !130)
!574 = !DILocation(line: 239, column: 16, scope: !571)
!575 = !DILocalVariable(name: "v3", scope: !571, file: !1, line: 239, type: !130)
!576 = !DILocation(line: 239, column: 21, scope: !571)
!577 = !DILocalVariable(name: "v4", scope: !571, file: !1, line: 239, type: !130)
!578 = !DILocation(line: 239, column: 26, scope: !571)
!579 = !DILocalVariable(name: "f_a", scope: !571, file: !1, line: 240, type: !198)
!580 = !DILocation(line: 240, column: 11, scope: !571)
!581 = !DILocalVariable(name: "f_b", scope: !571, file: !1, line: 240, type: !198)
!582 = !DILocation(line: 240, column: 17, scope: !571)
!583 = !DILocalVariable(name: "measure", scope: !571, file: !1, line: 241, type: !153)
!584 = !DILocation(line: 241, column: 9, scope: !571)
!585 = !DILocation(line: 243, column: 8, scope: !586)
!586 = distinct !DILexicalBlock(scope: !571, file: !1, line: 243, column: 7)
!587 = !DILocation(line: 243, column: 7, scope: !571)
!588 = !DILocation(line: 244, column: 4, scope: !586)
!589 = !DILocation(line: 246, column: 9, scope: !571)
!590 = !DILocation(line: 246, column: 12, scope: !571)
!591 = !DILocation(line: 246, column: 15, scope: !571)
!592 = !DILocation(line: 246, column: 7, scope: !571)
!593 = !DILocation(line: 247, column: 9, scope: !571)
!594 = !DILocation(line: 247, column: 12, scope: !571)
!595 = !DILocation(line: 247, column: 15, scope: !571)
!596 = !DILocation(line: 247, column: 28, scope: !571)
!597 = !DILocation(line: 247, column: 7, scope: !571)
!598 = !DILocation(line: 249, column: 7, scope: !599)
!599 = distinct !DILexicalBlock(scope: !571, file: !1, line: 249, column: 7)
!600 = !DILocation(line: 249, column: 16, scope: !599)
!601 = !DILocation(line: 249, column: 20, scope: !599)
!602 = !DILocation(line: 249, column: 7, scope: !571)
!603 = !DILocation(line: 250, column: 4, scope: !599)
!604 = !DILocation(line: 252, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !571, file: !1, line: 252, column: 7)
!606 = !DILocation(line: 252, column: 14, scope: !605)
!607 = !DILocation(line: 252, column: 17, scope: !605)
!608 = !DILocation(line: 252, column: 22, scope: !605)
!609 = !DILocation(line: 252, column: 32, scope: !605)
!610 = !DILocation(line: 252, column: 37, scope: !605)
!611 = !DILocation(line: 252, column: 29, scope: !605)
!612 = !DILocation(line: 252, column: 7, scope: !571)
!613 = !DILocation(line: 253, column: 4, scope: !605)
!614 = !DILocation(line: 255, column: 8, scope: !615)
!615 = distinct !DILexicalBlock(scope: !571, file: !1, line: 255, column: 7)
!616 = !DILocation(line: 255, column: 14, scope: !615)
!617 = !DILocation(line: 255, column: 17, scope: !615)
!618 = !DILocation(line: 255, column: 23, scope: !615)
!619 = !DILocation(line: 255, column: 26, scope: !615)
!620 = !DILocation(line: 255, column: 35, scope: !615)
!621 = !DILocation(line: 255, column: 57, scope: !615)
!622 = !DILocation(line: 255, column: 61, scope: !615)
!623 = !DILocation(line: 255, column: 64, scope: !615)
!624 = !DILocation(line: 255, column: 71, scope: !615)
!625 = !DILocation(line: 255, column: 78, scope: !615)
!626 = !DILocation(line: 255, column: 39, scope: !615)
!627 = !DILocation(line: 255, column: 87, scope: !615)
!628 = !DILocation(line: 255, column: 7, scope: !571)
!629 = !DILocation(line: 256, column: 4, scope: !615)
!630 = !DILocation(line: 258, column: 8, scope: !571)
!631 = !DILocation(line: 258, column: 11, scope: !571)
!632 = !DILocation(line: 258, column: 14, scope: !571)
!633 = !DILocation(line: 258, column: 6, scope: !571)
!634 = !DILocation(line: 259, column: 8, scope: !571)
!635 = !DILocation(line: 259, column: 11, scope: !571)
!636 = !DILocation(line: 259, column: 14, scope: !571)
!637 = !DILocation(line: 259, column: 20, scope: !571)
!638 = !DILocation(line: 259, column: 6, scope: !571)
!639 = !DILocation(line: 260, column: 8, scope: !571)
!640 = !DILocation(line: 260, column: 11, scope: !571)
!641 = !DILocation(line: 260, column: 14, scope: !571)
!642 = !DILocation(line: 260, column: 20, scope: !571)
!643 = !DILocation(line: 260, column: 6, scope: !571)
!644 = !DILocation(line: 261, column: 8, scope: !571)
!645 = !DILocation(line: 261, column: 11, scope: !571)
!646 = !DILocation(line: 261, column: 14, scope: !571)
!647 = !DILocation(line: 261, column: 27, scope: !571)
!648 = !DILocation(line: 261, column: 33, scope: !571)
!649 = !DILocation(line: 261, column: 6, scope: !571)
!650 = !DILocation(line: 263, column: 30, scope: !571)
!651 = !DILocation(line: 263, column: 34, scope: !571)
!652 = !DILocation(line: 263, column: 38, scope: !571)
!653 = !DILocation(line: 263, column: 42, scope: !571)
!654 = !DILocation(line: 263, column: 46, scope: !571)
!655 = !DILocation(line: 263, column: 50, scope: !571)
!656 = !DILocation(line: 263, column: 54, scope: !571)
!657 = !DILocation(line: 263, column: 58, scope: !571)
!658 = !DILocation(line: 263, column: 62, scope: !571)
!659 = !DILocation(line: 263, column: 13, scope: !571)
!660 = !DILocation(line: 263, column: 11, scope: !571)
!661 = !DILocation(line: 264, column: 7, scope: !662)
!662 = distinct !DILexicalBlock(scope: !571, file: !1, line: 264, column: 7)
!663 = !DILocation(line: 264, column: 17, scope: !662)
!664 = !DILocation(line: 264, column: 15, scope: !662)
!665 = !DILocation(line: 264, column: 7, scope: !571)
!666 = !DILocation(line: 265, column: 21, scope: !667)
!667 = distinct !DILexicalBlock(scope: !662, file: !1, line: 264, column: 24)
!668 = !DILocation(line: 265, column: 4, scope: !667)
!669 = !DILocation(line: 265, column: 11, scope: !667)
!670 = !DILocation(line: 265, column: 14, scope: !667)
!671 = !DILocation(line: 265, column: 19, scope: !667)
!672 = !DILocation(line: 266, column: 27, scope: !667)
!673 = !DILocation(line: 266, column: 4, scope: !667)
!674 = !DILocation(line: 266, column: 11, scope: !667)
!675 = !DILocation(line: 266, column: 14, scope: !667)
!676 = !DILocation(line: 266, column: 25, scope: !667)
!677 = !DILocation(line: 267, column: 5, scope: !667)
!678 = !DILocation(line: 268, column: 3, scope: !667)
!679 = !DILocation(line: 269, column: 2, scope: !571)
!680 = distinct !{!680, !566, !681}
!681 = !DILocation(line: 269, column: 2, scope: !567)
!682 = !DILocation(line: 271, column: 12, scope: !206)
!683 = !DILocation(line: 271, column: 10, scope: !206)
!684 = !DILocation(line: 272, column: 8, scope: !206)
!685 = !DILocation(line: 272, column: 16, scope: !206)
!686 = !DILocation(line: 272, column: 2, scope: !206)
!687 = !DILocation(line: 274, column: 9, scope: !688)
!688 = distinct !DILexicalBlock(scope: !206, file: !1, line: 274, column: 2)
!689 = !DILocation(line: 274, column: 7, scope: !688)
!690 = !DILocation(line: 274, column: 14, scope: !691)
!691 = distinct !DILexicalBlock(scope: !688, file: !1, line: 274, column: 2)
!692 = !DILocation(line: 274, column: 18, scope: !691)
!693 = !DILocation(line: 274, column: 16, scope: !691)
!694 = !DILocation(line: 274, column: 2, scope: !688)
!695 = !DILocalVariable(name: "f_a", scope: !696, file: !1, line: 275, type: !198)
!696 = distinct !DILexicalBlock(scope: !691, file: !1, line: 274, column: 32)
!697 = !DILocation(line: 275, column: 11, scope: !696)
!698 = !DILocalVariable(name: "f_b", scope: !696, file: !1, line: 275, type: !198)
!699 = !DILocation(line: 275, column: 17, scope: !696)
!700 = !DILocation(line: 277, column: 7, scope: !696)
!701 = !DILocation(line: 277, column: 14, scope: !696)
!702 = !DILocation(line: 277, column: 17, scope: !696)
!703 = !DILocation(line: 277, column: 5, scope: !696)
!704 = !DILocation(line: 278, column: 9, scope: !696)
!705 = !DILocation(line: 278, column: 12, scope: !696)
!706 = !DILocation(line: 278, column: 15, scope: !696)
!707 = !DILocation(line: 278, column: 7, scope: !696)
!708 = !DILocation(line: 279, column: 9, scope: !696)
!709 = !DILocation(line: 279, column: 12, scope: !696)
!710 = !DILocation(line: 279, column: 15, scope: !696)
!711 = !DILocation(line: 279, column: 28, scope: !696)
!712 = !DILocation(line: 279, column: 7, scope: !696)
!713 = !DILocation(line: 282, column: 8, scope: !714)
!714 = distinct !DILexicalBlock(scope: !696, file: !1, line: 282, column: 7)
!715 = !DILocation(line: 282, column: 47, scope: !714)
!716 = !DILocation(line: 282, column: 57, scope: !714)
!717 = !DILocation(line: 283, column: 8, scope: !714)
!718 = !DILocation(line: 283, column: 47, scope: !714)
!719 = !DILocation(line: 282, column: 7, scope: !696)
!720 = !DILocation(line: 285, column: 4, scope: !721)
!721 = distinct !DILexicalBlock(scope: !714, file: !1, line: 284, column: 3)
!722 = !DILocation(line: 286, column: 4, scope: !721)
!723 = !DILocation(line: 287, column: 4, scope: !721)
!724 = !DILocation(line: 288, column: 3, scope: !721)
!725 = !DILocation(line: 289, column: 2, scope: !696)
!726 = !DILocation(line: 274, column: 28, scope: !691)
!727 = !DILocation(line: 274, column: 2, scope: !691)
!728 = distinct !{!728, !694, !729}
!729 = !DILocation(line: 289, column: 2, scope: !688)
!730 = !DILocation(line: 291, column: 2, scope: !206)
!731 = !DILocation(line: 291, column: 12, scope: !206)
!732 = !DILocation(line: 294, column: 2, scope: !733)
!733 = distinct !DILexicalBlock(scope: !206, file: !1, line: 294, column: 2)
!734 = !DILocation(line: 294, column: 2, scope: !735)
!735 = distinct !DILexicalBlock(scope: !733, file: !1, line: 294, column: 2)
!736 = !DILocalVariable(name: "f_new", scope: !737, file: !1, line: 295, type: !198)
!737 = distinct !DILexicalBlock(scope: !735, file: !1, line: 294, column: 64)
!738 = !DILocation(line: 295, column: 11, scope: !737)
!739 = !DILocalVariable(name: "f_a", scope: !737, file: !1, line: 296, type: !198)
!740 = !DILocation(line: 296, column: 11, scope: !737)
!741 = !DILocalVariable(name: "f_b", scope: !737, file: !1, line: 296, type: !198)
!742 = !DILocation(line: 296, column: 17, scope: !737)
!743 = !DILocation(line: 298, column: 8, scope: !744)
!744 = distinct !DILexicalBlock(scope: !737, file: !1, line: 298, column: 7)
!745 = !DILocation(line: 298, column: 7, scope: !737)
!746 = !DILocation(line: 299, column: 4, scope: !744)
!747 = !DILocation(line: 301, column: 21, scope: !737)
!748 = !DILocation(line: 301, column: 3, scope: !737)
!749 = !DILocation(line: 302, column: 8, scope: !750)
!750 = distinct !DILexicalBlock(scope: !737, file: !1, line: 302, column: 7)
!751 = !DILocation(line: 302, column: 13, scope: !750)
!752 = !DILocation(line: 302, column: 17, scope: !750)
!753 = !DILocation(line: 302, column: 22, scope: !750)
!754 = !DILocation(line: 302, column: 25, scope: !750)
!755 = !DILocation(line: 302, column: 30, scope: !750)
!756 = !DILocation(line: 302, column: 34, scope: !750)
!757 = !DILocation(line: 302, column: 7, scope: !737)
!758 = !DILocation(line: 303, column: 31, scope: !759)
!759 = distinct !DILexicalBlock(scope: !750, file: !1, line: 302, column: 41)
!760 = !DILocation(line: 303, column: 35, scope: !759)
!761 = !DILocation(line: 303, column: 40, scope: !759)
!762 = !DILocation(line: 303, column: 45, scope: !759)
!763 = !DILocation(line: 303, column: 12, scope: !759)
!764 = !DILocation(line: 303, column: 10, scope: !759)
!765 = !DILocation(line: 304, column: 8, scope: !766)
!766 = distinct !DILexicalBlock(scope: !759, file: !1, line: 304, column: 8)
!767 = !DILocation(line: 304, column: 8, scope: !759)
!768 = !DILocation(line: 305, column: 5, scope: !769)
!769 = distinct !DILexicalBlock(scope: !766, file: !1, line: 304, column: 15)
!770 = !DILocation(line: 306, column: 4, scope: !769)
!771 = !DILocation(line: 307, column: 3, scope: !759)
!772 = !DILocation(line: 308, column: 2, scope: !737)
!773 = distinct !{!773, !732, !774}
!774 = !DILocation(line: 308, column: 2, scope: !733)
!775 = !DILocation(line: 311, column: 2, scope: !776)
!776 = distinct !DILexicalBlock(scope: !206, file: !1, line: 311, column: 2)
!777 = !DILocation(line: 311, column: 2, scope: !778)
!778 = distinct !DILexicalBlock(scope: !776, file: !1, line: 311, column: 2)
!779 = !DILocation(line: 312, column: 7, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !1, line: 312, column: 7)
!781 = distinct !DILexicalBlock(scope: !778, file: !1, line: 311, column: 64)
!782 = !DILocation(line: 312, column: 7, scope: !781)
!783 = !DILocalVariable(name: "l_a", scope: !784, file: !1, line: 313, type: !180)
!784 = distinct !DILexicalBlock(scope: !780, file: !1, line: 312, column: 45)
!785 = !DILocation(line: 313, column: 12, scope: !784)
!786 = !DILocalVariable(name: "l_b", scope: !784, file: !1, line: 313, type: !180)
!787 = !DILocation(line: 313, column: 18, scope: !784)
!788 = !DILocalVariable(name: "f_a", scope: !784, file: !1, line: 314, type: !198)
!789 = !DILocation(line: 314, column: 12, scope: !784)
!790 = !DILocalVariable(name: "f_b", scope: !784, file: !1, line: 314, type: !198)
!791 = !DILocation(line: 314, column: 18, scope: !784)
!792 = !DILocation(line: 318, column: 10, scope: !784)
!793 = !DILocation(line: 318, column: 13, scope: !784)
!794 = !DILocation(line: 318, column: 8, scope: !784)
!795 = !DILocation(line: 319, column: 10, scope: !784)
!796 = !DILocation(line: 319, column: 13, scope: !784)
!797 = !DILocation(line: 319, column: 16, scope: !784)
!798 = !DILocation(line: 319, column: 8, scope: !784)
!799 = !DILocation(line: 321, column: 10, scope: !784)
!800 = !DILocation(line: 321, column: 15, scope: !784)
!801 = !DILocation(line: 321, column: 8, scope: !784)
!802 = !DILocation(line: 322, column: 10, scope: !784)
!803 = !DILocation(line: 322, column: 15, scope: !784)
!804 = !DILocation(line: 322, column: 8, scope: !784)
!805 = !DILocation(line: 325, column: 9, scope: !806)
!806 = distinct !DILexicalBlock(scope: !784, file: !1, line: 325, column: 8)
!807 = !DILocation(line: 325, column: 14, scope: !806)
!808 = !DILocation(line: 325, column: 18, scope: !806)
!809 = !DILocation(line: 325, column: 23, scope: !806)
!810 = !DILocation(line: 325, column: 26, scope: !806)
!811 = !DILocation(line: 325, column: 31, scope: !806)
!812 = !DILocation(line: 325, column: 35, scope: !806)
!813 = !DILocation(line: 325, column: 41, scope: !806)
!814 = !DILocation(line: 326, column: 9, scope: !806)
!815 = !DILocation(line: 326, column: 57, scope: !806)
!816 = !DILocation(line: 326, column: 67, scope: !806)
!817 = !DILocation(line: 327, column: 9, scope: !806)
!818 = !DILocation(line: 327, column: 57, scope: !806)
!819 = !DILocation(line: 327, column: 67, scope: !806)
!820 = !DILocation(line: 328, column: 9, scope: !806)
!821 = !DILocation(line: 328, column: 57, scope: !806)
!822 = !DILocation(line: 328, column: 67, scope: !806)
!823 = !DILocation(line: 329, column: 9, scope: !806)
!824 = !DILocation(line: 329, column: 57, scope: !806)
!825 = !DILocation(line: 329, column: 67, scope: !806)
!826 = !DILocation(line: 333, column: 9, scope: !806)
!827 = !DILocation(line: 325, column: 8, scope: !784)
!828 = !DILocalVariable(name: "f_new", scope: !829, file: !1, line: 335, type: !198)
!829 = distinct !DILexicalBlock(scope: !806, file: !1, line: 334, column: 4)
!830 = !DILocation(line: 335, column: 13, scope: !829)
!831 = !DILocation(line: 336, column: 32, scope: !829)
!832 = !DILocation(line: 336, column: 36, scope: !829)
!833 = !DILocation(line: 336, column: 41, scope: !829)
!834 = !DILocation(line: 336, column: 46, scope: !829)
!835 = !DILocation(line: 336, column: 13, scope: !829)
!836 = !DILocation(line: 336, column: 11, scope: !829)
!837 = !DILocation(line: 337, column: 9, scope: !838)
!838 = distinct !DILexicalBlock(scope: !829, file: !1, line: 337, column: 9)
!839 = !DILocation(line: 337, column: 9, scope: !829)
!840 = !DILocation(line: 338, column: 6, scope: !841)
!841 = distinct !DILexicalBlock(scope: !838, file: !1, line: 337, column: 16)
!842 = !DILocation(line: 339, column: 5, scope: !841)
!843 = !DILocation(line: 340, column: 4, scope: !829)
!844 = !DILocation(line: 341, column: 3, scope: !784)
!845 = !DILocation(line: 342, column: 2, scope: !781)
!846 = distinct !{!846, !775, !847}
!847 = !DILocation(line: 342, column: 2, scope: !776)
!848 = !DILocation(line: 344, column: 36, scope: !206)
!849 = !DILocation(line: 344, column: 40, scope: !206)
!850 = !DILocation(line: 344, column: 44, scope: !206)
!851 = !DILocation(line: 344, column: 48, scope: !206)
!852 = !DILocation(line: 344, column: 2, scope: !206)
!853 = !DILocation(line: 345, column: 1, scope: !206)
!854 = distinct !DISubprogram(name: "_bmo_elem_flag_enable", scope: !855, file: !855, line: 51, type: !856, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!855 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!856 = !DISubroutineType(types: !857)
!857 = !{null, !209, !858, !860}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFlagLayer", file: !43, line: 182, baseType: !147)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!861 = !DILocalVariable(name: "bm", arg: 1, scope: !854, file: !855, line: 51, type: !209)
!862 = !DILocation(line: 51, column: 46, scope: !854)
!863 = !DILocalVariable(name: "oflags", arg: 2, scope: !854, file: !855, line: 51, type: !858)
!864 = !DILocation(line: 51, column: 63, scope: !854)
!865 = !DILocalVariable(name: "oflag", arg: 3, scope: !854, file: !855, line: 51, type: !860)
!866 = !DILocation(line: 51, column: 83, scope: !854)
!867 = !DILocation(line: 53, column: 34, scope: !854)
!868 = !DILocation(line: 53, column: 2, scope: !854)
!869 = !DILocation(line: 53, column: 9, scope: !854)
!870 = !DILocation(line: 53, column: 13, scope: !854)
!871 = !DILocation(line: 53, column: 24, scope: !854)
!872 = !DILocation(line: 53, column: 29, scope: !854)
!873 = !DILocation(line: 53, column: 31, scope: !854)
!874 = !DILocation(line: 54, column: 1, scope: !854)
!875 = distinct !DISubprogram(name: "BM_iter_new", scope: !876, file: !876, line: 172, type: !877, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!876 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!877 = !DISubroutineType(types: !878)
!878 = !{!120, !879, !209, !251, !120}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!880 = !DILocalVariable(name: "iter", arg: 1, scope: !875, file: !876, line: 172, type: !879)
!881 = !DILocation(line: 172, column: 38, scope: !875)
!882 = !DILocalVariable(name: "bm", arg: 2, scope: !875, file: !876, line: 172, type: !209)
!883 = !DILocation(line: 172, column: 51, scope: !875)
!884 = !DILocalVariable(name: "itype", arg: 3, scope: !875, file: !876, line: 172, type: !251)
!885 = !DILocation(line: 172, column: 66, scope: !875)
!886 = !DILocalVariable(name: "data", arg: 4, scope: !875, file: !876, line: 172, type: !120)
!887 = !DILocation(line: 172, column: 79, scope: !875)
!888 = !DILocation(line: 174, column: 6, scope: !889)
!889 = distinct !DILexicalBlock(scope: !875, file: !876, line: 174, column: 6)
!890 = !DILocation(line: 174, column: 6, scope: !875)
!891 = !DILocation(line: 175, column: 23, scope: !892)
!892 = distinct !DILexicalBlock(scope: !889, file: !876, line: 174, column: 51)
!893 = !DILocation(line: 175, column: 10, scope: !892)
!894 = !DILocation(line: 175, column: 3, scope: !892)
!895 = !DILocation(line: 178, column: 3, scope: !896)
!896 = distinct !DILexicalBlock(scope: !889, file: !876, line: 177, column: 7)
!897 = !DILocation(line: 180, column: 1, scope: !875)
!898 = distinct !DISubprogram(name: "_bmo_elem_flag_test", scope: !855, file: !855, line: 41, type: !899, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!899 = !DISubroutineType(types: !900)
!900 = !{!150, !209, !858, !860}
!901 = !DILocalVariable(name: "bm", arg: 1, scope: !898, file: !855, line: 41, type: !209)
!902 = !DILocation(line: 41, column: 45, scope: !898)
!903 = !DILocalVariable(name: "oflags", arg: 2, scope: !898, file: !855, line: 41, type: !858)
!904 = !DILocation(line: 41, column: 62, scope: !898)
!905 = !DILocalVariable(name: "oflag", arg: 3, scope: !898, file: !855, line: 41, type: !860)
!906 = !DILocation(line: 41, column: 82, scope: !898)
!907 = !DILocation(line: 43, column: 9, scope: !898)
!908 = !DILocation(line: 43, column: 16, scope: !898)
!909 = !DILocation(line: 43, column: 20, scope: !898)
!910 = !DILocation(line: 43, column: 31, scope: !898)
!911 = !DILocation(line: 43, column: 36, scope: !898)
!912 = !DILocation(line: 43, column: 40, scope: !898)
!913 = !DILocation(line: 43, column: 38, scope: !898)
!914 = !DILocation(line: 43, column: 2, scope: !898)
!915 = distinct !DISubprogram(name: "BM_iter_step", scope: !876, file: !876, line: 40, type: !916, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!916 = !DISubroutineType(types: !917)
!917 = !{!120, !879}
!918 = !DILocalVariable(name: "iter", arg: 1, scope: !915, file: !876, line: 40, type: !879)
!919 = !DILocation(line: 40, column: 39, scope: !915)
!920 = !DILocation(line: 42, column: 9, scope: !915)
!921 = !DILocation(line: 42, column: 15, scope: !915)
!922 = !DILocation(line: 42, column: 20, scope: !915)
!923 = !DILocation(line: 42, column: 2, scope: !915)
!924 = distinct !DISubprogram(name: "_bm_elem_flag_test", scope: !925, file: !925, line: 42, type: !926, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!925 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!926 = !DISubroutineType(types: !927)
!927 = !{!142, !928, !251}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!930 = !DILocalVariable(name: "head", arg: 1, scope: !924, file: !925, line: 42, type: !928)
!931 = !DILocation(line: 42, column: 52, scope: !924)
!932 = !DILocalVariable(name: "hflag", arg: 2, scope: !924, file: !925, line: 42, type: !251)
!933 = !DILocation(line: 42, column: 69, scope: !924)
!934 = !DILocation(line: 44, column: 9, scope: !924)
!935 = !DILocation(line: 44, column: 15, scope: !924)
!936 = !DILocation(line: 44, column: 23, scope: !924)
!937 = !DILocation(line: 44, column: 21, scope: !924)
!938 = !DILocation(line: 44, column: 2, scope: !924)
!939 = distinct !DISubprogram(name: "bm_edge_faces_cmp", scope: !1, file: !1, line: 116, type: !940, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!940 = !DISubroutineType(types: !941)
!941 = !{!201, !209, !196, !357, !357, !357}
!942 = !DILocalVariable(name: "bm", arg: 1, scope: !939, file: !1, line: 116, type: !209)
!943 = !DILocation(line: 116, column: 38, scope: !939)
!944 = !DILocalVariable(name: "e", arg: 2, scope: !939, file: !1, line: 116, type: !196)
!945 = !DILocation(line: 116, column: 50, scope: !939)
!946 = !DILocalVariable(name: "do_uv", arg: 3, scope: !939, file: !1, line: 116, type: !357)
!947 = !DILocation(line: 116, column: 64, scope: !939)
!948 = !DILocalVariable(name: "do_tf", arg: 4, scope: !939, file: !1, line: 116, type: !357)
!949 = !DILocation(line: 116, column: 82, scope: !939)
!950 = !DILocalVariable(name: "do_vcol", arg: 5, scope: !939, file: !1, line: 116, type: !357)
!951 = !DILocation(line: 116, column: 100, scope: !939)
!952 = !DILocalVariable(name: "l", scope: !939, file: !1, line: 119, type: !953)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 4)
!956 = !DILocation(line: 119, column: 10, scope: !939)
!957 = !DILocation(line: 121, column: 9, scope: !939)
!958 = !DILocation(line: 121, column: 12, scope: !939)
!959 = !DILocation(line: 121, column: 2, scope: !939)
!960 = !DILocation(line: 121, column: 7, scope: !939)
!961 = !DILocation(line: 122, column: 9, scope: !939)
!962 = !DILocation(line: 122, column: 12, scope: !939)
!963 = !DILocation(line: 122, column: 15, scope: !939)
!964 = !DILocation(line: 122, column: 2, scope: !939)
!965 = !DILocation(line: 122, column: 7, scope: !939)
!966 = !DILocation(line: 125, column: 6, scope: !967)
!967 = distinct !DILexicalBlock(scope: !939, file: !1, line: 125, column: 6)
!968 = !DILocation(line: 125, column: 12, scope: !967)
!969 = !DILocation(line: 125, column: 17, scope: !967)
!970 = !DILocation(line: 125, column: 23, scope: !967)
!971 = !DILocation(line: 125, column: 14, scope: !967)
!972 = !DILocation(line: 125, column: 6, scope: !939)
!973 = !DILocation(line: 126, column: 10, scope: !974)
!974 = distinct !DILexicalBlock(scope: !967, file: !1, line: 125, column: 26)
!975 = !DILocation(line: 126, column: 16, scope: !974)
!976 = !DILocation(line: 126, column: 3, scope: !974)
!977 = !DILocation(line: 126, column: 8, scope: !974)
!978 = !DILocation(line: 127, column: 10, scope: !974)
!979 = !DILocation(line: 127, column: 16, scope: !974)
!980 = !DILocation(line: 127, column: 3, scope: !974)
!981 = !DILocation(line: 127, column: 8, scope: !974)
!982 = !DILocation(line: 128, column: 2, scope: !974)
!983 = !DILocation(line: 130, column: 10, scope: !984)
!984 = distinct !DILexicalBlock(scope: !967, file: !1, line: 129, column: 7)
!985 = !DILocation(line: 130, column: 16, scope: !984)
!986 = !DILocation(line: 130, column: 3, scope: !984)
!987 = !DILocation(line: 130, column: 8, scope: !984)
!988 = !DILocation(line: 132, column: 10, scope: !984)
!989 = !DILocation(line: 132, column: 3, scope: !984)
!990 = !DILocation(line: 132, column: 8, scope: !984)
!991 = !DILocation(line: 133, column: 10, scope: !984)
!992 = !DILocation(line: 133, column: 16, scope: !984)
!993 = !DILocation(line: 133, column: 3, scope: !984)
!994 = !DILocation(line: 133, column: 8, scope: !984)
!995 = !DILocation(line: 137, column: 6, scope: !996)
!996 = distinct !DILexicalBlock(scope: !939, file: !1, line: 137, column: 6)
!997 = !DILocation(line: 137, column: 6, scope: !939)
!998 = !DILocalVariable(name: "luv", scope: !999, file: !1, line: 138, type: !1000)
!999 = distinct !DILexicalBlock(scope: !996, file: !1, line: 137, column: 13)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 256, elements: !954)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLoopUV", file: !1004, line: 112, baseType: !1005)
!1004 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !1004, line: 109, size: 96, elements: !1006)
!1006 = !{!1007, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !1005, file: !1004, line: 110, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 2)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1005, file: !1004, line: 111, baseType: !140, size: 32, offset: 64)
!1012 = !DILocation(line: 138, column: 18, scope: !999)
!1013 = !DILocation(line: 138, column: 27, scope: !999)
!1014 = !DILocation(line: 139, column: 29, scope: !999)
!1015 = !DILocation(line: 139, column: 33, scope: !999)
!1016 = !DILocation(line: 139, column: 40, scope: !999)
!1017 = !DILocation(line: 139, column: 46, scope: !999)
!1018 = !DILocation(line: 139, column: 51, scope: !999)
!1019 = !DILocation(line: 139, column: 7, scope: !999)
!1020 = !DILocation(line: 140, column: 29, scope: !999)
!1021 = !DILocation(line: 140, column: 33, scope: !999)
!1022 = !DILocation(line: 140, column: 40, scope: !999)
!1023 = !DILocation(line: 140, column: 46, scope: !999)
!1024 = !DILocation(line: 140, column: 51, scope: !999)
!1025 = !DILocation(line: 140, column: 7, scope: !999)
!1026 = !DILocation(line: 141, column: 29, scope: !999)
!1027 = !DILocation(line: 141, column: 33, scope: !999)
!1028 = !DILocation(line: 141, column: 40, scope: !999)
!1029 = !DILocation(line: 141, column: 46, scope: !999)
!1030 = !DILocation(line: 141, column: 51, scope: !999)
!1031 = !DILocation(line: 141, column: 7, scope: !999)
!1032 = !DILocation(line: 142, column: 29, scope: !999)
!1033 = !DILocation(line: 142, column: 33, scope: !999)
!1034 = !DILocation(line: 142, column: 40, scope: !999)
!1035 = !DILocation(line: 142, column: 46, scope: !999)
!1036 = !DILocation(line: 142, column: 51, scope: !999)
!1037 = !DILocation(line: 142, column: 7, scope: !999)
!1038 = !DILocation(line: 146, column: 7, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !999, file: !1, line: 146, column: 7)
!1040 = !DILocation(line: 146, column: 14, scope: !1039)
!1041 = !DILocation(line: 146, column: 32, scope: !1039)
!1042 = !DILocation(line: 146, column: 40, scope: !1039)
!1043 = !DILocation(line: 146, column: 44, scope: !1039)
!1044 = !DILocation(line: 146, column: 52, scope: !1039)
!1045 = !DILocation(line: 146, column: 19, scope: !1039)
!1046 = !DILocation(line: 146, column: 69, scope: !1039)
!1047 = !DILocation(line: 147, column: 32, scope: !1039)
!1048 = !DILocation(line: 147, column: 40, scope: !1039)
!1049 = !DILocation(line: 147, column: 44, scope: !1039)
!1050 = !DILocation(line: 147, column: 52, scope: !1039)
!1051 = !DILocation(line: 147, column: 19, scope: !1039)
!1052 = !DILocation(line: 146, column: 7, scope: !999)
!1053 = !DILocation(line: 149, column: 4, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 148, column: 3)
!1055 = !DILocation(line: 151, column: 2, scope: !999)
!1056 = !DILocation(line: 153, column: 6, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !939, file: !1, line: 153, column: 6)
!1058 = !DILocation(line: 153, column: 6, scope: !939)
!1059 = !DILocalVariable(name: "tp", scope: !1060, file: !1, line: 154, type: !1061)
!1060 = distinct !DILexicalBlock(scope: !1057, file: !1, line: 153, column: 13)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 128, elements: !1009)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MTexPoly", file: !1004, line: 97, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !1004, line: 93, size: 128, elements: !1066)
!1066 = !{!1067, !1070, !1071, !1072, !1073, !1074}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !1065, file: !1004, line: 94, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1004, line: 39, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1065, file: !1004, line: 95, baseType: !142, size: 8, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !1065, file: !1004, line: 95, baseType: !142, size: 8, offset: 72)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1065, file: !1004, line: 96, baseType: !150, size: 16, offset: 80)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1065, file: !1004, line: 96, baseType: !150, size: 16, offset: 96)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1065, file: !1004, line: 96, baseType: !150, size: 16, offset: 112)
!1075 = !DILocation(line: 154, column: 19, scope: !1060)
!1076 = !DILocation(line: 154, column: 27, scope: !1060)
!1077 = !DILocation(line: 155, column: 29, scope: !1060)
!1078 = !DILocation(line: 155, column: 33, scope: !1060)
!1079 = !DILocation(line: 155, column: 40, scope: !1060)
!1080 = !DILocation(line: 155, column: 46, scope: !1060)
!1081 = !DILocation(line: 155, column: 49, scope: !1060)
!1082 = !DILocation(line: 155, column: 54, scope: !1060)
!1083 = !DILocation(line: 155, column: 7, scope: !1060)
!1084 = !DILocation(line: 156, column: 29, scope: !1060)
!1085 = !DILocation(line: 156, column: 33, scope: !1060)
!1086 = !DILocation(line: 156, column: 40, scope: !1060)
!1087 = !DILocation(line: 156, column: 46, scope: !1060)
!1088 = !DILocation(line: 156, column: 49, scope: !1060)
!1089 = !DILocation(line: 156, column: 54, scope: !1060)
!1090 = !DILocation(line: 156, column: 7, scope: !1060)
!1091 = !DILocation(line: 159, column: 7, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1060, file: !1, line: 159, column: 7)
!1093 = !DILocation(line: 159, column: 13, scope: !1092)
!1094 = !DILocation(line: 159, column: 17, scope: !1092)
!1095 = !DILocation(line: 159, column: 24, scope: !1092)
!1096 = !DILocation(line: 159, column: 33, scope: !1092)
!1097 = !DILocation(line: 159, column: 40, scope: !1092)
!1098 = !DILocation(line: 159, column: 30, scope: !1092)
!1099 = !DILocation(line: 159, column: 7, scope: !1060)
!1100 = !DILocation(line: 160, column: 4, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 159, column: 48)
!1102 = !DILocation(line: 162, column: 2, scope: !1060)
!1103 = !DILocation(line: 165, column: 6, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !939, file: !1, line: 165, column: 6)
!1105 = !DILocation(line: 165, column: 6, scope: !939)
!1106 = !DILocalVariable(name: "lcol", scope: !1107, file: !1, line: 166, type: !1108)
!1107 = distinct !DILexicalBlock(scope: !1104, file: !1, line: 165, column: 15)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 256, elements: !954)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLoopCol", file: !1004, line: 131, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !1004, line: 129, size: 32, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1112, file: !1004, line: 130, baseType: !142, size: 8)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1112, file: !1004, line: 130, baseType: !142, size: 8, offset: 8)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1112, file: !1004, line: 130, baseType: !142, size: 8, offset: 16)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1112, file: !1004, line: 130, baseType: !142, size: 8, offset: 24)
!1118 = !DILocation(line: 166, column: 19, scope: !1107)
!1119 = !DILocation(line: 166, column: 29, scope: !1107)
!1120 = !DILocation(line: 167, column: 29, scope: !1107)
!1121 = !DILocation(line: 167, column: 33, scope: !1107)
!1122 = !DILocation(line: 167, column: 40, scope: !1107)
!1123 = !DILocation(line: 167, column: 46, scope: !1107)
!1124 = !DILocation(line: 167, column: 51, scope: !1107)
!1125 = !DILocation(line: 167, column: 7, scope: !1107)
!1126 = !DILocation(line: 168, column: 26, scope: !1107)
!1127 = !DILocation(line: 168, column: 30, scope: !1107)
!1128 = !DILocation(line: 168, column: 37, scope: !1107)
!1129 = !DILocation(line: 168, column: 43, scope: !1107)
!1130 = !DILocation(line: 168, column: 48, scope: !1107)
!1131 = !DILocation(line: 168, column: 4, scope: !1107)
!1132 = !DILocation(line: 169, column: 26, scope: !1107)
!1133 = !DILocation(line: 169, column: 30, scope: !1107)
!1134 = !DILocation(line: 169, column: 37, scope: !1107)
!1135 = !DILocation(line: 169, column: 43, scope: !1107)
!1136 = !DILocation(line: 169, column: 48, scope: !1107)
!1137 = !DILocation(line: 169, column: 4, scope: !1107)
!1138 = !DILocation(line: 170, column: 26, scope: !1107)
!1139 = !DILocation(line: 170, column: 30, scope: !1107)
!1140 = !DILocation(line: 170, column: 37, scope: !1107)
!1141 = !DILocation(line: 170, column: 43, scope: !1107)
!1142 = !DILocation(line: 170, column: 48, scope: !1107)
!1143 = !DILocation(line: 170, column: 4, scope: !1107)
!1144 = !DILocation(line: 173, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1107, file: !1, line: 173, column: 7)
!1146 = !DILocation(line: 173, column: 7, scope: !1107)
!1147 = !DILocation(line: 174, column: 45, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !1, line: 174, column: 8)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !1, line: 173, column: 16)
!1150 = !DILocation(line: 174, column: 54, scope: !1148)
!1151 = !DILocation(line: 174, column: 75, scope: !1148)
!1152 = !DILocation(line: 174, column: 84, scope: !1148)
!1153 = !DILocation(line: 174, column: 9, scope: !1148)
!1154 = !DILocation(line: 174, column: 101, scope: !1148)
!1155 = !DILocation(line: 175, column: 45, scope: !1148)
!1156 = !DILocation(line: 175, column: 54, scope: !1148)
!1157 = !DILocation(line: 175, column: 75, scope: !1148)
!1158 = !DILocation(line: 175, column: 84, scope: !1148)
!1159 = !DILocation(line: 175, column: 9, scope: !1148)
!1160 = !DILocation(line: 174, column: 8, scope: !1149)
!1161 = !DILocation(line: 177, column: 5, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1148, file: !1, line: 176, column: 4)
!1163 = !DILocation(line: 179, column: 3, scope: !1149)
!1164 = !DILocation(line: 180, column: 2, scope: !1107)
!1165 = !DILocation(line: 182, column: 2, scope: !939)
!1166 = !DILocation(line: 183, column: 1, scope: !939)
!1167 = distinct !DISubprogram(name: "measure_facepair", scope: !1, file: !1, line: 48, type: !1168, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!153, !1170, !1170, !1170, !1170, !153}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!1171 = !DILocalVariable(name: "v1", arg: 1, scope: !1167, file: !1, line: 48, type: !1170)
!1172 = !DILocation(line: 48, column: 43, scope: !1167)
!1173 = !DILocalVariable(name: "v2", arg: 2, scope: !1167, file: !1, line: 48, type: !1170)
!1174 = !DILocation(line: 48, column: 62, scope: !1167)
!1175 = !DILocalVariable(name: "v3", arg: 3, scope: !1167, file: !1, line: 49, type: !1170)
!1176 = !DILocation(line: 49, column: 43, scope: !1167)
!1177 = !DILocalVariable(name: "v4", arg: 4, scope: !1167, file: !1, line: 49, type: !1170)
!1178 = !DILocation(line: 49, column: 62, scope: !1167)
