; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_curve.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_curve.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bContext = type opaque

!78 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!79 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!80 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!81 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!82 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!83 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!84 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!85 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!86 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!87 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!88 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!89 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 351, baseType: !5, size: 32, elements: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !{!93, !94, !95, !96, !97, !98}
!93 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!95 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!96 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!97 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Handle", file: !100, line: 361, baseType: !5, size: 32, elements: !101)
!100 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = !{!102, !103, !104, !105, !106, !107}
!102 = !DIEnumerator(name: "HD_FREE", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "HD_AUTO", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "HD_VECT", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "HD_ALIGN", value: 3, isUnsigned: true)
!106 = !DIEnumerator(name: "HD_AUTO_ANIM", value: 4, isUnsigned: true)
!107 = !DIEnumerator(name: "HD_ALIGN_DOUBLESIDE", value: 5, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PaintMode", file: !109, line: 74, baseType: !5, size: 32, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !113, !114, !115, !116, !117}
!111 = !DIEnumerator(name: "PAINT_SCULPT", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "PAINT_VERTEX", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "PAINT_WEIGHT", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "PAINT_TEXTURE_PROJECTIVE", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "PAINT_TEXTURE_2D", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "PAINT_SCULPT_UV", value: 5, isUnsigned: true)
!117 = !DIEnumerator(name: "PAINT_INVALID", value: 6, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !119, line: 39, baseType: !5, size: 32, elements: !120)
!119 = !DIFile(filename: "blender/source/blender/editors/include/ED_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !{!121, !122}
!121 = !DIEnumerator(name: "UNDO_PAINT_IMAGE", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "UNDO_PAINT_MESH", value: 1, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 141, baseType: !5, size: 32, elements: !125)
!124 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!126 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!129 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!130 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!131 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!132 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!133 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!134 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!135 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!136 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!137 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!138 = !{!139, !187}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "UndoCurve", file: !1, line: 94, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UndoCurve", file: !1, line: 86, size: 832, elements: !142)
!142 = !{!143, !146, !147, !181, !182, !183}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !1, line: 87, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "UndoImageTile", file: !1, line: 87, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !1, line: 87, baseType: !144, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !141, file: !1, line: 89, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PaintCurvePoint", file: !22, line: 164, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PaintCurvePoint", file: !22, line: 160, size: 608, elements: !151)
!151 = !{!152, !180}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bez", scope: !150, file: !22, line: 162, baseType: !153, size: 576)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !100, line: 133, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !100, line: 117, size: 576, elements: !155)
!155 = !{!156, !161, !162, !163, !164, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !154, file: !100, line: 118, baseType: !157, size: 288)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 288, elements: !159)
!158 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!159 = !{!160, !160}
!160 = !DISubrange(count: 3)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !154, file: !100, line: 119, baseType: !158, size: 32, offset: 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !154, file: !100, line: 119, baseType: !158, size: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !154, file: !100, line: 119, baseType: !158, size: 32, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !154, file: !100, line: 121, baseType: !165, size: 8, offset: 384)
!165 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !154, file: !100, line: 123, baseType: !165, size: 8, offset: 392)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !154, file: !100, line: 123, baseType: !165, size: 8, offset: 400)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !154, file: !100, line: 124, baseType: !165, size: 8, offset: 408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !154, file: !100, line: 124, baseType: !165, size: 8, offset: 416)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !154, file: !100, line: 124, baseType: !165, size: 8, offset: 424)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !154, file: !100, line: 126, baseType: !165, size: 8, offset: 432)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !154, file: !100, line: 128, baseType: !165, size: 8, offset: 440)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !154, file: !100, line: 129, baseType: !158, size: 32, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !154, file: !100, line: 130, baseType: !158, size: 32, offset: 480)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !154, file: !100, line: 130, baseType: !158, size: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !100, line: 132, baseType: !177, size: 32, offset: 544)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 32, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 4)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pressure", scope: !150, file: !22, line: 163, baseType: !158, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tot_points", scope: !141, file: !1, line: 90, baseType: !23, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "active_point", scope: !141, file: !1, line: 91, baseType: !23, size: 32, offset: 224)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !141, file: !1, line: 93, baseType: !184, size: 528, offset: 256)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 528, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 66)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!188 = !{i32 7, !"Dwarf Version", i32 4}
!189 = !{i32 2, !"Debug Info Version", i32 3}
!190 = !{i32 1, !"wchar_size", i32 4}
!191 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!192 = distinct !DISubprogram(name: "paint_curve_poll", scope: !1, file: !1, line: 60, type: !193, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !199)
!193 = !DISubroutineType(types: !194)
!194 = !{!23, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !197, line: 69, baseType: !198)
!197 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !57, line: 44, flags: DIFlagFwdDecl)
!199 = !{}
!200 = !DILocalVariable(name: "C", arg: 1, scope: !192, file: !1, line: 60, type: !195)
!201 = !DILocation(line: 60, column: 32, scope: !192)
!202 = !DILocalVariable(name: "ob", scope: !192, file: !1, line: 62, type: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !4, line: 295, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !4, line: 115, size: 11392, elements: !206)
!206 = !{!207, !273, !277, !346, !347, !348, !349, !350, !351, !352, !354, !355, !356, !357, !358, !361, !371, !385, !386, !427, !428, !431, !432, !448, !449, !450, !451, !452, !453, !454, !458, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !472, !473, !474, !475, !476, !477, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !537, !538, !539, !540, !541, !542, !543, !544, !545, !548, !551, !554, !555, !556, !557, !558, !561, !564, !567, !568, !574, !575, !576, !577, !578, !579, !581, !584, !587, !591, !2088, !2089}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !205, file: !4, line: 116, baseType: !208, size: 960)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !209, line: 130, baseType: !210)
!209 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !209, line: 117, size: 960, elements: !211)
!211 = !{!212, !213, !214, !216, !235, !236, !238, !239, !240, !241}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !209, line: 118, baseType: !187, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !209, line: 118, baseType: !187, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !210, file: !209, line: 119, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !210, file: !209, line: 120, baseType: !217, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !209, line: 136, size: 17600, elements: !219)
!219 = !{!220, !221, !223, !226, !230, !231, !232}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !218, file: !209, line: 137, baseType: !208, size: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !218, file: !209, line: 138, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !218, file: !209, line: 139, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !209, line: 43, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !209, line: 140, baseType: !227, size: 8192, offset: 1088)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 8192, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !218, file: !209, line: 141, baseType: !227, size: 8192, offset: 9280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !218, file: !209, line: 148, baseType: !217, size: 64, offset: 17472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !218, file: !209, line: 150, baseType: !233, size: 64, offset: 17536)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !209, line: 45, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !209, line: 121, baseType: !184, size: 528, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !209, line: 126, baseType: !237, size: 16, offset: 784)
!237 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !210, file: !209, line: 127, baseType: !23, size: 32, offset: 800)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !210, file: !209, line: 128, baseType: !23, size: 32, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !210, file: !209, line: 128, baseType: !23, size: 32, offset: 864)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !210, file: !209, line: 129, baseType: !242, size: 64, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !209, line: 75, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !209, line: 62, size: 1024, elements: !245)
!245 = !{!246, !248, !249, !250, !251, !252, !256, !257, !271, !272}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !209, line: 63, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !209, line: 63, baseType: !247, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !209, line: 64, baseType: !165, size: 8, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !244, file: !209, line: 64, baseType: !165, size: 8, offset: 136)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !244, file: !209, line: 65, baseType: !237, size: 16, offset: 144)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !209, line: 66, baseType: !253, size: 512, offset: 160)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 512, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !244, file: !209, line: 67, baseType: !23, size: 32, offset: 672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !209, line: 69, baseType: !258, size: 256, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !209, line: 60, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !209, line: 48, size: 256, elements: !260)
!260 = !{!261, !262, !269, !270}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !259, file: !209, line: 49, baseType: !187, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !259, file: !209, line: 58, baseType: !263, size: 128, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !264, line: 71, baseType: !265)
!264 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !264, line: 69, size: 128, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !265, file: !264, line: 70, baseType: !187, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !265, file: !264, line: 70, baseType: !187, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !259, file: !209, line: 59, baseType: !23, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !259, file: !209, line: 59, baseType: !23, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !209, line: 70, baseType: !23, size: 32, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !244, file: !209, line: 74, baseType: !23, size: 32, offset: 992)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !205, file: !4, line: 117, baseType: !274, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !276, line: 45, flags: DIFlagFwdDecl)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !205, file: !4, line: 119, baseType: !278, size: 64, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !109, line: 155, size: 1856, elements: !280)
!280 = !{!281, !284, !287, !290, !293, !294, !295, !299, !302, !304, !308, !311, !312, !313, !315, !318, !321, !322, !323, !324, !325, !327, !328, !329, !331, !332, !335, !336, !339, !342, !343, !344, !345}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !279, file: !109, line: 157, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !109, line: 157, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !279, file: !109, line: 158, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !109, line: 49, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !279, file: !109, line: 159, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !109, line: 159, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !279, file: !109, line: 160, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !109, line: 160, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !279, file: !109, line: 161, baseType: !23, size: 32, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !279, file: !109, line: 161, baseType: !23, size: 32, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !279, file: !109, line: 162, baseType: !296, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 96, elements: !298)
!298 = !{!160}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !279, file: !109, line: 163, baseType: !300, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !109, line: 163, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !279, file: !109, line: 164, baseType: !303, size: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !279, file: !109, line: 167, baseType: !305, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !109, line: 44, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !279, file: !109, line: 170, baseType: !309, size: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !109, line: 39, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !279, file: !109, line: 171, baseType: !23, size: 32, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !279, file: !109, line: 172, baseType: !23, size: 32, offset: 672)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !279, file: !109, line: 173, baseType: !314, size: 8, offset: 704)
!314 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !279, file: !109, line: 175, baseType: !316, size: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !109, line: 175, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !279, file: !109, line: 178, baseType: !319, size: 64, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !109, line: 55, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !279, file: !109, line: 179, baseType: !314, size: 8, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !279, file: !109, line: 182, baseType: !314, size: 8, offset: 904)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !279, file: !109, line: 183, baseType: !296, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !279, file: !109, line: 184, baseType: !296, size: 64, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !279, file: !109, line: 185, baseType: !326, size: 64, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !279, file: !109, line: 188, baseType: !314, size: 8, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !279, file: !109, line: 191, baseType: !5, size: 32, offset: 1184)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !279, file: !109, line: 191, baseType: !330, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !279, file: !109, line: 191, baseType: !5, size: 32, offset: 1280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !279, file: !109, line: 192, baseType: !333, size: 64, offset: 1344)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !109, line: 61, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !279, file: !109, line: 195, baseType: !296, size: 64, offset: 1408)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !279, file: !109, line: 197, baseType: !337, size: 64, offset: 1472)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !109, line: 197, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !279, file: !109, line: 198, baseType: !340, size: 64, offset: 1536)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !109, line: 59, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !279, file: !109, line: 201, baseType: !314, size: 8, offset: 1600)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !279, file: !109, line: 202, baseType: !297, size: 96, offset: 1632)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !279, file: !109, line: 204, baseType: !297, size: 96, offset: 1728)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !279, file: !109, line: 205, baseType: !23, size: 32, offset: 1824)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !4, line: 121, baseType: !237, size: 16, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !205, file: !4, line: 121, baseType: !237, size: 16, offset: 1104)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !205, file: !4, line: 122, baseType: !23, size: 32, offset: 1120)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !205, file: !4, line: 122, baseType: !23, size: 32, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !205, file: !4, line: 122, baseType: !23, size: 32, offset: 1184)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !205, file: !4, line: 123, baseType: !253, size: 512, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !205, file: !4, line: 124, baseType: !353, size: 64, offset: 1728)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !205, file: !4, line: 124, baseType: !353, size: 64, offset: 1792)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !205, file: !4, line: 127, baseType: !353, size: 64, offset: 1856)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !205, file: !4, line: 127, baseType: !353, size: 64, offset: 1920)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !205, file: !4, line: 127, baseType: !353, size: 64, offset: 1984)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !205, file: !4, line: 128, baseType: !359, size: 64, offset: 2048)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !276, line: 46, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !205, file: !4, line: 130, baseType: !362, size: 64, offset: 2112)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !4, line: 97, size: 832, elements: !364)
!364 = !{!365, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !363, file: !4, line: 98, baseType: !366, size: 768)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 768, elements: !367)
!367 = !{!368, !160}
!368 = !DISubrange(count: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !363, file: !4, line: 99, baseType: !23, size: 32, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !363, file: !4, line: 99, baseType: !23, size: 32, offset: 800)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !205, file: !4, line: 131, baseType: !372, size: 64, offset: 2176)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !374, line: 486, size: 1600, elements: !375)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !373, file: !374, line: 487, baseType: !208, size: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !373, file: !374, line: 489, baseType: !263, size: 128, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !373, file: !374, line: 490, baseType: !263, size: 128, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !373, file: !374, line: 491, baseType: !263, size: 128, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !373, file: !374, line: 492, baseType: !263, size: 128, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !373, file: !374, line: 494, baseType: !23, size: 32, offset: 1472)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !373, file: !374, line: 495, baseType: !23, size: 32, offset: 1504)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !373, file: !374, line: 497, baseType: !23, size: 32, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !373, file: !374, line: 498, baseType: !23, size: 32, offset: 1568)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !205, file: !4, line: 132, baseType: !372, size: 64, offset: 2240)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !205, file: !4, line: 133, baseType: !387, size: 64, offset: 2304)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !374, line: 334, size: 1728, elements: !389)
!389 = !{!390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !426}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !388, file: !374, line: 335, baseType: !263, size: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !388, file: !374, line: 336, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !100, line: 51, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !374, line: 338, baseType: !237, size: 16, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !388, file: !374, line: 338, baseType: !237, size: 16, offset: 208)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !388, file: !374, line: 339, baseType: !5, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !388, file: !374, line: 340, baseType: !23, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !388, file: !374, line: 342, baseType: !158, size: 32, offset: 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !388, file: !374, line: 343, baseType: !297, size: 96, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !388, file: !374, line: 344, baseType: !297, size: 96, offset: 416)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !388, file: !374, line: 347, baseType: !263, size: 128, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !388, file: !374, line: 349, baseType: !23, size: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !388, file: !374, line: 350, baseType: !23, size: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !388, file: !374, line: 351, baseType: !187, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !388, file: !374, line: 352, baseType: !187, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !388, file: !374, line: 354, baseType: !407, size: 384, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !374, line: 116, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !374, line: 94, size: 384, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !408, file: !374, line: 96, baseType: !23, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !408, file: !374, line: 96, baseType: !23, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !408, file: !374, line: 97, baseType: !23, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !408, file: !374, line: 97, baseType: !23, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !408, file: !374, line: 99, baseType: !237, size: 16, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !408, file: !374, line: 100, baseType: !237, size: 16, offset: 144)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !408, file: !374, line: 102, baseType: !237, size: 16, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !408, file: !374, line: 105, baseType: !237, size: 16, offset: 176)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !408, file: !374, line: 108, baseType: !237, size: 16, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !408, file: !374, line: 109, baseType: !237, size: 16, offset: 208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !408, file: !374, line: 111, baseType: !237, size: 16, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !408, file: !374, line: 112, baseType: !237, size: 16, offset: 240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !408, file: !374, line: 114, baseType: !23, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !408, file: !374, line: 114, baseType: !23, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !408, file: !374, line: 115, baseType: !23, size: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !408, file: !374, line: 115, baseType: !23, size: 32, offset: 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !388, file: !374, line: 355, baseType: !253, size: 512, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !205, file: !4, line: 134, baseType: !187, size: 64, offset: 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !205, file: !4, line: 136, baseType: !429, size: 64, offset: 2432)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 58, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !205, file: !4, line: 138, baseType: !407, size: 384, offset: 2496)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !205, file: !4, line: 139, baseType: !433, size: 64, offset: 2880)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !374, line: 80, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !374, line: 72, size: 192, elements: !436)
!436 = !{!437, !444, !445, !446, !447}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !435, file: !374, line: 73, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !374, line: 59, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !374, line: 56, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !440, file: !374, line: 57, baseType: !297, size: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !440, file: !374, line: 58, baseType: !23, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !435, file: !374, line: 74, baseType: !23, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !435, file: !374, line: 76, baseType: !23, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !435, file: !374, line: 77, baseType: !23, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !374, line: 79, baseType: !23, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !205, file: !4, line: 141, baseType: !263, size: 128, offset: 2944)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !205, file: !4, line: 142, baseType: !263, size: 128, offset: 3072)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !205, file: !4, line: 143, baseType: !263, size: 128, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !205, file: !4, line: 144, baseType: !263, size: 128, offset: 3328)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !205, file: !4, line: 146, baseType: !23, size: 32, offset: 3456)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !205, file: !4, line: 147, baseType: !23, size: 32, offset: 3488)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !205, file: !4, line: 150, baseType: !455, size: 64, offset: 3520)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !100, line: 46, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !205, file: !4, line: 151, baseType: !459, size: 64, offset: 3584)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !205, file: !4, line: 152, baseType: !23, size: 32, offset: 3648)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !205, file: !4, line: 153, baseType: !23, size: 32, offset: 3680)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !205, file: !4, line: 156, baseType: !297, size: 96, offset: 3712)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !205, file: !4, line: 156, baseType: !297, size: 96, offset: 3808)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !205, file: !4, line: 156, baseType: !297, size: 96, offset: 3904)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !205, file: !4, line: 157, baseType: !297, size: 96, offset: 4000)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !205, file: !4, line: 158, baseType: !297, size: 96, offset: 4096)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !205, file: !4, line: 159, baseType: !297, size: 96, offset: 4192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !205, file: !4, line: 160, baseType: !297, size: 96, offset: 4288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !205, file: !4, line: 160, baseType: !297, size: 96, offset: 4384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !205, file: !4, line: 161, baseType: !471, size: 128, offset: 4480)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !178)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !205, file: !4, line: 161, baseType: !471, size: 128, offset: 4608)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !205, file: !4, line: 162, baseType: !297, size: 96, offset: 4736)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !205, file: !4, line: 162, baseType: !297, size: 96, offset: 4832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !205, file: !4, line: 163, baseType: !158, size: 32, offset: 4928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !205, file: !4, line: 163, baseType: !158, size: 32, offset: 4960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !205, file: !4, line: 164, baseType: !478, size: 512, offset: 4992)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 512, elements: !479)
!479 = !{!179, !179}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !205, file: !4, line: 165, baseType: !478, size: 512, offset: 5504)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !205, file: !4, line: 166, baseType: !478, size: 512, offset: 6016)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !205, file: !4, line: 167, baseType: !478, size: 512, offset: 6528)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !205, file: !4, line: 176, baseType: !478, size: 512, offset: 7040)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !205, file: !4, line: 178, baseType: !5, size: 32, offset: 7552)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !4, line: 180, baseType: !237, size: 16, offset: 7584)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !205, file: !4, line: 181, baseType: !237, size: 16, offset: 7600)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !205, file: !4, line: 183, baseType: !237, size: 16, offset: 7616)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !205, file: !4, line: 183, baseType: !237, size: 16, offset: 7632)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !205, file: !4, line: 184, baseType: !237, size: 16, offset: 7648)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !205, file: !4, line: 184, baseType: !237, size: 16, offset: 7664)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !205, file: !4, line: 185, baseType: !237, size: 16, offset: 7680)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !205, file: !4, line: 186, baseType: !237, size: 16, offset: 7696)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !205, file: !4, line: 187, baseType: !237, size: 16, offset: 7712)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !205, file: !4, line: 188, baseType: !165, size: 8, offset: 7728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !205, file: !4, line: 189, baseType: !165, size: 8, offset: 7736)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !205, file: !4, line: 192, baseType: !23, size: 32, offset: 7744)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !205, file: !4, line: 192, baseType: !23, size: 32, offset: 7776)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !205, file: !4, line: 192, baseType: !23, size: 32, offset: 7808)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !205, file: !4, line: 192, baseType: !23, size: 32, offset: 7840)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !205, file: !4, line: 194, baseType: !23, size: 32, offset: 7872)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !205, file: !4, line: 202, baseType: !158, size: 32, offset: 7904)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !205, file: !4, line: 202, baseType: !158, size: 32, offset: 7936)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !205, file: !4, line: 202, baseType: !158, size: 32, offset: 7968)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !205, file: !4, line: 211, baseType: !158, size: 32, offset: 8000)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !205, file: !4, line: 212, baseType: !158, size: 32, offset: 8032)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !205, file: !4, line: 213, baseType: !158, size: 32, offset: 8064)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !205, file: !4, line: 214, baseType: !158, size: 32, offset: 8096)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !205, file: !4, line: 215, baseType: !158, size: 32, offset: 8128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !205, file: !4, line: 216, baseType: !158, size: 32, offset: 8160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !205, file: !4, line: 219, baseType: !158, size: 32, offset: 8192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !205, file: !4, line: 220, baseType: !158, size: 32, offset: 8224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !205, file: !4, line: 221, baseType: !158, size: 32, offset: 8256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !205, file: !4, line: 224, baseType: !514, size: 16, offset: 8288)
!514 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !205, file: !4, line: 224, baseType: !514, size: 16, offset: 8304)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !205, file: !4, line: 226, baseType: !237, size: 16, offset: 8320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !205, file: !4, line: 228, baseType: !165, size: 8, offset: 8336)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !205, file: !4, line: 229, baseType: !165, size: 8, offset: 8344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !205, file: !4, line: 231, baseType: !237, size: 16, offset: 8352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !205, file: !4, line: 232, baseType: !165, size: 8, offset: 8368)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !205, file: !4, line: 233, baseType: !165, size: 8, offset: 8376)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !205, file: !4, line: 234, baseType: !158, size: 32, offset: 8384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !205, file: !4, line: 235, baseType: !158, size: 32, offset: 8416)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !205, file: !4, line: 237, baseType: !263, size: 128, offset: 8448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !205, file: !4, line: 238, baseType: !263, size: 128, offset: 8576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !205, file: !4, line: 239, baseType: !263, size: 128, offset: 8704)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !205, file: !4, line: 240, baseType: !263, size: 128, offset: 8832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !205, file: !4, line: 242, baseType: !158, size: 32, offset: 8960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !205, file: !4, line: 244, baseType: !237, size: 16, offset: 8992)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !205, file: !4, line: 245, baseType: !514, size: 16, offset: 9008)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !205, file: !4, line: 246, baseType: !471, size: 128, offset: 9024)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !205, file: !4, line: 248, baseType: !23, size: 32, offset: 9152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !205, file: !4, line: 249, baseType: !23, size: 32, offset: 9184)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !205, file: !4, line: 251, baseType: !535, size: 64, offset: 9216)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !4, line: 251, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !205, file: !4, line: 253, baseType: !165, size: 8, offset: 9280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !205, file: !4, line: 254, baseType: !165, size: 8, offset: 9288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !205, file: !4, line: 255, baseType: !237, size: 16, offset: 9296)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !205, file: !4, line: 256, baseType: !297, size: 96, offset: 9312)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !205, file: !4, line: 258, baseType: !263, size: 128, offset: 9408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !205, file: !4, line: 259, baseType: !263, size: 128, offset: 9536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !205, file: !4, line: 260, baseType: !263, size: 128, offset: 9664)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !205, file: !4, line: 261, baseType: !263, size: 128, offset: 9792)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !205, file: !4, line: 263, baseType: !546, size: 64, offset: 9920)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !4, line: 52, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !205, file: !4, line: 264, baseType: !549, size: 64, offset: 9984)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !4, line: 53, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !205, file: !4, line: 265, baseType: !552, size: 64, offset: 10048)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !374, line: 46, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !205, file: !4, line: 267, baseType: !165, size: 8, offset: 10112)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !205, file: !4, line: 268, baseType: !165, size: 8, offset: 10120)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !205, file: !4, line: 269, baseType: !237, size: 16, offset: 10128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !205, file: !4, line: 270, baseType: !158, size: 32, offset: 10144)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !205, file: !4, line: 272, baseType: !559, size: 64, offset: 10176)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !4, line: 54, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !205, file: !4, line: 275, baseType: !562, size: 64, offset: 10240)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !4, line: 275, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !205, file: !4, line: 277, baseType: !565, size: 64, offset: 10304)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 56, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !205, file: !4, line: 277, baseType: !565, size: 64, offset: 10368)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !205, file: !4, line: 278, baseType: !569, size: 64, offset: 10432)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !570, line: 27, baseType: !571)
!570 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !572, line: 45, baseType: !573)
!572 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!573 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !205, file: !4, line: 279, baseType: !569, size: 64, offset: 10496)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !205, file: !4, line: 280, baseType: !5, size: 32, offset: 10560)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !205, file: !4, line: 281, baseType: !5, size: 32, offset: 10592)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !205, file: !4, line: 283, baseType: !263, size: 128, offset: 10624)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !205, file: !4, line: 284, baseType: !263, size: 128, offset: 10752)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !205, file: !4, line: 285, baseType: !580, size: 64, offset: 10880)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !205, file: !4, line: 287, baseType: !582, size: 64, offset: 10944)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !4, line: 59, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !205, file: !4, line: 288, baseType: !585, size: 64, offset: 11008)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !4, line: 288, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !205, file: !4, line: 290, baseType: !588, size: 64, offset: 11072)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 2)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !205, file: !4, line: 291, baseType: !592, size: 64, offset: 11136)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !594, line: 65, baseType: !595)
!594 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !594, line: 50, size: 320, elements: !596)
!596 = !{!597, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !595, file: !594, line: 51, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !600, line: 1216, size: 39680, elements: !601)
!600 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!601 = !{!602, !603, !604, !605, !608, !609, !610, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !636, !709, !1135, !1701, !1704, !1951, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1973, !1974, !1975, !1976, !1977, !1985, !2051, !2058, !2059, !2066, !2067, !2068, !2069, !2070, !2071, !2072}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !599, file: !600, line: 1217, baseType: !208, size: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !599, file: !600, line: 1218, baseType: !274, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !599, file: !600, line: 1220, baseType: !353, size: 64, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !599, file: !600, line: 1221, baseType: !606, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !600, line: 52, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !599, file: !600, line: 1223, baseType: !598, size: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !599, file: !600, line: 1225, baseType: !263, size: 128, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !599, file: !600, line: 1226, baseType: !611, size: 64, offset: 1344)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !600, line: 69, size: 320, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !600, line: 70, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !612, file: !600, line: 70, baseType: !611, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !612, file: !600, line: 71, baseType: !5, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !612, file: !600, line: 71, baseType: !5, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !612, file: !600, line: 72, baseType: !23, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !612, file: !600, line: 73, baseType: !237, size: 16, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !612, file: !600, line: 73, baseType: !237, size: 16, offset: 240)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !612, file: !600, line: 74, baseType: !353, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !599, file: !600, line: 1227, baseType: !353, size: 64, offset: 1408)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !599, file: !600, line: 1229, baseType: !297, size: 96, offset: 1472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !599, file: !600, line: 1230, baseType: !297, size: 96, offset: 1568)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !599, file: !600, line: 1231, baseType: !297, size: 96, offset: 1664)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !599, file: !600, line: 1231, baseType: !297, size: 96, offset: 1760)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !599, file: !600, line: 1233, baseType: !5, size: 32, offset: 1856)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !599, file: !600, line: 1234, baseType: !23, size: 32, offset: 1888)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !599, file: !600, line: 1235, baseType: !5, size: 32, offset: 1920)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !599, file: !600, line: 1237, baseType: !237, size: 16, offset: 1952)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !599, file: !600, line: 1239, baseType: !165, size: 8, offset: 1968)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !599, file: !600, line: 1240, baseType: !633, size: 8, offset: 1976)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 8, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 1)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !599, file: !600, line: 1242, baseType: !637, size: 64, offset: 1984)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !639, line: 328, size: 3456, elements: !640)
!639 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!640 = !{!641, !642, !643, !646, !647, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !675, !676, !677, !680, !685, !686, !689, !693, !697, !701, !705, !706, !707, !708}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !638, file: !639, line: 329, baseType: !208, size: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !638, file: !639, line: 330, baseType: !274, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !638, file: !639, line: 332, baseType: !644, size: 64, offset: 1024)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !639, line: 332, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !638, file: !639, line: 333, baseType: !253, size: 512, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !638, file: !639, line: 335, baseType: !648, size: 64, offset: 1600)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !639, line: 335, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !638, file: !639, line: 337, baseType: !429, size: 64, offset: 1664)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !638, file: !639, line: 338, baseType: !588, size: 64, offset: 1728)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !638, file: !639, line: 340, baseType: !263, size: 128, offset: 1792)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !638, file: !639, line: 340, baseType: !263, size: 128, offset: 1920)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !639, line: 342, baseType: !23, size: 32, offset: 2048)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !638, file: !639, line: 342, baseType: !23, size: 32, offset: 2080)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !638, file: !639, line: 343, baseType: !23, size: 32, offset: 2112)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !638, file: !639, line: 345, baseType: !23, size: 32, offset: 2144)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !638, file: !639, line: 346, baseType: !23, size: 32, offset: 2176)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !638, file: !639, line: 347, baseType: !237, size: 16, offset: 2208)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !638, file: !639, line: 348, baseType: !237, size: 16, offset: 2224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !638, file: !639, line: 349, baseType: !23, size: 32, offset: 2240)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !638, file: !639, line: 351, baseType: !23, size: 32, offset: 2272)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !638, file: !639, line: 353, baseType: !237, size: 16, offset: 2304)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !638, file: !639, line: 354, baseType: !237, size: 16, offset: 2320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !638, file: !639, line: 355, baseType: !23, size: 32, offset: 2336)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !638, file: !639, line: 357, baseType: !667, size: 128, offset: 2368)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !668, line: 95, baseType: !669)
!668 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !668, line: 92, size: 128, elements: !670)
!670 = !{!671, !672, !673, !674}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !669, file: !668, line: 93, baseType: !158, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !669, file: !668, line: 93, baseType: !158, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !669, file: !668, line: 94, baseType: !158, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !669, file: !668, line: 94, baseType: !158, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !638, file: !639, line: 363, baseType: !263, size: 128, offset: 2496)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !638, file: !639, line: 363, baseType: !263, size: 128, offset: 2624)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !638, file: !639, line: 368, baseType: !678, size: 64, offset: 2752)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !639, line: 48, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !638, file: !639, line: 372, baseType: !681, size: 32, offset: 2816)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !639, line: 274, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !639, line: 271, size: 32, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !682, file: !639, line: 273, baseType: !5, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !638, file: !639, line: 373, baseType: !23, size: 32, offset: 2848)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !638, file: !639, line: 382, baseType: !687, size: 64, offset: 2880)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !639, line: 46, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !638, file: !639, line: 385, baseType: !690, size: 64, offset: 2944)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !187, !158}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !638, file: !639, line: 386, baseType: !694, size: 64, offset: 3008)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !187, !459}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !638, file: !639, line: 387, baseType: !698, size: 64, offset: 3072)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!23, !187}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !638, file: !639, line: 388, baseType: !702, size: 64, offset: 3136)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !187}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !638, file: !639, line: 389, baseType: !187, size: 64, offset: 3200)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !638, file: !639, line: 389, baseType: !187, size: 64, offset: 3264)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !638, file: !639, line: 389, baseType: !187, size: 64, offset: 3328)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !638, file: !639, line: 389, baseType: !187, size: 64, offset: 3392)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !599, file: !600, line: 1244, baseType: !710, size: 64, offset: 2048)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !712, line: 200, size: 17024, elements: !713)
!712 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!713 = !{!714, !715, !716, !717, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !711, file: !712, line: 201, baseType: !580, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !711, file: !712, line: 202, baseType: !263, size: 128, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !711, file: !712, line: 203, baseType: !263, size: 128, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !711, file: !712, line: 206, baseType: !718, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !712, line: 190, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !712, line: 126, size: 2816, elements: !721)
!721 = !{!722, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !820, !821, !822, !823, !1100, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1127}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !712, line: 127, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !720, file: !712, line: 127, baseType: !723, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !720, file: !712, line: 128, baseType: !187, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !720, file: !712, line: 129, baseType: !187, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !712, line: 130, baseType: !253, size: 512, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !720, file: !712, line: 132, baseType: !23, size: 32, offset: 768)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !712, line: 132, baseType: !23, size: 32, offset: 800)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !720, file: !712, line: 133, baseType: !23, size: 32, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !720, file: !712, line: 134, baseType: !23, size: 32, offset: 864)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !720, file: !712, line: 134, baseType: !23, size: 32, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !720, file: !712, line: 134, baseType: !23, size: 32, offset: 928)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !720, file: !712, line: 135, baseType: !23, size: 32, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !720, file: !712, line: 135, baseType: !23, size: 32, offset: 992)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !720, file: !712, line: 136, baseType: !23, size: 32, offset: 1024)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !720, file: !712, line: 136, baseType: !23, size: 32, offset: 1056)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !720, file: !712, line: 137, baseType: !23, size: 32, offset: 1088)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !720, file: !712, line: 137, baseType: !23, size: 32, offset: 1120)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !720, file: !712, line: 138, baseType: !158, size: 32, offset: 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !720, file: !712, line: 139, baseType: !158, size: 32, offset: 1184)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !720, file: !712, line: 139, baseType: !158, size: 32, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !720, file: !712, line: 141, baseType: !237, size: 16, offset: 1248)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !720, file: !712, line: 142, baseType: !237, size: 16, offset: 1264)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !720, file: !712, line: 143, baseType: !23, size: 32, offset: 1280)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !720, file: !712, line: 144, baseType: !23, size: 32, offset: 1312)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !720, file: !712, line: 146, baseType: !748, size: 64, offset: 1344)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !712, line: 114, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !712, line: 99, size: 7232, elements: !751)
!751 = !{!752, !754, !755, !756, !757, !758, !759, !770, !774, !788, !797, !804, !814}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !712, line: 100, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !750, file: !712, line: 100, baseType: !753, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !750, file: !712, line: 101, baseType: !23, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !750, file: !712, line: 101, baseType: !23, size: 32, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !750, file: !712, line: 102, baseType: !23, size: 32, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !750, file: !712, line: 102, baseType: !23, size: 32, offset: 224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !750, file: !712, line: 103, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !712, line: 59, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !712, line: 56, size: 2112, elements: !763)
!763 = !{!764, !768, !769}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !712, line: 57, baseType: !765, size: 2048)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 2048, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !762, file: !712, line: 58, baseType: !23, size: 32, offset: 2048)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !762, file: !712, line: 58, baseType: !23, size: 32, offset: 2080)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !750, file: !712, line: 106, baseType: !771, size: 6144, offset: 320)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 6144, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 768)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !750, file: !712, line: 107, baseType: !775, size: 64, offset: 6464)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !712, line: 97, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !712, line: 83, size: 8320, elements: !778)
!778 = !{!779, !780, !781, !784, !785, !786, !787}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !777, file: !712, line: 84, baseType: !771, size: 6144)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !777, file: !712, line: 87, baseType: !765, size: 2048, offset: 6144)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !777, file: !712, line: 88, baseType: !782, size: 64, offset: 8192)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !594, line: 41, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !777, file: !712, line: 90, baseType: !237, size: 16, offset: 8256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !777, file: !712, line: 92, baseType: !237, size: 16, offset: 8272)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !777, file: !712, line: 93, baseType: !237, size: 16, offset: 8288)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !777, file: !712, line: 95, baseType: !237, size: 16, offset: 8304)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !750, file: !712, line: 108, baseType: !789, size: 64, offset: 6528)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !712, line: 66, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !712, line: 61, size: 128, elements: !792)
!792 = !{!793, !794, !795, !796}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !791, file: !712, line: 62, baseType: !23, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !791, file: !712, line: 63, baseType: !23, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !791, file: !712, line: 64, baseType: !23, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !791, file: !712, line: 65, baseType: !23, size: 32, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !750, file: !712, line: 109, baseType: !798, size: 64, offset: 6592)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !712, line: 71, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !712, line: 68, size: 64, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !800, file: !712, line: 69, baseType: !23, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !800, file: !712, line: 70, baseType: !23, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !750, file: !712, line: 110, baseType: !805, size: 64, offset: 6656)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !712, line: 81, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !712, line: 73, size: 352, elements: !808)
!808 = !{!809, !810, !811, !812, !813}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !807, file: !712, line: 74, baseType: !297, size: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !807, file: !712, line: 75, baseType: !297, size: 96, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !807, file: !712, line: 76, baseType: !297, size: 96, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !712, line: 77, baseType: !23, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !712, line: 78, baseType: !23, size: 32, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !750, file: !712, line: 113, baseType: !815, size: 512, offset: 6720)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !816, line: 182, baseType: !817)
!816 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !816, line: 180, size: 512, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !816, line: 181, baseType: !253, size: 512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !720, file: !712, line: 148, baseType: !359, size: 64, offset: 1408)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !720, file: !712, line: 151, baseType: !598, size: 64, offset: 1472)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !720, file: !712, line: 152, baseType: !353, size: 64, offset: 1536)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !720, file: !712, line: 153, baseType: !824, size: 64, offset: 1600)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !826, line: 64, size: 19136, elements: !827)
!826 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!827 = !{!828, !829, !830, !831, !832, !833, !835, !836, !837, !838, !841, !842, !1086, !1087, !1095, !1096, !1097, !1098, !1099}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !825, file: !826, line: 65, baseType: !208, size: 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !825, file: !826, line: 66, baseType: !274, size: 64, offset: 960)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !825, file: !826, line: 68, baseType: !227, size: 8192, offset: 1024)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !825, file: !826, line: 70, baseType: !23, size: 32, offset: 9216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !825, file: !826, line: 71, baseType: !23, size: 32, offset: 9248)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !825, file: !826, line: 72, baseType: !834, size: 64, offset: 9280)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, elements: !589)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !825, file: !826, line: 74, baseType: !158, size: 32, offset: 9344)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !825, file: !826, line: 74, baseType: !158, size: 32, offset: 9376)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !825, file: !826, line: 76, baseType: !782, size: 64, offset: 9408)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !825, file: !826, line: 77, baseType: !839, size: 64, offset: 9472)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !826, line: 77, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !825, file: !826, line: 78, baseType: !429, size: 64, offset: 9536)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !825, file: !826, line: 80, baseType: !843, size: 2624, offset: 9600)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !844, line: 340, size: 2624, elements: !845)
!844 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!845 = !{!846, !874, !892, !893, !894, !909, !967, !968, !1066, !1067, !1068, !1069, !1075}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !843, file: !844, line: 341, baseType: !847, size: 576)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !844, line: 251, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !844, line: 207, size: 576, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !848, file: !844, line: 208, baseType: !23, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !848, file: !844, line: 211, baseType: !237, size: 16, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !848, file: !844, line: 212, baseType: !237, size: 16, offset: 48)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !848, file: !844, line: 213, baseType: !158, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !848, file: !844, line: 214, baseType: !237, size: 16, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !848, file: !844, line: 215, baseType: !237, size: 16, offset: 112)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !848, file: !844, line: 216, baseType: !237, size: 16, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !848, file: !844, line: 217, baseType: !237, size: 16, offset: 144)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !848, file: !844, line: 218, baseType: !237, size: 16, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !848, file: !844, line: 219, baseType: !237, size: 16, offset: 176)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !848, file: !844, line: 220, baseType: !158, size: 32, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !848, file: !844, line: 222, baseType: !237, size: 16, offset: 224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !848, file: !844, line: 225, baseType: !237, size: 16, offset: 240)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !848, file: !844, line: 228, baseType: !23, size: 32, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !848, file: !844, line: 229, baseType: !23, size: 32, offset: 288)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !848, file: !844, line: 233, baseType: !23, size: 32, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !848, file: !844, line: 236, baseType: !237, size: 16, offset: 352)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !848, file: !844, line: 236, baseType: !237, size: 16, offset: 368)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !848, file: !844, line: 241, baseType: !158, size: 32, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !848, file: !844, line: 244, baseType: !23, size: 32, offset: 416)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !848, file: !844, line: 244, baseType: !23, size: 32, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !848, file: !844, line: 245, baseType: !158, size: 32, offset: 480)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !848, file: !844, line: 248, baseType: !158, size: 32, offset: 512)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !848, file: !844, line: 250, baseType: !23, size: 32, offset: 544)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !843, file: !844, line: 342, baseType: !875, size: 448, offset: 576)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !844, line: 79, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !844, line: 61, size: 448, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !876, file: !844, line: 62, baseType: !187, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !876, file: !844, line: 64, baseType: !237, size: 16, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !876, file: !844, line: 65, baseType: !237, size: 16, offset: 80)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !876, file: !844, line: 67, baseType: !158, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !876, file: !844, line: 68, baseType: !158, size: 32, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !876, file: !844, line: 69, baseType: !158, size: 32, offset: 160)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !876, file: !844, line: 70, baseType: !237, size: 16, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !876, file: !844, line: 71, baseType: !237, size: 16, offset: 208)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !876, file: !844, line: 72, baseType: !588, size: 64, offset: 224)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !876, file: !844, line: 75, baseType: !158, size: 32, offset: 288)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !876, file: !844, line: 75, baseType: !158, size: 32, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !876, file: !844, line: 75, baseType: !158, size: 32, offset: 352)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !876, file: !844, line: 78, baseType: !158, size: 32, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !876, file: !844, line: 78, baseType: !158, size: 32, offset: 416)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !843, file: !844, line: 343, baseType: !263, size: 128, offset: 1024)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !843, file: !844, line: 344, baseType: !263, size: 128, offset: 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !843, file: !844, line: 345, baseType: !895, size: 192, offset: 1280)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !844, line: 278, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !844, line: 270, size: 192, elements: !897)
!897 = !{!898, !899, !900, !901, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !896, file: !844, line: 271, baseType: !23, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !896, file: !844, line: 273, baseType: !158, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !896, file: !844, line: 275, baseType: !23, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !896, file: !844, line: 276, baseType: !23, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !896, file: !844, line: 277, baseType: !903, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !844, line: 55, size: 576, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !904, file: !844, line: 56, baseType: !23, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !904, file: !844, line: 57, baseType: !158, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !904, file: !844, line: 58, baseType: !478, size: 512, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !843, file: !844, line: 346, baseType: !910, size: 384, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !844, line: 268, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !844, line: 253, size: 384, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !961, !962, !963, !964, !965, !966}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !911, file: !844, line: 254, baseType: !23, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !911, file: !844, line: 255, baseType: !23, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !911, file: !844, line: 255, baseType: !23, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !911, file: !844, line: 258, baseType: !158, size: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !911, file: !844, line: 259, baseType: !918, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !844, line: 164, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !844, line: 108, size: 1664, elements: !921)
!921 = !{!922, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !844, line: 109, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !920, file: !844, line: 109, baseType: !923, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !844, line: 111, baseType: !253, size: 512, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !920, file: !844, line: 119, baseType: !588, size: 64, offset: 640)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !920, file: !844, line: 119, baseType: !588, size: 64, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !920, file: !844, line: 125, baseType: !588, size: 64, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !920, file: !844, line: 125, baseType: !588, size: 64, offset: 832)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !920, file: !844, line: 127, baseType: !588, size: 64, offset: 896)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !920, file: !844, line: 130, baseType: !23, size: 32, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !920, file: !844, line: 131, baseType: !23, size: 32, offset: 992)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !920, file: !844, line: 132, baseType: !934, size: 64, offset: 1024)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !844, line: 106, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !844, line: 81, size: 512, elements: !937)
