; ModuleID = 'blender/source/blender/editors/animation/keyingsets.c'
source_filename = "blender/source/blender/editors/animation/keyingsets.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.ListBase = type { i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!880 = !DIEnumerator(name: "ICON_BRUSH_SCULPT_DRAW", value: 800, isUnsigned: true)
!881 = !DIEnumerator(name: "ICON_BRUSH_SMEAR", value: 801, isUnsigned: true)
!882 = !DIEnumerator(name: "ICON_BRUSH_SMOOTH", value: 802, isUnsigned: true)
!883 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!884 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!885 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!886 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!887 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!888 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!889 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!890 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!891 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!892 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!893 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!894 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!895 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!896 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!897 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!898 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!899 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!900 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!901 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!902 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!903 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!904 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!905 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!906 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!907 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!908 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!909 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!910 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!911 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!912 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!913 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!914 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!915 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!916 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!917 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!918 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!919 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!920 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!921 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!922 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!923 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!924 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!925 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!926 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!927 = !{!928, !929, !931, !933}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !53, line: 295, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !53, line: 115, size: 11392, elements: !936)
!936 = !{!937, !1005, !1075, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1086, !1087, !1088, !1089, !1090, !1094, !1105, !1107, !1108, !1151, !1152, !1156, !1157, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1199, !1200, !1201, !1202, !1203, !1204, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1275, !1278, !1281, !1282, !1283, !1284, !1285, !1288, !1291, !1294, !1295, !1301, !1302, !1303, !1304, !1305, !1306, !1308, !1311, !1314, !1318, !2508, !2509}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !935, file: !53, line: 116, baseType: !938, size: 960)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !939, line: 130, baseType: !940)
!939 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !939, line: 117, size: 960, elements: !941)
!941 = !{!942, !943, !944, !946, !965, !969, !970, !971, !972, !973}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !940, file: !939, line: 118, baseType: !928, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !940, file: !939, line: 118, baseType: !928, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !940, file: !939, line: 119, baseType: !945, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !940, file: !939, line: 120, baseType: !947, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !939, line: 136, size: 17600, elements: !949)
!949 = !{!950, !951, !953, !956, !960, !961, !962}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !948, file: !939, line: 137, baseType: !938, size: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !948, file: !939, line: 138, baseType: !952, size: 64, offset: 960)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !948, file: !939, line: 139, baseType: !954, size: 64, offset: 1024)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !939, line: 43, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !939, line: 140, baseType: !957, size: 8192, offset: 1088)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 8192, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 1024)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !948, file: !939, line: 141, baseType: !957, size: 8192, offset: 9280)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !948, file: !939, line: 148, baseType: !947, size: 64, offset: 17472)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !948, file: !939, line: 150, baseType: !963, size: 64, offset: 17536)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !939, line: 45, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !940, file: !939, line: 121, baseType: !966, size: 528, offset: 256)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 528, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 66)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !940, file: !939, line: 126, baseType: !932, size: 16, offset: 784)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !940, file: !939, line: 127, baseType: !23, size: 32, offset: 800)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !940, file: !939, line: 128, baseType: !23, size: 32, offset: 832)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !940, file: !939, line: 128, baseType: !23, size: 32, offset: 864)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !940, file: !939, line: 129, baseType: !974, size: 64, offset: 896)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !939, line: 75, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !939, line: 62, size: 1024, elements: !977)
!977 = !{!978, !980, !981, !982, !983, !984, !988, !989, !1003, !1004}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !976, file: !939, line: 63, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !976, file: !939, line: 63, baseType: !979, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !976, file: !939, line: 64, baseType: !930, size: 8, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !976, file: !939, line: 64, baseType: !930, size: 8, offset: 136)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !976, file: !939, line: 65, baseType: !932, size: 16, offset: 144)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !976, file: !939, line: 66, baseType: !985, size: 512, offset: 160)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 512, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !976, file: !939, line: 67, baseType: !23, size: 32, offset: 672)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !976, file: !939, line: 69, baseType: !990, size: 256, offset: 704)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !939, line: 60, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !939, line: 48, size: 256, elements: !992)
!992 = !{!993, !994, !1001, !1002}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !991, file: !939, line: 49, baseType: !928, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !991, file: !939, line: 58, baseType: !995, size: 128, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !996, line: 71, baseType: !997)
!996 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !996, line: 69, size: 128, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !997, file: !996, line: 70, baseType: !928, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !997, file: !996, line: 70, baseType: !928, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !991, file: !939, line: 59, baseType: !23, size: 32, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !991, file: !939, line: 59, baseType: !23, size: 32, offset: 224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !976, file: !939, line: 70, baseType: !23, size: 32, offset: 960)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !976, file: !939, line: 74, baseType: !23, size: 32, offset: 992)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !935, file: !53, line: 117, baseType: !1006, size: 64, offset: 960)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !17, line: 838, size: 768, elements: !1008)
!1008 = !{!1009, !1024, !1025, !1035, !1036, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1007, file: !17, line: 840, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !1012, line: 499, baseType: !1013)
!1012 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1012, line: 486, size: 1600, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1013, file: !1012, line: 487, baseType: !938, size: 960)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1013, file: !1012, line: 489, baseType: !995, size: 128, offset: 960)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1013, file: !1012, line: 490, baseType: !995, size: 128, offset: 1088)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1013, file: !1012, line: 491, baseType: !995, size: 128, offset: 1216)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1013, file: !1012, line: 492, baseType: !995, size: 128, offset: 1344)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1013, file: !1012, line: 494, baseType: !23, size: 32, offset: 1472)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1013, file: !1012, line: 495, baseType: !23, size: 32, offset: 1504)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1013, file: !1012, line: 497, baseType: !23, size: 32, offset: 1536)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1013, file: !1012, line: 498, baseType: !23, size: 32, offset: 1568)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1007, file: !17, line: 844, baseType: !1010, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1007, file: !17, line: 848, baseType: !1026, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !17, line: 549, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !17, line: 544, size: 320, elements: !1029)
!1029 = !{!1030, !1032, !1033, !1034}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !17, line: 545, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1028, file: !17, line: 545, baseType: !1031, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1028, file: !17, line: 547, baseType: !1010, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1028, file: !17, line: 548, baseType: !995, size: 128, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1007, file: !17, line: 851, baseType: !995, size: 128, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1007, file: !17, line: 853, baseType: !1037, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !17, line: 594, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !17, line: 561, size: 1664, elements: !1040)
!1040 = !{!1041, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !17, line: 562, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1039, file: !17, line: 562, baseType: !1042, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1039, file: !17, line: 564, baseType: !995, size: 128, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1039, file: !17, line: 565, baseType: !1010, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1039, file: !17, line: 566, baseType: !1026, size: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1039, file: !17, line: 568, baseType: !995, size: 128, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1039, file: !17, line: 569, baseType: !995, size: 128, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !17, line: 571, baseType: !985, size: 512, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1039, file: !17, line: 573, baseType: !1051, size: 32, offset: 1152)
!1051 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1039, file: !17, line: 574, baseType: !1051, size: 32, offset: 1184)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1039, file: !17, line: 576, baseType: !1051, size: 32, offset: 1216)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1039, file: !17, line: 576, baseType: !1051, size: 32, offset: 1248)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1039, file: !17, line: 577, baseType: !1051, size: 32, offset: 1280)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1039, file: !17, line: 577, baseType: !1051, size: 32, offset: 1312)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1039, file: !17, line: 579, baseType: !1051, size: 32, offset: 1344)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1039, file: !17, line: 580, baseType: !1051, size: 32, offset: 1376)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1039, file: !17, line: 582, baseType: !1051, size: 32, offset: 1408)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1039, file: !17, line: 582, baseType: !1051, size: 32, offset: 1440)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1039, file: !17, line: 583, baseType: !932, size: 16, offset: 1472)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1039, file: !17, line: 585, baseType: !932, size: 16, offset: 1488)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1039, file: !17, line: 586, baseType: !932, size: 16, offset: 1504)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1039, file: !17, line: 588, baseType: !932, size: 16, offset: 1520)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1039, file: !17, line: 590, baseType: !928, size: 64, offset: 1536)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1039, file: !17, line: 592, baseType: !23, size: 32, offset: 1600)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1039, file: !17, line: 593, baseType: !23, size: 32, offset: 1632)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1007, file: !17, line: 858, baseType: !995, size: 128, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1007, file: !17, line: 859, baseType: !995, size: 128, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1007, file: !17, line: 862, baseType: !23, size: 32, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1007, file: !17, line: 863, baseType: !23, size: 32, offset: 672)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1007, file: !17, line: 866, baseType: !932, size: 16, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1007, file: !17, line: 867, baseType: !932, size: 16, offset: 720)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1007, file: !17, line: 868, baseType: !1051, size: 32, offset: 736)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !935, file: !53, line: 119, baseType: !1076, size: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !53, line: 57, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !53, line: 121, baseType: !932, size: 16, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !935, file: !53, line: 121, baseType: !932, size: 16, offset: 1104)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !935, file: !53, line: 122, baseType: !23, size: 32, offset: 1120)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !935, file: !53, line: 122, baseType: !23, size: 32, offset: 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !935, file: !53, line: 122, baseType: !23, size: 32, offset: 1184)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !935, file: !53, line: 123, baseType: !985, size: 512, offset: 1216)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !935, file: !53, line: 124, baseType: !1085, size: 64, offset: 1728)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !935, file: !53, line: 124, baseType: !1085, size: 64, offset: 1792)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !935, file: !53, line: 127, baseType: !1085, size: 64, offset: 1856)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !935, file: !53, line: 127, baseType: !1085, size: 64, offset: 1920)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !935, file: !53, line: 127, baseType: !1085, size: 64, offset: 1984)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !935, file: !53, line: 128, baseType: !1091, size: 64, offset: 2048)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1093, line: 46, flags: DIFlagFwdDecl)
!1093 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !935, file: !53, line: 130, baseType: !1095, size: 64, offset: 2112)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !53, line: 97, size: 832, elements: !1097)
!1097 = !{!1098, !1103, !1104}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1096, file: !53, line: 98, baseType: !1099, size: 768)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 768, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DISubrange(count: 8)
!1102 = !DISubrange(count: 3)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1096, file: !53, line: 99, baseType: !23, size: 32, offset: 768)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1096, file: !53, line: 99, baseType: !23, size: 32, offset: 800)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !935, file: !53, line: 131, baseType: !1106, size: 64, offset: 2176)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !935, file: !53, line: 132, baseType: !1106, size: 64, offset: 2240)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !935, file: !53, line: 133, baseType: !1109, size: 64, offset: 2304)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1012, line: 334, size: 1728, elements: !1111)
!1111 = !{!1112, !1113, !1116, !1117, !1118, !1119, !1120, !1121, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1150}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1110, file: !1012, line: 335, baseType: !995, size: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1110, file: !1012, line: 336, baseType: !1114, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1012, line: 47, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1110, file: !1012, line: 338, baseType: !932, size: 16, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1110, file: !1012, line: 338, baseType: !932, size: 16, offset: 208)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1110, file: !1012, line: 339, baseType: !7, size: 32, offset: 224)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1110, file: !1012, line: 340, baseType: !23, size: 32, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1110, file: !1012, line: 342, baseType: !1051, size: 32, offset: 288)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1110, file: !1012, line: 343, baseType: !1122, size: 96, offset: 320)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 96, elements: !1123)
!1123 = !{!1102}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1110, file: !1012, line: 344, baseType: !1122, size: 96, offset: 416)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1110, file: !1012, line: 347, baseType: !995, size: 128, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1110, file: !1012, line: 349, baseType: !23, size: 32, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1110, file: !1012, line: 350, baseType: !23, size: 32, offset: 672)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1110, file: !1012, line: 351, baseType: !928, size: 64, offset: 704)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1110, file: !1012, line: 352, baseType: !928, size: 64, offset: 768)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1110, file: !1012, line: 354, baseType: !1131, size: 384, offset: 832)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1012, line: 116, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1012, line: 94, size: 384, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1132, file: !1012, line: 96, baseType: !23, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1132, file: !1012, line: 96, baseType: !23, size: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1132, file: !1012, line: 97, baseType: !23, size: 32, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1132, file: !1012, line: 97, baseType: !23, size: 32, offset: 96)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1132, file: !1012, line: 99, baseType: !932, size: 16, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1132, file: !1012, line: 100, baseType: !932, size: 16, offset: 144)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1132, file: !1012, line: 102, baseType: !932, size: 16, offset: 160)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1132, file: !1012, line: 105, baseType: !932, size: 16, offset: 176)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1132, file: !1012, line: 108, baseType: !932, size: 16, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1132, file: !1012, line: 109, baseType: !932, size: 16, offset: 208)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1132, file: !1012, line: 111, baseType: !932, size: 16, offset: 224)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1132, file: !1012, line: 112, baseType: !932, size: 16, offset: 240)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1132, file: !1012, line: 114, baseType: !23, size: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1132, file: !1012, line: 114, baseType: !23, size: 32, offset: 288)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1132, file: !1012, line: 115, baseType: !23, size: 32, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1132, file: !1012, line: 115, baseType: !23, size: 32, offset: 352)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1110, file: !1012, line: 355, baseType: !985, size: 512, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !935, file: !53, line: 134, baseType: !928, size: 64, offset: 2368)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !935, file: !53, line: 136, baseType: !1153, size: 64, offset: 2432)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1155, line: 61, flags: DIFlagFwdDecl)
!1155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !935, file: !53, line: 138, baseType: !1131, size: 384, offset: 2496)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !935, file: !53, line: 139, baseType: !1158, size: 64, offset: 2880)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1012, line: 80, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1012, line: 72, size: 192, elements: !1161)
!1161 = !{!1162, !1169, !1170, !1171, !1172}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1160, file: !1012, line: 73, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1012, line: 59, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1012, line: 56, size: 128, elements: !1166)
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1165, file: !1012, line: 57, baseType: !1122, size: 96)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1165, file: !1012, line: 58, baseType: !23, size: 32, offset: 96)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1160, file: !1012, line: 74, baseType: !23, size: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1160, file: !1012, line: 76, baseType: !23, size: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1160, file: !1012, line: 77, baseType: !23, size: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1160, file: !1012, line: 79, baseType: !23, size: 32, offset: 160)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !935, file: !53, line: 141, baseType: !995, size: 128, offset: 2944)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !935, file: !53, line: 142, baseType: !995, size: 128, offset: 3072)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !935, file: !53, line: 143, baseType: !995, size: 128, offset: 3200)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !935, file: !53, line: 144, baseType: !995, size: 128, offset: 3328)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !935, file: !53, line: 146, baseType: !23, size: 32, offset: 3456)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !935, file: !53, line: 147, baseType: !23, size: 32, offset: 3488)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !935, file: !53, line: 150, baseType: !1180, size: 64, offset: 3520)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1183, line: 46, flags: DIFlagFwdDecl)
!1183 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !935, file: !53, line: 151, baseType: !929, size: 64, offset: 3584)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !935, file: !53, line: 152, baseType: !23, size: 32, offset: 3648)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !935, file: !53, line: 153, baseType: !23, size: 32, offset: 3680)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !935, file: !53, line: 156, baseType: !1122, size: 96, offset: 3712)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !935, file: !53, line: 156, baseType: !1122, size: 96, offset: 3808)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !935, file: !53, line: 156, baseType: !1122, size: 96, offset: 3904)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !935, file: !53, line: 157, baseType: !1122, size: 96, offset: 4000)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !935, file: !53, line: 158, baseType: !1122, size: 96, offset: 4096)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !935, file: !53, line: 159, baseType: !1122, size: 96, offset: 4192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !935, file: !53, line: 160, baseType: !1122, size: 96, offset: 4288)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !935, file: !53, line: 160, baseType: !1122, size: 96, offset: 4384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !935, file: !53, line: 161, baseType: !1196, size: 128, offset: 4480)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 128, elements: !1197)
!1197 = !{!1198}
!1198 = !DISubrange(count: 4)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !935, file: !53, line: 161, baseType: !1196, size: 128, offset: 4608)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !935, file: !53, line: 162, baseType: !1122, size: 96, offset: 4736)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !935, file: !53, line: 162, baseType: !1122, size: 96, offset: 4832)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !935, file: !53, line: 163, baseType: !1051, size: 32, offset: 4928)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !935, file: !53, line: 163, baseType: !1051, size: 32, offset: 4960)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !935, file: !53, line: 164, baseType: !1205, size: 512, offset: 4992)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 512, elements: !1206)
!1206 = !{!1198, !1198}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !935, file: !53, line: 165, baseType: !1205, size: 512, offset: 5504)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !935, file: !53, line: 166, baseType: !1205, size: 512, offset: 6016)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !935, file: !53, line: 167, baseType: !1205, size: 512, offset: 6528)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !935, file: !53, line: 176, baseType: !1205, size: 512, offset: 7040)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !935, file: !53, line: 178, baseType: !7, size: 32, offset: 7552)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !935, file: !53, line: 180, baseType: !932, size: 16, offset: 7584)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !935, file: !53, line: 181, baseType: !932, size: 16, offset: 7600)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !935, file: !53, line: 183, baseType: !932, size: 16, offset: 7616)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !935, file: !53, line: 183, baseType: !932, size: 16, offset: 7632)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !935, file: !53, line: 184, baseType: !932, size: 16, offset: 7648)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !935, file: !53, line: 184, baseType: !932, size: 16, offset: 7664)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !935, file: !53, line: 185, baseType: !932, size: 16, offset: 7680)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !935, file: !53, line: 186, baseType: !932, size: 16, offset: 7696)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !935, file: !53, line: 187, baseType: !932, size: 16, offset: 7712)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !935, file: !53, line: 188, baseType: !930, size: 8, offset: 7728)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !935, file: !53, line: 189, baseType: !930, size: 8, offset: 7736)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !935, file: !53, line: 192, baseType: !23, size: 32, offset: 7744)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !935, file: !53, line: 192, baseType: !23, size: 32, offset: 7776)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !935, file: !53, line: 192, baseType: !23, size: 32, offset: 7808)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !935, file: !53, line: 192, baseType: !23, size: 32, offset: 7840)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !935, file: !53, line: 194, baseType: !23, size: 32, offset: 7872)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !935, file: !53, line: 202, baseType: !1051, size: 32, offset: 7904)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !935, file: !53, line: 202, baseType: !1051, size: 32, offset: 7936)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !935, file: !53, line: 202, baseType: !1051, size: 32, offset: 7968)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !935, file: !53, line: 211, baseType: !1051, size: 32, offset: 8000)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !935, file: !53, line: 212, baseType: !1051, size: 32, offset: 8032)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !935, file: !53, line: 213, baseType: !1051, size: 32, offset: 8064)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !935, file: !53, line: 214, baseType: !1051, size: 32, offset: 8096)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !935, file: !53, line: 215, baseType: !1051, size: 32, offset: 8128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !935, file: !53, line: 216, baseType: !1051, size: 32, offset: 8160)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !935, file: !53, line: 219, baseType: !1051, size: 32, offset: 8192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !935, file: !53, line: 220, baseType: !1051, size: 32, offset: 8224)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !935, file: !53, line: 221, baseType: !1051, size: 32, offset: 8256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !935, file: !53, line: 224, baseType: !1241, size: 16, offset: 8288)
!1241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !935, file: !53, line: 224, baseType: !1241, size: 16, offset: 8304)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !935, file: !53, line: 226, baseType: !932, size: 16, offset: 8320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !935, file: !53, line: 228, baseType: !930, size: 8, offset: 8336)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !935, file: !53, line: 229, baseType: !930, size: 8, offset: 8344)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !935, file: !53, line: 231, baseType: !932, size: 16, offset: 8352)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !935, file: !53, line: 232, baseType: !930, size: 8, offset: 8368)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !935, file: !53, line: 233, baseType: !930, size: 8, offset: 8376)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !935, file: !53, line: 234, baseType: !1051, size: 32, offset: 8384)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !935, file: !53, line: 235, baseType: !1051, size: 32, offset: 8416)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !935, file: !53, line: 237, baseType: !995, size: 128, offset: 8448)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !935, file: !53, line: 238, baseType: !995, size: 128, offset: 8576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !935, file: !53, line: 239, baseType: !995, size: 128, offset: 8704)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !935, file: !53, line: 240, baseType: !995, size: 128, offset: 8832)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !935, file: !53, line: 242, baseType: !1051, size: 32, offset: 8960)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !935, file: !53, line: 244, baseType: !932, size: 16, offset: 8992)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !935, file: !53, line: 245, baseType: !1241, size: 16, offset: 9008)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !935, file: !53, line: 246, baseType: !1196, size: 128, offset: 9024)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !935, file: !53, line: 248, baseType: !23, size: 32, offset: 9152)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !935, file: !53, line: 249, baseType: !23, size: 32, offset: 9184)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !935, file: !53, line: 251, baseType: !1262, size: 64, offset: 9216)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !53, line: 251, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !935, file: !53, line: 253, baseType: !930, size: 8, offset: 9280)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !935, file: !53, line: 254, baseType: !930, size: 8, offset: 9288)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !935, file: !53, line: 255, baseType: !932, size: 16, offset: 9296)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !935, file: !53, line: 256, baseType: !1122, size: 96, offset: 9312)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !935, file: !53, line: 258, baseType: !995, size: 128, offset: 9408)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !935, file: !53, line: 259, baseType: !995, size: 128, offset: 9536)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !935, file: !53, line: 260, baseType: !995, size: 128, offset: 9664)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !935, file: !53, line: 261, baseType: !995, size: 128, offset: 9792)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !935, file: !53, line: 263, baseType: !1273, size: 64, offset: 9920)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !53, line: 52, flags: DIFlagFwdDecl)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !935, file: !53, line: 264, baseType: !1276, size: 64, offset: 9984)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !53, line: 53, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !935, file: !53, line: 265, baseType: !1279, size: 64, offset: 10048)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1012, line: 46, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !935, file: !53, line: 267, baseType: !930, size: 8, offset: 10112)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !935, file: !53, line: 268, baseType: !930, size: 8, offset: 10120)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !935, file: !53, line: 269, baseType: !932, size: 16, offset: 10128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !935, file: !53, line: 270, baseType: !1051, size: 32, offset: 10144)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !935, file: !53, line: 272, baseType: !1286, size: 64, offset: 10176)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !53, line: 54, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !935, file: !53, line: 275, baseType: !1289, size: 64, offset: 10240)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !53, line: 275, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !935, file: !53, line: 277, baseType: !1292, size: 64, offset: 10304)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !53, line: 56, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !935, file: !53, line: 277, baseType: !1292, size: 64, offset: 10368)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !935, file: !53, line: 278, baseType: !1296, size: 64, offset: 10432)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1297, line: 27, baseType: !1298)
!1297 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1299, line: 45, baseType: !1300)
!1299 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1300 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !935, file: !53, line: 279, baseType: !1296, size: 64, offset: 10496)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !935, file: !53, line: 280, baseType: !7, size: 32, offset: 10560)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !935, file: !53, line: 281, baseType: !7, size: 32, offset: 10592)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !935, file: !53, line: 283, baseType: !995, size: 128, offset: 10624)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !935, file: !53, line: 284, baseType: !995, size: 128, offset: 10752)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !935, file: !53, line: 285, baseType: !1307, size: 64, offset: 10880)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !935, file: !53, line: 287, baseType: !1309, size: 64, offset: 10944)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !53, line: 59, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !935, file: !53, line: 288, baseType: !1312, size: 64, offset: 11008)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !53, line: 288, flags: DIFlagFwdDecl)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !935, file: !53, line: 290, baseType: !1315, size: 64, offset: 11072)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 64, elements: !1316)
!1316 = !{!1317}
!1317 = !DISubrange(count: 2)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !935, file: !53, line: 291, baseType: !1319, size: 64, offset: 11136)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1321, line: 65, baseType: !1322)
!1321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1321, line: 50, size: 320, elements: !1323)
!1323 = !{!1324, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1322, file: !1321, line: 51, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1155, line: 1216, size: 39680, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1331, !1334, !1335, !1336, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1362, !1436, !1864, !2079, !2082, !2370, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2392, !2393, !2394, !2395, !2396, !2404, !2471, !2478, !2479, !2486, !2487, !2488, !2489, !2490, !2491, !2492}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1326, file: !1155, line: 1217, baseType: !938, size: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1326, file: !1155, line: 1218, baseType: !1006, size: 64, offset: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1326, file: !1155, line: 1220, baseType: !1085, size: 64, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1326, file: !1155, line: 1221, baseType: !1332, size: 64, offset: 1088)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1155, line: 52, flags: DIFlagFwdDecl)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1326, file: !1155, line: 1223, baseType: !1325, size: 64, offset: 1152)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1326, file: !1155, line: 1225, baseType: !995, size: 128, offset: 1216)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1326, file: !1155, line: 1226, baseType: !1337, size: 64, offset: 1344)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1155, line: 69, size: 320, elements: !1339)
!1339 = !{!1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1338, file: !1155, line: 70, baseType: !1337, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1338, file: !1155, line: 70, baseType: !1337, size: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1338, file: !1155, line: 71, baseType: !7, size: 32, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1338, file: !1155, line: 71, baseType: !7, size: 32, offset: 160)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1338, file: !1155, line: 72, baseType: !23, size: 32, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1338, file: !1155, line: 73, baseType: !932, size: 16, offset: 224)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1338, file: !1155, line: 73, baseType: !932, size: 16, offset: 240)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1338, file: !1155, line: 74, baseType: !1085, size: 64, offset: 256)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1326, file: !1155, line: 1227, baseType: !1085, size: 64, offset: 1408)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1326, file: !1155, line: 1229, baseType: !1122, size: 96, offset: 1472)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1326, file: !1155, line: 1230, baseType: !1122, size: 96, offset: 1568)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1326, file: !1155, line: 1231, baseType: !1122, size: 96, offset: 1664)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1326, file: !1155, line: 1231, baseType: !1122, size: 96, offset: 1760)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1326, file: !1155, line: 1233, baseType: !7, size: 32, offset: 1856)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1326, file: !1155, line: 1234, baseType: !23, size: 32, offset: 1888)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1326, file: !1155, line: 1235, baseType: !7, size: 32, offset: 1920)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1326, file: !1155, line: 1237, baseType: !932, size: 16, offset: 1952)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1326, file: !1155, line: 1239, baseType: !930, size: 8, offset: 1968)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1326, file: !1155, line: 1240, baseType: !1359, size: 8, offset: 1976)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 8, elements: !1360)
!1360 = !{!1361}
!1361 = !DISubrange(count: 1)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1326, file: !1155, line: 1242, baseType: !1363, size: 64, offset: 1984)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1365, line: 328, size: 3456, elements: !1366)
!1365 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1366 = !{!1367, !1368, !1369, !1372, !1373, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1402, !1403, !1404, !1407, !1412, !1413, !1416, !1420, !1424, !1428, !1432, !1433, !1434, !1435}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1364, file: !1365, line: 329, baseType: !938, size: 960)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1364, file: !1365, line: 330, baseType: !1006, size: 64, offset: 960)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1364, file: !1365, line: 332, baseType: !1370, size: 64, offset: 1024)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1365, line: 332, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1364, file: !1365, line: 333, baseType: !985, size: 512, offset: 1088)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1364, file: !1365, line: 335, baseType: !1374, size: 64, offset: 1600)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1376, line: 41, flags: DIFlagFwdDecl)
!1376 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1364, file: !1365, line: 337, baseType: !1153, size: 64, offset: 1664)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1364, file: !1365, line: 338, baseType: !1315, size: 64, offset: 1728)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1364, file: !1365, line: 340, baseType: !995, size: 128, offset: 1792)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1364, file: !1365, line: 340, baseType: !995, size: 128, offset: 1920)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1364, file: !1365, line: 342, baseType: !23, size: 32, offset: 2048)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1364, file: !1365, line: 342, baseType: !23, size: 32, offset: 2080)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1364, file: !1365, line: 343, baseType: !23, size: 32, offset: 2112)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1364, file: !1365, line: 345, baseType: !23, size: 32, offset: 2144)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1364, file: !1365, line: 346, baseType: !23, size: 32, offset: 2176)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1364, file: !1365, line: 347, baseType: !932, size: 16, offset: 2208)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1364, file: !1365, line: 348, baseType: !932, size: 16, offset: 2224)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1364, file: !1365, line: 349, baseType: !23, size: 32, offset: 2240)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1364, file: !1365, line: 351, baseType: !23, size: 32, offset: 2272)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1364, file: !1365, line: 353, baseType: !932, size: 16, offset: 2304)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1364, file: !1365, line: 354, baseType: !932, size: 16, offset: 2320)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1364, file: !1365, line: 355, baseType: !23, size: 32, offset: 2336)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1364, file: !1365, line: 357, baseType: !1394, size: 128, offset: 2368)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1395, line: 95, baseType: !1396)
!1395 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1395, line: 92, size: 128, elements: !1397)
!1397 = !{!1398, !1399, !1400, !1401}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1396, file: !1395, line: 93, baseType: !1051, size: 32)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1396, file: !1395, line: 93, baseType: !1051, size: 32, offset: 32)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1396, file: !1395, line: 94, baseType: !1051, size: 32, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1396, file: !1395, line: 94, baseType: !1051, size: 32, offset: 96)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1364, file: !1365, line: 363, baseType: !995, size: 128, offset: 2496)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1364, file: !1365, line: 363, baseType: !995, size: 128, offset: 2624)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1364, file: !1365, line: 368, baseType: !1405, size: 64, offset: 2752)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1365, line: 48, flags: DIFlagFwdDecl)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1364, file: !1365, line: 372, baseType: !1408, size: 32, offset: 2816)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1365, line: 274, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1365, line: 271, size: 32, elements: !1410)
!1410 = !{!1411}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1409, file: !1365, line: 273, baseType: !7, size: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1364, file: !1365, line: 373, baseType: !23, size: 32, offset: 2848)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1364, file: !1365, line: 382, baseType: !1414, size: 64, offset: 2880)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1365, line: 46, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1364, file: !1365, line: 385, baseType: !1417, size: 64, offset: 2944)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{null, !928, !1051}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1364, file: !1365, line: 386, baseType: !1421, size: 64, offset: 3008)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !928, !929}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1364, file: !1365, line: 387, baseType: !1425, size: 64, offset: 3072)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!23, !928}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1364, file: !1365, line: 388, baseType: !1429, size: 64, offset: 3136)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{null, !928}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1364, file: !1365, line: 389, baseType: !928, size: 64, offset: 3200)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1364, file: !1365, line: 389, baseType: !928, size: 64, offset: 3264)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1364, file: !1365, line: 389, baseType: !928, size: 64, offset: 3328)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1364, file: !1365, line: 389, baseType: !928, size: 64, offset: 3392)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1326, file: !1155, line: 1244, baseType: !1437, size: 64, offset: 2048)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1439, line: 200, size: 17024, elements: !1440)
!1439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1440 = !{!1441, !1442, !1443, !1444, !1857, !1858, !1859, !1860, !1861, !1862, !1863}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1438, file: !1439, line: 201, baseType: !1307, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1438, file: !1439, line: 202, baseType: !995, size: 128, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1438, file: !1439, line: 203, baseType: !995, size: 128, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1438, file: !1439, line: 206, baseType: !1445, size: 64, offset: 320)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1439, line: 190, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1439, line: 126, size: 2816, elements: !1448)
!1448 = !{!1449, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1547, !1548, !1549, !1550, !1828, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1856}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1447, file: !1439, line: 127, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1447, file: !1439, line: 127, baseType: !1450, size: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1447, file: !1439, line: 128, baseType: !928, size: 64, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1447, file: !1439, line: 129, baseType: !928, size: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1447, file: !1439, line: 130, baseType: !985, size: 512, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1447, file: !1439, line: 132, baseType: !23, size: 32, offset: 768)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1447, file: !1439, line: 132, baseType: !23, size: 32, offset: 800)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1447, file: !1439, line: 133, baseType: !23, size: 32, offset: 832)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1447, file: !1439, line: 134, baseType: !23, size: 32, offset: 864)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1447, file: !1439, line: 134, baseType: !23, size: 32, offset: 896)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1447, file: !1439, line: 134, baseType: !23, size: 32, offset: 928)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1447, file: !1439, line: 135, baseType: !23, size: 32, offset: 960)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1447, file: !1439, line: 135, baseType: !23, size: 32, offset: 992)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1447, file: !1439, line: 136, baseType: !23, size: 32, offset: 1024)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1447, file: !1439, line: 136, baseType: !23, size: 32, offset: 1056)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1447, file: !1439, line: 137, baseType: !23, size: 32, offset: 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1447, file: !1439, line: 137, baseType: !23, size: 32, offset: 1120)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1447, file: !1439, line: 138, baseType: !1051, size: 32, offset: 1152)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1447, file: !1439, line: 139, baseType: !1051, size: 32, offset: 1184)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1447, file: !1439, line: 139, baseType: !1051, size: 32, offset: 1216)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1447, file: !1439, line: 141, baseType: !932, size: 16, offset: 1248)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1447, file: !1439, line: 142, baseType: !932, size: 16, offset: 1264)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1447, file: !1439, line: 143, baseType: !23, size: 32, offset: 1280)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1447, file: !1439, line: 144, baseType: !23, size: 32, offset: 1312)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1447, file: !1439, line: 146, baseType: !1475, size: 64, offset: 1344)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64)
!1476 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1439, line: 114, baseType: !1477)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1439, line: 99, size: 7232, elements: !1478)
!1478 = !{!1479, !1481, !1482, !1483, !1484, !1485, !1486, !1497, !1501, !1515, !1524, !1531, !1541}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1477, file: !1439, line: 100, baseType: !1480, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1477, file: !1439, line: 100, baseType: !1480, size: 64, offset: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1477, file: !1439, line: 101, baseType: !23, size: 32, offset: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1477, file: !1439, line: 101, baseType: !23, size: 32, offset: 160)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1477, file: !1439, line: 102, baseType: !23, size: 32, offset: 192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1477, file: !1439, line: 102, baseType: !23, size: 32, offset: 224)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1477, file: !1439, line: 103, baseType: !1487, size: 64, offset: 256)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1439, line: 59, baseType: !1489)
!1489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1439, line: 56, size: 2112, elements: !1490)
!1490 = !{!1491, !1495, !1496}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1489, file: !1439, line: 57, baseType: !1492, size: 2048)
!1492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 2048, elements: !1493)
!1493 = !{!1494}
!1494 = !DISubrange(count: 256)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1489, file: !1439, line: 58, baseType: !23, size: 32, offset: 2048)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1489, file: !1439, line: 58, baseType: !23, size: 32, offset: 2080)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1477, file: !1439, line: 106, baseType: !1498, size: 6144, offset: 320)
!1498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 6144, elements: !1499)
!1499 = !{!1500}
!1500 = !DISubrange(count: 768)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1477, file: !1439, line: 107, baseType: !1502, size: 64, offset: 6464)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1439, line: 97, baseType: !1504)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1439, line: 83, size: 8320, elements: !1505)
!1505 = !{!1506, !1507, !1508, !1511, !1512, !1513, !1514}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1504, file: !1439, line: 84, baseType: !1498, size: 6144)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1504, file: !1439, line: 87, baseType: !1492, size: 2048, offset: 6144)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1504, file: !1439, line: 88, baseType: !1509, size: 64, offset: 8192)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1321, line: 41, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1504, file: !1439, line: 90, baseType: !932, size: 16, offset: 8256)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1504, file: !1439, line: 92, baseType: !932, size: 16, offset: 8272)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1504, file: !1439, line: 93, baseType: !932, size: 16, offset: 8288)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1504, file: !1439, line: 95, baseType: !932, size: 16, offset: 8304)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1477, file: !1439, line: 108, baseType: !1516, size: 64, offset: 6528)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1439, line: 66, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1439, line: 61, size: 128, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1518, file: !1439, line: 62, baseType: !23, size: 32)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1518, file: !1439, line: 63, baseType: !23, size: 32, offset: 32)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1518, file: !1439, line: 64, baseType: !23, size: 32, offset: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1518, file: !1439, line: 65, baseType: !23, size: 32, offset: 96)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1477, file: !1439, line: 109, baseType: !1525, size: 64, offset: 6592)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1439, line: 71, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1439, line: 68, size: 64, elements: !1528)
!1528 = !{!1529, !1530}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1527, file: !1439, line: 69, baseType: !23, size: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1527, file: !1439, line: 70, baseType: !23, size: 32, offset: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1477, file: !1439, line: 110, baseType: !1532, size: 64, offset: 6656)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1439, line: 81, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1439, line: 73, size: 352, elements: !1535)
!1535 = !{!1536, !1537, !1538, !1539, !1540}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1534, file: !1439, line: 74, baseType: !1122, size: 96)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1534, file: !1439, line: 75, baseType: !1122, size: 96, offset: 96)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1534, file: !1439, line: 76, baseType: !1122, size: 96, offset: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1534, file: !1439, line: 77, baseType: !23, size: 32, offset: 288)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1534, file: !1439, line: 78, baseType: !23, size: 32, offset: 320)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1477, file: !1439, line: 113, baseType: !1542, size: 512, offset: 6720)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1543, line: 182, baseType: !1544)
!1543 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1543, line: 180, size: 512, elements: !1545)
!1545 = !{!1546}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1544, file: !1543, line: 181, baseType: !985, size: 512)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1447, file: !1439, line: 148, baseType: !1091, size: 64, offset: 1408)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1447, file: !1439, line: 151, baseType: !1325, size: 64, offset: 1472)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1447, file: !1439, line: 152, baseType: !1085, size: 64, offset: 1536)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1447, file: !1439, line: 153, baseType: !1551, size: 64, offset: 1600)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1553, line: 64, size: 19136, elements: !1554)
!1553 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1554 = !{!1555, !1556, !1557, !1558, !1559, !1560, !1562, !1563, !1564, !1565, !1568, !1569, !1814, !1815, !1823, !1824, !1825, !1826, !1827}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1552, file: !1553, line: 65, baseType: !938, size: 960)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1552, file: !1553, line: 66, baseType: !1006, size: 64, offset: 960)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1552, file: !1553, line: 68, baseType: !957, size: 8192, offset: 1024)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1552, file: !1553, line: 70, baseType: !23, size: 32, offset: 9216)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1552, file: !1553, line: 71, baseType: !23, size: 32, offset: 9248)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1552, file: !1553, line: 72, baseType: !1561, size: 64, offset: 9280)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, elements: !1316)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1552, file: !1553, line: 74, baseType: !1051, size: 32, offset: 9344)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1552, file: !1553, line: 74, baseType: !1051, size: 32, offset: 9376)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1552, file: !1553, line: 76, baseType: !1509, size: 64, offset: 9408)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1552, file: !1553, line: 77, baseType: !1566, size: 64, offset: 9472)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1567 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1553, line: 77, flags: DIFlagFwdDecl)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1552, file: !1553, line: 78, baseType: !1153, size: 64, offset: 9536)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1552, file: !1553, line: 80, baseType: !1570, size: 2624, offset: 9600)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1571, line: 340, size: 2624, elements: !1572)
!1571 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1572 = !{!1573, !1601, !1619, !1620, !1621, !1636, !1694, !1695, !1794, !1795, !1796, !1797, !1803}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1570, file: !1571, line: 341, baseType: !1574, size: 576)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1571, line: 251, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1571, line: 207, size: 576, elements: !1576)
!1576 = !{!1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1575, file: !1571, line: 208, baseType: !23, size: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1575, file: !1571, line: 211, baseType: !932, size: 16, offset: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1575, file: !1571, line: 212, baseType: !932, size: 16, offset: 48)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1575, file: !1571, line: 213, baseType: !1051, size: 32, offset: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1575, file: !1571, line: 214, baseType: !932, size: 16, offset: 96)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1575, file: !1571, line: 215, baseType: !932, size: 16, offset: 112)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1575, file: !1571, line: 216, baseType: !932, size: 16, offset: 128)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1575, file: !1571, line: 217, baseType: !932, size: 16, offset: 144)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1575, file: !1571, line: 218, baseType: !932, size: 16, offset: 160)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1575, file: !1571, line: 219, baseType: !932, size: 16, offset: 176)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1575, file: !1571, line: 220, baseType: !1051, size: 32, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1575, file: !1571, line: 222, baseType: !932, size: 16, offset: 224)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1575, file: !1571, line: 225, baseType: !932, size: 16, offset: 240)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1575, file: !1571, line: 228, baseType: !23, size: 32, offset: 256)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1575, file: !1571, line: 229, baseType: !23, size: 32, offset: 288)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1575, file: !1571, line: 233, baseType: !23, size: 32, offset: 320)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1575, file: !1571, line: 236, baseType: !932, size: 16, offset: 352)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1575, file: !1571, line: 236, baseType: !932, size: 16, offset: 368)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1575, file: !1571, line: 241, baseType: !1051, size: 32, offset: 384)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1575, file: !1571, line: 244, baseType: !23, size: 32, offset: 416)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1575, file: !1571, line: 244, baseType: !23, size: 32, offset: 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1575, file: !1571, line: 245, baseType: !1051, size: 32, offset: 480)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1575, file: !1571, line: 248, baseType: !1051, size: 32, offset: 512)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1575, file: !1571, line: 250, baseType: !23, size: 32, offset: 544)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1570, file: !1571, line: 342, baseType: !1602, size: 448, offset: 576)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1571, line: 79, baseType: !1603)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1571, line: 61, size: 448, elements: !1604)
!1604 = !{!1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1603, file: !1571, line: 62, baseType: !928, size: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1603, file: !1571, line: 64, baseType: !932, size: 16, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1603, file: !1571, line: 65, baseType: !932, size: 16, offset: 80)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1603, file: !1571, line: 67, baseType: !1051, size: 32, offset: 96)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1603, file: !1571, line: 68, baseType: !1051, size: 32, offset: 128)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1603, file: !1571, line: 69, baseType: !1051, size: 32, offset: 160)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1603, file: !1571, line: 70, baseType: !932, size: 16, offset: 192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1603, file: !1571, line: 71, baseType: !932, size: 16, offset: 208)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1603, file: !1571, line: 72, baseType: !1315, size: 64, offset: 224)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1603, file: !1571, line: 75, baseType: !1051, size: 32, offset: 288)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1603, file: !1571, line: 75, baseType: !1051, size: 32, offset: 320)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1603, file: !1571, line: 75, baseType: !1051, size: 32, offset: 352)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1603, file: !1571, line: 78, baseType: !1051, size: 32, offset: 384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1603, file: !1571, line: 78, baseType: !1051, size: 32, offset: 416)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1570, file: !1571, line: 343, baseType: !995, size: 128, offset: 1024)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1570, file: !1571, line: 344, baseType: !995, size: 128, offset: 1152)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1570, file: !1571, line: 345, baseType: !1622, size: 192, offset: 1280)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1571, line: 278, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1571, line: 270, size: 192, elements: !1624)
!1624 = !{!1625, !1626, !1627, !1628, !1629}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1623, file: !1571, line: 271, baseType: !23, size: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1623, file: !1571, line: 273, baseType: !1051, size: 32, offset: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1623, file: !1571, line: 275, baseType: !23, size: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1623, file: !1571, line: 276, baseType: !23, size: 32, offset: 96)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1623, file: !1571, line: 277, baseType: !1630, size: 64, offset: 128)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1571, line: 55, size: 576, elements: !1632)
!1632 = !{!1633, !1634, !1635}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1631, file: !1571, line: 56, baseType: !23, size: 32)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1631, file: !1571, line: 57, baseType: !1051, size: 32, offset: 32)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1631, file: !1571, line: 58, baseType: !1205, size: 512, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1570, file: !1571, line: 346, baseType: !1637, size: 384, offset: 1472)
!1637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1571, line: 268, baseType: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1571, line: 253, size: 384, elements: !1639)
!1639 = !{!1640, !1641, !1642, !1643, !1644, !1688, !1689, !1690, !1691, !1692, !1693}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1638, file: !1571, line: 254, baseType: !23, size: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1638, file: !1571, line: 255, baseType: !23, size: 32, offset: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1638, file: !1571, line: 255, baseType: !23, size: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1638, file: !1571, line: 258, baseType: !1051, size: 32, offset: 96)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1638, file: !1571, line: 259, baseType: !1645, size: 64, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1571, line: 164, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1571, line: 108, size: 1664, elements: !1648)
!1648 = !{!1649, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1647, file: !1571, line: 109, baseType: !1650, size: 64)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1647, file: !1571, line: 109, baseType: !1650, size: 64, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1647, file: !1571, line: 111, baseType: !985, size: 512, offset: 128)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1647, file: !1571, line: 119, baseType: !1315, size: 64, offset: 640)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1647, file: !1571, line: 119, baseType: !1315, size: 64, offset: 704)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1647, file: !1571, line: 125, baseType: !1315, size: 64, offset: 768)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1647, file: !1571, line: 125, baseType: !1315, size: 64, offset: 832)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1647, file: !1571, line: 127, baseType: !1315, size: 64, offset: 896)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1647, file: !1571, line: 130, baseType: !23, size: 32, offset: 960)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1647, file: !1571, line: 131, baseType: !23, size: 32, offset: 992)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1647, file: !1571, line: 132, baseType: !1661, size: 64, offset: 1024)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64)
!1662 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1571, line: 106, baseType: !1663)
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1571, line: 81, size: 512, elements: !1664)
!1664 = !{!1665, !1666, !1669, !1670, !1671, !1672}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1663, file: !1571, line: 82, baseType: !1315, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1663, file: !1571, line: 97, baseType: !1667, size: 256, offset: 64)
!1667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 256, elements: !1668)
!1668 = !{!1198, !1317}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1663, file: !1571, line: 102, baseType: !1315, size: 64, offset: 320)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1663, file: !1571, line: 102, baseType: !1315, size: 64, offset: 384)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1663, file: !1571, line: 104, baseType: !23, size: 32, offset: 448)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1663, file: !1571, line: 105, baseType: !23, size: 32, offset: 480)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1647, file: !1571, line: 135, baseType: !1122, size: 96, offset: 1088)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1647, file: !1571, line: 136, baseType: !1051, size: 32, offset: 1184)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1647, file: !1571, line: 139, baseType: !23, size: 32, offset: 1216)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1647, file: !1571, line: 139, baseType: !23, size: 32, offset: 1248)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1647, file: !1571, line: 139, baseType: !23, size: 32, offset: 1280)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1647, file: !1571, line: 140, baseType: !1122, size: 96, offset: 1312)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1647, file: !1571, line: 143, baseType: !932, size: 16, offset: 1408)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1647, file: !1571, line: 144, baseType: !932, size: 16, offset: 1424)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1647, file: !1571, line: 145, baseType: !932, size: 16, offset: 1440)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1647, file: !1571, line: 148, baseType: !932, size: 16, offset: 1456)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1647, file: !1571, line: 149, baseType: !23, size: 32, offset: 1472)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1647, file: !1571, line: 150, baseType: !1051, size: 32, offset: 1504)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1647, file: !1571, line: 152, baseType: !1153, size: 64, offset: 1536)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1647, file: !1571, line: 163, baseType: !1051, size: 32, offset: 1600)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1647, file: !1571, line: 163, baseType: !1051, size: 32, offset: 1632)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1638, file: !1571, line: 261, baseType: !1051, size: 32, offset: 192)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1638, file: !1571, line: 261, baseType: !1051, size: 32, offset: 224)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1638, file: !1571, line: 261, baseType: !1051, size: 32, offset: 256)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1638, file: !1571, line: 263, baseType: !23, size: 32, offset: 288)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1638, file: !1571, line: 266, baseType: !23, size: 32, offset: 320)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1638, file: !1571, line: 267, baseType: !1051, size: 32, offset: 352)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1570, file: !1571, line: 347, baseType: !1645, size: 64, offset: 1856)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1570, file: !1571, line: 348, baseType: !1696, size: 64, offset: 1920)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64)
