; ModuleID = 'blender/source/blender/nodes/composite/nodes/node_composite_mask.c'
source_filename = "blender/source/blender/nodes/composite/nodes/node_composite_mask.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 60, type: !2191, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_cmp_mask", scope: !3, file: !3, line: 58, type: !4, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2190)
!3 = !DIFile(filename: "blender/source/blender/nodes/composite/nodes/node_composite_mask.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, globals: !22, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !{!0, !23}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "cmp_node_mask_out", scope: !6, file: !3, line: 43, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2816, elements: !279)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !27, line: 109, baseType: !28)
!27 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !27, line: 98, size: 1408, elements: !29)
!29 = !{!30, !32, !33, !38, !40, !41, !42, !43, !44, !45, !46, !47, !2189}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !27, line: 99, baseType: !31, size: 32)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !28, file: !27, line: 99, baseType: !31, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !27, line: 100, baseType: !34, size: 512, offset: 64)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !36)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!37}
!37 = !DISubrange(count: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !28, file: !27, line: 101, baseType: !39, size: 32, offset: 576)
!39 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !28, file: !27, line: 101, baseType: !39, size: 32, offset: 608)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !28, file: !27, line: 101, baseType: !39, size: 32, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !28, file: !27, line: 101, baseType: !39, size: 32, offset: 672)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !28, file: !27, line: 102, baseType: !39, size: 32, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !28, file: !27, line: 102, baseType: !39, size: 32, offset: 736)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !28, file: !27, line: 103, baseType: !31, size: 32, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !28, file: !27, line: 104, baseType: !31, size: 32, offset: 800)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !28, file: !27, line: 107, baseType: !48, size: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !50, line: 87, size: 2816, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !87, !88, !89, !90, !91, !92, !93, !94, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !50, line: 88, baseType: !48, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !49, file: !50, line: 88, baseType: !48, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !49, file: !50, line: 88, baseType: !48, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !49, file: !50, line: 90, baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !58, line: 75, baseType: !59)
!58 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !58, line: 62, size: 1024, elements: !60)
!60 = !{!61, !63, !64, !65, !66, !68, !69, !70, !85, !86}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !58, line: 63, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !58, line: 63, baseType: !62, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !58, line: 64, baseType: !35, size: 8, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !58, line: 64, baseType: !35, size: 8, offset: 136)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !58, line: 65, baseType: !67, size: 16, offset: 144)
!67 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !58, line: 66, baseType: !34, size: 512, offset: 160)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !59, file: !58, line: 67, baseType: !31, size: 32, offset: 672)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !58, line: 69, baseType: !71, size: 256, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !58, line: 60, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !58, line: 48, size: 256, elements: !73)
!73 = !{!74, !76, !83, !84}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !72, file: !58, line: 49, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !72, file: !58, line: 58, baseType: !77, size: 128, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !78, line: 71, baseType: !79)
!78 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !78, line: 69, size: 128, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !79, file: !78, line: 70, baseType: !75, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !79, file: !78, line: 70, baseType: !75, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !72, file: !58, line: 59, baseType: !31, size: 32, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !72, file: !58, line: 59, baseType: !31, size: 32, offset: 224)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !59, file: !58, line: 70, baseType: !31, size: 32, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !59, file: !58, line: 74, baseType: !31, size: 32, offset: 992)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !49, file: !50, line: 92, baseType: !34, size: 512, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !50, line: 94, baseType: !34, size: 512, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !49, file: !50, line: 99, baseType: !75, size: 64, offset: 1280)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !50, line: 101, baseType: !67, size: 16, offset: 1344)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !49, file: !50, line: 101, baseType: !67, size: 16, offset: 1360)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !49, file: !50, line: 102, baseType: !67, size: 16, offset: 1376)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !49, file: !50, line: 103, baseType: !67, size: 16, offset: 1392)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !49, file: !50, line: 104, baseType: !95, size: 64, offset: 1408)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !27, line: 114, size: 1600, elements: !97)
!97 = !{!98, !99, !121, !126, !130, !134, !2162, !2166, !2167, !2171, !2172, !2173, !2174}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !96, file: !27, line: 115, baseType: !34, size: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !96, file: !27, line: 117, baseType: !100, size: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103, !106, !108, !108, !119}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !105, line: 44, flags: DIFlagFwdDecl)
!105 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !27, line: 73, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !105, line: 55, size: 192, elements: !110)
!110 = !{!111, !115, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !105, line: 58, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !109, file: !105, line: 56, size: 64, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !105, line: 57, baseType: !75, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !105, line: 60, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !50, line: 335, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !105, line: 61, baseType: !75, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !96, file: !27, line: 118, baseType: !122, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !103, !108, !108, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !96, file: !27, line: 120, baseType: !127, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !103, !106, !108}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !96, file: !27, line: 121, baseType: !131, size: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !103, !108, !125}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !96, file: !27, line: 122, baseType: !135, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138, !48, !116}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !50, line: 328, size: 3456, elements: !140)
!140 = !{!141, !177, !181, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2145, !2149, !2153, !2157, !2158, !2159, !2160, !2161}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !50, line: 329, baseType: !142, size: 960)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !58, line: 130, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !58, line: 117, size: 960, elements: !144)
!144 = !{!145, !146, !147, !149, !168, !172, !173, !174, !175, !176}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !58, line: 118, baseType: !75, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !58, line: 118, baseType: !75, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !143, file: !58, line: 119, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !143, file: !58, line: 120, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !58, line: 136, size: 17600, elements: !152)
!152 = !{!153, !154, !156, !159, !163, !164, !165}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !58, line: 137, baseType: !142, size: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !151, file: !58, line: 138, baseType: !155, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !151, file: !58, line: 139, baseType: !157, size: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !58, line: 43, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !58, line: 140, baseType: !160, size: 8192, offset: 1088)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 1024)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !151, file: !58, line: 141, baseType: !160, size: 8192, offset: 9280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !151, file: !58, line: 148, baseType: !150, size: 64, offset: 17472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !151, file: !58, line: 150, baseType: !166, size: 64, offset: 17536)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !58, line: 45, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !58, line: 121, baseType: !169, size: 528, offset: 256)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 528, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 66)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !58, line: 126, baseType: !67, size: 16, offset: 784)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !143, file: !58, line: 127, baseType: !31, size: 32, offset: 800)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !143, file: !58, line: 128, baseType: !31, size: 32, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !143, file: !58, line: 128, baseType: !31, size: 32, offset: 864)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !143, file: !58, line: 129, baseType: !56, size: 64, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !139, file: !50, line: 330, baseType: !178, size: 64, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !180, line: 48, flags: DIFlagFwdDecl)
!180 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !139, file: !50, line: 332, baseType: !182, size: 64, offset: 1024)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !27, line: 283, size: 4096, elements: !184)
!184 = !{!185, !186, !187, !188, !192, !193, !197, !552, !2080, !2084, !2090, !2094, !2095, !2096, !2097, !2116, !2117}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !183, file: !27, line: 284, baseType: !31, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !183, file: !27, line: 285, baseType: !34, size: 512, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !183, file: !27, line: 287, baseType: !34, size: 512, offset: 544)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !183, file: !27, line: 288, baseType: !189, size: 2048, offset: 1056)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !183, file: !27, line: 289, baseType: !31, size: 32, offset: 3104)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !183, file: !27, line: 292, baseType: !194, size: 64, offset: 3136)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !138}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !183, file: !27, line: 293, baseType: !198, size: 64, offset: 3200)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !138, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !50, line: 167, size: 3712, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !544, !545, !546, !547, !548, !549}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !50, line: 168, baseType: !201, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !50, line: 168, baseType: !201, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !202, file: !50, line: 168, baseType: !201, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !202, file: !50, line: 170, baseType: !56, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !202, file: !50, line: 172, baseType: !209, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !27, line: 144, size: 6016, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !231, !232, !233, !247, !251, !255, !256, !340, !345, !349, !350, !351, !352, !356, !357, !361, !365, !369, !373, !377, !381, !385, !386, !404, !409, !452, !472}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !27, line: 145, baseType: !75, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !27, line: 145, baseType: !75, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !210, file: !27, line: 146, baseType: !67, size: 16, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !210, file: !27, line: 148, baseType: !34, size: 512, offset: 144)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !27, line: 149, baseType: !31, size: 32, offset: 672)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !210, file: !27, line: 151, baseType: !34, size: 512, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !210, file: !27, line: 152, baseType: !189, size: 2048, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !210, file: !27, line: 153, baseType: !31, size: 32, offset: 3264)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !210, file: !27, line: 155, baseType: !39, size: 32, offset: 3296)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !210, file: !27, line: 155, baseType: !39, size: 32, offset: 3328)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !210, file: !27, line: 155, baseType: !39, size: 32, offset: 3360)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !210, file: !27, line: 156, baseType: !39, size: 32, offset: 3392)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !210, file: !27, line: 156, baseType: !39, size: 32, offset: 3424)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !210, file: !27, line: 156, baseType: !39, size: 32, offset: 3456)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !210, file: !27, line: 157, baseType: !67, size: 16, offset: 3488)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !27, line: 157, baseType: !67, size: 16, offset: 3504)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !210, file: !27, line: 157, baseType: !67, size: 16, offset: 3520)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !210, file: !27, line: 160, baseType: !230, size: 64, offset: 3584)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !210, file: !27, line: 160, baseType: !230, size: 64, offset: 3648)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !210, file: !27, line: 162, baseType: !34, size: 512, offset: 3712)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !210, file: !27, line: 165, baseType: !234, size: 64, offset: 4224)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !239, !241, !138, !201, !243}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !27, line: 81, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !50, line: 43, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !50, line: 274, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !50, line: 271, size: 32, elements: !245)
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !244, file: !50, line: 273, baseType: !10, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !210, file: !27, line: 168, baseType: !248, size: 64, offset: 4288)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !237, !138, !201}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !210, file: !27, line: 171, baseType: !252, size: 64, offset: 4352)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !106, !103, !108}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !210, file: !27, line: 173, baseType: !252, size: 64, offset: 4416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !210, file: !27, line: 176, baseType: !257, size: 64, offset: 4480)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !241, !260, !201, !31, !31}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !262, line: 70, size: 19840, elements: !263)
!262 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!263 = !{!264, !265, !266, !267, !268, !270, !271, !272, !273, !275, !276, !281, !282, !283, !284, !285, !287, !289, !290, !291, !295, !296, !297, !298, !299, !302, !303, !304, !305, !306, !309, !310, !312, !313, !314, !318, !319, !320, !323, !324, !333}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !262, line: 71, baseType: !260, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !261, file: !262, line: 71, baseType: !260, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !261, file: !262, line: 74, baseType: !31, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !261, file: !262, line: 74, baseType: !31, size: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !261, file: !262, line: 79, baseType: !269, size: 8, offset: 192)
!269 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !261, file: !262, line: 80, baseType: !31, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !261, file: !262, line: 83, baseType: !31, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !261, file: !262, line: 84, baseType: !31, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !261, file: !262, line: 87, baseType: !274, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !261, file: !262, line: 88, baseType: !125, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !261, file: !262, line: 93, baseType: !277, size: 128, offset: 448)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 128, elements: !279)
!278 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!279 = !{!280}
!280 = !DISubrange(count: 2)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !261, file: !262, line: 96, baseType: !31, size: 32, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !261, file: !262, line: 96, baseType: !31, size: 32, offset: 608)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !261, file: !262, line: 97, baseType: !31, size: 32, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !261, file: !262, line: 97, baseType: !31, size: 32, offset: 672)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !261, file: !262, line: 98, baseType: !286, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !261, file: !262, line: 101, baseType: !288, size: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !261, file: !262, line: 102, baseType: !125, size: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !261, file: !262, line: 105, baseType: !39, size: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !261, file: !262, line: 108, baseType: !292, size: 1280, offset: 960)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 1280, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 20)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !261, file: !262, line: 109, baseType: !31, size: 32, offset: 2240)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !261, file: !262, line: 109, baseType: !31, size: 32, offset: 2272)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !261, file: !262, line: 112, baseType: !31, size: 32, offset: 2304)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !261, file: !262, line: 113, baseType: !31, size: 32, offset: 2336)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !261, file: !262, line: 114, baseType: !300, size: 64, offset: 2368)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !262, line: 50, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !261, file: !262, line: 115, baseType: !75, size: 64, offset: 2432)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !261, file: !262, line: 118, baseType: !31, size: 32, offset: 2496)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !262, line: 119, baseType: !160, size: 8192, offset: 2528)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !261, file: !262, line: 120, baseType: !160, size: 8192, offset: 10720)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !261, file: !262, line: 123, baseType: !307, size: 64, offset: 18944)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !262, line: 123, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !261, file: !262, line: 124, baseType: !31, size: 32, offset: 19008)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !261, file: !262, line: 127, baseType: !311, size: 64, offset: 19072)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !261, file: !262, line: 128, baseType: !10, size: 32, offset: 19136)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !261, file: !262, line: 129, baseType: !10, size: 32, offset: 19168)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !261, file: !262, line: 132, baseType: !315, size: 64, offset: 19200)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !317, line: 63, flags: DIFlagFwdDecl)
!317 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !261, file: !262, line: 133, baseType: !315, size: 64, offset: 19264)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !261, file: !262, line: 134, baseType: !274, size: 64, offset: 19328)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !261, file: !262, line: 135, baseType: !321, size: 64, offset: 19392)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !262, line: 135, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !261, file: !262, line: 136, baseType: !31, size: 32, offset: 19456)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !261, file: !262, line: 137, baseType: !325, size: 128, offset: 19488)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !326, line: 89, baseType: !327)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !326, line: 86, size: 128, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !327, file: !326, line: 87, baseType: !31, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !327, file: !326, line: 87, baseType: !31, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !327, file: !326, line: 88, baseType: !31, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !327, file: !326, line: 88, baseType: !31, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !261, file: !262, line: 140, baseType: !334, size: 192, offset: 19648)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !262, line: 55, size: 192, elements: !335)
!335 = !{!336, !337, !338, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !334, file: !262, line: 56, baseType: !10, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !334, file: !262, line: 57, baseType: !10, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !262, line: 58, baseType: !311, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !262, line: 59, baseType: !10, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !210, file: !27, line: 179, baseType: !341, size: 64, offset: 4544)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !138, !201, !344, !31}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !210, file: !27, line: 181, baseType: !346, size: 64, offset: 4608)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!31, !201, !31, !31}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !210, file: !27, line: 183, baseType: !346, size: 64, offset: 4672)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !210, file: !27, line: 185, baseType: !346, size: 64, offset: 4736)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !210, file: !27, line: 188, baseType: !198, size: 64, offset: 4800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !210, file: !27, line: 190, baseType: !353, size: 64, offset: 4864)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !138, !201, !148}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !210, file: !27, line: 193, baseType: !198, size: 64, offset: 4928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !210, file: !27, line: 195, baseType: !358, size: 64, offset: 4992)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !201}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !210, file: !27, line: 197, baseType: !362, size: 64, offset: 5056)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !138, !201, !201}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !210, file: !27, line: 200, baseType: !366, size: 64, offset: 5120)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !237, !108}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !210, file: !27, line: 201, baseType: !370, size: 64, offset: 5184)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !108}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !210, file: !27, line: 202, baseType: !374, size: 64, offset: 5248)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !108, !201}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !210, file: !27, line: 205, baseType: !378, size: 64, offset: 5312)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!31, !209, !138}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !210, file: !27, line: 207, baseType: !382, size: 64, offset: 5376)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!31, !201, !138}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !210, file: !27, line: 210, baseType: !198, size: 64, offset: 5440)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !210, file: !27, line: 213, baseType: !387, size: 64, offset: 5504)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !27, line: 135, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!75, !391, !201, !243}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !393, line: 54, size: 64, elements: !394)
!393 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !392, file: !393, line: 55, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !27, line: 500, size: 64, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !397, file: !27, line: 502, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !402, line: 48, baseType: !403)
!402 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !180, line: 51, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !210, file: !27, line: 214, baseType: !405, size: 64, offset: 5568)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !27, line: 136, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !75}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !210, file: !27, line: 215, baseType: !410, size: 64, offset: 5632)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !27, line: 137, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !75, !31, !201, !414, !433, !433}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !393, line: 58, size: 128, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !393, line: 59, baseType: !75, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !415, file: !393, line: 60, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !50, line: 289, size: 192, elements: !421)
!421 = !{!422, !429, !430, !431, !432}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !420, file: !50, line: 290, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !50, line: 286, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !50, line: 280, size: 64, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !424, file: !50, line: 281, baseType: !243, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !424, file: !50, line: 284, baseType: !67, size: 16, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !424, file: !50, line: 285, baseType: !67, size: 16, offset: 48)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !420, file: !50, line: 292, baseType: !311, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !420, file: !50, line: 293, baseType: !67, size: 16, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !420, file: !50, line: 293, baseType: !67, size: 16, offset: 144)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !420, file: !50, line: 294, baseType: !31, size: 32, offset: 160)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !50, line: 62, size: 384, elements: !436)
!436 = !{!437, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !435, file: !50, line: 63, baseType: !438, size: 128)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 4)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !435, file: !50, line: 64, baseType: !39, size: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !435, file: !50, line: 64, baseType: !39, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !435, file: !50, line: 65, baseType: !75, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !435, file: !50, line: 66, baseType: !67, size: 16, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !435, file: !50, line: 67, baseType: !67, size: 16, offset: 272)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !435, file: !50, line: 68, baseType: !67, size: 16, offset: 288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !435, file: !50, line: 69, baseType: !67, size: 16, offset: 304)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !435, file: !50, line: 70, baseType: !67, size: 16, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !435, file: !50, line: 71, baseType: !67, size: 16, offset: 336)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !435, file: !50, line: 72, baseType: !451, size: 32, offset: 352)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 32, elements: !279)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !210, file: !27, line: 217, baseType: !453, size: 64, offset: 5696)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !27, line: 138, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!31, !457, !201, !414, !459, !459}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !27, line: 64, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !461)
!461 = !{!462, !464, !465, !466, !469, !470, !471}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !9, line: 107, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !460, file: !9, line: 108, baseType: !119, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !460, file: !9, line: 109, baseType: !438, size: 128, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !460, file: !9, line: 110, baseType: !467, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !460, file: !9, line: 111, baseType: !269, size: 8, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !460, file: !9, line: 112, baseType: !269, size: 8, offset: 328)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !460, file: !9, line: 113, baseType: !67, size: 16, offset: 336)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !210, file: !27, line: 220, baseType: !473, size: 256, offset: 5760)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !105, line: 436, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !105, line: 430, size: 256, elements: !475)
!475 = !{!476, !477, !480, !496}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !105, line: 431, baseType: !75, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !474, file: !105, line: 432, baseType: !478, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !105, line: 417, baseType: !117)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !474, file: !105, line: 433, baseType: !481, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !105, line: 408, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!31, !103, !108, !485, !487}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !105, line: 38, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !105, line: 348, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !105, line: 337, size: 256, elements: !490)
!490 = !{!491, !492, !493, !494, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !105, line: 339, baseType: !75, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !489, file: !105, line: 342, baseType: !485, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !489, file: !105, line: 345, baseType: !31, size: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !489, file: !105, line: 347, baseType: !31, size: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !489, file: !105, line: 347, baseType: !31, size: 32, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !474, file: !105, line: 434, baseType: !497, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !105, line: 409, baseType: !406)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !202, file: !50, line: 173, baseType: !34, size: 512, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !50, line: 175, baseType: !34, size: 512, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !202, file: !50, line: 176, baseType: !31, size: 32, offset: 1344)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !50, line: 177, baseType: !67, size: 16, offset: 1376)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !202, file: !50, line: 177, baseType: !67, size: 16, offset: 1392)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !202, file: !50, line: 178, baseType: !67, size: 16, offset: 1408)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !50, line: 178, baseType: !67, size: 16, offset: 1424)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !202, file: !50, line: 179, baseType: !67, size: 16, offset: 1440)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !202, file: !50, line: 179, baseType: !67, size: 16, offset: 1456)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !202, file: !50, line: 180, baseType: !67, size: 16, offset: 1472)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !202, file: !50, line: 181, baseType: !67, size: 16, offset: 1488)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !202, file: !50, line: 182, baseType: !510, size: 96, offset: 1504)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 96, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 3)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !202, file: !50, line: 184, baseType: !77, size: 128, offset: 1600)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !202, file: !50, line: 184, baseType: !77, size: 128, offset: 1728)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !202, file: !50, line: 185, baseType: !201, size: 64, offset: 1856)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !202, file: !50, line: 186, baseType: !148, size: 64, offset: 1920)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !202, file: !50, line: 187, baseType: !75, size: 64, offset: 1984)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !202, file: !50, line: 188, baseType: !201, size: 64, offset: 2048)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !202, file: !50, line: 189, baseType: !77, size: 128, offset: 2112)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !202, file: !50, line: 191, baseType: !39, size: 32, offset: 2240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !202, file: !50, line: 191, baseType: !39, size: 32, offset: 2272)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !202, file: !50, line: 192, baseType: !39, size: 32, offset: 2304)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !202, file: !50, line: 192, baseType: !39, size: 32, offset: 2336)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !202, file: !50, line: 193, baseType: !39, size: 32, offset: 2368)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !202, file: !50, line: 194, baseType: !39, size: 32, offset: 2400)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !202, file: !50, line: 194, baseType: !39, size: 32, offset: 2432)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !202, file: !50, line: 196, baseType: !31, size: 32, offset: 2464)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !202, file: !50, line: 198, baseType: !34, size: 512, offset: 2496)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !202, file: !50, line: 199, baseType: !67, size: 16, offset: 3008)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !202, file: !50, line: 199, baseType: !67, size: 16, offset: 3024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !202, file: !50, line: 200, baseType: !39, size: 32, offset: 3040)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !202, file: !50, line: 200, baseType: !39, size: 32, offset: 3072)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !202, file: !50, line: 202, baseType: !67, size: 16, offset: 3104)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !202, file: !50, line: 202, baseType: !67, size: 16, offset: 3120)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !202, file: !50, line: 203, baseType: !75, size: 64, offset: 3136)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !202, file: !50, line: 204, baseType: !537, size: 128, offset: 3200)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !326, line: 95, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !326, line: 92, size: 128, elements: !539)
!539 = !{!540, !541, !542, !543}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !538, file: !326, line: 93, baseType: !39, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !538, file: !326, line: 93, baseType: !39, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !538, file: !326, line: 94, baseType: !39, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !538, file: !326, line: 94, baseType: !39, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !202, file: !50, line: 205, baseType: !537, size: 128, offset: 3328)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !202, file: !50, line: 206, baseType: !537, size: 128, offset: 3456)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !202, file: !50, line: 215, baseType: !67, size: 16, offset: 3584)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !202, file: !50, line: 215, baseType: !67, size: 16, offset: 3600)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !202, file: !50, line: 216, baseType: !31, size: 32, offset: 3616)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !202, file: !50, line: 217, baseType: !550, size: 64, offset: 3648)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !50, line: 51, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !183, file: !27, line: 294, baseType: !553, size: 64, offset: 3264)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !556, !75, !2076}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !317, line: 1216, size: 39680, elements: !558)
!558 = !{!559, !560, !561, !564, !1256, !1257, !1258, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1285, !1497, !1500, !1742, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1764, !1765, !1766, !1767, !1768, !1776, !1842, !1849, !1853, !1860, !2063, !2069, !2070, !2071, !2072, !2073}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !557, file: !317, line: 1217, baseType: !142, size: 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !557, file: !317, line: 1218, baseType: !178, size: 64, offset: 960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !557, file: !317, line: 1220, baseType: !562, size: 64, offset: 1024)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !180, line: 43, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !557, file: !317, line: 1221, baseType: !565, size: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !567, line: 52, size: 4224, elements: !568)
!567 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !641, !1251, !1252, !1253, !1254, !1255}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !566, file: !567, line: 53, baseType: !142, size: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !566, file: !567, line: 54, baseType: !178, size: 64, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !566, file: !567, line: 56, baseType: !67, size: 16, offset: 1024)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !566, file: !567, line: 56, baseType: !67, size: 16, offset: 1040)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !566, file: !567, line: 57, baseType: !67, size: 16, offset: 1056)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !566, file: !567, line: 57, baseType: !67, size: 16, offset: 1072)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !566, file: !567, line: 59, baseType: !39, size: 32, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !566, file: !567, line: 59, baseType: !39, size: 32, offset: 1120)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !566, file: !567, line: 59, baseType: !39, size: 32, offset: 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !566, file: !567, line: 60, baseType: !39, size: 32, offset: 1184)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !566, file: !567, line: 60, baseType: !39, size: 32, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !566, file: !567, line: 60, baseType: !39, size: 32, offset: 1248)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !566, file: !567, line: 61, baseType: !39, size: 32, offset: 1280)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !566, file: !567, line: 61, baseType: !39, size: 32, offset: 1312)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !566, file: !567, line: 61, baseType: !39, size: 32, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !566, file: !567, line: 68, baseType: !39, size: 32, offset: 1376)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !566, file: !567, line: 68, baseType: !39, size: 32, offset: 1408)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !566, file: !567, line: 68, baseType: !39, size: 32, offset: 1440)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !566, file: !567, line: 69, baseType: !39, size: 32, offset: 1472)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !566, file: !567, line: 69, baseType: !39, size: 32, offset: 1504)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !566, file: !567, line: 74, baseType: !39, size: 32, offset: 1536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !566, file: !567, line: 79, baseType: !39, size: 32, offset: 1568)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !566, file: !567, line: 81, baseType: !67, size: 16, offset: 1600)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !566, file: !567, line: 91, baseType: !67, size: 16, offset: 1616)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !566, file: !567, line: 92, baseType: !67, size: 16, offset: 1632)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !566, file: !567, line: 93, baseType: !67, size: 16, offset: 1648)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !566, file: !567, line: 94, baseType: !67, size: 16, offset: 1664)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !566, file: !567, line: 94, baseType: !67, size: 16, offset: 1680)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !566, file: !567, line: 94, baseType: !67, size: 16, offset: 1696)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !566, file: !567, line: 94, baseType: !67, size: 16, offset: 1712)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !566, file: !567, line: 96, baseType: !39, size: 32, offset: 1728)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !566, file: !567, line: 96, baseType: !39, size: 32, offset: 1760)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !566, file: !567, line: 96, baseType: !39, size: 32, offset: 1792)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !566, file: !567, line: 96, baseType: !39, size: 32, offset: 1824)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !566, file: !567, line: 98, baseType: !39, size: 32, offset: 1856)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !566, file: !567, line: 98, baseType: !39, size: 32, offset: 1888)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !566, file: !567, line: 98, baseType: !39, size: 32, offset: 1920)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !566, file: !567, line: 98, baseType: !39, size: 32, offset: 1952)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !566, file: !567, line: 99, baseType: !39, size: 32, offset: 1984)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !566, file: !567, line: 99, baseType: !39, size: 32, offset: 2016)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !566, file: !567, line: 100, baseType: !39, size: 32, offset: 2048)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !566, file: !567, line: 100, baseType: !39, size: 32, offset: 2080)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !566, file: !567, line: 103, baseType: !67, size: 16, offset: 2112)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !566, file: !567, line: 103, baseType: !67, size: 16, offset: 2128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !566, file: !567, line: 103, baseType: !67, size: 16, offset: 2144)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !566, file: !567, line: 103, baseType: !67, size: 16, offset: 2160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !566, file: !567, line: 106, baseType: !39, size: 32, offset: 2176)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !566, file: !567, line: 106, baseType: !39, size: 32, offset: 2208)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !566, file: !567, line: 106, baseType: !39, size: 32, offset: 2240)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !566, file: !567, line: 106, baseType: !39, size: 32, offset: 2272)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !566, file: !567, line: 107, baseType: !67, size: 16, offset: 2304)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !566, file: !567, line: 107, baseType: !67, size: 16, offset: 2320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !566, file: !567, line: 107, baseType: !67, size: 16, offset: 2336)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !566, file: !567, line: 107, baseType: !67, size: 16, offset: 2352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !566, file: !567, line: 108, baseType: !39, size: 32, offset: 2368)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !566, file: !567, line: 108, baseType: !39, size: 32, offset: 2400)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !566, file: !567, line: 109, baseType: !39, size: 32, offset: 2432)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !566, file: !567, line: 109, baseType: !39, size: 32, offset: 2464)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !566, file: !567, line: 110, baseType: !39, size: 32, offset: 2496)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !566, file: !567, line: 110, baseType: !39, size: 32, offset: 2528)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !566, file: !567, line: 110, baseType: !39, size: 32, offset: 2560)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !566, file: !567, line: 111, baseType: !67, size: 16, offset: 2592)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !566, file: !567, line: 111, baseType: !67, size: 16, offset: 2608)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !566, file: !567, line: 112, baseType: !67, size: 16, offset: 2624)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !566, file: !567, line: 112, baseType: !67, size: 16, offset: 2640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !566, file: !567, line: 112, baseType: !67, size: 16, offset: 2656)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !567, line: 115, baseType: !67, size: 16, offset: 2672)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !566, file: !567, line: 118, baseType: !125, size: 64, offset: 2688)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !566, file: !567, line: 118, baseType: !125, size: 64, offset: 2752)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !566, file: !567, line: 121, baseType: !639, size: 64, offset: 2816)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !180, line: 44, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !566, file: !567, line: 122, baseType: !642, size: 1152, offset: 2880)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 1152, elements: !1249)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !645, line: 57, size: 2496, elements: !646)
!645 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!646 = !{!647, !648, !649, !650, !651, !652, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !644, file: !645, line: 59, baseType: !67, size: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !644, file: !645, line: 59, baseType: !67, size: 16, offset: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !644, file: !645, line: 59, baseType: !67, size: 16, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !644, file: !645, line: 59, baseType: !67, size: 16, offset: 48)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !644, file: !645, line: 60, baseType: !562, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !644, file: !645, line: 61, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !645, line: 202, size: 3328, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !725, !726, !727, !1061, !1062, !1090, !1091, !1159, !1180, !1188, !1189}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !654, file: !645, line: 203, baseType: !142, size: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !654, file: !645, line: 204, baseType: !178, size: 64, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !654, file: !645, line: 206, baseType: !39, size: 32, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !654, file: !645, line: 206, baseType: !39, size: 32, offset: 1056)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !654, file: !645, line: 207, baseType: !39, size: 32, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !654, file: !645, line: 207, baseType: !39, size: 32, offset: 1120)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !654, file: !645, line: 207, baseType: !39, size: 32, offset: 1152)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !654, file: !645, line: 207, baseType: !39, size: 32, offset: 1184)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !654, file: !645, line: 207, baseType: !39, size: 32, offset: 1216)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !654, file: !645, line: 207, baseType: !39, size: 32, offset: 1248)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !654, file: !645, line: 208, baseType: !39, size: 32, offset: 1280)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !654, file: !645, line: 208, baseType: !39, size: 32, offset: 1312)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !654, file: !645, line: 211, baseType: !39, size: 32, offset: 1344)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !654, file: !645, line: 211, baseType: !39, size: 32, offset: 1376)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !654, file: !645, line: 211, baseType: !39, size: 32, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !654, file: !645, line: 211, baseType: !39, size: 32, offset: 1440)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !654, file: !645, line: 211, baseType: !39, size: 32, offset: 1472)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !654, file: !645, line: 214, baseType: !39, size: 32, offset: 1504)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !654, file: !645, line: 214, baseType: !39, size: 32, offset: 1536)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !654, file: !645, line: 217, baseType: !39, size: 32, offset: 1568)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !654, file: !645, line: 218, baseType: !39, size: 32, offset: 1600)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !654, file: !645, line: 219, baseType: !39, size: 32, offset: 1632)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !654, file: !645, line: 220, baseType: !39, size: 32, offset: 1664)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !654, file: !645, line: 221, baseType: !39, size: 32, offset: 1696)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !654, file: !645, line: 222, baseType: !67, size: 16, offset: 1728)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !654, file: !645, line: 222, baseType: !67, size: 16, offset: 1744)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !654, file: !645, line: 224, baseType: !67, size: 16, offset: 1760)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !654, file: !645, line: 224, baseType: !67, size: 16, offset: 1776)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !654, file: !645, line: 227, baseType: !67, size: 16, offset: 1792)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !654, file: !645, line: 227, baseType: !67, size: 16, offset: 1808)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !654, file: !645, line: 229, baseType: !67, size: 16, offset: 1824)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !654, file: !645, line: 229, baseType: !67, size: 16, offset: 1840)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !654, file: !645, line: 230, baseType: !67, size: 16, offset: 1856)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !654, file: !645, line: 230, baseType: !67, size: 16, offset: 1872)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !654, file: !645, line: 232, baseType: !39, size: 32, offset: 1888)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !654, file: !645, line: 232, baseType: !39, size: 32, offset: 1920)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !654, file: !645, line: 232, baseType: !39, size: 32, offset: 1952)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !654, file: !645, line: 232, baseType: !39, size: 32, offset: 1984)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !654, file: !645, line: 233, baseType: !31, size: 32, offset: 2016)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !654, file: !645, line: 234, baseType: !31, size: 32, offset: 2048)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !654, file: !645, line: 235, baseType: !67, size: 16, offset: 2080)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !654, file: !645, line: 235, baseType: !67, size: 16, offset: 2096)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !654, file: !645, line: 236, baseType: !67, size: 16, offset: 2112)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !654, file: !645, line: 239, baseType: !67, size: 16, offset: 2128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !654, file: !645, line: 240, baseType: !31, size: 32, offset: 2144)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !654, file: !645, line: 241, baseType: !31, size: 32, offset: 2176)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !654, file: !645, line: 241, baseType: !31, size: 32, offset: 2208)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !654, file: !645, line: 241, baseType: !31, size: 32, offset: 2240)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !654, file: !645, line: 243, baseType: !39, size: 32, offset: 2272)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !654, file: !645, line: 243, baseType: !39, size: 32, offset: 2304)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !654, file: !645, line: 244, baseType: !39, size: 32, offset: 2336)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !654, file: !645, line: 246, baseType: !708, size: 320, offset: 2368)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !709, line: 50, size: 320, elements: !710)
!709 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !708, file: !709, line: 51, baseType: !556, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !708, file: !709, line: 53, baseType: !31, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !708, file: !709, line: 54, baseType: !31, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !708, file: !709, line: 55, baseType: !31, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !708, file: !709, line: 55, baseType: !31, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !708, file: !709, line: 56, baseType: !35, size: 8, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !708, file: !709, line: 56, baseType: !35, size: 8, offset: 200)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !708, file: !709, line: 57, baseType: !35, size: 8, offset: 208)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !708, file: !709, line: 57, baseType: !35, size: 8, offset: 216)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !708, file: !709, line: 59, baseType: !67, size: 16, offset: 224)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !708, file: !709, line: 59, baseType: !67, size: 16, offset: 240)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !708, file: !709, line: 59, baseType: !67, size: 16, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !708, file: !709, line: 61, baseType: !67, size: 16, offset: 272)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !708, file: !709, line: 63, baseType: !31, size: 32, offset: 288)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !654, file: !645, line: 248, baseType: !138, size: 64, offset: 2688)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !654, file: !645, line: 249, baseType: !639, size: 64, offset: 2752)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !654, file: !645, line: 250, baseType: !728, size: 64, offset: 2816)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !709, line: 77, size: 15424, elements: !730)
!730 = !{!731, !732, !733, !736, !739, !743, !1011, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1050, !1051, !1055}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !729, file: !709, line: 78, baseType: !142, size: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !729, file: !709, line: 80, baseType: !160, size: 8192, offset: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !729, file: !709, line: 82, baseType: !734, size: 64, offset: 9152)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !709, line: 43, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !729, file: !709, line: 83, baseType: !737, size: 64, offset: 9216)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !58, line: 46, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !729, file: !709, line: 86, baseType: !740, size: 64, offset: 9280)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !742, line: 42, flags: DIFlagFwdDecl)
!742 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !729, file: !709, line: 87, baseType: !744, size: 64, offset: 9344)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !746, line: 110, size: 1152, elements: !747)
!746 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !763, !1007, !1008, !1009, !1010}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !746, line: 111, baseType: !744, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !746, line: 111, baseType: !744, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !745, file: !746, line: 114, baseType: !31, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !745, file: !746, line: 114, baseType: !31, size: 32, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !745, file: !746, line: 115, baseType: !67, size: 16, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !745, file: !746, line: 115, baseType: !67, size: 16, offset: 208)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !745, file: !746, line: 118, baseType: !288, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !745, file: !746, line: 120, baseType: !125, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !745, file: !746, line: 122, baseType: !125, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !745, file: !746, line: 125, baseType: !325, size: 128, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !745, file: !746, line: 127, baseType: !31, size: 32, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !745, file: !746, line: 127, baseType: !31, size: 32, offset: 608)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !745, file: !746, line: 130, baseType: !77, size: 128, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !745, file: !746, line: 133, baseType: !762, size: 128, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !325)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !745, file: !746, line: 134, baseType: !764, size: 64, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !746, line: 108, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !746, line: 85, size: 1600, elements: !768)
!768 = !{!769, !771, !772, !776, !777, !778, !779, !780, !781, !782, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !746, line: 86, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !767, file: !746, line: 86, baseType: !770, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !767, file: !746, line: 89, baseType: !773, size: 592, offset: 128)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 592, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 74)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !767, file: !746, line: 90, baseType: !10, size: 32, offset: 736)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !767, file: !746, line: 90, baseType: !10, size: 32, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !767, file: !746, line: 90, baseType: !10, size: 32, offset: 800)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !767, file: !746, line: 91, baseType: !31, size: 32, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !767, file: !746, line: 91, baseType: !31, size: 32, offset: 864)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !767, file: !746, line: 91, baseType: !31, size: 32, offset: 896)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !767, file: !746, line: 93, baseType: !783, size: 64, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !785, line: 93, size: 7552, elements: !786)
!785 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !835, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !947, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !989, !997}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !784, file: !785, line: 94, baseType: !142, size: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !784, file: !785, line: 95, baseType: !178, size: 64, offset: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !784, file: !785, line: 97, baseType: !67, size: 16, offset: 1024)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !785, line: 97, baseType: !67, size: 16, offset: 1040)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !784, file: !785, line: 99, baseType: !39, size: 32, offset: 1056)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !784, file: !785, line: 99, baseType: !39, size: 32, offset: 1088)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !784, file: !785, line: 99, baseType: !39, size: 32, offset: 1120)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !784, file: !785, line: 100, baseType: !39, size: 32, offset: 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !784, file: !785, line: 100, baseType: !39, size: 32, offset: 1184)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !784, file: !785, line: 100, baseType: !39, size: 32, offset: 1216)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !784, file: !785, line: 101, baseType: !39, size: 32, offset: 1248)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !784, file: !785, line: 101, baseType: !39, size: 32, offset: 1280)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !784, file: !785, line: 101, baseType: !39, size: 32, offset: 1312)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !784, file: !785, line: 102, baseType: !39, size: 32, offset: 1344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !784, file: !785, line: 102, baseType: !39, size: 32, offset: 1376)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !784, file: !785, line: 102, baseType: !39, size: 32, offset: 1408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !784, file: !785, line: 103, baseType: !39, size: 32, offset: 1440)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !784, file: !785, line: 103, baseType: !39, size: 32, offset: 1472)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !784, file: !785, line: 103, baseType: !39, size: 32, offset: 1504)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !784, file: !785, line: 103, baseType: !39, size: 32, offset: 1536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !784, file: !785, line: 103, baseType: !39, size: 32, offset: 1568)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !784, file: !785, line: 104, baseType: !39, size: 32, offset: 1600)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !784, file: !785, line: 104, baseType: !39, size: 32, offset: 1632)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !784, file: !785, line: 104, baseType: !39, size: 32, offset: 1664)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !784, file: !785, line: 104, baseType: !39, size: 32, offset: 1696)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !784, file: !785, line: 104, baseType: !39, size: 32, offset: 1728)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !784, file: !785, line: 105, baseType: !39, size: 32, offset: 1760)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !784, file: !785, line: 108, baseType: !815, size: 704, offset: 1792)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !785, line: 53, size: 704, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !815, file: !785, line: 54, baseType: !39, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !815, file: !785, line: 55, baseType: !39, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !815, file: !785, line: 56, baseType: !39, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !815, file: !785, line: 57, baseType: !39, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !815, file: !785, line: 59, baseType: !510, size: 96, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !815, file: !785, line: 60, baseType: !510, size: 96, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !815, file: !785, line: 61, baseType: !510, size: 96, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !815, file: !785, line: 63, baseType: !39, size: 32, offset: 416)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !815, file: !785, line: 64, baseType: !39, size: 32, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !815, file: !785, line: 65, baseType: !39, size: 32, offset: 480)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !815, file: !785, line: 67, baseType: !67, size: 16, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !815, file: !785, line: 68, baseType: !67, size: 16, offset: 528)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !815, file: !785, line: 69, baseType: !67, size: 16, offset: 544)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !815, file: !785, line: 70, baseType: !67, size: 16, offset: 560)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !815, file: !785, line: 72, baseType: !39, size: 32, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !815, file: !785, line: 73, baseType: !39, size: 32, offset: 608)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !815, file: !785, line: 74, baseType: !39, size: 32, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !815, file: !785, line: 75, baseType: !39, size: 32, offset: 672)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !784, file: !785, line: 109, baseType: !836, size: 128, offset: 2496)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !785, line: 79, size: 128, elements: !837)
!837 = !{!838, !839, !840, !841}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !785, line: 80, baseType: !31, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !836, file: !785, line: 81, baseType: !31, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !836, file: !785, line: 82, baseType: !31, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !836, file: !785, line: 83, baseType: !31, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !784, file: !785, line: 111, baseType: !39, size: 32, offset: 2624)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !784, file: !785, line: 111, baseType: !39, size: 32, offset: 2656)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !784, file: !785, line: 112, baseType: !39, size: 32, offset: 2688)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !784, file: !785, line: 112, baseType: !39, size: 32, offset: 2720)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !784, file: !785, line: 113, baseType: !39, size: 32, offset: 2752)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !784, file: !785, line: 114, baseType: !39, size: 32, offset: 2784)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !784, file: !785, line: 114, baseType: !39, size: 32, offset: 2816)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !784, file: !785, line: 115, baseType: !67, size: 16, offset: 2848)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !784, file: !785, line: 115, baseType: !67, size: 16, offset: 2864)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !784, file: !785, line: 116, baseType: !67, size: 16, offset: 2880)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !784, file: !785, line: 117, baseType: !35, size: 8, offset: 2896)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !784, file: !785, line: 117, baseType: !35, size: 8, offset: 2904)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !784, file: !785, line: 119, baseType: !39, size: 32, offset: 2912)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !784, file: !785, line: 119, baseType: !39, size: 32, offset: 2944)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !784, file: !785, line: 120, baseType: !67, size: 16, offset: 2976)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !784, file: !785, line: 120, baseType: !67, size: 16, offset: 2992)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !784, file: !785, line: 121, baseType: !39, size: 32, offset: 3008)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !784, file: !785, line: 121, baseType: !39, size: 32, offset: 3040)
