; ModuleID = 'blender/source/blender/editors/screen/screendump.c'
source_filename = "blender/source/blender/editors/screen/screendump.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cursor", scope: !2, file: !3, line: 446, type: !17, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "screencast_cursor_toggle", scope: !3, file: !3, line: 444, type: !4, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1458, retainedNodes: !1575)
!3 = !DIFile(filename: "blender/source/blender/editors/screen/screendump.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !46}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmWindowManager", file: !8, line: 160, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !8, line: 128, size: 2816, elements: !10)
!10 = !{!11, !83, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1437, !1438, !1439, !1440, !1441, !1452, !1453, !1454, !1455, !1456, !1457}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !8, line: 129, baseType: !12, size: 960)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !13, line: 130, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !13, line: 117, size: 960, elements: !15)
!15 = !{!16, !18, !19, !21, !41, !45, !47, !49, !50, !51}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 118, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !14, file: !13, line: 118, baseType: !17, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !14, file: !13, line: 119, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !14, file: !13, line: 120, baseType: !22, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !13, line: 136, size: 17600, elements: !24)
!24 = !{!25, !26, !28, !31, !36, !37, !38}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !23, file: !13, line: 137, baseType: !12, size: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !23, file: !13, line: 138, baseType: !27, size: 64, offset: 960)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !23, file: !13, line: 139, baseType: !29, size: 64, offset: 1024)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !13, line: 43, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !13, line: 140, baseType: !32, size: 8192, offset: 1088)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8192, elements: !34)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 1024)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !23, file: !13, line: 141, baseType: !32, size: 8192, offset: 9280)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !23, file: !13, line: 148, baseType: !22, size: 64, offset: 17472)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !23, file: !13, line: 150, baseType: !39, size: 64, offset: 17536)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !13, line: 45, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 121, baseType: !42, size: 528, offset: 256)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 528, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 66)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !14, file: !13, line: 126, baseType: !46, size: 16, offset: 784)
!46 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !14, file: !13, line: 127, baseType: !48, size: 32, offset: 800)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 864)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !14, file: !13, line: 129, baseType: !52, size: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !13, line: 75, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !13, line: 62, size: 1024, elements: !55)
!55 = !{!56, !58, !59, !60, !61, !62, !66, !67, !81, !82}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !13, line: 63, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !13, line: 63, baseType: !57, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 136)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !13, line: 65, baseType: !46, size: 16, offset: 144)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !13, line: 66, baseType: !63, size: 512, offset: 160)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !54, file: !13, line: 67, baseType: !48, size: 32, offset: 672)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !13, line: 69, baseType: !68, size: 256, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !13, line: 60, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !13, line: 48, size: 256, elements: !70)
!70 = !{!71, !72, !79, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !69, file: !13, line: 49, baseType: !17, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !69, file: !13, line: 58, baseType: !73, size: 128, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !74, line: 71, baseType: !75)
!74 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !74, line: 69, size: 128, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !75, file: !74, line: 70, baseType: !17, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !75, file: !74, line: 70, baseType: !17, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !13, line: 70, baseType: !48, size: 32, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !54, file: !13, line: 74, baseType: !48, size: 32, offset: 992)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !9, file: !8, line: 131, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !8, line: 169, size: 2048, elements: !86)
!86 = !{!87, !88, !89, !90, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1396, !1399, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !8, line: 170, baseType: !84, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !8, line: 170, baseType: !84, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !85, file: !8, line: 172, baseType: !17, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !85, file: !8, line: 174, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !93, line: 49, size: 1984, elements: !94)
!93 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = !{!95, !96, !97, !98, !99, !100, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1336}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !93, line: 50, baseType: !12, size: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !92, file: !93, line: 52, baseType: !73, size: 128, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !92, file: !93, line: 53, baseType: !73, size: 128, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !92, file: !93, line: 54, baseType: !73, size: 128, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !92, file: !93, line: 55, baseType: !73, size: 128, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !92, file: !93, line: 57, baseType: !101, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !103, line: 1216, size: 39680, elements: !104)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = !{!105, !106, !109, !112, !115, !116, !117, !130, !131, !136, !137, !138, !139, !140, !141, !142, !143, !144, !148, !227, !665, !881, !884, !1173, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1198, !1199, !1207, !1274, !1281, !1282, !1289, !1290, !1296, !1297, !1298, !1299, !1300}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !102, file: !103, line: 1217, baseType: !12, size: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !102, file: !103, line: 1218, baseType: !107, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !103, line: 58, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !102, file: !103, line: 1220, baseType: !110, size: 64, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !103, line: 50, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !102, file: !103, line: 1221, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !103, line: 52, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !102, file: !103, line: 1223, baseType: !101, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !102, file: !103, line: 1225, baseType: !73, size: 128, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !102, file: !103, line: 1226, baseType: !118, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !103, line: 69, size: 320, elements: !120)
!120 = !{!121, !122, !123, !125, !126, !127, !128, !129}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !103, line: 70, baseType: !118, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !103, line: 70, baseType: !118, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !119, file: !103, line: 71, baseType: !124, size: 32, offset: 128)
!124 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !119, file: !103, line: 71, baseType: !124, size: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !119, file: !103, line: 72, baseType: !48, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !119, file: !103, line: 73, baseType: !46, size: 16, offset: 224)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !119, file: !103, line: 73, baseType: !46, size: 16, offset: 240)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !119, file: !103, line: 74, baseType: !110, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !102, file: !103, line: 1227, baseType: !110, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !102, file: !103, line: 1229, baseType: !132, size: 96, offset: 1472)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !134)
!133 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!134 = !{!135}
!135 = !DISubrange(count: 3)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !102, file: !103, line: 1230, baseType: !132, size: 96, offset: 1568)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !102, file: !103, line: 1231, baseType: !132, size: 96, offset: 1664)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !102, file: !103, line: 1231, baseType: !132, size: 96, offset: 1760)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !102, file: !103, line: 1233, baseType: !124, size: 32, offset: 1856)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !102, file: !103, line: 1234, baseType: !48, size: 32, offset: 1888)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !102, file: !103, line: 1235, baseType: !124, size: 32, offset: 1920)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !102, file: !103, line: 1237, baseType: !46, size: 16, offset: 1952)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !102, file: !103, line: 1239, baseType: !33, size: 8, offset: 1968)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !102, file: !103, line: 1240, baseType: !145, size: 8, offset: 1976)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 1)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !102, file: !103, line: 1242, baseType: !149, size: 64, offset: 1984)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !151, line: 328, size: 3456, elements: !152)
!151 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!152 = !{!153, !154, !155, !158, !159, !162, !165, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !192, !193, !194, !197, !202, !203, !206, !210, !215, !219, !223, !224, !225, !226}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !150, file: !151, line: 329, baseType: !12, size: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !150, file: !151, line: 330, baseType: !107, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !150, file: !151, line: 332, baseType: !156, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !151, line: 332, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !150, file: !151, line: 333, baseType: !63, size: 512, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !150, file: !151, line: 335, baseType: !160, size: 64, offset: 1600)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !151, line: 335, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !150, file: !151, line: 337, baseType: !163, size: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !103, line: 61, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !150, file: !151, line: 338, baseType: !166, size: 64, offset: 1728)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 2)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !150, file: !151, line: 340, baseType: !73, size: 128, offset: 1792)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !150, file: !151, line: 340, baseType: !73, size: 128, offset: 1920)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !150, file: !151, line: 342, baseType: !48, size: 32, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !150, file: !151, line: 342, baseType: !48, size: 32, offset: 2080)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !150, file: !151, line: 343, baseType: !48, size: 32, offset: 2112)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !151, line: 345, baseType: !48, size: 32, offset: 2144)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !150, file: !151, line: 346, baseType: !48, size: 32, offset: 2176)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !150, file: !151, line: 347, baseType: !46, size: 16, offset: 2208)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !150, file: !151, line: 348, baseType: !46, size: 16, offset: 2224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !150, file: !151, line: 349, baseType: !48, size: 32, offset: 2240)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !150, file: !151, line: 351, baseType: !48, size: 32, offset: 2272)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !150, file: !151, line: 353, baseType: !46, size: 16, offset: 2304)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !150, file: !151, line: 354, baseType: !46, size: 16, offset: 2320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !150, file: !151, line: 355, baseType: !48, size: 32, offset: 2336)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !150, file: !151, line: 357, baseType: !184, size: 128, offset: 2368)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !185, line: 95, baseType: !186)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !185, line: 92, size: 128, elements: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !186, file: !185, line: 93, baseType: !133, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !186, file: !185, line: 93, baseType: !133, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !186, file: !185, line: 94, baseType: !133, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !186, file: !185, line: 94, baseType: !133, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !150, file: !151, line: 363, baseType: !73, size: 128, offset: 2496)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !150, file: !151, line: 363, baseType: !73, size: 128, offset: 2624)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !150, file: !151, line: 368, baseType: !195, size: 64, offset: 2752)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !151, line: 48, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !150, file: !151, line: 372, baseType: !198, size: 32, offset: 2816)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !151, line: 274, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !151, line: 271, size: 32, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !151, line: 273, baseType: !124, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !150, file: !151, line: 373, baseType: !48, size: 32, offset: 2848)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !150, file: !151, line: 382, baseType: !204, size: 64, offset: 2880)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !151, line: 46, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !150, file: !151, line: 385, baseType: !207, size: 64, offset: 2944)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !17, !133}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !150, file: !151, line: 386, baseType: !211, size: 64, offset: 3008)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !17, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !150, file: !151, line: 387, baseType: !216, size: 64, offset: 3072)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!48, !17}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !150, file: !151, line: 388, baseType: !220, size: 64, offset: 3136)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !17}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !150, file: !151, line: 389, baseType: !17, size: 64, offset: 3200)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !150, file: !151, line: 389, baseType: !17, size: 64, offset: 3264)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !150, file: !151, line: 389, baseType: !17, size: 64, offset: 3328)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !150, file: !151, line: 389, baseType: !17, size: 64, offset: 3392)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !102, file: !103, line: 1244, baseType: !228, size: 64, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !230, line: 200, size: 17024, elements: !231)
!230 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!231 = !{!232, !234, !235, !236, !658, !659, !660, !661, !662, !663, !664}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !229, file: !230, line: 201, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !229, file: !230, line: 202, baseType: !73, size: 128, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !229, file: !230, line: 203, baseType: !73, size: 128, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !229, file: !230, line: 206, baseType: !237, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !230, line: 190, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !230, line: 126, size: 2816, elements: !240)
!240 = !{!241, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !340, !343, !344, !345, !630, !633, !634, !635, !636, !637, !638, !639, !640, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !657}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !230, line: 127, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !230, line: 127, baseType: !242, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !239, file: !230, line: 128, baseType: !17, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !239, file: !230, line: 129, baseType: !17, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !230, line: 130, baseType: !63, size: 512, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !230, line: 132, baseType: !48, size: 32, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !239, file: !230, line: 132, baseType: !48, size: 32, offset: 800)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !239, file: !230, line: 133, baseType: !48, size: 32, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !239, file: !230, line: 134, baseType: !48, size: 32, offset: 864)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !239, file: !230, line: 134, baseType: !48, size: 32, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !239, file: !230, line: 134, baseType: !48, size: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !239, file: !230, line: 135, baseType: !48, size: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !239, file: !230, line: 135, baseType: !48, size: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !239, file: !230, line: 136, baseType: !48, size: 32, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !239, file: !230, line: 136, baseType: !48, size: 32, offset: 1056)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !239, file: !230, line: 137, baseType: !48, size: 32, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !239, file: !230, line: 137, baseType: !48, size: 32, offset: 1120)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !239, file: !230, line: 138, baseType: !133, size: 32, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !239, file: !230, line: 139, baseType: !133, size: 32, offset: 1184)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !239, file: !230, line: 139, baseType: !133, size: 32, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !239, file: !230, line: 141, baseType: !46, size: 16, offset: 1248)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !239, file: !230, line: 142, baseType: !46, size: 16, offset: 1264)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !239, file: !230, line: 143, baseType: !48, size: 32, offset: 1280)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !239, file: !230, line: 144, baseType: !48, size: 32, offset: 1312)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !239, file: !230, line: 146, baseType: !267, size: 64, offset: 1344)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !230, line: 114, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !230, line: 99, size: 7232, elements: !270)
!270 = !{!271, !273, !274, !275, !276, !277, !278, !289, !293, !308, !317, !324, !334}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !230, line: 100, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !269, file: !230, line: 100, baseType: !272, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !269, file: !230, line: 101, baseType: !48, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !269, file: !230, line: 101, baseType: !48, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !269, file: !230, line: 102, baseType: !48, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !269, file: !230, line: 102, baseType: !48, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !269, file: !230, line: 103, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !230, line: 59, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !230, line: 56, size: 2112, elements: !282)
!282 = !{!283, !287, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !230, line: 57, baseType: !284, size: 2048)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !281, file: !230, line: 58, baseType: !48, size: 32, offset: 2048)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !281, file: !230, line: 58, baseType: !48, size: 32, offset: 2080)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !269, file: !230, line: 106, baseType: !290, size: 6144, offset: 320)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 6144, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !269, file: !230, line: 107, baseType: !294, size: 64, offset: 6464)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !230, line: 97, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !230, line: 83, size: 8320, elements: !297)
!297 = !{!298, !299, !300, !304, !305, !306, !307}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !296, file: !230, line: 84, baseType: !290, size: 6144)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !296, file: !230, line: 87, baseType: !284, size: 2048, offset: 6144)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !296, file: !230, line: 88, baseType: !301, size: 64, offset: 8192)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !303, line: 85, flags: DIFlagFwdDecl)
!303 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !296, file: !230, line: 90, baseType: !46, size: 16, offset: 8256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !296, file: !230, line: 92, baseType: !46, size: 16, offset: 8272)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !296, file: !230, line: 93, baseType: !46, size: 16, offset: 8288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !296, file: !230, line: 95, baseType: !46, size: 16, offset: 8304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !269, file: !230, line: 108, baseType: !309, size: 64, offset: 6528)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !230, line: 66, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !230, line: 61, size: 128, elements: !312)
!312 = !{!313, !314, !315, !316}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !311, file: !230, line: 62, baseType: !48, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !311, file: !230, line: 63, baseType: !48, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !311, file: !230, line: 64, baseType: !48, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !311, file: !230, line: 65, baseType: !48, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !269, file: !230, line: 109, baseType: !318, size: 64, offset: 6592)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !230, line: 71, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !230, line: 68, size: 64, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !320, file: !230, line: 69, baseType: !48, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !320, file: !230, line: 70, baseType: !48, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !269, file: !230, line: 110, baseType: !325, size: 64, offset: 6656)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !230, line: 81, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !230, line: 73, size: 352, elements: !328)
!328 = !{!329, !330, !331, !332, !333}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !327, file: !230, line: 74, baseType: !132, size: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !327, file: !230, line: 75, baseType: !132, size: 96, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !327, file: !230, line: 76, baseType: !132, size: 96, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !230, line: 77, baseType: !48, size: 32, offset: 288)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !327, file: !230, line: 78, baseType: !48, size: 32, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !269, file: !230, line: 113, baseType: !335, size: 512, offset: 6720)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !336, line: 182, baseType: !337)
!336 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !336, line: 180, size: 512, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !336, line: 181, baseType: !63, size: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !239, file: !230, line: 148, baseType: !341, size: 64, offset: 1408)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !230, line: 49, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !239, file: !230, line: 151, baseType: !101, size: 64, offset: 1472)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !239, file: !230, line: 152, baseType: !110, size: 64, offset: 1536)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !239, file: !230, line: 153, baseType: !346, size: 64, offset: 1600)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !348, line: 64, size: 19136, elements: !349)
!348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = !{!350, !351, !352, !353, !354, !355, !357, !358, !359, !360, !363, !364, !616, !617, !625, !626, !627, !628, !629}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !347, file: !348, line: 65, baseType: !12, size: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !347, file: !348, line: 66, baseType: !107, size: 64, offset: 960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !348, line: 68, baseType: !32, size: 8192, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !347, file: !348, line: 70, baseType: !48, size: 32, offset: 9216)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !347, file: !348, line: 71, baseType: !48, size: 32, offset: 9248)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !347, file: !348, line: 72, baseType: !356, size: 64, offset: 9280)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !167)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !347, file: !348, line: 74, baseType: !133, size: 32, offset: 9344)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !347, file: !348, line: 74, baseType: !133, size: 32, offset: 9376)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !347, file: !348, line: 76, baseType: !301, size: 64, offset: 9408)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !347, file: !348, line: 77, baseType: !361, size: 64, offset: 9472)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !348, line: 77, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !347, file: !348, line: 78, baseType: !163, size: 64, offset: 9536)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !347, file: !348, line: 80, baseType: !365, size: 2624, offset: 9600)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !366, line: 340, size: 2624, elements: !367)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !{!368, !396, !414, !415, !416, !434, !492, !493, !596, !597, !598, !599, !605}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !365, file: !366, line: 341, baseType: !369, size: 576)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !366, line: 251, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !366, line: 207, size: 576, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !366, line: 208, baseType: !48, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !370, file: !366, line: 211, baseType: !46, size: 16, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !370, file: !366, line: 212, baseType: !46, size: 16, offset: 48)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !370, file: !366, line: 213, baseType: !133, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !370, file: !366, line: 214, baseType: !46, size: 16, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !370, file: !366, line: 215, baseType: !46, size: 16, offset: 112)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !370, file: !366, line: 216, baseType: !46, size: 16, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !370, file: !366, line: 217, baseType: !46, size: 16, offset: 144)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !370, file: !366, line: 218, baseType: !46, size: 16, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !370, file: !366, line: 219, baseType: !46, size: 16, offset: 176)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !370, file: !366, line: 220, baseType: !133, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !370, file: !366, line: 222, baseType: !46, size: 16, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !370, file: !366, line: 225, baseType: !46, size: 16, offset: 240)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !370, file: !366, line: 228, baseType: !48, size: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !370, file: !366, line: 229, baseType: !48, size: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !370, file: !366, line: 233, baseType: !48, size: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !370, file: !366, line: 236, baseType: !46, size: 16, offset: 352)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !370, file: !366, line: 236, baseType: !46, size: 16, offset: 368)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !370, file: !366, line: 241, baseType: !133, size: 32, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !370, file: !366, line: 244, baseType: !48, size: 32, offset: 416)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !370, file: !366, line: 244, baseType: !48, size: 32, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !370, file: !366, line: 245, baseType: !133, size: 32, offset: 480)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !370, file: !366, line: 248, baseType: !133, size: 32, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !370, file: !366, line: 250, baseType: !48, size: 32, offset: 544)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !365, file: !366, line: 342, baseType: !397, size: 448, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !366, line: 79, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !366, line: 61, size: 448, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !398, file: !366, line: 62, baseType: !17, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !398, file: !366, line: 64, baseType: !46, size: 16, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !398, file: !366, line: 65, baseType: !46, size: 16, offset: 80)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !398, file: !366, line: 67, baseType: !133, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !398, file: !366, line: 68, baseType: !133, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !398, file: !366, line: 69, baseType: !133, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !398, file: !366, line: 70, baseType: !46, size: 16, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !398, file: !366, line: 71, baseType: !46, size: 16, offset: 208)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !398, file: !366, line: 72, baseType: !166, size: 64, offset: 224)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !398, file: !366, line: 75, baseType: !133, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !398, file: !366, line: 75, baseType: !133, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !398, file: !366, line: 75, baseType: !133, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !398, file: !366, line: 78, baseType: !133, size: 32, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !398, file: !366, line: 78, baseType: !133, size: 32, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !365, file: !366, line: 343, baseType: !73, size: 128, offset: 1024)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !365, file: !366, line: 344, baseType: !73, size: 128, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !365, file: !366, line: 345, baseType: !417, size: 192, offset: 1280)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !366, line: 278, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !366, line: 270, size: 192, elements: !419)
!419 = !{!420, !421, !422, !423, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !418, file: !366, line: 271, baseType: !48, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !418, file: !366, line: 273, baseType: !133, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !418, file: !366, line: 275, baseType: !48, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !418, file: !366, line: 276, baseType: !48, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !418, file: !366, line: 277, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !366, line: 55, size: 576, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !426, file: !366, line: 56, baseType: !48, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !426, file: !366, line: 57, baseType: !133, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !426, file: !366, line: 58, baseType: !431, size: 512, offset: 64)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 512, elements: !432)
!432 = !{!433, !433}
!433 = !DISubrange(count: 4)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !365, file: !366, line: 346, baseType: !435, size: 384, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !366, line: 268, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !366, line: 253, size: 384, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !486, !487, !488, !489, !490, !491}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !366, line: 254, baseType: !48, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !436, file: !366, line: 255, baseType: !48, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !436, file: !366, line: 255, baseType: !48, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !436, file: !366, line: 258, baseType: !133, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !436, file: !366, line: 259, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !366, line: 164, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !366, line: 108, size: 1664, elements: !446)
!446 = !{!447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !366, line: 109, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !445, file: !366, line: 109, baseType: !448, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !366, line: 111, baseType: !63, size: 512, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !445, file: !366, line: 119, baseType: !166, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !445, file: !366, line: 119, baseType: !166, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !445, file: !366, line: 125, baseType: !166, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !445, file: !366, line: 125, baseType: !166, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !445, file: !366, line: 127, baseType: !166, size: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !445, file: !366, line: 130, baseType: !48, size: 32, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !445, file: !366, line: 131, baseType: !48, size: 32, offset: 992)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !445, file: !366, line: 132, baseType: !459, size: 64, offset: 1024)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !366, line: 106, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !366, line: 81, size: 512, elements: !462)
!462 = !{!463, !464, !467, !468, !469, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !461, file: !366, line: 82, baseType: !166, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !461, file: !366, line: 97, baseType: !465, size: 256, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !466)
!466 = !{!433, !168}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !461, file: !366, line: 102, baseType: !166, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !461, file: !366, line: 102, baseType: !166, size: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !461, file: !366, line: 104, baseType: !48, size: 32, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !366, line: 105, baseType: !48, size: 32, offset: 480)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !445, file: !366, line: 135, baseType: !132, size: 96, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !445, file: !366, line: 136, baseType: !133, size: 32, offset: 1184)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !366, line: 139, baseType: !48, size: 32, offset: 1216)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !445, file: !366, line: 139, baseType: !48, size: 32, offset: 1248)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !445, file: !366, line: 139, baseType: !48, size: 32, offset: 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !445, file: !366, line: 140, baseType: !132, size: 96, offset: 1312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !445, file: !366, line: 143, baseType: !46, size: 16, offset: 1408)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !445, file: !366, line: 144, baseType: !46, size: 16, offset: 1424)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !445, file: !366, line: 145, baseType: !46, size: 16, offset: 1440)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !445, file: !366, line: 148, baseType: !46, size: 16, offset: 1456)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !445, file: !366, line: 149, baseType: !48, size: 32, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !445, file: !366, line: 150, baseType: !133, size: 32, offset: 1504)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !445, file: !366, line: 152, baseType: !163, size: 64, offset: 1536)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !445, file: !366, line: 163, baseType: !133, size: 32, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !445, file: !366, line: 163, baseType: !133, size: 32, offset: 1632)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !436, file: !366, line: 261, baseType: !133, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !436, file: !366, line: 261, baseType: !133, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !436, file: !366, line: 261, baseType: !133, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !436, file: !366, line: 263, baseType: !48, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !436, file: !366, line: 266, baseType: !48, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !436, file: !366, line: 267, baseType: !133, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !365, file: !366, line: 347, baseType: !443, size: 64, offset: 1856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !365, file: !366, line: 348, baseType: !494, size: 64, offset: 1920)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !366, line: 205, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !366, line: 186, size: 1024, elements: !497)
!497 = !{!498, !500, !501, !502, !504, !505, !506, !514, !515, !516, !594, !595}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !366, line: 187, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !366, line: 187, baseType: !499, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !496, file: !366, line: 189, baseType: !63, size: 512, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !496, file: !366, line: 191, baseType: !503, size: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !496, file: !366, line: 193, baseType: !48, size: 32, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !496, file: !366, line: 193, baseType: !48, size: 32, offset: 736)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !496, file: !366, line: 195, baseType: !507, size: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !366, line: 184, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !366, line: 166, size: 320, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !509, file: !366, line: 180, baseType: !465, size: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !509, file: !366, line: 182, baseType: !48, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !366, line: 183, baseType: !48, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !496, file: !366, line: 196, baseType: !48, size: 32, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !366, line: 198, baseType: !48, size: 32, offset: 864)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !496, file: !366, line: 200, baseType: !517, size: 64, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !519, line: 77, size: 15424, elements: !520)
!519 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!520 = !{!521, !522, !523, !526, !529, !530, !533, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !553, !554, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !580, !581, !582, !583, !584, !588}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !518, file: !519, line: 78, baseType: !12, size: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !519, line: 80, baseType: !32, size: 8192, offset: 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !518, file: !519, line: 82, baseType: !524, size: 64, offset: 9152)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !519, line: 43, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !518, file: !519, line: 83, baseType: !527, size: 64, offset: 9216)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !13, line: 46, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !518, file: !519, line: 86, baseType: !301, size: 64, offset: 9280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !518, file: !519, line: 87, baseType: !531, size: 64, offset: 9344)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !519, line: 44, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !518, file: !519, line: 89, baseType: !534, size: 512, offset: 9408)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 512, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 8)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !518, file: !519, line: 90, baseType: !46, size: 16, offset: 9920)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !518, file: !519, line: 90, baseType: !46, size: 16, offset: 9936)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !518, file: !519, line: 92, baseType: !46, size: 16, offset: 9952)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !518, file: !519, line: 92, baseType: !46, size: 16, offset: 9968)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !518, file: !519, line: 93, baseType: !46, size: 16, offset: 9984)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !519, line: 93, baseType: !46, size: 16, offset: 10000)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !518, file: !519, line: 94, baseType: !48, size: 32, offset: 10016)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !518, file: !519, line: 97, baseType: !46, size: 16, offset: 10048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !518, file: !519, line: 97, baseType: !46, size: 16, offset: 10064)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !518, file: !519, line: 98, baseType: !46, size: 16, offset: 10080)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !518, file: !519, line: 98, baseType: !46, size: 16, offset: 10096)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !518, file: !519, line: 99, baseType: !46, size: 16, offset: 10112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !518, file: !519, line: 99, baseType: !46, size: 16, offset: 10128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !518, file: !519, line: 100, baseType: !124, size: 32, offset: 10144)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !518, file: !519, line: 101, baseType: !552, size: 64, offset: 10176)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !518, file: !519, line: 103, baseType: !39, size: 64, offset: 10240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !518, file: !519, line: 104, baseType: !555, size: 64, offset: 10304)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !13, line: 159, size: 448, elements: !557)
!557 = !{!558, !560, !561, !563, !564, !566}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !556, file: !13, line: 161, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 64, elements: !167)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !556, file: !13, line: 162, baseType: !559, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !556, file: !13, line: 163, baseType: !562, size: 32, offset: 128)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !167)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !556, file: !13, line: 164, baseType: !562, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !556, file: !13, line: 165, baseType: !565, size: 128, offset: 192)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 128, elements: !167)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !556, file: !13, line: 166, baseType: !567, size: 128, offset: 320)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 128, elements: !167)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !518, file: !519, line: 107, baseType: !133, size: 32, offset: 10368)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !518, file: !519, line: 108, baseType: !48, size: 32, offset: 10400)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !518, file: !519, line: 109, baseType: !46, size: 16, offset: 10432)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !518, file: !519, line: 110, baseType: !46, size: 16, offset: 10448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !518, file: !519, line: 113, baseType: !48, size: 32, offset: 10464)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !518, file: !519, line: 113, baseType: !48, size: 32, offset: 10496)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !518, file: !519, line: 114, baseType: !33, size: 8, offset: 10528)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !518, file: !519, line: 114, baseType: !33, size: 8, offset: 10536)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !518, file: !519, line: 115, baseType: !46, size: 16, offset: 10544)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !518, file: !519, line: 116, baseType: !578, size: 128, offset: 10560)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !579)
!579 = !{!433}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !518, file: !519, line: 119, baseType: !133, size: 32, offset: 10688)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !518, file: !519, line: 119, baseType: !133, size: 32, offset: 10720)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !518, file: !519, line: 122, baseType: !335, size: 512, offset: 10752)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !518, file: !519, line: 123, baseType: !33, size: 8, offset: 11264)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !518, file: !519, line: 125, baseType: !585, size: 56, offset: 11272)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 56, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 7)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !518, file: !519, line: 126, baseType: !589, size: 4096, offset: 11328)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 4096, elements: !535)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !519, line: 69, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !519, line: 67, size: 512, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !591, file: !519, line: 68, baseType: !63, size: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !496, file: !366, line: 201, baseType: !133, size: 32, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !496, file: !366, line: 204, baseType: !48, size: 32, offset: 992)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !365, file: !366, line: 350, baseType: !73, size: 128, offset: 1984)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !365, file: !366, line: 351, baseType: !48, size: 32, offset: 2112)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !365, file: !366, line: 351, baseType: !48, size: 32, offset: 2144)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !365, file: !366, line: 353, baseType: !600, size: 64, offset: 2176)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !366, line: 297, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !366, line: 295, size: 2048, elements: !603)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !602, file: !366, line: 296, baseType: !284, size: 2048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !365, file: !366, line: 355, baseType: !606, size: 384, offset: 2240)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !366, line: 338, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !366, line: 322, size: 384, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !607, file: !366, line: 323, baseType: !48, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !607, file: !366, line: 325, baseType: !46, size: 16, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !607, file: !366, line: 326, baseType: !46, size: 16, offset: 48)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !607, file: !366, line: 331, baseType: !73, size: 128, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !607, file: !366, line: 334, baseType: !73, size: 128, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !607, file: !366, line: 335, baseType: !48, size: 32, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !607, file: !366, line: 337, baseType: !48, size: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !347, file: !348, line: 81, baseType: !17, size: 64, offset: 12224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !347, file: !348, line: 85, baseType: !618, size: 6208, offset: 12288)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !348, line: 55, size: 6208, elements: !619)
!619 = !{!620, !621, !622, !623, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !618, file: !348, line: 56, baseType: !290, size: 6144)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !618, file: !348, line: 58, baseType: !46, size: 16, offset: 6144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !618, file: !348, line: 59, baseType: !46, size: 16, offset: 6160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !618, file: !348, line: 60, baseType: !46, size: 16, offset: 6176)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !618, file: !348, line: 61, baseType: !46, size: 16, offset: 6192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !348, line: 86, baseType: !48, size: 32, offset: 18496)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !347, file: !348, line: 88, baseType: !48, size: 32, offset: 18528)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !347, file: !348, line: 90, baseType: !48, size: 32, offset: 18560)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !347, file: !348, line: 94, baseType: !48, size: 32, offset: 18592)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !347, file: !348, line: 100, baseType: !335, size: 512, offset: 18624)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !239, file: !230, line: 154, baseType: !631, size: 64, offset: 1664)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !230, line: 154, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !239, file: !230, line: 156, baseType: !301, size: 64, offset: 1728)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !239, file: !230, line: 158, baseType: !133, size: 32, offset: 1792)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !239, file: !230, line: 159, baseType: !133, size: 32, offset: 1824)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !239, file: !230, line: 162, baseType: !242, size: 64, offset: 1856)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !239, file: !230, line: 162, baseType: !242, size: 64, offset: 1920)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !239, file: !230, line: 162, baseType: !242, size: 64, offset: 1984)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !239, file: !230, line: 164, baseType: !73, size: 128, offset: 2048)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !239, file: !230, line: 166, baseType: !641, size: 64, offset: 2176)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !230, line: 51, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !239, file: !230, line: 167, baseType: !17, size: 64, offset: 2240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !239, file: !230, line: 168, baseType: !133, size: 32, offset: 2304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !239, file: !230, line: 170, baseType: !133, size: 32, offset: 2336)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !239, file: !230, line: 170, baseType: !133, size: 32, offset: 2368)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !239, file: !230, line: 171, baseType: !133, size: 32, offset: 2400)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !239, file: !230, line: 173, baseType: !17, size: 64, offset: 2432)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !239, file: !230, line: 175, baseType: !48, size: 32, offset: 2496)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !239, file: !230, line: 176, baseType: !48, size: 32, offset: 2528)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !239, file: !230, line: 179, baseType: !48, size: 32, offset: 2560)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !239, file: !230, line: 180, baseType: !133, size: 32, offset: 2592)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !239, file: !230, line: 183, baseType: !48, size: 32, offset: 2624)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !239, file: !230, line: 185, baseType: !33, size: 8, offset: 2656)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !239, file: !230, line: 186, baseType: !656, size: 24, offset: 2664)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, elements: !134)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !239, file: !230, line: 189, baseType: !73, size: 128, offset: 2688)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !229, file: !230, line: 207, baseType: !32, size: 8192, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !229, file: !230, line: 208, baseType: !32, size: 8192, offset: 8576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !229, file: !230, line: 210, baseType: !48, size: 32, offset: 16768)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !229, file: !230, line: 210, baseType: !48, size: 32, offset: 16800)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !229, file: !230, line: 211, baseType: !48, size: 32, offset: 16832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !229, file: !230, line: 211, baseType: !48, size: 32, offset: 16864)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !229, file: !230, line: 212, baseType: !184, size: 128, offset: 16896)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !102, file: !103, line: 1246, baseType: !666, size: 64, offset: 2112)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !103, line: 1067, size: 5184, elements: !668)
!668 = !{!669, !699, !700, !715, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !737, !753, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !864}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !667, file: !103, line: 1068, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !103, line: 934, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !103, line: 925, size: 576, elements: !673)
!673 = !{!674, !691, !692, !693, !694, !695, !698}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !672, file: !103, line: 926, baseType: !675, size: 320)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !103, line: 830, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !103, line: 813, size: 320, elements: !677)
!677 = !{!678, !681, !684, !685, !688, !689, !690}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !676, file: !103, line: 814, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !103, line: 51, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !676, file: !103, line: 815, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !103, line: 815, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !676, file: !103, line: 818, baseType: !17, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !676, file: !103, line: 819, baseType: !686, size: 32, offset: 192)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 32, elements: !579)
!687 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !676, file: !103, line: 822, baseType: !48, size: 32, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !676, file: !103, line: 826, baseType: !48, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !676, file: !103, line: 829, baseType: !48, size: 32, offset: 288)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !103, line: 928, baseType: !46, size: 16, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !672, file: !103, line: 928, baseType: !46, size: 16, offset: 336)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !672, file: !103, line: 929, baseType: !48, size: 32, offset: 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !672, file: !103, line: 930, baseType: !552, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !672, file: !103, line: 931, baseType: !696, size: 64, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !103, line: 931, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !672, file: !103, line: 933, baseType: !17, size: 64, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !667, file: !103, line: 1069, baseType: !670, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !667, file: !103, line: 1070, baseType: !701, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !103, line: 916, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !103, line: 891, size: 704, elements: !704)
!704 = !{!705, !706, !707, !709, !710, !711, !712, !713, !714}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !703, file: !103, line: 892, baseType: !675, size: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !703, file: !103, line: 896, baseType: !48, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !703, file: !103, line: 900, baseType: !708, size: 96, offset: 352)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !134)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !703, file: !103, line: 903, baseType: !133, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !703, file: !103, line: 906, baseType: !48, size: 32, offset: 480)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !703, file: !103, line: 909, baseType: !133, size: 32, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !703, file: !103, line: 912, baseType: !133, size: 32, offset: 544)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !703, file: !103, line: 914, baseType: !110, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !703, file: !103, line: 915, baseType: !17, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !667, file: !103, line: 1071, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !103, line: 920, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !103, line: 918, size: 320, elements: !719)
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !718, file: !103, line: 919, baseType: !675, size: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !667, file: !103, line: 1075, baseType: !133, size: 32, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !667, file: !103, line: 1077, baseType: !133, size: 32, offset: 288)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !667, file: !103, line: 1078, baseType: !133, size: 32, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !667, file: !103, line: 1079, baseType: !46, size: 16, offset: 352)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !667, file: !103, line: 1082, baseType: !46, size: 16, offset: 368)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !667, file: !103, line: 1085, baseType: !33, size: 8, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !667, file: !103, line: 1086, baseType: !33, size: 8, offset: 392)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !667, file: !103, line: 1087, baseType: !33, size: 8, offset: 400)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !667, file: !103, line: 1088, baseType: !33, size: 8, offset: 408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !667, file: !103, line: 1090, baseType: !133, size: 32, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !667, file: !103, line: 1093, baseType: !46, size: 16, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !667, file: !103, line: 1096, baseType: !33, size: 8, offset: 464)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !667, file: !103, line: 1098, baseType: !734, size: 40, offset: 472)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 40, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 5)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !667, file: !103, line: 1101, baseType: !738, size: 832, offset: 512)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !103, line: 836, size: 832, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !738, file: !103, line: 837, baseType: !675, size: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !738, file: !103, line: 839, baseType: !46, size: 16, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !738, file: !103, line: 839, baseType: !46, size: 16, offset: 336)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !738, file: !103, line: 842, baseType: !46, size: 16, offset: 352)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !738, file: !103, line: 842, baseType: !46, size: 16, offset: 368)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !738, file: !103, line: 843, baseType: !562, size: 32, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !738, file: !103, line: 845, baseType: !48, size: 32, offset: 416)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !738, file: !103, line: 847, baseType: !17, size: 64, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !738, file: !103, line: 848, baseType: !517, size: 64, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !738, file: !103, line: 849, baseType: !517, size: 64, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !738, file: !103, line: 850, baseType: !517, size: 64, offset: 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !738, file: !103, line: 851, baseType: !132, size: 96, offset: 704)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !738, file: !103, line: 852, baseType: !133, size: 32, offset: 800)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !667, file: !103, line: 1104, baseType: !754, size: 1344, offset: 1344)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !103, line: 867, size: 1344, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !754, file: !103, line: 868, baseType: !46, size: 16)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !754, file: !103, line: 869, baseType: !46, size: 16, offset: 16)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !754, file: !103, line: 870, baseType: !46, size: 16, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !754, file: !103, line: 871, baseType: !46, size: 16, offset: 48)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !754, file: !103, line: 873, baseType: !761, size: 896, offset: 64)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 896, elements: !586)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !103, line: 864, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !103, line: 859, size: 128, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !763, file: !103, line: 860, baseType: !46, size: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !763, file: !103, line: 861, baseType: !46, size: 16, offset: 16)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !763, file: !103, line: 861, baseType: !46, size: 16, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !763, file: !103, line: 861, baseType: !46, size: 16, offset: 48)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !763, file: !103, line: 862, baseType: !48, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !763, file: !103, line: 863, baseType: !133, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !754, file: !103, line: 874, baseType: !17, size: 64, offset: 960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !754, file: !103, line: 876, baseType: !133, size: 32, offset: 1024)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !754, file: !103, line: 876, baseType: !133, size: 32, offset: 1056)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !754, file: !103, line: 878, baseType: !48, size: 32, offset: 1088)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !754, file: !103, line: 879, baseType: !48, size: 32, offset: 1120)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !754, file: !103, line: 881, baseType: !48, size: 32, offset: 1152)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !754, file: !103, line: 881, baseType: !48, size: 32, offset: 1184)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !754, file: !103, line: 883, baseType: !101, size: 64, offset: 1216)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !754, file: !103, line: 884, baseType: !110, size: 64, offset: 1280)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !667, file: !103, line: 1107, baseType: !133, size: 32, offset: 2688)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !667, file: !103, line: 1110, baseType: !133, size: 32, offset: 2720)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !667, file: !103, line: 1113, baseType: !46, size: 16, offset: 2752)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !667, file: !103, line: 1113, baseType: !46, size: 16, offset: 2768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !667, file: !103, line: 1116, baseType: !33, size: 8, offset: 2784)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !667, file: !103, line: 1117, baseType: !145, size: 8, offset: 2792)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !667, file: !103, line: 1120, baseType: !46, size: 16, offset: 2800)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !667, file: !103, line: 1121, baseType: !133, size: 32, offset: 2816)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !667, file: !103, line: 1122, baseType: !133, size: 32, offset: 2848)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !667, file: !103, line: 1123, baseType: !133, size: 32, offset: 2880)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !667, file: !103, line: 1124, baseType: !133, size: 32, offset: 2912)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !667, file: !103, line: 1125, baseType: !133, size: 32, offset: 2944)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !667, file: !103, line: 1126, baseType: !133, size: 32, offset: 2976)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !667, file: !103, line: 1127, baseType: !133, size: 32, offset: 3008)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !667, file: !103, line: 1128, baseType: !133, size: 32, offset: 3040)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !667, file: !103, line: 1129, baseType: !133, size: 32, offset: 3072)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !667, file: !103, line: 1130, baseType: !133, size: 32, offset: 3104)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !667, file: !103, line: 1131, baseType: !46, size: 16, offset: 3136)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !667, file: !103, line: 1132, baseType: !33, size: 8, offset: 3152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !667, file: !103, line: 1133, baseType: !33, size: 8, offset: 3160)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !667, file: !103, line: 1134, baseType: !656, size: 24, offset: 3168)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !667, file: !103, line: 1135, baseType: !33, size: 8, offset: 3192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !667, file: !103, line: 1138, baseType: !110, size: 64, offset: 3200)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !667, file: !103, line: 1139, baseType: !33, size: 8, offset: 3264)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !667, file: !103, line: 1140, baseType: !33, size: 8, offset: 3272)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !667, file: !103, line: 1141, baseType: !33, size: 8, offset: 3280)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !667, file: !103, line: 1142, baseType: !33, size: 8, offset: 3288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !667, file: !103, line: 1143, baseType: !33, size: 8, offset: 3296)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !667, file: !103, line: 1144, baseType: !809, size: 64, offset: 3304)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !535)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !667, file: !103, line: 1145, baseType: !809, size: 64, offset: 3368)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !667, file: !103, line: 1148, baseType: !33, size: 8, offset: 3432)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !667, file: !103, line: 1149, baseType: !33, size: 8, offset: 3440)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !667, file: !103, line: 1152, baseType: !33, size: 8, offset: 3448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !667, file: !103, line: 1152, baseType: !33, size: 8, offset: 3456)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !667, file: !103, line: 1153, baseType: !33, size: 8, offset: 3464)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !667, file: !103, line: 1154, baseType: !46, size: 16, offset: 3472)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !667, file: !103, line: 1154, baseType: !46, size: 16, offset: 3488)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !667, file: !103, line: 1155, baseType: !46, size: 16, offset: 3504)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !667, file: !103, line: 1155, baseType: !46, size: 16, offset: 3520)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !667, file: !103, line: 1156, baseType: !33, size: 8, offset: 3536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !667, file: !103, line: 1157, baseType: !33, size: 8, offset: 3544)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !667, file: !103, line: 1159, baseType: !33, size: 8, offset: 3552)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !667, file: !103, line: 1160, baseType: !33, size: 8, offset: 3560)
