; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_tex_checker.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_tex_checker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, globals: !66, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 76, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!25 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!29 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!31 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!32 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!33 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!34 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!35 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!36 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!37 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!38 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!39 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!40 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!41 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!42 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!43 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!44 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!45 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!46 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!47 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!48 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!49 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!50 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!51 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!52 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!53 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!54 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!55 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!56 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!58 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!59 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!60 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!61 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!62 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!66 = !{!0, !67, !2276}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "sh_node_tex_checker_in", scope: !6, file: !3, line: 32, type: !69, isLocal: true, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 7040, elements: !1646)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !71, line: 109, baseType: !72)
!71 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !71, line: 98, size: 1408, elements: !73)
!73 = !{!74, !76, !77, !82, !84, !85, !86, !87, !88, !89, !90, !91, !2275}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !71, line: 99, baseType: !75, size: 32)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !72, file: !71, line: 99, baseType: !75, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !71, line: 100, baseType: !78, size: 512, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 512, elements: !80)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81}
!81 = !DISubrange(count: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !72, file: !71, line: 101, baseType: !83, size: 32, offset: 576)
!83 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !72, file: !71, line: 101, baseType: !83, size: 32, offset: 608)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !72, file: !71, line: 101, baseType: !83, size: 32, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !72, file: !71, line: 101, baseType: !83, size: 32, offset: 672)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !72, file: !71, line: 102, baseType: !83, size: 32, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !72, file: !71, line: 102, baseType: !83, size: 32, offset: 736)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !72, file: !71, line: 103, baseType: !75, size: 32, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !71, line: 104, baseType: !75, size: 32, offset: 800)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !72, file: !71, line: 107, baseType: !92, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !94, line: 87, size: 2816, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !97, !98, !99, !131, !132, !133, !134, !135, !136, !137, !138, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !94, line: 88, baseType: !92, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !93, file: !94, line: 88, baseType: !92, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !93, file: !94, line: 88, baseType: !92, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !93, file: !94, line: 90, baseType: !100, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !102, line: 75, baseType: !103)
!102 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !102, line: 62, size: 1024, elements: !104)
!104 = !{!105, !107, !108, !109, !110, !112, !113, !114, !129, !130}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !102, line: 63, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !103, file: !102, line: 63, baseType: !106, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !102, line: 64, baseType: !79, size: 8, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !103, file: !102, line: 64, baseType: !79, size: 8, offset: 136)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !103, file: !102, line: 65, baseType: !111, size: 16, offset: 144)
!111 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !102, line: 66, baseType: !78, size: 512, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !103, file: !102, line: 67, baseType: !75, size: 32, offset: 672)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !102, line: 69, baseType: !115, size: 256, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !102, line: 60, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !102, line: 48, size: 256, elements: !117)
!117 = !{!118, !120, !127, !128}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !116, file: !102, line: 49, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !116, file: !102, line: 58, baseType: !121, size: 128, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !122, line: 71, baseType: !123)
!122 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !122, line: 69, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !123, file: !122, line: 70, baseType: !119, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !123, file: !122, line: 70, baseType: !119, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !116, file: !102, line: 59, baseType: !75, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !116, file: !102, line: 59, baseType: !75, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !103, file: !102, line: 70, baseType: !75, size: 32, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !103, file: !102, line: 74, baseType: !75, size: 32, offset: 992)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !93, file: !94, line: 92, baseType: !78, size: 512, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !94, line: 94, baseType: !78, size: 512, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !93, file: !94, line: 99, baseType: !119, size: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !94, line: 101, baseType: !111, size: 16, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !93, file: !94, line: 101, baseType: !111, size: 16, offset: 1360)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !93, file: !94, line: 102, baseType: !111, size: 16, offset: 1376)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !93, file: !94, line: 103, baseType: !111, size: 16, offset: 1392)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !93, file: !94, line: 104, baseType: !139, size: 64, offset: 1408)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !71, line: 114, size: 1600, elements: !141)
!141 = !{!142, !143, !166, !171, !175, !179, !2248, !2252, !2253, !2257, !2258, !2259, !2260}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !140, file: !71, line: 115, baseType: !78, size: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !140, file: !71, line: 117, baseType: !144, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147, !150, !152, !152, !164}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !149, line: 60, flags: DIFlagFwdDecl)
!149 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !71, line: 73, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !154, line: 55, size: 192, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !160, !163}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 58, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !153, file: !154, line: 56, size: 64, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !154, line: 57, baseType: !119, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !154, line: 60, baseType: !161, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !94, line: 335, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 61, baseType: !119, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !140, file: !71, line: 118, baseType: !167, size: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !147, !152, !152, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !140, file: !71, line: 120, baseType: !172, size: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !147, !150, !152}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !140, file: !71, line: 121, baseType: !176, size: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !147, !152, !170}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !140, file: !71, line: 122, baseType: !180, size: 64, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !183, !92, !161}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !94, line: 328, size: 3456, elements: !185)
!185 = !{!186, !222, !226, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2231, !2235, !2239, !2243, !2244, !2245, !2246, !2247}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !184, file: !94, line: 329, baseType: !187, size: 960)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !102, line: 130, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !102, line: 117, size: 960, elements: !189)
!189 = !{!190, !191, !192, !194, !213, !217, !218, !219, !220, !221}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !102, line: 118, baseType: !119, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !188, file: !102, line: 118, baseType: !119, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !188, file: !102, line: 119, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !188, file: !102, line: 120, baseType: !195, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !102, line: 136, size: 17600, elements: !197)
!197 = !{!198, !199, !201, !204, !208, !209, !210}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !196, file: !102, line: 137, baseType: !187, size: 960)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !196, file: !102, line: 138, baseType: !200, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !196, file: !102, line: 139, baseType: !202, size: 64, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !102, line: 43, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !102, line: 140, baseType: !205, size: 8192, offset: 1088)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8192, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 1024)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !196, file: !102, line: 141, baseType: !205, size: 8192, offset: 9280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !196, file: !102, line: 148, baseType: !195, size: 64, offset: 17472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !196, file: !102, line: 150, baseType: !211, size: 64, offset: 17536)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !102, line: 45, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !102, line: 121, baseType: !214, size: 528, offset: 256)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 528, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 66)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !188, file: !102, line: 126, baseType: !111, size: 16, offset: 784)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !188, file: !102, line: 127, baseType: !75, size: 32, offset: 800)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !188, file: !102, line: 128, baseType: !75, size: 32, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !188, file: !102, line: 128, baseType: !75, size: 32, offset: 864)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !188, file: !102, line: 129, baseType: !100, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !184, file: !94, line: 330, baseType: !223, size: 64, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !225, line: 48, flags: DIFlagFwdDecl)
!225 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !184, file: !94, line: 332, baseType: !227, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !71, line: 283, size: 4096, elements: !229)
!229 = !{!230, !231, !232, !233, !237, !238, !242, !598, !2166, !2170, !2176, !2180, !2181, !2182, !2183, !2202, !2203}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !71, line: 284, baseType: !75, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !228, file: !71, line: 285, baseType: !78, size: 512, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !228, file: !71, line: 287, baseType: !78, size: 512, offset: 544)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !228, file: !71, line: 288, baseType: !234, size: 2048, offset: 1056)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 2048, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !228, file: !71, line: 289, baseType: !75, size: 32, offset: 3104)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !228, file: !71, line: 292, baseType: !239, size: 64, offset: 3136)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !183}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !228, file: !71, line: 293, baseType: !243, size: 64, offset: 3200)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !183, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !94, line: 167, size: 3712, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !590, !591, !592, !593, !594, !595}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !94, line: 168, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !247, file: !94, line: 168, baseType: !246, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !247, file: !94, line: 168, baseType: !246, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !247, file: !94, line: 170, baseType: !100, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !247, file: !94, line: 172, baseType: !254, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !71, line: 144, size: 6016, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !276, !277, !278, !292, !296, !300, !301, !385, !390, !394, !395, !396, !397, !401, !402, !406, !410, !414, !418, !422, !426, !430, !431, !450, !455, !498, !518}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !71, line: 145, baseType: !119, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !255, file: !71, line: 145, baseType: !119, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !255, file: !71, line: 146, baseType: !111, size: 16, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !255, file: !71, line: 148, baseType: !78, size: 512, offset: 144)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !71, line: 149, baseType: !75, size: 32, offset: 672)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !255, file: !71, line: 151, baseType: !78, size: 512, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !255, file: !71, line: 152, baseType: !234, size: 2048, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !255, file: !71, line: 153, baseType: !75, size: 32, offset: 3264)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !255, file: !71, line: 155, baseType: !83, size: 32, offset: 3296)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !255, file: !71, line: 155, baseType: !83, size: 32, offset: 3328)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !255, file: !71, line: 155, baseType: !83, size: 32, offset: 3360)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !255, file: !71, line: 156, baseType: !83, size: 32, offset: 3392)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !255, file: !71, line: 156, baseType: !83, size: 32, offset: 3424)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !255, file: !71, line: 156, baseType: !83, size: 32, offset: 3456)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !255, file: !71, line: 157, baseType: !111, size: 16, offset: 3488)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !71, line: 157, baseType: !111, size: 16, offset: 3504)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !255, file: !71, line: 157, baseType: !111, size: 16, offset: 3520)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !255, file: !71, line: 160, baseType: !275, size: 64, offset: 3584)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !255, file: !71, line: 160, baseType: !275, size: 64, offset: 3648)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !255, file: !71, line: 162, baseType: !78, size: 512, offset: 3712)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !255, file: !71, line: 165, baseType: !279, size: 64, offset: 4224)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282, !284, !286, !183, !246, !288}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !71, line: 81, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !94, line: 43, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !94, line: 274, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !94, line: 271, size: 32, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !289, file: !94, line: 273, baseType: !10, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !255, file: !71, line: 168, baseType: !293, size: 64, offset: 4288)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !282, !183, !246}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !255, file: !71, line: 171, baseType: !297, size: 64, offset: 4352)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !150, !147, !152}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !255, file: !71, line: 173, baseType: !297, size: 64, offset: 4416)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !255, file: !71, line: 176, baseType: !302, size: 64, offset: 4480)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !286, !305, !246, !75, !75}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !307, line: 70, size: 19840, elements: !308)
!307 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!308 = !{!309, !310, !311, !312, !313, !315, !316, !317, !318, !320, !321, !326, !327, !328, !329, !330, !332, !334, !335, !336, !340, !341, !342, !343, !344, !347, !348, !349, !350, !351, !354, !355, !357, !358, !359, !363, !364, !365, !368, !369, !378}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !307, line: 71, baseType: !305, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !306, file: !307, line: 71, baseType: !305, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !306, file: !307, line: 74, baseType: !75, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !306, file: !307, line: 74, baseType: !75, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !306, file: !307, line: 79, baseType: !314, size: 8, offset: 192)
!314 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !306, file: !307, line: 80, baseType: !75, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !307, line: 83, baseType: !75, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !306, file: !307, line: 84, baseType: !75, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !306, file: !307, line: 87, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !306, file: !307, line: 88, baseType: !170, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !306, file: !307, line: 93, baseType: !322, size: 128, offset: 448)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 128, elements: !324)
!323 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!324 = !{!325}
!325 = !DISubrange(count: 2)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !306, file: !307, line: 96, baseType: !75, size: 32, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !306, file: !307, line: 96, baseType: !75, size: 32, offset: 608)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !306, file: !307, line: 97, baseType: !75, size: 32, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !306, file: !307, line: 97, baseType: !75, size: 32, offset: 672)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !306, file: !307, line: 98, baseType: !331, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !306, file: !307, line: 101, baseType: !333, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !306, file: !307, line: 102, baseType: !170, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !306, file: !307, line: 105, baseType: !83, size: 32, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !306, file: !307, line: 108, baseType: !337, size: 1280, offset: 960)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1280, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 20)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !306, file: !307, line: 109, baseType: !75, size: 32, offset: 2240)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !306, file: !307, line: 109, baseType: !75, size: 32, offset: 2272)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !306, file: !307, line: 112, baseType: !75, size: 32, offset: 2304)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !306, file: !307, line: 113, baseType: !75, size: 32, offset: 2336)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !306, file: !307, line: 114, baseType: !345, size: 64, offset: 2368)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !307, line: 50, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !306, file: !307, line: 115, baseType: !119, size: 64, offset: 2432)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !306, file: !307, line: 118, baseType: !75, size: 32, offset: 2496)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 119, baseType: !205, size: 8192, offset: 2528)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !306, file: !307, line: 120, baseType: !205, size: 8192, offset: 10720)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !306, file: !307, line: 123, baseType: !352, size: 64, offset: 18944)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !307, line: 123, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !306, file: !307, line: 124, baseType: !75, size: 32, offset: 19008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !306, file: !307, line: 127, baseType: !356, size: 64, offset: 19072)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !306, file: !307, line: 128, baseType: !10, size: 32, offset: 19136)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !306, file: !307, line: 129, baseType: !10, size: 32, offset: 19168)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !306, file: !307, line: 132, baseType: !360, size: 64, offset: 19200)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !362, line: 63, flags: DIFlagFwdDecl)
!362 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !306, file: !307, line: 133, baseType: !360, size: 64, offset: 19264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !306, file: !307, line: 134, baseType: !319, size: 64, offset: 19328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !306, file: !307, line: 135, baseType: !366, size: 64, offset: 19392)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !307, line: 135, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !306, file: !307, line: 136, baseType: !75, size: 32, offset: 19456)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !306, file: !307, line: 137, baseType: !370, size: 128, offset: 19488)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !371, line: 89, baseType: !372)
!371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !371, line: 86, size: 128, elements: !373)
!373 = !{!374, !375, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !372, file: !371, line: 87, baseType: !75, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !372, file: !371, line: 87, baseType: !75, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !372, file: !371, line: 88, baseType: !75, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !372, file: !371, line: 88, baseType: !75, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !306, file: !307, line: 140, baseType: !379, size: 192, offset: 19648)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !307, line: 55, size: 192, elements: !380)
!380 = !{!381, !382, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !379, file: !307, line: 56, baseType: !10, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !379, file: !307, line: 57, baseType: !10, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !307, line: 58, baseType: !356, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !379, file: !307, line: 59, baseType: !10, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !255, file: !71, line: 179, baseType: !386, size: 64, offset: 4544)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !183, !246, !389, !75}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !255, file: !71, line: 181, baseType: !391, size: 64, offset: 4608)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!75, !246, !75, !75}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !255, file: !71, line: 183, baseType: !391, size: 64, offset: 4672)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !255, file: !71, line: 185, baseType: !391, size: 64, offset: 4736)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !255, file: !71, line: 188, baseType: !243, size: 64, offset: 4800)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !255, file: !71, line: 190, baseType: !398, size: 64, offset: 4864)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !183, !246, !193}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !255, file: !71, line: 193, baseType: !243, size: 64, offset: 4928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !255, file: !71, line: 195, baseType: !403, size: 64, offset: 4992)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !246}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !255, file: !71, line: 197, baseType: !407, size: 64, offset: 5056)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !183, !246, !246}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !255, file: !71, line: 200, baseType: !411, size: 64, offset: 5120)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !282, !152}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !255, file: !71, line: 201, baseType: !415, size: 64, offset: 5184)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !152}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !255, file: !71, line: 202, baseType: !419, size: 64, offset: 5248)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !152, !246}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !255, file: !71, line: 205, baseType: !423, size: 64, offset: 5312)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!75, !254, !183}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !255, file: !71, line: 207, baseType: !427, size: 64, offset: 5376)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!75, !246, !183}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !255, file: !71, line: 210, baseType: !243, size: 64, offset: 5440)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !255, file: !71, line: 213, baseType: !432, size: 64, offset: 5504)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !71, line: 135, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!119, !436, !246, !288}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !438, line: 54, size: 64, elements: !439)
!438 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !437, file: !438, line: 55, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !71, line: 500, size: 64, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !442, file: !71, line: 502, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !447, line: 48, baseType: !448)
!447 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !449, line: 47, flags: DIFlagFwdDecl)
!449 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!450 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !255, file: !71, line: 214, baseType: !451, size: 64, offset: 5568)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !71, line: 136, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !119}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !255, file: !71, line: 215, baseType: !456, size: 64, offset: 5632)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !71, line: 137, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !119, !75, !246, !460, !479, !479}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !438, line: 58, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !461, file: !438, line: 59, baseType: !119, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !461, file: !438, line: 60, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !94, line: 289, size: 192, elements: !467)
!467 = !{!468, !475, !476, !477, !478}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !466, file: !94, line: 290, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !94, line: 286, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !94, line: 280, size: 64, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !470, file: !94, line: 281, baseType: !288, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !470, file: !94, line: 284, baseType: !111, size: 16, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !470, file: !94, line: 285, baseType: !111, size: 16, offset: 48)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !466, file: !94, line: 292, baseType: !356, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !466, file: !94, line: 293, baseType: !111, size: 16, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !466, file: !94, line: 293, baseType: !111, size: 16, offset: 144)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !466, file: !94, line: 294, baseType: !75, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !94, line: 62, size: 384, elements: !482)
!482 = !{!483, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !481, file: !94, line: 63, baseType: !484, size: 128)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 4)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !481, file: !94, line: 64, baseType: !83, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !481, file: !94, line: 64, baseType: !83, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !481, file: !94, line: 65, baseType: !119, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !481, file: !94, line: 66, baseType: !111, size: 16, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !481, file: !94, line: 67, baseType: !111, size: 16, offset: 272)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !481, file: !94, line: 68, baseType: !111, size: 16, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !481, file: !94, line: 69, baseType: !111, size: 16, offset: 304)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !481, file: !94, line: 70, baseType: !111, size: 16, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !481, file: !94, line: 71, baseType: !111, size: 16, offset: 336)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !481, file: !94, line: 72, baseType: !497, size: 32, offset: 352)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 32, elements: !324)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !255, file: !71, line: 217, baseType: !499, size: 64, offset: 5696)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !71, line: 138, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!75, !503, !246, !460, !505, !505}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !71, line: 64, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !507)
!507 = !{!508, !510, !511, !512, !515, !516, !517}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !9, line: 107, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !506, file: !9, line: 108, baseType: !164, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !506, file: !9, line: 109, baseType: !484, size: 128, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !506, file: !9, line: 110, baseType: !513, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !506, file: !9, line: 111, baseType: !314, size: 8, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !506, file: !9, line: 112, baseType: !314, size: 8, offset: 328)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !506, file: !9, line: 113, baseType: !111, size: 16, offset: 336)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !255, file: !71, line: 220, baseType: !519, size: 256, offset: 5760)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !154, line: 436, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !154, line: 430, size: 256, elements: !521)
!521 = !{!522, !523, !526, !542}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !520, file: !154, line: 431, baseType: !119, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !520, file: !154, line: 432, baseType: !524, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !154, line: 417, baseType: !162)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !520, file: !154, line: 433, baseType: !527, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !154, line: 408, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!75, !147, !152, !531, !533}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !154, line: 38, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !154, line: 348, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !154, line: 337, size: 256, elements: !536)
!536 = !{!537, !538, !539, !540, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !154, line: 339, baseType: !119, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !535, file: !154, line: 342, baseType: !531, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !535, file: !154, line: 345, baseType: !75, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !535, file: !154, line: 347, baseType: !75, size: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !535, file: !154, line: 347, baseType: !75, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !520, file: !154, line: 434, baseType: !543, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !154, line: 409, baseType: !452)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !247, file: !94, line: 173, baseType: !78, size: 512, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !94, line: 175, baseType: !78, size: 512, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !94, line: 176, baseType: !75, size: 32, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !247, file: !94, line: 177, baseType: !111, size: 16, offset: 1376)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !247, file: !94, line: 177, baseType: !111, size: 16, offset: 1392)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !247, file: !94, line: 178, baseType: !111, size: 16, offset: 1408)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !247, file: !94, line: 178, baseType: !111, size: 16, offset: 1424)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !247, file: !94, line: 179, baseType: !111, size: 16, offset: 1440)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !247, file: !94, line: 179, baseType: !111, size: 16, offset: 1456)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !247, file: !94, line: 180, baseType: !111, size: 16, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !247, file: !94, line: 181, baseType: !111, size: 16, offset: 1488)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !247, file: !94, line: 182, baseType: !556, size: 96, offset: 1504)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 96, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 3)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !247, file: !94, line: 184, baseType: !121, size: 128, offset: 1600)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !247, file: !94, line: 184, baseType: !121, size: 128, offset: 1728)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !247, file: !94, line: 185, baseType: !246, size: 64, offset: 1856)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !247, file: !94, line: 186, baseType: !193, size: 64, offset: 1920)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !247, file: !94, line: 187, baseType: !119, size: 64, offset: 1984)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !247, file: !94, line: 188, baseType: !246, size: 64, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !247, file: !94, line: 189, baseType: !121, size: 128, offset: 2112)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !247, file: !94, line: 191, baseType: !83, size: 32, offset: 2240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !247, file: !94, line: 191, baseType: !83, size: 32, offset: 2272)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !247, file: !94, line: 192, baseType: !83, size: 32, offset: 2304)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !247, file: !94, line: 192, baseType: !83, size: 32, offset: 2336)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !247, file: !94, line: 193, baseType: !83, size: 32, offset: 2368)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !247, file: !94, line: 194, baseType: !83, size: 32, offset: 2400)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !247, file: !94, line: 194, baseType: !83, size: 32, offset: 2432)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !247, file: !94, line: 196, baseType: !75, size: 32, offset: 2464)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !247, file: !94, line: 198, baseType: !78, size: 512, offset: 2496)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !247, file: !94, line: 199, baseType: !111, size: 16, offset: 3008)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !247, file: !94, line: 199, baseType: !111, size: 16, offset: 3024)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !247, file: !94, line: 200, baseType: !83, size: 32, offset: 3040)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !247, file: !94, line: 200, baseType: !83, size: 32, offset: 3072)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !247, file: !94, line: 202, baseType: !111, size: 16, offset: 3104)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !247, file: !94, line: 202, baseType: !111, size: 16, offset: 3120)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !247, file: !94, line: 203, baseType: !119, size: 64, offset: 3136)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !247, file: !94, line: 204, baseType: !583, size: 128, offset: 3200)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !371, line: 95, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !371, line: 92, size: 128, elements: !585)
!585 = !{!586, !587, !588, !589}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !584, file: !371, line: 93, baseType: !83, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !584, file: !371, line: 93, baseType: !83, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !584, file: !371, line: 94, baseType: !83, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !584, file: !371, line: 94, baseType: !83, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !247, file: !94, line: 205, baseType: !583, size: 128, offset: 3328)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !247, file: !94, line: 206, baseType: !583, size: 128, offset: 3456)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !247, file: !94, line: 215, baseType: !111, size: 16, offset: 3584)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !247, file: !94, line: 215, baseType: !111, size: 16, offset: 3600)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !247, file: !94, line: 216, baseType: !75, size: 32, offset: 3616)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !247, file: !94, line: 217, baseType: !596, size: 64, offset: 3648)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !94, line: 51, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !228, file: !71, line: 294, baseType: !599, size: 64, offset: 3264)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !602, !119, !2162}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !362, line: 1216, size: 39680, elements: !604)
!604 = !{!605, !606, !607, !1468, !1549, !1550, !1551, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1578, !1790, !1793, !2036, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2058, !2059, !2060, !2061, !2062, !2070, !2136, !2143, !2144, !2151, !2154, !2155, !2156, !2157, !2158, !2159}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !603, file: !362, line: 1217, baseType: !187, size: 960)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !603, file: !362, line: 1218, baseType: !223, size: 64, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !603, file: !362, line: 1220, baseType: !608, size: 64, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !610, line: 115, size: 11392, elements: !611)
!610 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!611 = !{!612, !613, !614, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !631, !641, !654, !655, !695, !696, !699, !700, !716, !717, !718, !719, !720, !721, !722, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1415, !1418, !1419, !1420, !1421, !1422, !1423, !1426, !1429, !1432, !1433, !1439, !1440, !1441, !1442, !1443, !1444, !1446, !1449, !1452, !1453, !1456, !1457}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !609, file: !610, line: 116, baseType: !187, size: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !609, file: !610, line: 117, baseType: !223, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !609, file: !610, line: 119, baseType: !615, size: 64, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !610, line: 57, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !609, file: !610, line: 121, baseType: !111, size: 16, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !609, file: !610, line: 121, baseType: !111, size: 16, offset: 1104)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !609, file: !610, line: 122, baseType: !75, size: 32, offset: 1120)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !609, file: !610, line: 122, baseType: !75, size: 32, offset: 1152)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !609, file: !610, line: 122, baseType: !75, size: 32, offset: 1184)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !609, file: !610, line: 123, baseType: !78, size: 512, offset: 1216)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !609, file: !610, line: 124, baseType: !608, size: 64, offset: 1728)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !609, file: !610, line: 124, baseType: !608, size: 64, offset: 1792)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !609, file: !610, line: 127, baseType: !608, size: 64, offset: 1856)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !609, file: !610, line: 127, baseType: !608, size: 64, offset: 1920)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !609, file: !610, line: 127, baseType: !608, size: 64, offset: 1984)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !609, file: !610, line: 128, baseType: !629, size: 64, offset: 2048)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !225, line: 49, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !609, file: !610, line: 130, baseType: !632, size: 64, offset: 2112)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !610, line: 97, size: 832, elements: !634)
!634 = !{!635, !639, !640}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !633, file: !610, line: 98, baseType: !636, size: 768)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 768, elements: !637)
!637 = !{!638, !558}
!638 = !DISubrange(count: 8)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !633, file: !610, line: 99, baseType: !75, size: 32, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !633, file: !610, line: 99, baseType: !75, size: 32, offset: 800)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !609, file: !610, line: 131, baseType: !642, size: 64, offset: 2176)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !449, line: 486, size: 1600, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !643, file: !449, line: 487, baseType: !187, size: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !643, file: !449, line: 489, baseType: !121, size: 128, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !643, file: !449, line: 490, baseType: !121, size: 128, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !643, file: !449, line: 491, baseType: !121, size: 128, offset: 1216)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !643, file: !449, line: 492, baseType: !121, size: 128, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !643, file: !449, line: 494, baseType: !75, size: 32, offset: 1472)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !643, file: !449, line: 495, baseType: !75, size: 32, offset: 1504)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !643, file: !449, line: 497, baseType: !75, size: 32, offset: 1536)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !643, file: !449, line: 498, baseType: !75, size: 32, offset: 1568)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !609, file: !610, line: 132, baseType: !642, size: 64, offset: 2240)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !609, file: !610, line: 133, baseType: !656, size: 64, offset: 2304)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !449, line: 334, size: 1728, elements: !658)
!658 = !{!659, !660, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !694}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !657, file: !449, line: 335, baseType: !121, size: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !657, file: !449, line: 336, baseType: !661, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !449, line: 338, baseType: !111, size: 16, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !657, file: !449, line: 338, baseType: !111, size: 16, offset: 208)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !657, file: !449, line: 339, baseType: !10, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !657, file: !449, line: 340, baseType: !75, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !657, file: !449, line: 342, baseType: !83, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !657, file: !449, line: 343, baseType: !556, size: 96, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !657, file: !449, line: 344, baseType: !556, size: 96, offset: 416)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !657, file: !449, line: 347, baseType: !121, size: 128, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !657, file: !449, line: 349, baseType: !75, size: 32, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !657, file: !449, line: 350, baseType: !75, size: 32, offset: 672)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !657, file: !449, line: 351, baseType: !119, size: 64, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !657, file: !449, line: 352, baseType: !119, size: 64, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !657, file: !449, line: 354, baseType: !675, size: 384, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !449, line: 116, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !449, line: 94, size: 384, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !676, file: !449, line: 96, baseType: !75, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !676, file: !449, line: 96, baseType: !75, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !676, file: !449, line: 97, baseType: !75, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !676, file: !449, line: 97, baseType: !75, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !676, file: !449, line: 99, baseType: !111, size: 16, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !676, file: !449, line: 100, baseType: !111, size: 16, offset: 144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !676, file: !449, line: 102, baseType: !111, size: 16, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !676, file: !449, line: 105, baseType: !111, size: 16, offset: 176)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !676, file: !449, line: 108, baseType: !111, size: 16, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !676, file: !449, line: 109, baseType: !111, size: 16, offset: 208)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !676, file: !449, line: 111, baseType: !111, size: 16, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !676, file: !449, line: 112, baseType: !111, size: 16, offset: 240)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !676, file: !449, line: 114, baseType: !75, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !676, file: !449, line: 114, baseType: !75, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !676, file: !449, line: 115, baseType: !75, size: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !676, file: !449, line: 115, baseType: !75, size: 32, offset: 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !657, file: !449, line: 355, baseType: !78, size: 512, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !609, file: !610, line: 134, baseType: !119, size: 64, offset: 2368)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !609, file: !610, line: 136, baseType: !697, size: 64, offset: 2432)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !362, line: 61, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !609, file: !610, line: 138, baseType: !675, size: 384, offset: 2496)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !609, file: !610, line: 139, baseType: !701, size: 64, offset: 2880)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !449, line: 80, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !449, line: 72, size: 192, elements: !704)
!704 = !{!705, !712, !713, !714, !715}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !703, file: !449, line: 73, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !449, line: 59, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !449, line: 56, size: 128, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !708, file: !449, line: 57, baseType: !556, size: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !708, file: !449, line: 58, baseType: !75, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !703, file: !449, line: 74, baseType: !75, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !703, file: !449, line: 76, baseType: !75, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !703, file: !449, line: 77, baseType: !75, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !703, file: !449, line: 79, baseType: !75, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !609, file: !610, line: 141, baseType: !121, size: 128, offset: 2944)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !609, file: !610, line: 142, baseType: !121, size: 128, offset: 3072)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !609, file: !610, line: 143, baseType: !121, size: 128, offset: 3200)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !609, file: !610, line: 144, baseType: !121, size: 128, offset: 3328)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !609, file: !610, line: 146, baseType: !75, size: 32, offset: 3456)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !609, file: !610, line: 147, baseType: !75, size: 32, offset: 3488)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !609, file: !610, line: 150, baseType: !723, size: 64, offset: 3520)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !225, line: 93, size: 7552, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !775, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1328}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !725, file: !225, line: 94, baseType: !187, size: 960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !725, file: !225, line: 95, baseType: !223, size: 64, offset: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !725, file: !225, line: 97, baseType: !111, size: 16, offset: 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !225, line: 97, baseType: !111, size: 16, offset: 1040)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !725, file: !225, line: 99, baseType: !83, size: 32, offset: 1056)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !725, file: !225, line: 99, baseType: !83, size: 32, offset: 1088)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !725, file: !225, line: 99, baseType: !83, size: 32, offset: 1120)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !725, file: !225, line: 100, baseType: !83, size: 32, offset: 1152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !725, file: !225, line: 100, baseType: !83, size: 32, offset: 1184)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !725, file: !225, line: 100, baseType: !83, size: 32, offset: 1216)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !725, file: !225, line: 101, baseType: !83, size: 32, offset: 1248)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !725, file: !225, line: 101, baseType: !83, size: 32, offset: 1280)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !725, file: !225, line: 101, baseType: !83, size: 32, offset: 1312)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !725, file: !225, line: 102, baseType: !83, size: 32, offset: 1344)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !725, file: !225, line: 102, baseType: !83, size: 32, offset: 1376)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !725, file: !225, line: 102, baseType: !83, size: 32, offset: 1408)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !725, file: !225, line: 103, baseType: !83, size: 32, offset: 1440)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !725, file: !225, line: 103, baseType: !83, size: 32, offset: 1472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !725, file: !225, line: 103, baseType: !83, size: 32, offset: 1504)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !725, file: !225, line: 103, baseType: !83, size: 32, offset: 1536)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !725, file: !225, line: 103, baseType: !83, size: 32, offset: 1568)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !725, file: !225, line: 104, baseType: !83, size: 32, offset: 1600)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !725, file: !225, line: 104, baseType: !83, size: 32, offset: 1632)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !725, file: !225, line: 104, baseType: !83, size: 32, offset: 1664)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !725, file: !225, line: 104, baseType: !83, size: 32, offset: 1696)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !725, file: !225, line: 104, baseType: !83, size: 32, offset: 1728)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !725, file: !225, line: 105, baseType: !83, size: 32, offset: 1760)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !725, file: !225, line: 108, baseType: !755, size: 704, offset: 1792)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !225, line: 53, size: 704, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !755, file: !225, line: 54, baseType: !83, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !755, file: !225, line: 55, baseType: !83, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !755, file: !225, line: 56, baseType: !83, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !755, file: !225, line: 57, baseType: !83, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !755, file: !225, line: 59, baseType: !556, size: 96, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !755, file: !225, line: 60, baseType: !556, size: 96, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !755, file: !225, line: 61, baseType: !556, size: 96, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !755, file: !225, line: 63, baseType: !83, size: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !755, file: !225, line: 64, baseType: !83, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !755, file: !225, line: 65, baseType: !83, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !755, file: !225, line: 67, baseType: !111, size: 16, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !755, file: !225, line: 68, baseType: !111, size: 16, offset: 528)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !755, file: !225, line: 69, baseType: !111, size: 16, offset: 544)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !755, file: !225, line: 70, baseType: !111, size: 16, offset: 560)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !755, file: !225, line: 72, baseType: !83, size: 32, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !755, file: !225, line: 73, baseType: !83, size: 32, offset: 608)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !755, file: !225, line: 74, baseType: !83, size: 32, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !755, file: !225, line: 75, baseType: !83, size: 32, offset: 672)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !725, file: !225, line: 109, baseType: !776, size: 128, offset: 2496)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !225, line: 79, size: 128, elements: !777)
!777 = !{!778, !779, !780, !781}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !776, file: !225, line: 80, baseType: !75, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !776, file: !225, line: 81, baseType: !75, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !776, file: !225, line: 82, baseType: !75, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !776, file: !225, line: 83, baseType: !75, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !725, file: !225, line: 111, baseType: !83, size: 32, offset: 2624)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !725, file: !225, line: 111, baseType: !83, size: 32, offset: 2656)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !725, file: !225, line: 112, baseType: !83, size: 32, offset: 2688)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !725, file: !225, line: 112, baseType: !83, size: 32, offset: 2720)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !725, file: !225, line: 113, baseType: !83, size: 32, offset: 2752)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !725, file: !225, line: 114, baseType: !83, size: 32, offset: 2784)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !725, file: !225, line: 114, baseType: !83, size: 32, offset: 2816)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !725, file: !225, line: 115, baseType: !111, size: 16, offset: 2848)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !725, file: !225, line: 115, baseType: !111, size: 16, offset: 2864)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !725, file: !225, line: 116, baseType: !111, size: 16, offset: 2880)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !725, file: !225, line: 117, baseType: !79, size: 8, offset: 2896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !725, file: !225, line: 117, baseType: !79, size: 8, offset: 2904)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !725, file: !225, line: 119, baseType: !83, size: 32, offset: 2912)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !725, file: !225, line: 119, baseType: !83, size: 32, offset: 2944)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !725, file: !225, line: 120, baseType: !111, size: 16, offset: 2976)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !725, file: !225, line: 120, baseType: !111, size: 16, offset: 2992)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !725, file: !225, line: 121, baseType: !83, size: 32, offset: 3008)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !725, file: !225, line: 121, baseType: !83, size: 32, offset: 3040)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !725, file: !225, line: 122, baseType: !83, size: 32, offset: 3072)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !725, file: !225, line: 123, baseType: !83, size: 32, offset: 3104)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !725, file: !225, line: 124, baseType: !111, size: 16, offset: 3136)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !725, file: !225, line: 125, baseType: !111, size: 16, offset: 3152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !725, file: !225, line: 127, baseType: !75, size: 32, offset: 3168)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !725, file: !225, line: 127, baseType: !75, size: 32, offset: 3200)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !725, file: !225, line: 128, baseType: !75, size: 32, offset: 3232)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !725, file: !225, line: 128, baseType: !75, size: 32, offset: 3264)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !725, file: !225, line: 129, baseType: !111, size: 16, offset: 3296)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !725, file: !225, line: 129, baseType: !111, size: 16, offset: 3312)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !725, file: !225, line: 129, baseType: !111, size: 16, offset: 3328)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !725, file: !225, line: 129, baseType: !111, size: 16, offset: 3344)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !725, file: !225, line: 130, baseType: !83, size: 32, offset: 3360)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !725, file: !225, line: 130, baseType: !83, size: 32, offset: 3392)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !725, file: !225, line: 130, baseType: !83, size: 32, offset: 3424)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !725, file: !225, line: 130, baseType: !83, size: 32, offset: 3456)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !725, file: !225, line: 131, baseType: !83, size: 32, offset: 3488)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !725, file: !225, line: 131, baseType: !83, size: 32, offset: 3520)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !725, file: !225, line: 131, baseType: !83, size: 32, offset: 3552)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !725, file: !225, line: 131, baseType: !83, size: 32, offset: 3584)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !725, file: !225, line: 132, baseType: !83, size: 32, offset: 3616)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !725, file: !225, line: 132, baseType: !83, size: 32, offset: 3648)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !725, file: !225, line: 133, baseType: !78, size: 512, offset: 3680)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !725, file: !225, line: 135, baseType: !83, size: 32, offset: 4192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !725, file: !225, line: 136, baseType: !83, size: 32, offset: 4224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !725, file: !225, line: 137, baseType: !83, size: 32, offset: 4256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !725, file: !225, line: 138, baseType: !75, size: 32, offset: 4288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !725, file: !225, line: 141, baseType: !79, size: 8, offset: 4320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !725, file: !225, line: 141, baseType: !79, size: 8, offset: 4328)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !725, file: !225, line: 141, baseType: !79, size: 8, offset: 4336)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !725, file: !225, line: 141, baseType: !79, size: 8, offset: 4344)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !725, file: !225, line: 142, baseType: !111, size: 16, offset: 4352)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !725, file: !225, line: 142, baseType: !111, size: 16, offset: 4368)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !725, file: !225, line: 142, baseType: !111, size: 16, offset: 4384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !725, file: !225, line: 145, baseType: !79, size: 8, offset: 4400)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !725, file: !225, line: 145, baseType: !79, size: 8, offset: 4408)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !725, file: !225, line: 148, baseType: !111, size: 16, offset: 4416)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !725, file: !225, line: 148, baseType: !111, size: 16, offset: 4432)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !725, file: !225, line: 149, baseType: !83, size: 32, offset: 4448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !725, file: !225, line: 149, baseType: !83, size: 32, offset: 4480)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !725, file: !225, line: 152, baseType: !484, size: 128, offset: 4512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !725, file: !225, line: 153, baseType: !83, size: 32, offset: 4640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !725, file: !225, line: 154, baseType: !83, size: 32, offset: 4672)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !725, file: !225, line: 157, baseType: !111, size: 16, offset: 4704)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !725, file: !225, line: 157, baseType: !111, size: 16, offset: 4720)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !725, file: !225, line: 160, baseType: !846, size: 64, offset: 4736)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !848, line: 113, size: 6208, elements: !849)
!848 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!849 = !{!850, !851, !852, !853, !854, !855, !859}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !847, file: !848, line: 114, baseType: !111, size: 16)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !847, file: !848, line: 114, baseType: !111, size: 16, offset: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !847, file: !848, line: 115, baseType: !79, size: 8, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !847, file: !848, line: 115, baseType: !79, size: 8, offset: 40)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !847, file: !848, line: 116, baseType: !79, size: 8, offset: 48)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !847, file: !848, line: 117, baseType: !856, size: 8, offset: 56)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 1)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !847, file: !848, line: 119, baseType: !860, size: 6144, offset: 64)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 6144, elements: !870)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !848, line: 109, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !848, line: 106, size: 192, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !862, file: !848, line: 107, baseType: !83, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !862, file: !848, line: 107, baseType: !83, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !862, file: !848, line: 107, baseType: !83, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !862, file: !848, line: 107, baseType: !83, size: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !862, file: !848, line: 107, baseType: !83, size: 32, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !862, file: !848, line: 108, baseType: !75, size: 32, offset: 160)
!870 = !{!871}
!871 = !DISubrange(count: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !725, file: !225, line: 161, baseType: !846, size: 64, offset: 4800)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !725, file: !225, line: 162, baseType: !79, size: 8, offset: 4864)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !725, file: !225, line: 162, baseType: !79, size: 8, offset: 4872)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !725, file: !225, line: 163, baseType: !79, size: 8, offset: 4880)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !725, file: !225, line: 163, baseType: !79, size: 8, offset: 4888)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !725, file: !225, line: 164, baseType: !111, size: 16, offset: 4896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !725, file: !225, line: 164, baseType: !111, size: 16, offset: 4912)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !725, file: !225, line: 165, baseType: !83, size: 32, offset: 4928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !725, file: !225, line: 165, baseType: !83, size: 32, offset: 4960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !725, file: !225, line: 167, baseType: !882, size: 1152, offset: 4992)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 1152, elements: !1286)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !848, line: 57, size: 2496, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !884, file: !848, line: 59, baseType: !111, size: 16)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !884, file: !848, line: 59, baseType: !111, size: 16, offset: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !884, file: !848, line: 59, baseType: !111, size: 16, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !884, file: !848, line: 59, baseType: !111, size: 16, offset: 48)
