; ModuleID = 'blender/source/blender/bmesh/operators/bmo_connect.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_connect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 83, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 249, baseType: !5, size: 32, elements: !49)
!48 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !55, line: 57, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!57 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 62, baseType: !5, size: 32, elements: !73)
!72 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_error.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!74 = !DIEnumerator(name: "BMERR_SELF_INTERSECTING", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "BMERR_DISSOLVEDISK_FAILED", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "BMERR_CONNECTVERT_FAILED", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "BMERR_WALKER_FAILED", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "BMERR_DISSOLVEFACES_FAILED", value: 5, isUnsigned: true)
!79 = !DIEnumerator(name: "BMERR_TESSELLATION", value: 6, isUnsigned: true)
!80 = !DIEnumerator(name: "BMERR_NONMANIFOLD", value: 7, isUnsigned: true)
!81 = !DIEnumerator(name: "BMERR_INVALID_SELECTION", value: 8, isUnsigned: true)
!82 = !DIEnumerator(name: "BMERR_MESH_ERROR", value: 9, isUnsigned: true)
!83 = !DIEnumerator(name: "BMERR_CONVEX_HULL_FAILED", value: 10, isUnsigned: true)
!84 = !DIEnumerator(name: "BMERR_TOTAL", value: 11, isUnsigned: true)
!85 = !{!86, !87, !88, !92, !96, !162, !164, !146}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !55, line: 79, baseType: !54)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !55, line: 158, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !86}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !55, line: 159, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!86, !86}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !48, line: 103, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !48, line: 90, size: 448, elements: !99)
!99 = !{!100, !111, !117, !122, !123}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !98, file: !48, line: 91, baseType: !101, size: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !48, line: 82, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !48, line: 64, size: 128, elements: !103)
!103 = !{!104, !105, !107, !109, !110}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !48, line: 65, baseType: !86, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !102, file: !48, line: 66, baseType: !106, size: 32, offset: 64)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !102, file: !48, line: 73, baseType: !108, size: 8, offset: 96)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !102, file: !48, line: 74, baseType: !108, size: 8, offset: 104)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !102, file: !48, line: 80, baseType: !108, size: 8, offset: 112)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !98, file: !48, line: 92, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !48, line: 180, size: 16, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !113, file: !48, line: 181, baseType: !116, size: 16)
!116 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !98, file: !48, line: 94, baseType: !118, size: 96, offset: 192)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 96, elements: !120)
!119 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !98, file: !48, line: 95, baseType: !118, size: 96, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !98, file: !48, line: 102, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !48, line: 110, size: 640, elements: !126)
!126 = !{!127, !128, !129, !131, !132, !155, !161}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !125, file: !48, line: 111, baseType: !101, size: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !125, file: !48, line: 112, baseType: !112, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !125, file: !48, line: 114, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !125, file: !48, line: 114, baseType: !130, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !125, file: !48, line: 118, baseType: !133, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !48, line: 125, size: 576, elements: !135)
!135 = !{!136, !137, !138, !139, !151, !152, !153, !154}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !134, file: !48, line: 126, baseType: !101, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !134, file: !48, line: 129, baseType: !130, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !134, file: !48, line: 130, baseType: !124, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !134, file: !48, line: 131, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !48, line: 164, size: 448, elements: !142)
!142 = !{!143, !144, !145, !148, !149, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !48, line: 165, baseType: !101, size: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !141, file: !48, line: 166, baseType: !112, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !141, file: !48, line: 172, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !48, line: 140, baseType: !134)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, file: !48, line: 174, baseType: !106, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !141, file: !48, line: 175, baseType: !118, size: 96, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !141, file: !48, line: 176, baseType: !116, size: 16, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !134, file: !48, line: 135, baseType: !133, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !134, file: !48, line: 135, baseType: !133, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !48, line: 139, baseType: !133, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !48, line: 139, baseType: !133, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !125, file: !48, line: 122, baseType: !156, size: 128, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !48, line: 108, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !48, line: 106, size: 128, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !48, line: 107, baseType: !124, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !157, file: !48, line: 107, baseType: !124, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !125, file: !48, line: 122, baseType: !156, size: 128, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !48, line: 123, baseType: !125)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !48, line: 178, baseType: !141)
!166 = !{i32 7, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!170 = distinct !DISubprogram(name: "bmo_connect_verts_exec", scope: !1, file: !1, line: 149, type: !171, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !317)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !173, !315}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !48, line: 246, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !48, line: 186, size: 8064, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !190, !191, !192, !193, !195, !197, !199, !200, !201, !202, !203, !204, !205, !206, !258, !298, !299, !300, !301, !302, !303, !304, !305, !312, !313, !314}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !175, file: !48, line: 187, baseType: !106, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !175, file: !48, line: 187, baseType: !106, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !175, file: !48, line: 187, baseType: !106, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !175, file: !48, line: 187, baseType: !106, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !175, file: !48, line: 188, baseType: !106, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !175, file: !48, line: 188, baseType: !106, size: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !175, file: !48, line: 188, baseType: !106, size: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !175, file: !48, line: 193, baseType: !108, size: 8, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !175, file: !48, line: 197, baseType: !108, size: 8, offset: 232)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !175, file: !48, line: 201, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !189, line: 39, flags: DIFlagFwdDecl)
!189 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !175, file: !48, line: 201, baseType: !187, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !175, file: !48, line: 201, baseType: !187, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !175, file: !48, line: 201, baseType: !187, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !175, file: !48, line: 208, baseType: !194, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !175, file: !48, line: 209, baseType: !196, size: 64, offset: 576)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !175, file: !48, line: 210, baseType: !198, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !175, file: !48, line: 213, baseType: !106, size: 32, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !175, file: !48, line: 214, baseType: !106, size: 32, offset: 736)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !175, file: !48, line: 215, baseType: !106, size: 32, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !175, file: !48, line: 218, baseType: !187, size: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !175, file: !48, line: 218, baseType: !187, size: 64, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !175, file: !48, line: 218, baseType: !187, size: 64, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !175, file: !48, line: 220, baseType: !106, size: 32, offset: 1024)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !175, file: !48, line: 221, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !209)
!209 = !{!210, !246, !247, !251, !254, !255, !257}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !208, file: !4, line: 191, baseType: !211, size: 5120)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 5120, elements: !244)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !213)
!213 = !{!214, !217, !219, !229, !230}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !212, file: !4, line: 148, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !212, file: !4, line: 149, baseType: !218, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !212, file: !4, line: 150, baseType: !220, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !222)
!222 = !{!223, !225, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !221, file: !4, line: 139, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !221, file: !4, line: 140, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !221, file: !4, line: 141, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !212, file: !4, line: 152, baseType: !106, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !4, line: 162, baseType: !231, size: 128, offset: 192)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !4, line: 155, size: 128, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !239}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !231, file: !4, line: 156, baseType: !106, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !231, file: !4, line: 157, baseType: !119, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !231, file: !4, line: 158, baseType: !86, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !231, file: !4, line: 159, baseType: !118, size: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !231, file: !4, line: 160, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !231, file: !4, line: 161, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !242, line: 48, baseType: !243)
!242 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !242, line: 48, flags: DIFlagFwdDecl)
!244 = !{!245}
!245 = !DISubrange(count: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !208, file: !4, line: 192, baseType: !211, size: 5120, offset: 5120)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !208, file: !4, line: 193, baseType: !248, size: 64, offset: 10240)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !173, !207}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !208, file: !4, line: 194, baseType: !252, size: 64, offset: 10304)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !189, line: 38, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !4, line: 195, baseType: !106, size: 32, offset: 10368)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !208, file: !4, line: 196, baseType: !256, size: 32, offset: 10400)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !4, line: 197, baseType: !106, size: 32, offset: 10432)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !175, file: !48, line: 223, baseType: !259, size: 1600, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !260, line: 73, baseType: !261)
!260 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !260, line: 64, size: 1600, elements: !262)
!262 = !{!263, !281, !285, !286, !287, !288, !289}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !261, file: !260, line: 65, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !260, line: 53, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !260, line: 42, size: 832, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !280}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !260, line: 43, baseType: !106, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !266, file: !260, line: 44, baseType: !106, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !260, line: 45, baseType: !106, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !266, file: !260, line: 46, baseType: !106, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !266, file: !260, line: 47, baseType: !106, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !266, file: !260, line: 48, baseType: !106, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !266, file: !260, line: 49, baseType: !106, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !266, file: !260, line: 50, baseType: !106, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !260, line: 51, baseType: !277, size: 512, offset: 256)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 512, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !260, line: 52, baseType: !86, size: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !261, file: !260, line: 66, baseType: !282, size: 1312, offset: 64)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1312, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 41)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !261, file: !260, line: 69, baseType: !106, size: 32, offset: 1376)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !261, file: !260, line: 69, baseType: !106, size: 32, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !261, file: !260, line: 70, baseType: !106, size: 32, offset: 1440)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !261, file: !260, line: 71, baseType: !187, size: 64, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !261, file: !260, line: 72, baseType: !290, size: 64, offset: 1536)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !260, line: 59, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !260, line: 57, size: 8192, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !292, file: !260, line: 58, baseType: !295, size: 8192)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 8192, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 1024)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !175, file: !48, line: 223, baseType: !259, size: 1600, offset: 2752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !175, file: !48, line: 223, baseType: !259, size: 1600, offset: 4352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !175, file: !48, line: 223, baseType: !259, size: 1600, offset: 5952)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !175, file: !48, line: 233, baseType: !116, size: 16, offset: 7552)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !175, file: !48, line: 236, baseType: !106, size: 32, offset: 7584)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !175, file: !48, line: 238, baseType: !106, size: 32, offset: 7616)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !175, file: !48, line: 238, baseType: !106, size: 32, offset: 7648)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !175, file: !48, line: 239, baseType: !306, size: 128, offset: 7680)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !307, line: 71, baseType: !308)
!307 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !307, line: 69, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !308, file: !307, line: 70, baseType: !86, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !308, file: !307, line: 70, baseType: !86, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !175, file: !48, line: 241, baseType: !164, size: 64, offset: 7808)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !175, file: !48, line: 243, baseType: !306, size: 128, offset: 7872)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !175, file: !48, line: 245, baseType: !86, size: 64, offset: 8000)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !208)
!317 = !{}
!318 = !DILocalVariable(name: "bm", arg: 1, scope: !170, file: !1, line: 149, type: !173)
!319 = !DILocation(line: 149, column: 36, scope: !170)
!320 = !DILocalVariable(name: "op", arg: 2, scope: !170, file: !1, line: 149, type: !315)
!321 = !DILocation(line: 149, column: 52, scope: !170)
!322 = !DILocalVariable(name: "siter", scope: !170, file: !1, line: 151, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !325)
!325 = !{!326, !329, !330, !339, !340}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !324, file: !4, line: 458, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !212)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !324, file: !4, line: 459, baseType: !106, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !324, file: !4, line: 460, baseType: !331, size: 192, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !242, line: 54, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !242, line: 50, size: 192, elements: !333)
!333 = !{!334, !335, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !332, file: !242, line: 51, baseType: !240, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !332, file: !242, line: 52, baseType: !336, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !242, line: 52, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !332, file: !242, line: 53, baseType: !5, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !324, file: !4, line: 461, baseType: !238, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !324, file: !4, line: 462, baseType: !108, size: 8, offset: 384)
!341 = !DILocation(line: 151, column: 10, scope: !170)
!342 = !DILocalVariable(name: "v", scope: !170, file: !1, line: 152, type: !96)
!343 = !DILocation(line: 152, column: 10, scope: !170)
!344 = !DILocalVariable(name: "f", scope: !170, file: !1, line: 153, type: !164)
!345 = !DILocation(line: 153, column: 10, scope: !170)
!346 = !DILocalVariable(name: "check_degenerate", scope: !170, file: !1, line: 154, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!349 = !DILocation(line: 154, column: 13, scope: !170)
!350 = !DILocation(line: 154, column: 50, scope: !170)
!351 = !DILocation(line: 154, column: 54, scope: !170)
!352 = !DILocation(line: 154, column: 32, scope: !170)
!353 = !DILocalVariable(name: "faces", scope: !170, file: !1, line: 155, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !189, line: 48, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !189, line: 45, size: 128, elements: !357)
!357 = !{!358, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !189, line: 46, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !356, file: !189, line: 47, baseType: !86, size: 64, offset: 64)
!361 = !DILocation(line: 155, column: 2, scope: !170)
!362 = !DILocalVariable(name: "_faces_pool", scope: !170, file: !1, line: 155, type: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !43, line: 47, baseType: !188)
!365 = !DILocalVariable(name: "_faces_type", scope: !170, file: !1, line: 155, type: !164)
!366 = !DILocation(line: 157, column: 2, scope: !367)
!367 = distinct !DILexicalBlock(scope: !170, file: !1, line: 157, column: 2)
!368 = !DILocation(line: 160, column: 30, scope: !170)
!369 = !DILocation(line: 160, column: 34, scope: !170)
!370 = !DILocation(line: 160, column: 38, scope: !170)
!371 = !DILocation(line: 160, column: 2, scope: !170)
!372 = !DILocation(line: 163, column: 2, scope: !373)
!373 = distinct !DILexicalBlock(scope: !170, file: !1, line: 163, column: 2)
!374 = !DILocation(line: 163, column: 2, scope: !375)
!375 = distinct !DILexicalBlock(scope: !373, file: !1, line: 163, column: 2)
!376 = !DILocalVariable(name: "iter", scope: !377, file: !1, line: 164, type: !378)
!377 = distinct !DILexicalBlock(scope: !375, file: !1, line: 163, column: 55)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !55, line: 186, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !55, line: 164, size: 512, elements: !380)
!380 = !{!381, !458, !459, !460, !461}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !55, line: 179, baseType: !382, size: 320)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !379, file: !55, line: 166, size: 320, elements: !383)
!383 = !{!384, !396, !402, !410, !418, !424, !430, !436, !440, !446, !452}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !382, file: !55, line: 167, baseType: !385, size: 192)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !55, line: 113, size: 192, elements: !386)
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !385, file: !55, line: 114, baseType: !388, size: 192)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !43, line: 80, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !43, line: 76, size: 192, elements: !390)
!390 = !{!391, !392, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !389, file: !43, line: 77, baseType: !363, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !389, file: !43, line: 78, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !43, line: 45, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !389, file: !43, line: 79, baseType: !5, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !382, file: !55, line: 169, baseType: !397, size: 192)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !55, line: 116, size: 192, elements: !398)
!398 = !{!399, !400, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !397, file: !55, line: 117, baseType: !96, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !397, file: !55, line: 118, baseType: !162, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !397, file: !55, line: 118, baseType: !162, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !382, file: !55, line: 170, baseType: !403, size: 320)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !55, line: 120, size: 320, elements: !404)
!404 = !{!405, !406, !407, !408, !409}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !403, file: !55, line: 121, baseType: !96, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !403, file: !55, line: 122, baseType: !146, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !403, file: !55, line: 122, baseType: !146, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !403, file: !55, line: 123, baseType: !162, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !403, file: !55, line: 123, baseType: !162, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !382, file: !55, line: 171, baseType: !411, size: 320)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !55, line: 125, size: 320, elements: !412)
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !411, file: !55, line: 126, baseType: !96, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !411, file: !55, line: 127, baseType: !146, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !411, file: !55, line: 127, baseType: !146, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !411, file: !55, line: 128, baseType: !162, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !411, file: !55, line: 128, baseType: !162, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !382, file: !55, line: 172, baseType: !419, size: 192)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !55, line: 130, size: 192, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !419, file: !55, line: 131, baseType: !162, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !419, file: !55, line: 132, baseType: !146, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !419, file: !55, line: 132, baseType: !146, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !382, file: !55, line: 173, baseType: !425, size: 192)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !55, line: 134, size: 192, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !425, file: !55, line: 135, baseType: !146, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !425, file: !55, line: 136, baseType: !146, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !425, file: !55, line: 136, baseType: !146, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !382, file: !55, line: 174, baseType: !431, size: 192)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !55, line: 138, size: 192, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !431, file: !55, line: 139, baseType: !162, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !431, file: !55, line: 140, baseType: !146, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !431, file: !55, line: 140, baseType: !146, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !382, file: !55, line: 175, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !55, line: 142, size: 64, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !437, file: !55, line: 143, baseType: !162, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !382, file: !55, line: 176, baseType: !441, size: 192)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !55, line: 145, size: 192, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !441, file: !55, line: 146, baseType: !164, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !441, file: !55, line: 147, baseType: !146, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !441, file: !55, line: 147, baseType: !146, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !382, file: !55, line: 177, baseType: !447, size: 192)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !55, line: 149, size: 192, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !447, file: !55, line: 150, baseType: !164, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !447, file: !55, line: 151, baseType: !146, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !447, file: !55, line: 151, baseType: !146, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !382, file: !55, line: 178, baseType: !453, size: 192)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !55, line: 153, size: 192, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !453, file: !55, line: 154, baseType: !164, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !453, file: !55, line: 155, baseType: !146, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !453, file: !55, line: 155, baseType: !146, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !379, file: !55, line: 181, baseType: !88, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !379, file: !55, line: 182, baseType: !92, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !379, file: !55, line: 184, baseType: !106, size: 32, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !379, file: !55, line: 185, baseType: !108, size: 8, offset: 480)
!462 = !DILocation(line: 164, column: 10, scope: !377)
!463 = !DILocalVariable(name: "l_iter", scope: !377, file: !1, line: 165, type: !146)
!464 = !DILocation(line: 165, column: 11, scope: !377)
!465 = !DILocation(line: 167, column: 3, scope: !377)
!466 = !DILocation(line: 168, column: 3, scope: !467)
!467 = distinct !DILexicalBlock(scope: !377, file: !1, line: 168, column: 3)
!468 = !DILocation(line: 168, column: 3, scope: !469)
!469 = distinct !DILexicalBlock(scope: !467, file: !1, line: 168, column: 3)
!470 = !DILocation(line: 169, column: 8, scope: !471)
!471 = distinct !DILexicalBlock(scope: !469, file: !1, line: 168, column: 53)
!472 = !DILocation(line: 169, column: 16, scope: !471)
!473 = !DILocation(line: 169, column: 6, scope: !471)
!474 = !DILocation(line: 170, column: 9, scope: !475)
!475 = distinct !DILexicalBlock(scope: !471, file: !1, line: 170, column: 8)
!476 = !DILocation(line: 170, column: 8, scope: !471)
!477 = !DILocation(line: 171, column: 10, scope: !478)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 171, column: 9)
!479 = distinct !DILexicalBlock(scope: !475, file: !1, line: 170, column: 50)
!480 = !DILocation(line: 171, column: 9, scope: !479)
!481 = !DILocation(line: 172, column: 6, scope: !482)
!482 = distinct !DILexicalBlock(scope: !478, file: !1, line: 171, column: 47)
!483 = !DILocation(line: 173, column: 10, scope: !484)
!484 = distinct !DILexicalBlock(scope: !482, file: !1, line: 173, column: 10)
!485 = !DILocation(line: 173, column: 13, scope: !484)
!486 = !DILocation(line: 173, column: 17, scope: !484)
!487 = !DILocation(line: 173, column: 10, scope: !482)
!488 = !DILocation(line: 174, column: 7, scope: !489)
!489 = distinct !DILexicalBlock(scope: !484, file: !1, line: 173, column: 22)
!490 = !DILocation(line: 175, column: 6, scope: !489)
!491 = !DILocation(line: 176, column: 5, scope: !482)
!492 = !DILocation(line: 177, column: 4, scope: !479)
!493 = !DILocation(line: 182, column: 8, scope: !494)
!494 = distinct !DILexicalBlock(scope: !471, file: !1, line: 182, column: 8)
!495 = !DILocation(line: 182, column: 8, scope: !471)
!496 = !DILocation(line: 183, column: 5, scope: !497)
!497 = distinct !DILexicalBlock(scope: !494, file: !1, line: 182, column: 61)
!498 = !DILocation(line: 184, column: 4, scope: !497)
!499 = !DILocation(line: 185, column: 8, scope: !500)
!500 = distinct !DILexicalBlock(scope: !471, file: !1, line: 185, column: 8)
!501 = !DILocation(line: 185, column: 8, scope: !471)
!502 = !DILocation(line: 186, column: 5, scope: !503)
!503 = distinct !DILexicalBlock(scope: !500, file: !1, line: 185, column: 61)
!504 = !DILocation(line: 187, column: 4, scope: !503)
!505 = !DILocation(line: 188, column: 3, scope: !471)
!506 = distinct !{!506, !466, !507}
!507 = !DILocation(line: 188, column: 3, scope: !467)
!508 = !DILocation(line: 189, column: 2, scope: !377)
!509 = distinct !{!509, !372, !510}
!510 = !DILocation(line: 189, column: 2, scope: !373)
!511 = !DILocation(line: 192, column: 2, scope: !170)
!512 = !DILocation(line: 192, column: 14, scope: !170)
!513 = !DILocation(line: 192, column: 12, scope: !170)
!514 = !DILocation(line: 193, column: 29, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !1, line: 193, column: 7)
!516 = distinct !DILexicalBlock(scope: !170, file: !1, line: 192, column: 41)
!517 = !DILocation(line: 193, column: 33, scope: !515)
!518 = !DILocation(line: 193, column: 36, scope: !515)
!519 = !DILocation(line: 193, column: 7, scope: !515)
!520 = !DILocation(line: 193, column: 54, scope: !515)
!521 = !DILocation(line: 193, column: 7, scope: !516)
!522 = !DILocation(line: 194, column: 20, scope: !523)
!523 = distinct !DILexicalBlock(scope: !515, file: !1, line: 193, column: 61)
!524 = !DILocation(line: 194, column: 24, scope: !523)
!525 = !DILocation(line: 194, column: 4, scope: !523)
