; ModuleID = 'blender/source/blender/editors/space_node/space_node.c'
source_filename = "blender/source/blender/editors/space_node/space_node.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bNodeInstanceKey = type { i32 }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!857 = !DIEnumerator(name: "ICON_BRUSH_FLATTEN", value: 789, isUnsigned: true)
!858 = !DIEnumerator(name: "ICON_BRUSH_GRAB", value: 790, isUnsigned: true)
!859 = !DIEnumerator(name: "ICON_BRUSH_INFLATE", value: 791, isUnsigned: true)
!860 = !DIEnumerator(name: "ICON_BRUSH_LAYER", value: 792, isUnsigned: true)
!861 = !DIEnumerator(name: "ICON_BRUSH_LIGHTEN", value: 793, isUnsigned: true)
!862 = !DIEnumerator(name: "ICON_BRUSH_MASK", value: 794, isUnsigned: true)
!863 = !DIEnumerator(name: "ICON_BRUSH_MIX", value: 795, isUnsigned: true)
!864 = !DIEnumerator(name: "ICON_BRUSH_MULTIPLY", value: 796, isUnsigned: true)
!865 = !DIEnumerator(name: "ICON_BRUSH_NUDGE", value: 797, isUnsigned: true)
!866 = !DIEnumerator(name: "ICON_BRUSH_PINCH", value: 798, isUnsigned: true)
!867 = !DIEnumerator(name: "ICON_BRUSH_SCRAPE", value: 799, isUnsigned: true)
!868 = !DIEnumerator(name: "ICON_BRUSH_SCULPT_DRAW", value: 800, isUnsigned: true)
!869 = !DIEnumerator(name: "ICON_BRUSH_SMEAR", value: 801, isUnsigned: true)
!870 = !DIEnumerator(name: "ICON_BRUSH_SMOOTH", value: 802, isUnsigned: true)
!871 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!872 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!873 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!874 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!875 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!876 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!877 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!878 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!879 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!880 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!881 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!882 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!883 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!884 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!885 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!886 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!887 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!888 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!889 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!890 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!891 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!892 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!893 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!894 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!895 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!896 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!897 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!898 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!899 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!900 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!901 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!902 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!903 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!904 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!905 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!906 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!907 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!908 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!909 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!910 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!911 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!912 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!913 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!914 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_CommonViewTypes", file: !916, line: 52, baseType: !917, size: 32, elements: !918)
!916 = !DIFile(filename: "blender/source/blender/editors/include/UI_view2d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!917 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "V2D_COMMONVIEW_CUSTOM", value: -1)
!920 = !DIEnumerator(name: "V2D_COMMONVIEW_STANDARD", value: 0)
!921 = !DIEnumerator(name: "V2D_COMMONVIEW_LIST", value: 1)
!922 = !DIEnumerator(name: "V2D_COMMONVIEW_STACK", value: 2)
!923 = !DIEnumerator(name: "V2D_COMMONVIEW_HEADER", value: 3)
!924 = !DIEnumerator(name: "V2D_COMMONVIEW_PANELS_UI", value: 4)
!925 = !{!926, !927, !949, !956, !1735, !3346, !3347, !3524, !3604, !3606, !1373, !3608, !1051, !943}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !18, line: 91, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !18, line: 85, size: 448, elements: !930)
!930 = !{!931, !933, !934, !941, !942, !944}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !929, file: !18, line: 86, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !929, file: !18, line: 86, baseType: !932, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !929, file: !18, line: 87, baseType: !935, size: 128, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !936, line: 71, baseType: !937)
!936 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !936, line: 69, size: 128, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !937, file: !936, line: 70, baseType: !926, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !937, file: !936, line: 70, baseType: !926, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !929, file: !18, line: 88, baseType: !917, size: 32, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !929, file: !18, line: 89, baseType: !943, size: 32, offset: 288)
!943 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !929, file: !18, line: 90, baseType: !945, size: 128, offset: 320)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 128, elements: !947)
!946 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!947 = !{!948}
!948 = !DISubrange(count: 8)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !951, line: 94, size: 192, elements: !952)
!951 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !951, line: 94, baseType: !926, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !950, file: !951, line: 94, baseType: !926, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !950, file: !951, line: 94, baseType: !926, size: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceNode", file: !18, line: 963, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !18, line: 925, size: 3200, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !966, !3324, !3325, !3326, !3327, !3328, !3329, !3330, !3331, !3332, !3333, !3334, !3335, !3336, !3337, !3338, !3339, !3340, !3341, !3342, !3343, !3344, !3345}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !18, line: 926, baseType: !927, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !958, file: !18, line: 926, baseType: !927, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !958, file: !18, line: 927, baseType: !935, size: 128, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !958, file: !18, line: 928, baseType: !917, size: 32, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !958, file: !18, line: 929, baseType: !943, size: 32, offset: 288)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !958, file: !18, line: 930, baseType: !945, size: 128, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !958, file: !18, line: 932, baseType: !967, size: 1280, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !968, line: 71, baseType: !969)
!968 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !968, line: 40, size: 1280, elements: !970)
!970 = !{!971, !980, !981, !989, !990, !991, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1012, !1013, !1014, !1017}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !969, file: !968, line: 41, baseType: !972, size: 128)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !973, line: 95, baseType: !974)
!973 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !973, line: 92, size: 128, elements: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !974, file: !973, line: 93, baseType: !943, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !974, file: !973, line: 93, baseType: !943, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !974, file: !973, line: 94, baseType: !943, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !974, file: !973, line: 94, baseType: !943, size: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !969, file: !968, line: 41, baseType: !972, size: 128, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !969, file: !968, line: 42, baseType: !982, size: 128, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !973, line: 89, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !973, line: 86, size: 128, elements: !984)
!984 = !{!985, !986, !987, !988}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !983, file: !973, line: 87, baseType: !917, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !983, file: !973, line: 87, baseType: !917, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !983, file: !973, line: 88, baseType: !917, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !983, file: !973, line: 88, baseType: !917, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !969, file: !968, line: 42, baseType: !982, size: 128, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !969, file: !968, line: 43, baseType: !982, size: 128, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !969, file: !968, line: 45, baseType: !992, size: 64, offset: 640)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 64, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 2)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !969, file: !968, line: 45, baseType: !992, size: 64, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !969, file: !968, line: 46, baseType: !943, size: 32, offset: 768)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !969, file: !968, line: 46, baseType: !943, size: 32, offset: 800)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !969, file: !968, line: 48, baseType: !946, size: 16, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !969, file: !968, line: 49, baseType: !946, size: 16, offset: 848)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !969, file: !968, line: 51, baseType: !946, size: 16, offset: 864)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !969, file: !968, line: 52, baseType: !946, size: 16, offset: 880)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !969, file: !968, line: 53, baseType: !946, size: 16, offset: 896)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !969, file: !968, line: 55, baseType: !946, size: 16, offset: 912)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !969, file: !968, line: 56, baseType: !946, size: 16, offset: 928)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !969, file: !968, line: 58, baseType: !946, size: 16, offset: 944)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !969, file: !968, line: 58, baseType: !946, size: 16, offset: 960)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !969, file: !968, line: 59, baseType: !946, size: 16, offset: 976)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !969, file: !968, line: 59, baseType: !946, size: 16, offset: 992)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !969, file: !968, line: 61, baseType: !946, size: 16, offset: 1008)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !969, file: !968, line: 63, baseType: !1011, size: 64, offset: 1024)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !969, file: !968, line: 64, baseType: !917, size: 32, offset: 1088)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !969, file: !968, line: 65, baseType: !917, size: 32, offset: 1120)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !969, file: !968, line: 68, baseType: !1015, size: 64, offset: 1152)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !968, line: 68, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !969, file: !968, line: 69, baseType: !1018, size: 64, offset: 1216)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1020, line: 490, size: 768, elements: !1021)
!1020 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1021 = !{!1022, !1023, !1024, !3315, !3316, !3317, !3318, !3319, !3320, !3321, !3322, !3323}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !1020, line: 491, baseType: !1018, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1019, file: !1020, line: 491, baseType: !1018, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1019, file: !1020, line: 493, baseType: !1025, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1027, line: 169, size: 2048, elements: !1028)
!1027 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1028 = !{!1029, !1030, !1031, !1032, !3232, !3233, !3234, !3235, !3236, !3237, !3238, !3239, !3240, !3241, !3242, !3243, !3244, !3245, !3246, !3247, !3248, !3249, !3290, !3293, !3307, !3308, !3309, !3310, !3311, !3312, !3313, !3314}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1026, file: !1027, line: 170, baseType: !1025, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1026, file: !1027, line: 170, baseType: !1025, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1026, file: !1027, line: 172, baseType: !926, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1026, file: !1027, line: 174, baseType: !1033, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !6, line: 49, size: 1984, elements: !1035)
!1035 = !{!1036, !1099, !1100, !1101, !1102, !1103, !3215, !3216, !3217, !3218, !3219, !3220, !3221, !3222, !3223, !3224, !3225, !3226, !3227, !3228, !3229, !3230, !3231}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1034, file: !6, line: 50, baseType: !1037, size: 960)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1038, line: 130, baseType: !1039)
!1038 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1038, line: 117, size: 960, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1045, !1065, !1069, !1070, !1071, !1072, !1073}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !1038, line: 118, baseType: !926, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1039, file: !1038, line: 118, baseType: !926, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1039, file: !1038, line: 119, baseType: !1044, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1039, file: !1038, line: 120, baseType: !1046, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1038, line: 136, size: 17600, elements: !1048)
!1048 = !{!1049, !1050, !1052, !1055, !1060, !1061, !1062}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1047, file: !1038, line: 137, baseType: !1037, size: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1047, file: !1038, line: 138, baseType: !1051, size: 64, offset: 960)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1047, file: !1038, line: 139, baseType: !1053, size: 64, offset: 1024)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1038, line: 43, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !1038, line: 140, baseType: !1056, size: 8192, offset: 1088)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 8192, elements: !1058)
!1057 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1058 = !{!1059}
!1059 = !DISubrange(count: 1024)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1047, file: !1038, line: 141, baseType: !1056, size: 8192, offset: 9280)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1047, file: !1038, line: 148, baseType: !1046, size: 64, offset: 17472)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1047, file: !1038, line: 150, baseType: !1063, size: 64, offset: 17536)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1038, line: 45, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !1038, line: 121, baseType: !1066, size: 528, offset: 256)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 528, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 66)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1039, file: !1038, line: 126, baseType: !946, size: 16, offset: 784)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1039, file: !1038, line: 127, baseType: !917, size: 32, offset: 800)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1039, file: !1038, line: 128, baseType: !917, size: 32, offset: 832)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1039, file: !1038, line: 128, baseType: !917, size: 32, offset: 864)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1039, file: !1038, line: 129, baseType: !1074, size: 64, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1038, line: 75, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1038, line: 62, size: 1024, elements: !1077)
!1077 = !{!1078, !1080, !1081, !1082, !1083, !1084, !1088, !1089, !1097, !1098}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1076, file: !1038, line: 63, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1076, file: !1038, line: 63, baseType: !1079, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1076, file: !1038, line: 64, baseType: !1057, size: 8, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1076, file: !1038, line: 64, baseType: !1057, size: 8, offset: 136)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1076, file: !1038, line: 65, baseType: !946, size: 16, offset: 144)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1076, file: !1038, line: 66, baseType: !1085, size: 512, offset: 160)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 512, elements: !1086)
!1086 = !{!1087}
!1087 = !DISubrange(count: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1076, file: !1038, line: 67, baseType: !917, size: 32, offset: 672)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1076, file: !1038, line: 69, baseType: !1090, size: 256, offset: 704)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1038, line: 60, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1038, line: 48, size: 256, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1091, file: !1038, line: 49, baseType: !926, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1091, file: !1038, line: 58, baseType: !935, size: 128, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1091, file: !1038, line: 59, baseType: !917, size: 32, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1091, file: !1038, line: 59, baseType: !917, size: 32, offset: 224)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1076, file: !1038, line: 70, baseType: !917, size: 32, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1076, file: !1038, line: 74, baseType: !917, size: 32, offset: 992)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1034, file: !6, line: 52, baseType: !935, size: 128, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1034, file: !6, line: 53, baseType: !935, size: 128, offset: 1088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1034, file: !6, line: 54, baseType: !935, size: 128, offset: 1216)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1034, file: !6, line: 55, baseType: !935, size: 128, offset: 1344)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1034, file: !6, line: 57, baseType: !1104, size: 64, offset: 1472)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1106, line: 1216, size: 39680, elements: !1107)
!1106 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1107 = !{!1108, !1109, !1113, !1117, !2258, !2259, !2260, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2629, !2843, !2846, !3086, !3098, !3099, !3100, !3101, !3102, !3103, !3104, !3105, !3108, !3109, !3110, !3111, !3112, !3120, !3186, !3193, !3194, !3201, !3202, !3208, !3209, !3210, !3211, !3212}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1105, file: !1106, line: 1217, baseType: !1037, size: 960)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1105, file: !1106, line: 1218, baseType: !1110, size: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1112, line: 42, flags: DIFlagFwdDecl)
!1112 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1105, file: !1106, line: 1220, baseType: !1114, size: 64, offset: 1024)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1116, line: 49, flags: DIFlagFwdDecl)
!1116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1105, file: !1106, line: 1221, baseType: !1118, size: 64, offset: 1088)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1120, line: 52, size: 4224, elements: !1121)
!1120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1194, !2253, !2254, !2255, !2256, !2257}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1119, file: !1120, line: 53, baseType: !1037, size: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1119, file: !1120, line: 54, baseType: !1110, size: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !1119, file: !1120, line: 56, baseType: !946, size: 16, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !1119, file: !1120, line: 56, baseType: !946, size: 16, offset: 1040)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1119, file: !1120, line: 57, baseType: !946, size: 16, offset: 1056)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !1119, file: !1120, line: 57, baseType: !946, size: 16, offset: 1072)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !1119, file: !1120, line: 59, baseType: !943, size: 32, offset: 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !1119, file: !1120, line: 59, baseType: !943, size: 32, offset: 1120)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !1119, file: !1120, line: 59, baseType: !943, size: 32, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !1119, file: !1120, line: 60, baseType: !943, size: 32, offset: 1184)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !1119, file: !1120, line: 60, baseType: !943, size: 32, offset: 1216)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !1119, file: !1120, line: 60, baseType: !943, size: 32, offset: 1248)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1119, file: !1120, line: 61, baseType: !943, size: 32, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1119, file: !1120, line: 61, baseType: !943, size: 32, offset: 1312)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1119, file: !1120, line: 61, baseType: !943, size: 32, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !1119, file: !1120, line: 68, baseType: !943, size: 32, offset: 1376)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1119, file: !1120, line: 68, baseType: !943, size: 32, offset: 1408)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1119, file: !1120, line: 68, baseType: !943, size: 32, offset: 1440)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !1119, file: !1120, line: 69, baseType: !943, size: 32, offset: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !1119, file: !1120, line: 69, baseType: !943, size: 32, offset: 1504)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1119, file: !1120, line: 74, baseType: !943, size: 32, offset: 1536)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !1119, file: !1120, line: 79, baseType: !943, size: 32, offset: 1568)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !1119, file: !1120, line: 81, baseType: !946, size: 16, offset: 1600)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1119, file: !1120, line: 91, baseType: !946, size: 16, offset: 1616)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !1119, file: !1120, line: 92, baseType: !946, size: 16, offset: 1632)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !1119, file: !1120, line: 93, baseType: !946, size: 16, offset: 1648)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !1119, file: !1120, line: 94, baseType: !946, size: 16, offset: 1664)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !1119, file: !1120, line: 94, baseType: !946, size: 16, offset: 1680)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !1119, file: !1120, line: 94, baseType: !946, size: 16, offset: 1696)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !1119, file: !1120, line: 94, baseType: !946, size: 16, offset: 1712)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !1119, file: !1120, line: 96, baseType: !943, size: 32, offset: 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !1119, file: !1120, line: 96, baseType: !943, size: 32, offset: 1760)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !1119, file: !1120, line: 96, baseType: !943, size: 32, offset: 1792)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !1119, file: !1120, line: 96, baseType: !943, size: 32, offset: 1824)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !1119, file: !1120, line: 98, baseType: !943, size: 32, offset: 1856)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !1119, file: !1120, line: 98, baseType: !943, size: 32, offset: 1888)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !1119, file: !1120, line: 98, baseType: !943, size: 32, offset: 1920)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !1119, file: !1120, line: 98, baseType: !943, size: 32, offset: 1952)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !1119, file: !1120, line: 99, baseType: !943, size: 32, offset: 1984)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !1119, file: !1120, line: 99, baseType: !943, size: 32, offset: 2016)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !1119, file: !1120, line: 100, baseType: !943, size: 32, offset: 2048)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !1119, file: !1120, line: 100, baseType: !943, size: 32, offset: 2080)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !1119, file: !1120, line: 103, baseType: !946, size: 16, offset: 2112)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !1119, file: !1120, line: 103, baseType: !946, size: 16, offset: 2128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !1119, file: !1120, line: 103, baseType: !946, size: 16, offset: 2144)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !1119, file: !1120, line: 103, baseType: !946, size: 16, offset: 2160)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !1119, file: !1120, line: 106, baseType: !943, size: 32, offset: 2176)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !1119, file: !1120, line: 106, baseType: !943, size: 32, offset: 2208)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !1119, file: !1120, line: 106, baseType: !943, size: 32, offset: 2240)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !1119, file: !1120, line: 106, baseType: !943, size: 32, offset: 2272)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !1119, file: !1120, line: 107, baseType: !946, size: 16, offset: 2304)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !1119, file: !1120, line: 107, baseType: !946, size: 16, offset: 2320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !1119, file: !1120, line: 107, baseType: !946, size: 16, offset: 2336)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !1119, file: !1120, line: 107, baseType: !946, size: 16, offset: 2352)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !1119, file: !1120, line: 108, baseType: !943, size: 32, offset: 2368)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !1119, file: !1120, line: 108, baseType: !943, size: 32, offset: 2400)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !1119, file: !1120, line: 109, baseType: !943, size: 32, offset: 2432)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !1119, file: !1120, line: 109, baseType: !943, size: 32, offset: 2464)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !1119, file: !1120, line: 110, baseType: !943, size: 32, offset: 2496)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !1119, file: !1120, line: 110, baseType: !943, size: 32, offset: 2528)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !1119, file: !1120, line: 110, baseType: !943, size: 32, offset: 2560)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !1119, file: !1120, line: 111, baseType: !946, size: 16, offset: 2592)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !1119, file: !1120, line: 111, baseType: !946, size: 16, offset: 2608)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !1119, file: !1120, line: 112, baseType: !946, size: 16, offset: 2624)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !1119, file: !1120, line: 112, baseType: !946, size: 16, offset: 2640)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !1119, file: !1120, line: 112, baseType: !946, size: 16, offset: 2656)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1119, file: !1120, line: 115, baseType: !946, size: 16, offset: 2672)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !1119, file: !1120, line: 118, baseType: !1011, size: 64, offset: 2688)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !1119, file: !1120, line: 118, baseType: !1011, size: 64, offset: 2752)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1119, file: !1120, line: 121, baseType: !1192, size: 64, offset: 2816)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1112, line: 45, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1119, file: !1120, line: 122, baseType: !1195, size: 1152, offset: 2880)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 1152, elements: !2251)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1116, line: 57, size: 2496, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1197, file: !1116, line: 59, baseType: !946, size: 16)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1197, file: !1116, line: 59, baseType: !946, size: 16, offset: 16)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1197, file: !1116, line: 59, baseType: !946, size: 16, offset: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1197, file: !1116, line: 59, baseType: !946, size: 16, offset: 48)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1197, file: !1116, line: 60, baseType: !1114, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1197, file: !1116, line: 61, baseType: !1205, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1116, line: 202, size: 3328, elements: !1207)
!1207 = !{!1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1277, !1962, !1963, !2038, !2064, !2092, !2093, !2161, !2182, !2190, !2191}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1206, file: !1116, line: 203, baseType: !1037, size: 960)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1206, file: !1116, line: 204, baseType: !1110, size: 64, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1206, file: !1116, line: 206, baseType: !943, size: 32, offset: 1024)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1206, file: !1116, line: 206, baseType: !943, size: 32, offset: 1056)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1206, file: !1116, line: 207, baseType: !943, size: 32, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1206, file: !1116, line: 207, baseType: !943, size: 32, offset: 1120)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1206, file: !1116, line: 207, baseType: !943, size: 32, offset: 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1206, file: !1116, line: 207, baseType: !943, size: 32, offset: 1184)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1206, file: !1116, line: 207, baseType: !943, size: 32, offset: 1216)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1206, file: !1116, line: 207, baseType: !943, size: 32, offset: 1248)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1206, file: !1116, line: 208, baseType: !943, size: 32, offset: 1280)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1206, file: !1116, line: 208, baseType: !943, size: 32, offset: 1312)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1206, file: !1116, line: 211, baseType: !943, size: 32, offset: 1344)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1206, file: !1116, line: 211, baseType: !943, size: 32, offset: 1376)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1206, file: !1116, line: 211, baseType: !943, size: 32, offset: 1408)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1206, file: !1116, line: 211, baseType: !943, size: 32, offset: 1440)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1206, file: !1116, line: 211, baseType: !943, size: 32, offset: 1472)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1206, file: !1116, line: 214, baseType: !943, size: 32, offset: 1504)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1206, file: !1116, line: 214, baseType: !943, size: 32, offset: 1536)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1206, file: !1116, line: 217, baseType: !943, size: 32, offset: 1568)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1206, file: !1116, line: 218, baseType: !943, size: 32, offset: 1600)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1206, file: !1116, line: 219, baseType: !943, size: 32, offset: 1632)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1206, file: !1116, line: 220, baseType: !943, size: 32, offset: 1664)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1206, file: !1116, line: 221, baseType: !943, size: 32, offset: 1696)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1206, file: !1116, line: 222, baseType: !946, size: 16, offset: 1728)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1206, file: !1116, line: 222, baseType: !946, size: 16, offset: 1744)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1206, file: !1116, line: 224, baseType: !946, size: 16, offset: 1760)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1206, file: !1116, line: 224, baseType: !946, size: 16, offset: 1776)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1206, file: !1116, line: 227, baseType: !946, size: 16, offset: 1792)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1206, file: !1116, line: 227, baseType: !946, size: 16, offset: 1808)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1206, file: !1116, line: 229, baseType: !946, size: 16, offset: 1824)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1206, file: !1116, line: 229, baseType: !946, size: 16, offset: 1840)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1206, file: !1116, line: 230, baseType: !946, size: 16, offset: 1856)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1206, file: !1116, line: 230, baseType: !946, size: 16, offset: 1872)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1206, file: !1116, line: 232, baseType: !943, size: 32, offset: 1888)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1206, file: !1116, line: 232, baseType: !943, size: 32, offset: 1920)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1206, file: !1116, line: 232, baseType: !943, size: 32, offset: 1952)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1206, file: !1116, line: 232, baseType: !943, size: 32, offset: 1984)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1206, file: !1116, line: 233, baseType: !917, size: 32, offset: 2016)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1206, file: !1116, line: 234, baseType: !917, size: 32, offset: 2048)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1206, file: !1116, line: 235, baseType: !946, size: 16, offset: 2080)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1206, file: !1116, line: 235, baseType: !946, size: 16, offset: 2096)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1206, file: !1116, line: 236, baseType: !946, size: 16, offset: 2112)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1206, file: !1116, line: 239, baseType: !946, size: 16, offset: 2128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1206, file: !1116, line: 240, baseType: !917, size: 32, offset: 2144)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1206, file: !1116, line: 241, baseType: !917, size: 32, offset: 2176)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1206, file: !1116, line: 241, baseType: !917, size: 32, offset: 2208)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1206, file: !1116, line: 241, baseType: !917, size: 32, offset: 2240)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1206, file: !1116, line: 243, baseType: !943, size: 32, offset: 2272)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1206, file: !1116, line: 243, baseType: !943, size: 32, offset: 2304)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1206, file: !1116, line: 244, baseType: !943, size: 32, offset: 2336)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1206, file: !1116, line: 246, baseType: !1260, size: 320, offset: 2368)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1261, line: 50, size: 320, elements: !1262)
!1261 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1262 = !{!1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1260, file: !1261, line: 51, baseType: !1104, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1260, file: !1261, line: 53, baseType: !917, size: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1260, file: !1261, line: 54, baseType: !917, size: 32, offset: 96)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1260, file: !1261, line: 55, baseType: !917, size: 32, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1260, file: !1261, line: 55, baseType: !917, size: 32, offset: 160)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1260, file: !1261, line: 56, baseType: !1057, size: 8, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1260, file: !1261, line: 56, baseType: !1057, size: 8, offset: 200)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1260, file: !1261, line: 57, baseType: !1057, size: 8, offset: 208)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1260, file: !1261, line: 57, baseType: !1057, size: 8, offset: 216)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1260, file: !1261, line: 59, baseType: !946, size: 16, offset: 224)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1260, file: !1261, line: 59, baseType: !946, size: 16, offset: 240)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1260, file: !1261, line: 59, baseType: !946, size: 16, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1260, file: !1261, line: 61, baseType: !946, size: 16, offset: 272)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1260, file: !1261, line: 63, baseType: !917, size: 32, offset: 288)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1206, file: !1116, line: 248, baseType: !1278, size: 64, offset: 2688)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1280, line: 328, size: 3456, elements: !1281)
!1280 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1281 = !{!1282, !1283, !1284, !1909, !1910, !1911, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1940, !1941, !1942, !1945, !1949, !1953, !1957, !1958, !1959, !1960, !1961}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1279, file: !1280, line: 329, baseType: !1037, size: 960)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1279, file: !1280, line: 330, baseType: !1110, size: 64, offset: 960)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1279, file: !1280, line: 332, baseType: !1285, size: 64, offset: 1024)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1287, line: 283, size: 4096, elements: !1288)
!1287 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1288 = !{!1289, !1290, !1291, !1292, !1296, !1297, !1301, !1878, !1886, !1890, !1896, !1900, !1901, !1902, !1903, !1907, !1908}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1286, file: !1287, line: 284, baseType: !917, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1286, file: !1287, line: 285, baseType: !1085, size: 512, offset: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1286, file: !1287, line: 287, baseType: !1085, size: 512, offset: 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1286, file: !1287, line: 288, baseType: !1293, size: 2048, offset: 1056)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 2048, elements: !1294)
!1294 = !{!1295}
!1295 = !DISubrange(count: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1286, file: !1287, line: 289, baseType: !917, size: 32, offset: 3104)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !1286, file: !1287, line: 292, baseType: !1298, size: 64, offset: 3136)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !1278}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !1286, file: !1287, line: 293, baseType: !1302, size: 64, offset: 3200)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{null, !1278, !1305}
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !1280, line: 167, size: 3712, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1311, !1312, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1306, file: !1280, line: 168, baseType: !1305, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1306, file: !1280, line: 168, baseType: !1305, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !1306, file: !1280, line: 168, baseType: !1305, size: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1306, file: !1280, line: 170, baseType: !1074, size: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1306, file: !1280, line: 172, baseType: !1313, size: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !1287, line: 144, size: 6016, elements: !1315)
!1315 = !{!1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1496, !1497, !1498, !1742, !1746, !1750, !1751, !1758, !1762, !1766, !1767, !1768, !1769, !1773, !1774, !1778, !1782, !1786, !1790, !1794, !1798, !1802, !1803, !1810, !1812, !1821, !1830}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1314, file: !1287, line: 145, baseType: !926, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1314, file: !1287, line: 145, baseType: !926, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !1314, file: !1287, line: 146, baseType: !946, size: 16, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1314, file: !1287, line: 148, baseType: !1085, size: 512, offset: 144)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1314, file: !1287, line: 149, baseType: !917, size: 32, offset: 672)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1314, file: !1287, line: 151, baseType: !1085, size: 512, offset: 704)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1314, file: !1287, line: 152, baseType: !1293, size: 2048, offset: 1216)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1314, file: !1287, line: 153, baseType: !917, size: 32, offset: 3264)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1314, file: !1287, line: 155, baseType: !943, size: 32, offset: 3296)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !1314, file: !1287, line: 155, baseType: !943, size: 32, offset: 3328)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !1314, file: !1287, line: 155, baseType: !943, size: 32, offset: 3360)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1314, file: !1287, line: 156, baseType: !943, size: 32, offset: 3392)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !1314, file: !1287, line: 156, baseType: !943, size: 32, offset: 3424)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !1314, file: !1287, line: 156, baseType: !943, size: 32, offset: 3456)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !1314, file: !1287, line: 157, baseType: !946, size: 16, offset: 3488)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1314, file: !1287, line: 157, baseType: !946, size: 16, offset: 3504)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !1314, file: !1287, line: 157, baseType: !946, size: 16, offset: 3520)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1314, file: !1287, line: 160, baseType: !1334, size: 64, offset: 3584)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !1287, line: 109, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !1287, line: 98, size: 1408, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1495}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1336, file: !1287, line: 99, baseType: !917, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1336, file: !1287, line: 99, baseType: !917, size: 32, offset: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1336, file: !1287, line: 100, baseType: !1085, size: 512, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !1336, file: !1287, line: 101, baseType: !943, size: 32, offset: 576)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1336, file: !1287, line: 101, baseType: !943, size: 32, offset: 608)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !1336, file: !1287, line: 101, baseType: !943, size: 32, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !1336, file: !1287, line: 101, baseType: !943, size: 32, offset: 672)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1336, file: !1287, line: 102, baseType: !943, size: 32, offset: 704)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1336, file: !1287, line: 102, baseType: !943, size: 32, offset: 736)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1336, file: !1287, line: 103, baseType: !917, size: 32, offset: 768)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1336, file: !1287, line: 104, baseType: !917, size: 32, offset: 800)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !1336, file: !1287, line: 107, baseType: !1350, size: 64, offset: 832)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !1280, line: 87, size: 2816, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1476}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1351, file: !1280, line: 88, baseType: !1350, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1351, file: !1280, line: 88, baseType: !1350, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !1351, file: !1280, line: 88, baseType: !1350, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1351, file: !1280, line: 90, baseType: !1074, size: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1351, file: !1280, line: 92, baseType: !1085, size: 512, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1351, file: !1280, line: 94, baseType: !1085, size: 512, offset: 768)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !1351, file: !1280, line: 99, baseType: !926, size: 64, offset: 1280)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1351, file: !1280, line: 101, baseType: !946, size: 16, offset: 1344)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1351, file: !1280, line: 101, baseType: !946, size: 16, offset: 1360)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1351, file: !1280, line: 102, baseType: !946, size: 16, offset: 1376)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !1351, file: !1280, line: 103, baseType: !946, size: 16, offset: 1392)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1351, file: !1280, line: 104, baseType: !1365, size: 64, offset: 1408)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !1287, line: 114, size: 1600, elements: !1367)
!1367 = !{!1368, !1369, !1392, !1396, !1400, !1404, !1408, !1412, !1413, !1417, !1446, !1447, !1448}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1366, file: !1287, line: 115, baseType: !1085, size: 512)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1366, file: !1287, line: 117, baseType: !1370, size: 64, offset: 512)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{null, !1373, !1376, !1379, !1379, !1390}
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1375, line: 44, flags: DIFlagFwdDecl)
!1375 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1378, line: 48, flags: DIFlagFwdDecl)
!1378 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1375, line: 55, size: 192, elements: !1381)
!1381 = !{!1382, !1386, !1389}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1380, file: !1375, line: 58, baseType: !1383, size: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1380, file: !1375, line: 56, size: 64, elements: !1384)
!1384 = !{!1385}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1383, file: !1375, line: 57, baseType: !926, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1380, file: !1375, line: 60, baseType: !1387, size: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1280, line: 335, flags: DIFlagFwdDecl)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1380, file: !1375, line: 61, baseType: !926, size: 64, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !1366, file: !1287, line: 118, baseType: !1393, size: 64, offset: 576)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{null, !1373, !1379, !1379, !1011}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !1366, file: !1287, line: 120, baseType: !1397, size: 64, offset: 640)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DISubroutineType(types: !1399)
!1399 = !{null, !1373, !1376, !1379}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !1366, file: !1287, line: 121, baseType: !1401, size: 64, offset: 704)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{null, !1373, !1379, !1011}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !1366, file: !1287, line: 122, baseType: !1405, size: 64, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{null, !1278, !1350, !1387}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !1366, file: !1287, line: 123, baseType: !1409, size: 64, offset: 832)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{null, !1278, !1350, !1305, !1350, !1390}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !1366, file: !1287, line: 124, baseType: !1409, size: 64, offset: 896)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !1366, file: !1287, line: 125, baseType: !1414, size: 64, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !1278, !1350, !1305, !1350}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !1366, file: !1287, line: 128, baseType: !1418, size: 256, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !1375, line: 436, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !1375, line: 430, size: 256, elements: !1420)
!1420 = !{!1421, !1422, !1425, !1441}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1419, file: !1375, line: 431, baseType: !926, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1419, file: !1375, line: 432, baseType: !1423, size: 64, offset: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !1375, line: 417, baseType: !1388)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1419, file: !1375, line: 433, baseType: !1426, size: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !1375, line: 408, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!917, !1373, !1379, !1430, !1432}
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1375, line: 38, flags: DIFlagFwdDecl)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !1375, line: 348, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !1375, line: 337, size: 256, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1434, file: !1375, line: 339, baseType: !926, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1434, file: !1375, line: 342, baseType: !1430, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1434, file: !1375, line: 345, baseType: !917, size: 32, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1434, file: !1375, line: 347, baseType: !917, size: 32, offset: 160)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1434, file: !1375, line: 347, baseType: !917, size: 32, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1419, file: !1375, line: 434, baseType: !1442, size: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !1375, line: 409, baseType: !1443)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{null, !926}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !1366, file: !1287, line: 129, baseType: !1418, size: 256, offset: 1280)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1366, file: !1287, line: 132, baseType: !917, size: 32, offset: 1536)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1366, file: !1287, line: 132, baseType: !917, size: 32, offset: 1568)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1351, file: !1280, line: 105, baseType: !1085, size: 512, offset: 1472)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !1351, file: !1280, line: 107, baseType: !943, size: 32, offset: 1984)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !1351, file: !1280, line: 107, baseType: !943, size: 32, offset: 2016)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !1351, file: !1280, line: 109, baseType: !926, size: 64, offset: 2048)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !1351, file: !1280, line: 112, baseType: !946, size: 16, offset: 2112)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !1351, file: !1280, line: 114, baseType: !946, size: 16, offset: 2128)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1351, file: !1280, line: 115, baseType: !917, size: 32, offset: 2144)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1351, file: !1280, line: 117, baseType: !926, size: 64, offset: 2176)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !1351, file: !1280, line: 122, baseType: !917, size: 32, offset: 2240)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !1351, file: !1280, line: 124, baseType: !917, size: 32, offset: 2272)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !1351, file: !1280, line: 126, baseType: !1350, size: 64, offset: 2304)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1351, file: !1280, line: 128, baseType: !1461, size: 64, offset: 2368)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !1280, line: 298, size: 448, elements: !1463)
!1463 = !{!1464, !1465, !1466, !1469, !1470, !1473, !1474, !1475}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1462, file: !1280, line: 299, baseType: !1461, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1462, file: !1280, line: 299, baseType: !1461, size: 64, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !1462, file: !1280, line: 301, baseType: !1467, size: 64, offset: 128)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !1280, line: 218, baseType: !1306)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !1462, file: !1280, line: 301, baseType: !1467, size: 64, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !1462, file: !1280, line: 302, baseType: !1471, size: 64, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !1280, line: 132, baseType: !1351)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !1462, file: !1280, line: 302, baseType: !1471, size: 64, offset: 320)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1462, file: !1280, line: 304, baseType: !917, size: 32, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1462, file: !1280, line: 305, baseType: !917, size: 32, offset: 416)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1351, file: !1280, line: 131, baseType: !1477, size: 384, offset: 2432)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !1280, line: 73, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !1280, line: 62, size: 384, elements: !1479)
!1479 = !{!1480, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1478, file: !1280, line: 63, baseType: !1481, size: 128)
!1481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, elements: !1482)
!1482 = !{!1483}
!1483 = !DISubrange(count: 4)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1478, file: !1280, line: 64, baseType: !943, size: 32, offset: 128)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1478, file: !1280, line: 64, baseType: !943, size: 32, offset: 160)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1478, file: !1280, line: 65, baseType: !926, size: 64, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !1478, file: !1280, line: 66, baseType: !946, size: 16, offset: 256)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !1478, file: !1280, line: 67, baseType: !946, size: 16, offset: 272)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !1478, file: !1280, line: 68, baseType: !946, size: 16, offset: 288)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !1478, file: !1280, line: 69, baseType: !946, size: 16, offset: 304)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1478, file: !1280, line: 70, baseType: !946, size: 16, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1478, file: !1280, line: 71, baseType: !946, size: 16, offset: 336)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1478, file: !1280, line: 72, baseType: !1494, size: 32, offset: 352)
!1494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 32, elements: !993)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1336, file: !1287, line: 108, baseType: !1085, size: 512, offset: 896)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1314, file: !1287, line: 160, baseType: !1334, size: 64, offset: 3648)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !1314, file: !1287, line: 162, baseType: !1085, size: 512, offset: 3712)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !1314, file: !1287, line: 165, baseType: !1499, size: 64, offset: 4224)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{null, !1502, !1504, !1737, !1278, !1305, !1738}
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !6, line: 230, size: 3072, elements: !1506)
!1506 = !{!1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1736}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1505, file: !6, line: 231, baseType: !1504, size: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1505, file: !6, line: 231, baseType: !1504, size: 64, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1505, file: !6, line: 233, baseType: !967, size: 1280, offset: 128)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !1505, file: !6, line: 234, baseType: !982, size: 128, offset: 1408)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !1505, file: !6, line: 235, baseType: !982, size: 128, offset: 1536)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1505, file: !6, line: 236, baseType: !946, size: 16, offset: 1664)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1505, file: !6, line: 236, baseType: !946, size: 16, offset: 1680)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1505, file: !6, line: 238, baseType: !946, size: 16, offset: 1696)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !1505, file: !6, line: 239, baseType: !946, size: 16, offset: 1712)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1505, file: !6, line: 240, baseType: !946, size: 16, offset: 1728)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1505, file: !6, line: 241, baseType: !946, size: 16, offset: 1744)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !1505, file: !6, line: 243, baseType: !943, size: 32, offset: 1760)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1505, file: !6, line: 244, baseType: !946, size: 16, offset: 1792)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1505, file: !6, line: 244, baseType: !946, size: 16, offset: 1808)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !1505, file: !6, line: 246, baseType: !946, size: 16, offset: 1824)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !1505, file: !6, line: 247, baseType: !946, size: 16, offset: 1840)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !1505, file: !6, line: 248, baseType: !946, size: 16, offset: 1856)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !1505, file: !6, line: 249, baseType: !946, size: 16, offset: 1872)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !1505, file: !6, line: 250, baseType: !946, size: 16, offset: 1888)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1505, file: !6, line: 251, baseType: !946, size: 16, offset: 1904)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1505, file: !6, line: 253, baseType: !1528, size: 64, offset: 1920)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1378, line: 116, size: 1472, elements: !1530)
!1530 = !{!1531, !1532, !1533, !1534, !1583, !1584, !1588, !1700, !1704, !1708, !1709, !1710, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1529, file: !1378, line: 117, baseType: !1528, size: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1529, file: !1378, line: 117, baseType: !1528, size: 64, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !1529, file: !1378, line: 119, baseType: !917, size: 32, offset: 128)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1529, file: !1378, line: 122, baseType: !1535, size: 64, offset: 192)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{null, !1538, !1504}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !1027, line: 128, size: 2816, elements: !1540)
!1540 = !{!1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1559, !1560, !1561, !1562, !1563, !1574, !1575, !1576, !1577, !1578, !1579}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1539, file: !1027, line: 129, baseType: !1037, size: 960)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1539, file: !1027, line: 131, baseType: !1025, size: 64, offset: 960)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "winactive", scope: !1539, file: !1027, line: 131, baseType: !1025, size: 64, offset: 1024)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !1539, file: !1027, line: 132, baseType: !935, size: 128, offset: 1088)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1539, file: !1027, line: 134, baseType: !917, size: 32, offset: 1216)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "file_saved", scope: !1539, file: !1027, line: 135, baseType: !946, size: 16, offset: 1248)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "op_undo_depth", scope: !1539, file: !1027, line: 136, baseType: !946, size: 16, offset: 1264)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "operators", scope: !1539, file: !1027, line: 138, baseType: !935, size: 128, offset: 1280)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !1539, file: !1027, line: 140, baseType: !935, size: 128, offset: 1408)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !1539, file: !1027, line: 142, baseType: !1551, size: 320, offset: 1536)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !1027, line: 106, size: 320, elements: !1552)
!1552 = !{!1553, !1554, !1555, !1556, !1557, !1558}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1551, file: !1027, line: 107, baseType: !935, size: 128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1551, file: !1027, line: 108, baseType: !917, size: 32, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1551, file: !1027, line: 109, baseType: !917, size: 32, offset: 160)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1551, file: !1027, line: 110, baseType: !917, size: 32, offset: 192)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1551, file: !1027, line: 110, baseType: !917, size: 32, offset: 224)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1551, file: !1027, line: 111, baseType: !1018, size: 64, offset: 256)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !1539, file: !1027, line: 144, baseType: !935, size: 128, offset: 1856)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursors", scope: !1539, file: !1027, line: 146, baseType: !935, size: 128, offset: 1984)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "drags", scope: !1539, file: !1027, line: 148, baseType: !935, size: 128, offset: 2112)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigs", scope: !1539, file: !1027, line: 150, baseType: !935, size: 128, offset: 2240)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "defaultconf", scope: !1539, file: !1027, line: 151, baseType: !1564, size: 64, offset: 2368)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !1027, line: 310, size: 1344, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570, !1571, !1572, !1573}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1565, file: !1027, line: 311, baseType: !1564, size: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1565, file: !1027, line: 311, baseType: !1564, size: 64, offset: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1565, file: !1027, line: 313, baseType: !1085, size: 512, offset: 128)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !1565, file: !1027, line: 314, baseType: !1085, size: 512, offset: 640)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !1565, file: !1027, line: 316, baseType: !935, size: 128, offset: 1152)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !1565, file: !1027, line: 317, baseType: !917, size: 32, offset: 1280)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1565, file: !1027, line: 317, baseType: !917, size: 32, offset: 1312)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "addonconf", scope: !1539, file: !1027, line: 152, baseType: !1564, size: 64, offset: 2432)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "userconf", scope: !1539, file: !1027, line: 153, baseType: !1564, size: 64, offset: 2496)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "timers", scope: !1539, file: !1027, line: 155, baseType: !935, size: 128, offset: 2560)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "autosavetimer", scope: !1539, file: !1027, line: 156, baseType: !1018, size: 64, offset: 2688)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "is_interface_locked", scope: !1539, file: !1027, line: 158, baseType: !1057, size: 8, offset: 2752)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1539, file: !1027, line: 159, baseType: !1580, size: 56, offset: 2760)
!1580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 56, elements: !1581)
!1581 = !{!1582}
!1582 = !DISubrange(count: 7)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !1529, file: !1378, line: 124, baseType: !1535, size: 64, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1529, file: !1378, line: 126, baseType: !1585, size: 64, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{null, !1502, !1504}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1529, file: !1378, line: 128, baseType: !1589, size: 64, offset: 384)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{null, !1033, !1592, !1504, !1657}
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !6, line: 203, size: 1280, elements: !1594)
!1594 = !{!1595, !1596, !1597, !1614, !1615, !1616, !1617, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1696, !1697, !1698, !1699}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1593, file: !6, line: 204, baseType: !1592, size: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1593, file: !6, line: 204, baseType: !1592, size: 64, offset: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1593, file: !6, line: 206, baseType: !1598, size: 64, offset: 128)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !6, line: 87, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !6, line: 82, size: 256, elements: !1601)
!1601 = !{!1602, !1604, !1605, !1606, !1612, !1613}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1600, file: !6, line: 83, baseType: !1603, size: 64)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1600, file: !6, line: 83, baseType: !1603, size: 64, offset: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !1600, file: !6, line: 83, baseType: !1603, size: 64, offset: 128)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1600, file: !6, line: 84, baseType: !1607, size: 32, offset: 192)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !973, line: 43, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !973, line: 41, size: 32, elements: !1609)
!1609 = !{!1610, !1611}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1608, file: !973, line: 42, baseType: !946, size: 16)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1608, file: !973, line: 42, baseType: !946, size: 16, offset: 16)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1600, file: !6, line: 86, baseType: !946, size: 16, offset: 224)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !1600, file: !6, line: 86, baseType: !946, size: 16, offset: 240)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1593, file: !6, line: 206, baseType: !1598, size: 64, offset: 192)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1593, file: !6, line: 206, baseType: !1598, size: 64, offset: 256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1593, file: !6, line: 206, baseType: !1598, size: 64, offset: 320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1593, file: !6, line: 207, baseType: !1618, size: 64, offset: 384)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !6, line: 80, baseType: !1034)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "totrct", scope: !1593, file: !6, line: 209, baseType: !982, size: 128, offset: 448)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1593, file: !6, line: 211, baseType: !1057, size: 8, offset: 576)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "butspacetype", scope: !1593, file: !6, line: 211, baseType: !1057, size: 8, offset: 584)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1593, file: !6, line: 212, baseType: !946, size: 16, offset: 592)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1593, file: !6, line: 212, baseType: !946, size: 16, offset: 608)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "headertype", scope: !1593, file: !6, line: 214, baseType: !946, size: 16, offset: 624)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !1593, file: !6, line: 215, baseType: !946, size: 16, offset: 640)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1593, file: !6, line: 216, baseType: !946, size: 16, offset: 656)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "region_active_win", scope: !1593, file: !6, line: 217, baseType: !946, size: 16, offset: 672)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1593, file: !6, line: 219, baseType: !1057, size: 8, offset: 688)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1593, file: !6, line: 219, baseType: !1057, size: 8, offset: 696)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1593, file: !6, line: 221, baseType: !1632, size: 64, offset: 704)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !1378, line: 66, size: 1728, elements: !1634)
!1634 = !{!1635, !1636, !1637, !1638, !1639, !1640, !1644, !1648, !1652, !1653, !1670, !1674, !1678, !1682, !1686, !1687, !1693, !1694, !1695}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1633, file: !1378, line: 67, baseType: !1632, size: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1633, file: !1378, line: 67, baseType: !1632, size: 64, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1633, file: !1378, line: 69, baseType: !1085, size: 512, offset: 128)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1633, file: !1378, line: 70, baseType: !917, size: 32, offset: 640)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !1633, file: !1378, line: 71, baseType: !917, size: 32, offset: 672)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !1633, file: !1378, line: 74, baseType: !1641, size: 64, offset: 704)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!932, !1502}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1633, file: !1378, line: 76, baseType: !1645, size: 64, offset: 768)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{null, !932}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1633, file: !1378, line: 79, baseType: !1649, size: 64, offset: 832)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{null, !1538, !1592}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !1633, file: !1378, line: 81, baseType: !1649, size: 64, offset: 896)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1633, file: !1378, line: 83, baseType: !1654, size: 64, offset: 960)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1033, !1592, !1657}
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmNotifier", file: !1020, line: 195, size: 512, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1658, file: !1020, line: 196, baseType: !1657, size: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1658, file: !1020, line: 196, baseType: !1657, size: 64, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !1658, file: !1020, line: 198, baseType: !1538, size: 64, offset: 128)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1658, file: !1020, line: 199, baseType: !1025, size: 64, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1658, file: !1020, line: 201, baseType: !917, size: 32, offset: 256)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1658, file: !1020, line: 202, baseType: !7, size: 32, offset: 288)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1658, file: !1020, line: 202, baseType: !7, size: 32, offset: 320)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1658, file: !1020, line: 202, baseType: !7, size: 32, offset: 352)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1658, file: !1020, line: 202, baseType: !7, size: 32, offset: 384)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1658, file: !1020, line: 204, baseType: !926, size: 64, offset: 448)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !1633, file: !1378, line: 86, baseType: !1671, size: 64, offset: 1024)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{null, !1502, !1592}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !1633, file: !1378, line: 89, baseType: !1675, size: 64, offset: 1088)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!932, !932}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "operatortypes", scope: !1633, file: !1378, line: 92, baseType: !1679, size: 64, offset: 1152)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{null}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !1633, file: !1378, line: 94, baseType: !1683, size: 64, offset: 1216)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{null, !1564}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "dropboxes", scope: !1633, file: !1378, line: 96, baseType: !1679, size: 64, offset: 1280)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1633, file: !1378, line: 99, baseType: !1688, size: 64, offset: 1344)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!917, !1502, !1390, !1691}
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64)
!1692 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContextDataResult", file: !61, line: 71, flags: DIFlagFwdDecl)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "regiontypes", scope: !1633, file: !1378, line: 102, baseType: !935, size: 128, offset: 1408)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "toolshelf", scope: !1633, file: !1378, line: 105, baseType: !935, size: 128, offset: 1536)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "keymapflag", scope: !1633, file: !1378, line: 110, baseType: !917, size: 32, offset: 1664)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "spacedata", scope: !1593, file: !6, line: 223, baseType: !935, size: 128, offset: 768)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1593, file: !6, line: 224, baseType: !935, size: 128, offset: 896)
