; ModuleID = 'libpng/pngtrans.c'
source_filename = "libpng/pngtrans.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "onebppswaptable", scope: !2, file: !3, line: 289, type: !19, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !16, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libpng/pngtrans.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !10, !12, !13, !14}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !8, line: 447, baseType: !9)
!8 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !8, line: 449, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !8, line: 524, baseType: !6)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !8, line: 441, baseType: !15)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!0, !17, !23}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "twobppswaptable", scope: !2, file: !3, line: 324, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !21)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!21 = !{!22}
!22 = !DISubrange(count: 256)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "fourbppswaptable", scope: !2, file: !3, line: 359, type: !19, isLocal: true, isDefinition: true)
!25 = !{i32 7, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{i32 1, !"wchar_size", i32 4}
!28 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!29 = distinct !DISubprogram(name: "png_set_bgr", scope: !3, file: !3, line: 21, type: !30, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !32}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !33, line: 851, baseType: !34)
!33 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !33, line: 849, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !37, line: 29, size: 9728, elements: !38)
!37 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = !{!39, !65, !71, !80, !81, !82, !92, !93, !94, !110, !111, !112, !113, !114, !115, !116, !117, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !216, !217, !218, !221, !230, !231, !234, !235, !236, !237, !238, !239, !240, !244, !245, !246, !247, !248, !257, !258, !259, !260, !265, !267, !395, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !428, !429, !430, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !451, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !36, file: !37, line: 32, baseType: !40, size: 1600)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !41, line: 45, baseType: !42)
!41 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1600, elements: !63)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !41, line: 33, size: 1600, elements: !44)
!44 = !{!45, !52, !53}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !43, file: !41, line: 39, baseType: !46, size: 512)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !47, line: 31, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 512, elements: !50)
!49 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!50 = !{!51}
!51 = !DISubrange(count: 8)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !43, file: !41, line: 40, baseType: !12, size: 32, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !43, file: !41, line: 41, baseType: !54, size: 1024, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !55, line: 8, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 5, size: 1024, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !56, file: !55, line: 7, baseType: !59, size: 1024)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 1024, elements: !61)
!60 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!61 = !{!62}
!62 = !DISubrange(count: 16)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !36, file: !37, line: 33, baseType: !66, size: 64, offset: 1600)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !33, line: 913, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !12}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !36, file: !37, line: 35, baseType: !72, size: 64, offset: 1664)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !33, line: 861, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !32, !76}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !8, line: 537, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !36, file: !37, line: 37, baseType: !72, size: 64, offset: 1728)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !36, file: !37, line: 39, baseType: !13, size: 64, offset: 1792)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !36, file: !37, line: 40, baseType: !83, size: 64, offset: 1856)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !33, line: 862, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !32, !87, !89}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !8, line: 526, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !8, line: 454, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !60)
!91 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !36, file: !37, line: 41, baseType: !83, size: 64, offset: 1920)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !36, file: !37, line: 42, baseType: !13, size: 64, offset: 1984)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !36, file: !37, line: 45, baseType: !95, size: 64, offset: 2048)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !33, line: 889, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !32, !99, !87}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !33, line: 842, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !33, line: 840, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !33, line: 832, size: 192, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !102, file: !33, line: 834, baseType: !14, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !102, file: !33, line: 835, baseType: !89, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !102, file: !33, line: 836, baseType: !10, size: 8, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !102, file: !33, line: 837, baseType: !10, size: 8, offset: 136)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !102, file: !33, line: 838, baseType: !10, size: 8, offset: 144)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !102, file: !33, line: 839, baseType: !10, size: 8, offset: 152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !36, file: !37, line: 49, baseType: !95, size: 64, offset: 2112)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !36, file: !37, line: 56, baseType: !13, size: 64, offset: 2176)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !36, file: !37, line: 57, baseType: !10, size: 8, offset: 2240)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !36, file: !37, line: 58, baseType: !10, size: 8, offset: 2248)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !36, file: !37, line: 62, baseType: !14, size: 32, offset: 2272)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !37, line: 63, baseType: !14, size: 32, offset: 2304)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !36, file: !37, line: 64, baseType: !14, size: 32, offset: 2336)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !36, file: !37, line: 66, baseType: !118, size: 896, offset: 2368)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !119, line: 104, baseType: !120)
!119 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !119, line: 85, size: 896, elements: !121)
!121 = !{!122, !127, !129, !131, !132, !133, !134, !136, !141, !147, !152, !153, !154, !155}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !120, file: !119, line: 86, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !125, line: 374, baseType: !126)
!125 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !125, line: 365, baseType: !11)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !120, file: !119, line: 87, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !125, line: 367, baseType: !15)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !120, file: !119, line: 88, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !125, line: 368, baseType: !60)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !120, file: !119, line: 90, baseType: !123, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !120, file: !119, line: 91, baseType: !128, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !120, file: !119, line: 92, baseType: !130, size: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !120, file: !119, line: 94, baseType: !135, size: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !120, file: !119, line: 95, baseType: !137, size: 64, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !119, line: 1714, size: 32, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !138, file: !119, line: 1714, baseType: !12, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !120, file: !119, line: 97, baseType: !142, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !119, line: 80, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !146, !128, !128}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !125, line: 383, baseType: !6)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !120, file: !119, line: 98, baseType: !148, size: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !119, line: 81, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !146, !146}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !120, file: !119, line: 99, baseType: !146, size: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !120, file: !119, line: 101, baseType: !12, size: 32, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !120, file: !119, line: 102, baseType: !130, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !120, file: !119, line: 103, baseType: !130, size: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !36, file: !37, line: 67, baseType: !87, size: 64, offset: 3264)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !36, file: !37, line: 68, baseType: !128, size: 32, offset: 3328)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !36, file: !37, line: 80, baseType: !14, size: 32, offset: 3360)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !36, file: !37, line: 83, baseType: !12, size: 32, offset: 3392)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !36, file: !37, line: 84, baseType: !12, size: 32, offset: 3424)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !36, file: !37, line: 85, baseType: !12, size: 32, offset: 3456)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !36, file: !37, line: 86, baseType: !12, size: 32, offset: 3488)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !36, file: !37, line: 87, baseType: !12, size: 32, offset: 3520)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !36, file: !37, line: 92, baseType: !12, size: 32, offset: 3552)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !36, file: !37, line: 93, baseType: !12, size: 32, offset: 3584)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !36, file: !37, line: 94, baseType: !12, size: 32, offset: 3616)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !36, file: !37, line: 95, baseType: !12, size: 32, offset: 3648)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !36, file: !37, line: 96, baseType: !12, size: 32, offset: 3680)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !36, file: !37, line: 100, baseType: !14, size: 32, offset: 3712)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !36, file: !37, line: 101, baseType: !14, size: 32, offset: 3744)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !36, file: !37, line: 102, baseType: !14, size: 32, offset: 3776)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !36, file: !37, line: 103, baseType: !14, size: 32, offset: 3808)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !36, file: !37, line: 104, baseType: !89, size: 64, offset: 3840)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !36, file: !37, line: 105, baseType: !14, size: 32, offset: 3904)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !36, file: !37, line: 106, baseType: !14, size: 32, offset: 3936)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !36, file: !37, line: 107, baseType: !14, size: 32, offset: 3968)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !36, file: !37, line: 108, baseType: !87, size: 64, offset: 4032)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !36, file: !37, line: 111, baseType: !87, size: 64, offset: 4096)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !36, file: !37, line: 114, baseType: !87, size: 64, offset: 4160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !36, file: !37, line: 115, baseType: !87, size: 64, offset: 4224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !36, file: !37, line: 116, baseType: !87, size: 64, offset: 4288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !36, file: !37, line: 117, baseType: !87, size: 64, offset: 4352)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !36, file: !37, line: 118, baseType: !89, size: 64, offset: 4416)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !36, file: !37, line: 120, baseType: !14, size: 32, offset: 4480)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !36, file: !37, line: 121, baseType: !14, size: 32, offset: 4512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !36, file: !37, line: 122, baseType: !187, size: 64, offset: 4544)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !33, line: 559, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !33, line: 558, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !33, line: 553, size: 24, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !190, file: !33, line: 555, baseType: !10, size: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !190, file: !33, line: 556, baseType: !10, size: 8, offset: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !190, file: !33, line: 557, baseType: !10, size: 8, offset: 16)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !36, file: !37, line: 123, baseType: !7, size: 16, offset: 4608)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !36, file: !37, line: 127, baseType: !12, size: 32, offset: 4640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !36, file: !37, line: 130, baseType: !7, size: 16, offset: 4672)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !36, file: !37, line: 131, baseType: !10, size: 8, offset: 4688)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !36, file: !37, line: 132, baseType: !10, size: 8, offset: 4696)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !36, file: !37, line: 133, baseType: !10, size: 8, offset: 4704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !36, file: !37, line: 134, baseType: !10, size: 8, offset: 4712)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !36, file: !37, line: 135, baseType: !10, size: 8, offset: 4720)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !36, file: !37, line: 136, baseType: !10, size: 8, offset: 4728)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !36, file: !37, line: 137, baseType: !10, size: 8, offset: 4736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !36, file: !37, line: 138, baseType: !10, size: 8, offset: 4744)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !36, file: !37, line: 139, baseType: !10, size: 8, offset: 4752)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !36, file: !37, line: 140, baseType: !10, size: 8, offset: 4760)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !36, file: !37, line: 141, baseType: !10, size: 8, offset: 4768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !36, file: !37, line: 142, baseType: !10, size: 8, offset: 4776)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !36, file: !37, line: 143, baseType: !10, size: 8, offset: 4784)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !36, file: !37, line: 145, baseType: !10, size: 8, offset: 4792)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !36, file: !37, line: 147, baseType: !213, size: 40, offset: 4800)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 40, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 5)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !36, file: !37, line: 151, baseType: !7, size: 16, offset: 4848)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !36, file: !37, line: 156, baseType: !10, size: 8, offset: 4864)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !36, file: !37, line: 157, baseType: !219, size: 32, offset: 4896)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !8, line: 521, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !8, line: 442, baseType: !12)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !36, file: !37, line: 158, baseType: !222, size: 80, offset: 4928)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !33, line: 570, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !33, line: 563, size: 80, elements: !224)
!224 = !{!225, !226, !227, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !223, file: !33, line: 565, baseType: !10, size: 8)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !223, file: !33, line: 566, baseType: !7, size: 16, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !223, file: !33, line: 567, baseType: !7, size: 16, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !223, file: !33, line: 568, baseType: !7, size: 16, offset: 48)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !223, file: !33, line: 569, baseType: !7, size: 16, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !36, file: !37, line: 160, baseType: !222, size: 80, offset: 5008)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !36, file: !37, line: 165, baseType: !232, size: 64, offset: 5120)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !33, line: 863, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !36, file: !37, line: 166, baseType: !14, size: 32, offset: 5184)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !36, file: !37, line: 167, baseType: !14, size: 32, offset: 5216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !36, file: !37, line: 171, baseType: !12, size: 32, offset: 5248)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !36, file: !37, line: 172, baseType: !219, size: 32, offset: 5280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !36, file: !37, line: 173, baseType: !219, size: 32, offset: 5312)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !36, file: !37, line: 175, baseType: !87, size: 64, offset: 5376)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !36, file: !37, line: 176, baseType: !241, size: 64, offset: 5440)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !8, line: 556, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !36, file: !37, line: 180, baseType: !87, size: 64, offset: 5504)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !36, file: !37, line: 181, baseType: !87, size: 64, offset: 5568)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !36, file: !37, line: 182, baseType: !241, size: 64, offset: 5632)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !36, file: !37, line: 183, baseType: !241, size: 64, offset: 5696)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !36, file: !37, line: 188, baseType: !249, size: 40, offset: 5760)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !33, line: 582, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !33, line: 575, size: 40, elements: !251)
!251 = !{!252, !253, !254, !255, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !250, file: !33, line: 577, baseType: !10, size: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !250, file: !33, line: 578, baseType: !10, size: 8, offset: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !250, file: !33, line: 579, baseType: !10, size: 8, offset: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !250, file: !33, line: 580, baseType: !10, size: 8, offset: 24)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !250, file: !33, line: 581, baseType: !10, size: 8, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !36, file: !37, line: 192, baseType: !249, size: 40, offset: 5800)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !36, file: !37, line: 197, baseType: !87, size: 64, offset: 5888)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !36, file: !37, line: 198, baseType: !222, size: 80, offset: 5952)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !36, file: !37, line: 201, baseType: !261, size: 64, offset: 6080)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !33, line: 864, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !32, !14, !12}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !36, file: !37, line: 202, baseType: !266, size: 64, offset: 6144)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !33, line: 866, baseType: !262)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !36, file: !37, line: 204, baseType: !268, size: 64, offset: 6208)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !33, line: 870, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !32, !272}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !33, line: 723, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !33, line: 722, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !276, line: 56, size: 2496, elements: !277)
!276 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !295, !296, !297, !298, !299, !313, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !350, !351, !352, !353, !363, !364, !365, !366, !367, !368, !388, !389, !390, !391, !392}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !275, file: !276, line: 59, baseType: !14, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !275, file: !276, line: 60, baseType: !14, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !275, file: !276, line: 61, baseType: !14, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !275, file: !276, line: 62, baseType: !89, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !275, file: !276, line: 63, baseType: !187, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !275, file: !276, line: 64, baseType: !7, size: 16, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !275, file: !276, line: 65, baseType: !7, size: 16, offset: 272)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !275, file: !276, line: 66, baseType: !10, size: 8, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !275, file: !276, line: 67, baseType: !10, size: 8, offset: 296)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !275, file: !276, line: 69, baseType: !10, size: 8, offset: 304)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !275, file: !276, line: 70, baseType: !10, size: 8, offset: 312)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !275, file: !276, line: 71, baseType: !10, size: 8, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !275, file: !276, line: 74, baseType: !10, size: 8, offset: 328)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !275, file: !276, line: 75, baseType: !10, size: 8, offset: 336)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !275, file: !276, line: 76, baseType: !10, size: 8, offset: 344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !275, file: !276, line: 77, baseType: !294, size: 64, offset: 352)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !50)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !275, file: !276, line: 90, baseType: !219, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !275, file: !276, line: 96, baseType: !10, size: 8, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !275, file: !276, line: 108, baseType: !12, size: 32, offset: 480)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !275, file: !276, line: 109, baseType: !12, size: 32, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !275, file: !276, line: 110, baseType: !300, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !33, line: 654, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !33, line: 653, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !33, line: 637, size: 448, elements: !304)
!304 = !{!305, !306, !308, !309, !310, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !303, file: !33, line: 639, baseType: !12, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !303, file: !33, line: 644, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !8, line: 536, baseType: !135)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !303, file: !33, line: 645, baseType: !307, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !303, file: !33, line: 647, baseType: !89, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !303, file: !33, line: 648, baseType: !89, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !303, file: !33, line: 649, baseType: !307, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !303, file: !33, line: 651, baseType: !307, size: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !275, file: !276, line: 117, baseType: !314, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !33, line: 683, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !33, line: 675, size: 64, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !315, file: !33, line: 677, baseType: !7, size: 16)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !315, file: !33, line: 678, baseType: !10, size: 8, offset: 16)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !315, file: !33, line: 679, baseType: !10, size: 8, offset: 24)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !315, file: !33, line: 680, baseType: !10, size: 8, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !315, file: !33, line: 681, baseType: !10, size: 8, offset: 40)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !315, file: !33, line: 682, baseType: !10, size: 8, offset: 48)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !275, file: !276, line: 127, baseType: !249, size: 40, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !275, file: !276, line: 141, baseType: !87, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !275, file: !276, line: 142, baseType: !222, size: 80, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !275, file: !276, line: 152, baseType: !222, size: 80, offset: 912)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !275, file: !276, line: 161, baseType: !220, size: 32, offset: 992)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !275, file: !276, line: 162, baseType: !220, size: 32, offset: 1024)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !275, file: !276, line: 163, baseType: !10, size: 8, offset: 1056)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !275, file: !276, line: 171, baseType: !14, size: 32, offset: 1088)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !275, file: !276, line: 172, baseType: !14, size: 32, offset: 1120)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !275, file: !276, line: 173, baseType: !10, size: 8, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !275, file: !276, line: 183, baseType: !334, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !8, line: 532, baseType: !243)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !275, file: !276, line: 193, baseType: !219, size: 32, offset: 1280)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !275, file: !276, line: 194, baseType: !219, size: 32, offset: 1312)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !275, file: !276, line: 195, baseType: !219, size: 32, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !275, file: !276, line: 196, baseType: !219, size: 32, offset: 1376)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !275, file: !276, line: 197, baseType: !219, size: 32, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !275, file: !276, line: 198, baseType: !219, size: 32, offset: 1440)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !275, file: !276, line: 199, baseType: !219, size: 32, offset: 1472)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !275, file: !276, line: 200, baseType: !219, size: 32, offset: 1504)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !275, file: !276, line: 215, baseType: !307, size: 64, offset: 1536)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !275, file: !276, line: 216, baseType: !220, size: 32, offset: 1600)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !275, file: !276, line: 217, baseType: !220, size: 32, offset: 1632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !275, file: !276, line: 218, baseType: !307, size: 64, offset: 1664)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !275, file: !276, line: 219, baseType: !348, size: 64, offset: 1728)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !8, line: 559, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !275, file: !276, line: 220, baseType: !10, size: 8, offset: 1792)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !275, file: !276, line: 221, baseType: !10, size: 8, offset: 1800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !275, file: !276, line: 225, baseType: !14, size: 32, offset: 1824)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !275, file: !276, line: 230, baseType: !354, size: 64, offset: 1856)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !33, line: 707, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !33, line: 706, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !33, line: 695, size: 256, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !33, line: 697, baseType: !213, size: 40)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !357, file: !33, line: 698, baseType: !88, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !357, file: !33, line: 699, baseType: !89, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !357, file: !33, line: 702, baseType: !10, size: 8, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !275, file: !276, line: 231, baseType: !12, size: 32, offset: 1920)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !275, file: !276, line: 236, baseType: !307, size: 64, offset: 1984)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !275, file: !276, line: 237, baseType: !87, size: 64, offset: 2048)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !275, file: !276, line: 238, baseType: !14, size: 32, offset: 2112)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !275, file: !276, line: 239, baseType: !10, size: 8, offset: 2144)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !275, file: !276, line: 244, baseType: !369, size: 64, offset: 2176)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !33, line: 615, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !33, line: 614, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !33, line: 608, size: 256, elements: !373)
!373 = !{!374, !375, !376, !387}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !33, line: 610, baseType: !307, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !372, file: !33, line: 611, baseType: !10, size: 8, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !372, file: !33, line: 612, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !33, line: 599, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !33, line: 598, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !33, line: 591, size: 80, elements: !381)
!381 = !{!382, !383, !384, !385, !386}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !380, file: !33, line: 593, baseType: !7, size: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !380, file: !33, line: 594, baseType: !7, size: 16, offset: 16)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !380, file: !33, line: 595, baseType: !7, size: 16, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !380, file: !33, line: 596, baseType: !7, size: 16, offset: 48)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !380, file: !33, line: 597, baseType: !7, size: 16, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !372, file: !33, line: 613, baseType: !220, size: 32, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !275, file: !276, line: 245, baseType: !14, size: 32, offset: 2240)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !275, file: !276, line: 256, baseType: !10, size: 8, offset: 2272)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !275, file: !276, line: 257, baseType: !307, size: 64, offset: 2304)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !275, file: !276, line: 258, baseType: !307, size: 64, offset: 2368)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !275, file: !276, line: 265, baseType: !393, size: 64, offset: 2432)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !8, line: 553, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !36, file: !37, line: 205, baseType: !396, size: 64, offset: 6272)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !33, line: 883, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !32, !87, !14, !12}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !36, file: !37, line: 206, baseType: !401, size: 64, offset: 6336)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !33, line: 871, baseType: !269)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !36, file: !37, line: 207, baseType: !87, size: 64, offset: 6400)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !36, file: !37, line: 208, baseType: !87, size: 64, offset: 6464)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !36, file: !37, line: 209, baseType: !87, size: 64, offset: 6528)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !36, file: !37, line: 210, baseType: !87, size: 64, offset: 6592)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !36, file: !37, line: 211, baseType: !14, size: 32, offset: 6656)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !36, file: !37, line: 212, baseType: !14, size: 32, offset: 6688)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !36, file: !37, line: 213, baseType: !89, size: 64, offset: 6720)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !36, file: !37, line: 214, baseType: !89, size: 64, offset: 6784)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !36, file: !37, line: 215, baseType: !89, size: 64, offset: 6848)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !36, file: !37, line: 216, baseType: !89, size: 64, offset: 6912)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !36, file: !37, line: 217, baseType: !12, size: 32, offset: 6976)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !36, file: !37, line: 218, baseType: !12, size: 32, offset: 7008)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !36, file: !37, line: 232, baseType: !87, size: 64, offset: 7040)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !36, file: !37, line: 233, baseType: !87, size: 64, offset: 7104)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !36, file: !37, line: 237, baseType: !334, size: 64, offset: 7168)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !36, file: !37, line: 241, baseType: !10, size: 8, offset: 7232)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !36, file: !37, line: 242, baseType: !10, size: 8, offset: 7240)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !36, file: !37, line: 243, baseType: !87, size: 64, offset: 7296)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !36, file: !37, line: 244, baseType: !334, size: 64, offset: 7360)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !36, file: !37, line: 245, baseType: !334, size: 64, offset: 7424)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !36, file: !37, line: 246, baseType: !334, size: 64, offset: 7488)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !36, file: !37, line: 247, baseType: !334, size: 64, offset: 7552)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !36, file: !37, line: 251, baseType: !425, size: 232, offset: 7616)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 232, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 29)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !36, file: !37, line: 256, baseType: !14, size: 32, offset: 7872)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !36, file: !37, line: 259, baseType: !13, size: 64, offset: 7936)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !36, file: !37, line: 260, baseType: !431, size: 64, offset: 8000)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !33, line: 894, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!12, !32, !354}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !36, file: !37, line: 264, baseType: !12, size: 32, offset: 8064)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !36, file: !37, line: 265, baseType: !87, size: 64, offset: 8128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !36, file: !37, line: 270, baseType: !10, size: 8, offset: 8192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !36, file: !37, line: 275, baseType: !10, size: 8, offset: 8200)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !36, file: !37, line: 277, baseType: !10, size: 8, offset: 8208)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !36, file: !37, line: 279, baseType: !7, size: 16, offset: 8224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !36, file: !37, line: 280, baseType: !7, size: 16, offset: 8240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !36, file: !37, line: 287, baseType: !14, size: 32, offset: 8256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !36, file: !37, line: 292, baseType: !10, size: 8, offset: 8288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !36, file: !37, line: 299, baseType: !13, size: 64, offset: 8320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !36, file: !37, line: 300, baseType: !446, size: 64, offset: 8384)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !33, line: 950, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!13, !32, !450}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !8, line: 591, baseType: !89)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !36, file: !37, line: 301, baseType: !452, size: 64, offset: 8448)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !33, line: 952, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !32, !13}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !36, file: !37, line: 305, baseType: !87, size: 64, offset: 8512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !36, file: !37, line: 309, baseType: !87, size: 64, offset: 8576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !36, file: !37, line: 310, baseType: !87, size: 64, offset: 8640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !36, file: !37, line: 312, baseType: !87, size: 64, offset: 8704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !36, file: !37, line: 317, baseType: !10, size: 8, offset: 8768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !36, file: !37, line: 320, baseType: !14, size: 32, offset: 8800)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !36, file: !37, line: 321, baseType: !14, size: 32, offset: 8832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !36, file: !37, line: 326, baseType: !14, size: 32, offset: 8864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !36, file: !37, line: 331, baseType: !450, size: 64, offset: 8896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !36, file: !37, line: 337, baseType: !356, size: 256, offset: 8960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !36, file: !37, line: 341, baseType: !89, size: 64, offset: 9216)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !36, file: !37, line: 344, baseType: !307, size: 64, offset: 9280)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !36, file: !37, line: 348, baseType: !14, size: 32, offset: 9344)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !36, file: !37, line: 352, baseType: !87, size: 64, offset: 9408)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !36, file: !37, line: 354, baseType: !471, size: 256, offset: 9472)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 256, elements: !477)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !99, !87, !475}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !8, line: 527, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!477 = !{!478}
!478 = !DISubrange(count: 4)
!479 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !29, file: !3, line: 21, type: !32)
!480 = !DILocation(line: 21, column: 25, scope: !29)
!481 = !DILocation(line: 25, column: 8, scope: !482)
!482 = distinct !DILexicalBlock(scope: !29, file: !3, line: 25, column: 8)
!483 = !DILocation(line: 25, column: 16, scope: !482)
!484 = !DILocation(line: 25, column: 8, scope: !29)
!485 = !DILocation(line: 26, column: 7, scope: !482)
!486 = !DILocation(line: 28, column: 4, scope: !29)
!487 = !DILocation(line: 28, column: 13, scope: !29)
!488 = !DILocation(line: 28, column: 29, scope: !29)
!489 = !DILocation(line: 29, column: 1, scope: !29)
!490 = distinct !DISubprogram(name: "png_set_swap", scope: !3, file: !3, line: 35, type: !30, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!491 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !490, file: !3, line: 35, type: !32)
!492 = !DILocation(line: 35, column: 26, scope: !490)
!493 = !DILocation(line: 39, column: 8, scope: !494)
!494 = distinct !DILexicalBlock(scope: !490, file: !3, line: 39, column: 8)
!495 = !DILocation(line: 39, column: 16, scope: !494)
!496 = !DILocation(line: 39, column: 8, scope: !490)
!497 = !DILocation(line: 40, column: 7, scope: !494)
!498 = !DILocation(line: 42, column: 8, scope: !499)
!499 = distinct !DILexicalBlock(scope: !490, file: !3, line: 42, column: 8)
!500 = !DILocation(line: 42, column: 17, scope: !499)
!501 = !DILocation(line: 42, column: 27, scope: !499)
!502 = !DILocation(line: 42, column: 8, scope: !490)
!503 = !DILocation(line: 43, column: 7, scope: !499)
!504 = !DILocation(line: 43, column: 16, scope: !499)
!505 = !DILocation(line: 43, column: 32, scope: !499)
!506 = !DILocation(line: 44, column: 1, scope: !490)
!507 = distinct !DISubprogram(name: "png_set_packing", scope: !3, file: !3, line: 50, type: !30, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!508 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !507, file: !3, line: 50, type: !32)
!509 = !DILocation(line: 50, column: 29, scope: !507)
!510 = !DILocation(line: 54, column: 8, scope: !511)
!511 = distinct !DILexicalBlock(scope: !507, file: !3, line: 54, column: 8)
!512 = !DILocation(line: 54, column: 16, scope: !511)
!513 = !DILocation(line: 54, column: 8, scope: !507)
!514 = !DILocation(line: 55, column: 7, scope: !511)
!515 = !DILocation(line: 57, column: 8, scope: !516)
!516 = distinct !DILexicalBlock(scope: !507, file: !3, line: 57, column: 8)
!517 = !DILocation(line: 57, column: 17, scope: !516)
!518 = !DILocation(line: 57, column: 27, scope: !516)
!519 = !DILocation(line: 57, column: 8, scope: !507)
!520 = !DILocation(line: 59, column: 7, scope: !521)
!521 = distinct !DILexicalBlock(scope: !516, file: !3, line: 58, column: 4)
!522 = !DILocation(line: 59, column: 16, scope: !521)
!523 = !DILocation(line: 59, column: 32, scope: !521)
!524 = !DILocation(line: 60, column: 7, scope: !521)
!525 = !DILocation(line: 60, column: 16, scope: !521)
!526 = !DILocation(line: 60, column: 30, scope: !521)
!527 = !DILocation(line: 61, column: 4, scope: !521)
!528 = !DILocation(line: 62, column: 1, scope: !507)
!529 = distinct !DISubprogram(name: "png_set_packswap", scope: !3, file: !3, line: 68, type: !30, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
