; ModuleID = 'blender/source/blender/blenlib/intern/voronoi.c'
source_filename = "blender/source/blender/blenlib/intern/voronoi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VoronoiSite = type { [2 x float], [3 x float] }
%struct.ListBase = type { i8*, i8* }
%struct.VoronoiProcess = type { %struct.ListBase, %struct.ListBase, %struct.VoronoiParabola*, i32, i32, float }
%struct.VoronoiParabola = type { %struct.VoronoiParabola*, %struct.VoronoiParabola*, %struct.VoronoiParabola*, %struct.VoronoiEvent*, %struct.VoronoiEdge*, [2 x float], i8 }
%struct.VoronoiEvent = type { %struct.VoronoiEvent*, %struct.VoronoiEvent*, i32, [2 x float], %struct.VoronoiParabola* }
%struct.VoronoiEdge = type { %struct.VoronoiEdge*, %struct.VoronoiEdge*, [2 x float], [2 x float], [2 x float], [2 x float], [2 x float], float, float, %struct.VoronoiEdge* }
%struct.VoronoiTriangulationPoint = type { [2 x float], [3 x float], i32 }

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [19 x i8] c"voronoi site event\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8
@.str.1 = private unnamed_addr constant [22 x i8] c"voronoi parabola site\00", align 1
@.str.2 = private unnamed_addr constant [13 x i8] c"voronoi edge\00", align 1
@.str.3 = private unnamed_addr constant [17 x i8] c"voronoi parabola\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !8, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/voronoi.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 44, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "voronoiEventType_Site", value: 0, isUnsigned: true)
!7 = !DIEnumerator(name: "voronoiEventType_Circle", value: 1, isUnsigned: true)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !{i32 7, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 1, !"wchar_size", i32 4}
!14 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!15 = distinct !DISubprogram(name: "BLI_voronoi_compute", scope: !1, file: !1, line: 646, type: !16, scopeLine: 647, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !41)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !10, !10, !10, !33}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoronoiSite", file: !21, line: 38, baseType: !22)
!21 = !DIFile(filename: "blender/source/blender/blenlib/BLI_voronoi.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoronoiSite", file: !21, line: 35, size: 160, elements: !23)
!23 = !{!24, !29}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !22, file: !21, line: 36, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !27)
!26 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!27 = !{!28}
!28 = !DISubrange(count: 2)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !22, file: !21, line: 37, baseType: !30, size: 96, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 3)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !35, line: 71, baseType: !36)
!35 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !35, line: 69, size: 128, elements: !37)
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !36, file: !35, line: 70, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !36, file: !35, line: 70, baseType: !39, size: 64, offset: 64)
!41 = !{}
!42 = !DILocalVariable(name: "sites", arg: 1, scope: !15, file: !1, line: 646, type: !18)
!43 = !DILocation(line: 646, column: 45, scope: !15)
!44 = !DILocalVariable(name: "sites_total", arg: 2, scope: !15, file: !1, line: 646, type: !10)
!45 = !DILocation(line: 646, column: 56, scope: !15)
!46 = !DILocalVariable(name: "width", arg: 3, scope: !15, file: !1, line: 646, type: !10)
!47 = !DILocation(line: 646, column: 73, scope: !15)
!48 = !DILocalVariable(name: "height", arg: 4, scope: !15, file: !1, line: 646, type: !10)
!49 = !DILocation(line: 646, column: 84, scope: !15)
!50 = !DILocalVariable(name: "edges", arg: 5, scope: !15, file: !1, line: 646, type: !33)
!51 = !DILocation(line: 646, column: 102, scope: !15)
!52 = !DILocalVariable(name: "process", scope: !15, file: !1, line: 648, type: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoronoiProcess", file: !1, line: 71, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoronoiProcess", file: !1, line: 66, size: 448, elements: !55)
!55 = !{!56, !57, !58, !97, !98, !99}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !54, file: !1, line: 67, baseType: !34, size: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !54, file: !1, line: 67, baseType: !34, size: 128, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !54, file: !1, line: 68, baseType: !59, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoronoiParabola", file: !1, line: 64, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoronoiParabola", file: !1, line: 58, size: 448, elements: !62)
!62 = !{!63, !65, !66, !67, !78, !94, !95}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !61, file: !1, line: 59, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !61, file: !1, line: 59, baseType: !64, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !61, file: !1, line: 59, baseType: !64, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !61, file: !1, line: 60, baseType: !68, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoronoiEvent", file: !1, line: 56, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoronoiEvent", file: !1, line: 49, size: 320, elements: !71)
!71 = !{!72, !74, !75, !76, !77}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !1, line: 50, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !70, file: !1, line: 50, baseType: !73, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !1, line: 52, baseType: !10, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "site", scope: !70, file: !1, line: 53, baseType: !25, size: 64, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "parabola", scope: !70, file: !1, line: 55, baseType: !64, size: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "edge", scope: !61, file: !1, line: 61, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoronoiEdge", file: !21, line: 56, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoronoiEdge", file: !21, line: 40, size: 576, elements: !82)
!82 = !{!83, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !21, line: 41, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !81, file: !21, line: 41, baseType: !84, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !81, file: !21, line: 43, baseType: !25, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !81, file: !21, line: 43, baseType: !25, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !81, file: !21, line: 47, baseType: !25, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !81, file: !21, line: 49, baseType: !25, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !81, file: !21, line: 50, baseType: !25, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !81, file: !21, line: 52, baseType: !26, size: 32, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !81, file: !21, line: 52, baseType: !26, size: 32, offset: 480)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "neighbor", scope: !81, file: !21, line: 55, baseType: !84, size: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "site", scope: !61, file: !1, line: 62, baseType: !25, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !61, file: !1, line: 63, baseType: !96, size: 8, offset: 384)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !54, file: !1, line: 69, baseType: !10, size: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !54, file: !1, line: 69, baseType: !10, size: 32, offset: 352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_y", scope: !54, file: !1, line: 70, baseType: !26, size: 32, offset: 384)
!100 = !DILocation(line: 648, column: 17, scope: !15)
!101 = !DILocalVariable(name: "edge", scope: !15, file: !1, line: 649, type: !79)
!102 = !DILocation(line: 649, column: 15, scope: !15)
!103 = !DILocalVariable(name: "i", scope: !15, file: !1, line: 650, type: !10)
!104 = !DILocation(line: 650, column: 6, scope: !15)
!105 = !DILocation(line: 652, column: 2, scope: !15)
!106 = !DILocation(line: 654, column: 18, scope: !15)
!107 = !DILocation(line: 654, column: 10, scope: !15)
!108 = !DILocation(line: 654, column: 16, scope: !15)
!109 = !DILocation(line: 655, column: 19, scope: !15)
!110 = !DILocation(line: 655, column: 10, scope: !15)
!111 = !DILocation(line: 655, column: 17, scope: !15)
!112 = !DILocation(line: 657, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !15, file: !1, line: 657, column: 2)
!114 = !DILocation(line: 657, column: 7, scope: !113)
!115 = !DILocation(line: 657, column: 14, scope: !116)
!116 = distinct !DILexicalBlock(scope: !113, file: !1, line: 657, column: 2)
!117 = !DILocation(line: 657, column: 18, scope: !116)
!118 = !DILocation(line: 657, column: 16, scope: !116)
!119 = !DILocation(line: 657, column: 2, scope: !113)
!120 = !DILocalVariable(name: "event", scope: !121, file: !1, line: 658, type: !68)
!121 = distinct !DILexicalBlock(scope: !116, file: !1, line: 657, column: 36)
!122 = !DILocation(line: 658, column: 17, scope: !121)
!123 = !DILocation(line: 658, column: 25, scope: !121)
!124 = !DILocation(line: 660, column: 3, scope: !121)
!125 = !DILocation(line: 660, column: 10, scope: !121)
!126 = !DILocation(line: 660, column: 15, scope: !121)
!127 = !DILocation(line: 661, column: 14, scope: !121)
!128 = !DILocation(line: 661, column: 21, scope: !121)
!129 = !DILocation(line: 661, column: 27, scope: !121)
!130 = !DILocation(line: 661, column: 33, scope: !121)
!131 = !DILocation(line: 661, column: 36, scope: !121)
!132 = !DILocation(line: 661, column: 3, scope: !121)
!133 = !DILocation(line: 663, column: 33, scope: !121)
!134 = !DILocation(line: 663, column: 3, scope: !121)
!135 = !DILocation(line: 664, column: 2, scope: !121)
!136 = !DILocation(line: 657, column: 32, scope: !116)
!137 = !DILocation(line: 657, column: 2, scope: !116)
!138 = distinct !{!138, !119, !139}
!139 = !DILocation(line: 664, column: 2, scope: !113)
!140 = !DILocation(line: 666, column: 2, scope: !15)
!141 = !DILocation(line: 666, column: 17, scope: !15)
!142 = !DILocation(line: 666, column: 23, scope: !15)
!143 = !DILocalVariable(name: "event", scope: !144, file: !1, line: 667, type: !68)
!144 = distinct !DILexicalBlock(scope: !15, file: !1, line: 666, column: 30)
!145 = !DILocation(line: 667, column: 17, scope: !144)
!146 = !DILocation(line: 667, column: 33, scope: !144)
!147 = !DILocation(line: 667, column: 39, scope: !144)
!148 = !DILocation(line: 667, column: 25, scope: !144)
!149 = !DILocation(line: 669, column: 23, scope: !144)
!150 = !DILocation(line: 669, column: 30, scope: !144)
!151 = !DILocation(line: 669, column: 11, scope: !144)
!152 = !DILocation(line: 669, column: 21, scope: !144)
!153 = !DILocation(line: 671, column: 7, scope: !154)
!154 = distinct !DILexicalBlock(scope: !144, file: !1, line: 671, column: 7)
!155 = !DILocation(line: 671, column: 14, scope: !154)
!156 = !DILocation(line: 671, column: 19, scope: !154)
!157 = !DILocation(line: 671, column: 7, scope: !144)
!158 = !DILocation(line: 672, column: 34, scope: !159)
!159 = distinct !DILexicalBlock(scope: !154, file: !1, line: 671, column: 45)
!160 = !DILocation(line: 672, column: 41, scope: !159)
!161 = !DILocation(line: 672, column: 4, scope: !159)
!162 = !DILocation(line: 673, column: 3, scope: !159)
!163 = !DILocation(line: 675, column: 37, scope: !164)
!164 = distinct !DILexicalBlock(scope: !154, file: !1, line: 674, column: 8)
!165 = !DILocation(line: 675, column: 4, scope: !164)
!166 = !DILocation(line: 678, column: 26, scope: !144)
!167 = !DILocation(line: 678, column: 33, scope: !144)
!168 = !DILocation(line: 678, column: 3, scope: !144)
!169 = distinct !{!169, !140, !170}
!170 = !DILocation(line: 679, column: 2, scope: !15)
!171 = !DILocation(line: 681, column: 39, scope: !15)
!172 = !DILocation(line: 681, column: 2, scope: !15)
!173 = !DILocation(line: 683, column: 17, scope: !15)
!174 = !DILocation(line: 683, column: 23, scope: !15)
!175 = !DILocation(line: 683, column: 9, scope: !15)
!176 = !DILocation(line: 683, column: 7, scope: !15)
!177 = !DILocation(line: 684, column: 2, scope: !15)
!178 = !DILocation(line: 684, column: 9, scope: !15)
!179 = !DILocation(line: 685, column: 7, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !1, line: 685, column: 7)
!181 = distinct !DILexicalBlock(scope: !15, file: !1, line: 684, column: 15)
!182 = !DILocation(line: 685, column: 13, scope: !180)
!183 = !DILocation(line: 685, column: 7, scope: !181)
!184 = !DILocation(line: 686, column: 15, scope: !185)
!185 = distinct !DILexicalBlock(scope: !180, file: !1, line: 685, column: 23)
!186 = !DILocation(line: 686, column: 21, scope: !185)
!187 = !DILocation(line: 686, column: 28, scope: !185)
!188 = !DILocation(line: 686, column: 34, scope: !185)
!189 = !DILocation(line: 686, column: 44, scope: !185)
!190 = !DILocation(line: 686, column: 4, scope: !185)
!191 = !DILocation(line: 687, column: 4, scope: !185)
!192 = !DILocation(line: 687, column: 14, scope: !185)
!193 = !DILocation(line: 687, column: 20, scope: !185)
!194 = !DILocation(line: 688, column: 3, scope: !185)
!195 = !DILocation(line: 690, column: 10, scope: !181)
!196 = !DILocation(line: 690, column: 16, scope: !181)
!197 = !DILocation(line: 690, column: 8, scope: !181)
!198 = distinct !{!198, !177, !199}
!199 = !DILocation(line: 691, column: 2, scope: !15)
!200 = !DILocation(line: 693, column: 21, scope: !15)
!201 = !DILocation(line: 693, column: 37, scope: !15)
!202 = !DILocation(line: 693, column: 2, scope: !15)
!203 = !DILocation(line: 694, column: 1, scope: !15)
!204 = distinct !DISubprogram(name: "copy_v2_v2", scope: !205, file: !205, line: 58, type: !206, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !41)
!205 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!206 = !DISubroutineType(types: !207)
!207 = !{null, !208, !209}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!211 = !DILocalVariable(name: "r", arg: 1, scope: !204, file: !205, line: 58, type: !208)
!212 = !DILocation(line: 58, column: 31, scope: !204)
!213 = !DILocalVariable(name: "a", arg: 2, scope: !204, file: !205, line: 58, type: !209)
!214 = !DILocation(line: 58, column: 49, scope: !204)
!215 = !DILocation(line: 60, column: 9, scope: !204)
!216 = !DILocation(line: 60, column: 2, scope: !204)
!217 = !DILocation(line: 60, column: 7, scope: !204)
!218 = !DILocation(line: 61, column: 9, scope: !204)
!219 = !DILocation(line: 61, column: 2, scope: !204)
!220 = !DILocation(line: 61, column: 7, scope: !204)
!221 = !DILocation(line: 62, column: 1, scope: !204)
!222 = distinct !DISubprogram(name: "voronoi_insertEvent", scope: !1, file: !1, line: 75, type: !223, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !41)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !225, !68}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!226 = !DILocalVariable(name: "process", arg: 1, scope: !222, file: !1, line: 75, type: !225)
!227 = !DILocation(line: 75, column: 49, scope: !222)
!228 = !DILocalVariable(name: "event", arg: 2, scope: !222, file: !1, line: 75, type: !68)
!229 = !DILocation(line: 75, column: 72, scope: !222)
!230 = !DILocalVariable(name: "current_event", scope: !222, file: !1, line: 77, type: !68)
!231 = !DILocation(line: 77, column: 16, scope: !222)
!232 = !DILocation(line: 77, column: 32, scope: !222)
!233 = !DILocation(line: 77, column: 41, scope: !222)
!234 = !DILocation(line: 77, column: 47, scope: !222)
!235 = !DILocation(line: 79, column: 2, scope: !222)
!236 = !DILocation(line: 79, column: 9, scope: !222)
!237 = !DILocation(line: 80, column: 7, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !1, line: 80, column: 7)
!239 = distinct !DILexicalBlock(scope: !222, file: !1, line: 79, column: 24)
!240 = !DILocation(line: 80, column: 22, scope: !238)
!241 = !DILocation(line: 80, column: 32, scope: !238)
!242 = !DILocation(line: 80, column: 39, scope: !238)
!243 = !DILocation(line: 80, column: 30, scope: !238)
!244 = !DILocation(line: 80, column: 7, scope: !239)
!245 = !DILocation(line: 81, column: 4, scope: !246)
!246 = distinct !DILexicalBlock(scope: !238, file: !1, line: 80, column: 48)
!247 = !DILocation(line: 83, column: 7, scope: !248)
!248 = distinct !DILexicalBlock(scope: !239, file: !1, line: 83, column: 7)
!249 = !DILocation(line: 83, column: 22, scope: !248)
!250 = !DILocation(line: 83, column: 33, scope: !248)
!251 = !DILocation(line: 83, column: 40, scope: !248)
!252 = !DILocation(line: 83, column: 30, scope: !248)
!253 = !DILocation(line: 83, column: 7, scope: !239)
!254 = !DILocation(line: 84, column: 4, scope: !255)
!255 = distinct !DILexicalBlock(scope: !248, file: !1, line: 83, column: 49)
!256 = !DILocation(line: 84, column: 11, scope: !255)
!257 = !DILocation(line: 84, column: 19, scope: !255)
!258 = !DILocation(line: 85, column: 3, scope: !255)
!259 = !DILocation(line: 87, column: 19, scope: !239)
!260 = !DILocation(line: 87, column: 34, scope: !239)
!261 = !DILocation(line: 87, column: 17, scope: !239)
!262 = distinct !{!262, !235, !263}
!263 = !DILocation(line: 88, column: 2, scope: !222)
!264 = !DILocation(line: 90, column: 24, scope: !222)
!265 = !DILocation(line: 90, column: 33, scope: !222)
!266 = !DILocation(line: 90, column: 40, scope: !222)
!267 = !DILocation(line: 90, column: 55, scope: !222)
!268 = !DILocation(line: 90, column: 2, scope: !222)
!269 = !DILocation(line: 91, column: 1, scope: !222)
!270 = distinct !DISubprogram(name: "voronoi_addParabola", scope: !1, file: !1, line: 350, type: !271, scopeLine: 351, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !41)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !225, !208}
!273 = !DILocalVariable(name: "process", arg: 1, scope: !270, file: !1, line: 350, type: !225)
!274 = !DILocation(line: 350, column: 49, scope: !270)
!275 = !DILocalVariable(name: "site", arg: 2, scope: !270, file: !1, line: 350, type: !208)
!276 = !DILocation(line: 350, column: 64, scope: !270)
!277 = !DILocalVariable(name: "root", scope: !270, file: !1, line: 352, type: !59)
!278 = !DILocation(line: 352, column: 19, scope: !270)
!279 = !DILocation(line: 352, column: 26, scope: !270)
!280 = !DILocation(line: 352, column: 35, scope: !270)
!281 = !DILocalVariable(name: "par", scope: !270, file: !1, line: 353, type: !59)
!282 = !DILocation(line: 353, column: 19, scope: !270)
!283 = !DILocalVariable(name: "p0", scope: !270, file: !1, line: 353, type: !59)
!284 = !DILocation(line: 353, column: 25, scope: !270)
!285 = !DILocalVariable(name: "p1", scope: !270, file: !1, line: 353, type: !59)
!286 = !DILocation(line: 353, column: 30, scope: !270)
!287 = !DILocalVariable(name: "p2", scope: !270, file: !1, line: 353, type: !59)
!288 = !DILocation(line: 353, column: 35, scope: !270)
!289 = !DILocalVariable(name: "el", scope: !270, file: !1, line: 354, type: !79)
!290 = !DILocation(line: 354, column: 15, scope: !270)
!291 = !DILocalVariable(name: "er", scope: !270, file: !1, line: 354, type: !79)
!292 = !DILocation(line: 354, column: 20, scope: !270)
!293 = !DILocalVariable(name: "start", scope: !270, file: !1, line: 355, type: !25)
!294 = !DILocation(line: 355, column: 8, scope: !270)
!295 = !DILocation(line: 357, column: 7, scope: !296)
!296 = distinct !DILexicalBlock(scope: !270, file: !1, line: 357, column: 6)
!297 = !DILocation(line: 357, column: 16, scope: !296)
!298 = !DILocation(line: 357, column: 6, scope: !270)
!299 = !DILocation(line: 358, column: 43, scope: !300)
!300 = distinct !DILexicalBlock(scope: !296, file: !1, line: 357, column: 22)
!301 = !DILocation(line: 358, column: 19, scope: !300)
!302 = !DILocation(line: 358, column: 3, scope: !300)
!303 = !DILocation(line: 358, column: 12, scope: !300)
!304 = !DILocation(line: 358, column: 17, scope: !300)
!305 = !DILocation(line: 360, column: 3, scope: !300)
!306 = !DILocation(line: 363, column: 6, scope: !307)
!307 = distinct !DILexicalBlock(scope: !270, file: !1, line: 363, column: 6)
!308 = !DILocation(line: 363, column: 12, scope: !307)
!309 = !DILocation(line: 363, column: 20, scope: !307)
!310 = !DILocation(line: 363, column: 23, scope: !307)
!311 = !DILocation(line: 363, column: 29, scope: !307)
!312 = !DILocation(line: 363, column: 39, scope: !307)
!313 = !DILocation(line: 363, column: 37, scope: !307)
!314 = !DILocation(line: 363, column: 47, scope: !307)
!315 = !DILocation(line: 363, column: 6, scope: !270)
!316 = !DILocalVariable(name: "fp", scope: !317, file: !1, line: 364, type: !208)
!317 = distinct !DILexicalBlock(scope: !307, file: !1, line: 363, column: 52)
!318 = !DILocation(line: 364, column: 10, scope: !317)
!319 = !DILocation(line: 364, column: 15, scope: !317)
!320 = !DILocation(line: 364, column: 21, scope: !317)
!321 = !DILocalVariable(name: "s", scope: !317, file: !1, line: 365, type: !25)
!322 = !DILocation(line: 365, column: 9, scope: !317)
!323 = !DILocation(line: 367, column: 3, scope: !317)
!324 = !DILocation(line: 367, column: 9, scope: !317)
!325 = !DILocation(line: 367, column: 17, scope: !317)
!326 = !DILocation(line: 368, column: 27, scope: !317)
!327 = !DILocation(line: 368, column: 57, scope: !317)
!328 = !DILocation(line: 368, column: 33, scope: !317)
!329 = !DILocation(line: 368, column: 3, scope: !317)
!330 = !DILocation(line: 369, column: 28, scope: !317)
!331 = !DILocation(line: 369, column: 58, scope: !317)
!332 = !DILocation(line: 369, column: 34, scope: !317)
!333 = !DILocation(line: 369, column: 3, scope: !317)
!334 = !DILocation(line: 371, column: 11, scope: !317)
!335 = !DILocation(line: 371, column: 21, scope: !317)
!336 = !DILocation(line: 371, column: 19, scope: !317)
!337 = !DILocation(line: 371, column: 28, scope: !317)
!338 = !DILocation(line: 371, column: 3, scope: !317)
!339 = !DILocation(line: 371, column: 8, scope: !317)
!340 = !DILocation(line: 372, column: 10, scope: !317)
!341 = !DILocation(line: 372, column: 19, scope: !317)
!342 = !DILocation(line: 372, column: 3, scope: !317)
!343 = !DILocation(line: 372, column: 8, scope: !317)
!344 = !DILocation(line: 374, column: 7, scope: !345)
!345 = distinct !DILexicalBlock(scope: !317, file: !1, line: 374, column: 7)
!346 = !DILocation(line: 374, column: 17, scope: !345)
!347 = !DILocation(line: 374, column: 15, scope: !345)
!348 = !DILocation(line: 374, column: 7, scope: !317)
!349 = !DILocation(line: 375, column: 33, scope: !345)
!350 = !DILocation(line: 375, column: 36, scope: !345)
!351 = !DILocation(line: 375, column: 40, scope: !345)
!352 = !DILocation(line: 375, column: 17, scope: !345)
!353 = !DILocation(line: 375, column: 4, scope: !345)
!354 = !DILocation(line: 375, column: 10, scope: !345)
!355 = !DILocation(line: 375, column: 15, scope: !345)
!356 = !DILocation(line: 377, column: 33, scope: !345)
!357 = !DILocation(line: 377, column: 36, scope: !345)
!358 = !DILocation(line: 377, column: 42, scope: !345)
!359 = !DILocation(line: 377, column: 17, scope: !345)
!360 = !DILocation(line: 377, column: 4, scope: !345)
!361 = !DILocation(line: 377, column: 10, scope: !345)
!362 = !DILocation(line: 377, column: 15, scope: !345)
!363 = !DILocation(line: 379, column: 16, scope: !317)
!364 = !DILocation(line: 379, column: 25, scope: !317)
!365 = !DILocation(line: 379, column: 32, scope: !317)
!366 = !DILocation(line: 379, column: 38, scope: !317)
!367 = !DILocation(line: 379, column: 3, scope: !317)
!368 = !DILocation(line: 381, column: 3, scope: !317)
!369 = !DILocation(line: 384, column: 31, scope: !270)
!370 = !DILocation(line: 384, column: 40, scope: !270)
!371 = !DILocation(line: 384, column: 8, scope: !270)
!372 = !DILocation(line: 384, column: 6, scope: !270)
!373 = !DILocation(line: 386, column: 6, scope: !374)
!374 = distinct !DILexicalBlock(scope: !270, file: !1, line: 386, column: 6)
!375 = !DILocation(line: 386, column: 11, scope: !374)
!376 = !DILocation(line: 386, column: 6, scope: !270)
!377 = !DILocation(line: 387, column: 18, scope: !378)
!378 = distinct !DILexicalBlock(scope: !374, file: !1, line: 386, column: 18)
!379 = !DILocation(line: 387, column: 27, scope: !378)
!380 = !DILocation(line: 387, column: 34, scope: !378)
!381 = !DILocation(line: 387, column: 39, scope: !378)
!382 = !DILocation(line: 387, column: 3, scope: !378)
!383 = !DILocation(line: 389, column: 3, scope: !378)
!384 = !DILocation(line: 389, column: 8, scope: !378)
!385 = !DILocation(line: 389, column: 14, scope: !378)
!386 = !DILocation(line: 390, column: 2, scope: !378)
!387 = !DILocation(line: 392, column: 13, scope: !270)
!388 = !DILocation(line: 392, column: 2, scope: !270)
!389 = !DILocation(line: 392, column: 11, scope: !270)
!390 = !DILocation(line: 393, column: 26, scope: !270)
!391 = !DILocation(line: 393, column: 35, scope: !270)
!392 = !DILocation(line: 393, column: 40, scope: !270)
!393 = !DILocation(line: 393, column: 46, scope: !270)
!394 = !DILocation(line: 393, column: 13, scope: !270)
!395 = !DILocation(line: 393, column: 2, scope: !270)
!396 = !DILocation(line: 393, column: 11, scope: !270)
!397 = !DILocation(line: 395, column: 23, scope: !270)
!398 = !DILocation(line: 395, column: 30, scope: !270)
!399 = !DILocation(line: 395, column: 35, scope: !270)
!400 = !DILocation(line: 395, column: 41, scope: !270)
!401 = !DILocation(line: 395, column: 7, scope: !270)
!402 = !DILocation(line: 395, column: 5, scope: !270)
!403 = !DILocation(line: 396, column: 23, scope: !270)
!404 = !DILocation(line: 396, column: 30, scope: !270)
!405 = !DILocation(line: 396, column: 36, scope: !270)
!406 = !DILocation(line: 396, column: 41, scope: !270)
!407 = !DILocation(line: 396, column: 7, scope: !270)
!408 = !DILocation(line: 396, column: 5, scope: !270)
!409 = !DILocation(line: 398, column: 17, scope: !270)
!410 = !DILocation(line: 398, column: 2, scope: !270)
!411 = !DILocation(line: 398, column: 6, scope: !270)
!412 = !DILocation(line: 398, column: 15, scope: !270)
!413 = !DILocation(line: 399, column: 15, scope: !270)
!414 = !DILocation(line: 399, column: 24, scope: !270)
!415 = !DILocation(line: 399, column: 31, scope: !270)
!416 = !DILocation(line: 399, column: 2, scope: !270)
!417 = !DILocation(line: 401, column: 14, scope: !270)
!418 = !DILocation(line: 401, column: 2, scope: !270)
!419 = !DILocation(line: 401, column: 7, scope: !270)
!420 = !DILocation(line: 401, column: 12, scope: !270)
!421 = !DILocation(line: 402, column: 2, scope: !270)
!422 = !DILocation(line: 402, column: 7, scope: !270)
!423 = !DILocation(line: 402, column: 15, scope: !270)
!424 = !DILocation(line: 404, column: 31, scope: !270)
!425 = !DILocation(line: 404, column: 36, scope: !270)
!426 = !DILocation(line: 404, column: 7, scope: !270)
!427 = !DILocation(line: 404, column: 5, scope: !270)
!428 = !DILocation(line: 405, column: 31, scope: !270)
!429 = !DILocation(line: 405, column: 7, scope: !270)
!430 = !DILocation(line: 405, column: 5, scope: !270)
!431 = !DILocation(line: 406, column: 31, scope: !270)
!432 = !DILocation(line: 406, column: 36, scope: !270)
!433 = !DILocation(line: 406, column: 7, scope: !270)
!434 = !DILocation(line: 406, column: 5, scope: !270)
!435 = !DILocation(line: 408, column: 27, scope: !270)
!436 = !DILocation(line: 408, column: 32, scope: !270)
!437 = !DILocation(line: 408, column: 2, scope: !270)
!438 = !DILocation(line: 409, column: 26, scope: !270)
!439 = !DILocation(line: 409, column: 31, scope: !270)
!440 = !DILocation(line: 409, column: 2, scope: !270)
!441 = !DILocation(line: 410, column: 20, scope: !270)
!442 = !DILocation(line: 410, column: 2, scope: !270)
!443 = !DILocation(line: 410, column: 7, scope: !270)
!444 = !DILocation(line: 410, column: 13, scope: !270)
!445 = !DILocation(line: 410, column: 18, scope: !270)
!446 = !DILocation(line: 412, column: 26, scope: !270)
!447 = !DILocation(line: 412, column: 31, scope: !270)
!448 = !DILocation(line: 412, column: 37, scope: !270)
!449 = !DILocation(line: 412, column: 2, scope: !270)
!450 = !DILocation(line: 413, column: 27, scope: !270)
!451 = !DILocation(line: 413, column: 32, scope: !270)
!452 = !DILocation(line: 413, column: 38, scope: !270)
!453 = !DILocation(line: 413, column: 2, scope: !270)
!454 = !DILocation(line: 415, column: 22, scope: !270)
!455 = !DILocation(line: 415, column: 31, scope: !270)
!456 = !DILocation(line: 415, column: 2, scope: !270)
!457 = !DILocation(line: 416, column: 22, scope: !270)
!458 = !DILocation(line: 416, column: 31, scope: !270)
!459 = !DILocation(line: 416, column: 2, scope: !270)
!460 = !DILocation(line: 417, column: 1, scope: !270)
!461 = distinct !DISubprogram(name: "voronoi_removeParabola", scope: !1, file: !1, line: 419, type: !223, scopeLine: 420, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !41)
!462 = !DILocalVariable(name: "process", arg: 1, scope: !461, file: !1, line: 419, type: !225)
!463 = !DILocation(line: 419, column: 52, scope: !461)
!464 = !DILocalVariable(name: "event", arg: 2, scope: !461, file: !1, line: 419, type: !68)
!465 = !DILocation(line: 419, column: 75, scope: !461)
!466 = !DILocalVariable(name: "p1", scope: !461, file: !1, line: 421, type: !59)
!467 = !DILocation(line: 421, column: 19, scope: !461)
!468 = !DILocation(line: 421, column: 24, scope: !461)
!469 = !DILocation(line: 421, column: 31, scope: !461)
!470 = !DILocalVariable(name: "xl", scope: !461, file: !1, line: 423, type: !59)
!471 = !DILocation(line: 423, column: 19, scope: !461)
!472 = !DILocation(line: 423, column: 54, scope: !461)
!473 = !DILocation(line: 423, column: 24, scope: !461)
!474 = !DILocalVariable(name: "xr", scope: !461, file: !1, line: 424, type: !59)
!475 = !DILocation(line: 424, column: 19, scope: !461)
!476 = !DILocation(line: 424, column: 55, scope: !461)
!477 = !DILocation(line: 424, column: 24, scope: !461)
!478 = !DILocalVariable(name: "p0", scope: !461, file: !1, line: 426, type: !59)
!479 = !DILocation(line: 426, column: 19, scope: !461)
!480 = !DILocation(line: 426, column: 53, scope: !461)
!481 = !DILocation(line: 426, column: 24, scope: !461)
!482 = !DILocalVariable(name: "p2", scope: !461, file: !1, line: 427, type: !59)
!483 = !DILocation(line: 427, column: 19, scope: !461)
!484 = !DILocation(line: 427, column: 54, scope: !461)
!485 = !DILocation(line: 427, column: 24, scope: !461)
!486 = !DILocalVariable(name: "higher", scope: !461, file: !1, line: 429, type: !59)
!487 = !DILocation(line: 429, column: 19, scope: !461)
!488 = !DILocalVariable(name: "par", scope: !461, file: !1, line: 429, type: !59)
!489 = !DILocation(line: 429, column: 35, scope: !461)
!490 = !DILocalVariable(name: "gparent", scope: !461, file: !1, line: 429, type: !59)
!491 = !DILocation(line: 429, column: 41, scope: !461)
!492 = !DILocalVariable(name: "p", scope: !461, file: !1, line: 431, type: !25)
!493 = !DILocation(line: 431, column: 8, scope: !461)
!494 = !DILocation(line: 433, column: 6, scope: !495)
!495 = distinct !DILexicalBlock(scope: !461, file: !1, line: 433, column: 6)
!496 = !DILocation(line: 433, column: 10, scope: !495)
!497 = !DILocation(line: 433, column: 6, scope: !461)
!498 = !DILocation(line: 434, column: 18, scope: !499)
!499 = distinct !DILexicalBlock(scope: !495, file: !1, line: 433, column: 17)
!500 = !DILocation(line: 434, column: 27, scope: !499)
!501 = !DILocation(line: 434, column: 34, scope: !499)
!502 = !DILocation(line: 434, column: 38, scope: !499)
!503 = !DILocation(line: 434, column: 3, scope: !499)
!504 = !DILocation(line: 435, column: 3, scope: !499)
!505 = !DILocation(line: 435, column: 7, scope: !499)
!506 = !DILocation(line: 435, column: 13, scope: !499)
!507 = !DILocation(line: 436, column: 2, scope: !499)
!508 = !DILocation(line: 438, column: 6, scope: !509)
!509 = distinct !DILexicalBlock(scope: !461, file: !1, line: 438, column: 6)
!510 = !DILocation(line: 438, column: 10, scope: !509)
!511 = !DILocation(line: 438, column: 6, scope: !461)
!512 = !DILocation(line: 439, column: 18, scope: !513)
!513 = distinct !DILexicalBlock(scope: !509, file: !1, line: 438, column: 17)
!514 = !DILocation(line: 439, column: 27, scope: !513)
!515 = !DILocation(line: 439, column: 34, scope: !513)
!516 = !DILocation(line: 439, column: 38, scope: !513)
!517 = !DILocation(line: 439, column: 3, scope: !513)
!518 = !DILocation(line: 440, column: 3, scope: !513)
!519 = !DILocation(line: 440, column: 7, scope: !513)
!520 = !DILocation(line: 440, column: 13, scope: !513)
!521 = !DILocation(line: 441, column: 2, scope: !513)
!522 = !DILocation(line: 443, column: 9, scope: !461)
!523 = !DILocation(line: 443, column: 16, scope: !461)
!524 = !DILocation(line: 443, column: 2, scope: !461)
!525 = !DILocation(line: 443, column: 7, scope: !461)
!526 = !DILocation(line: 444, column: 22, scope: !461)
!527 = !DILocation(line: 444, column: 31, scope: !461)
!528 = !DILocation(line: 444, column: 35, scope: !461)
!529 = !DILocation(line: 444, column: 41, scope: !461)
!530 = !DILocation(line: 444, column: 48, scope: !461)
!531 = !DILocation(line: 444, column: 9, scope: !461)
!532 = !DILocation(line: 444, column: 2, scope: !461)
!533 = !DILocation(line: 444, column: 7, scope: !461)
!534 = !DILocation(line: 446, column: 13, scope: !461)
!535 = !DILocation(line: 446, column: 17, scope: !461)
!536 = !DILocation(line: 446, column: 23, scope: !461)
!537 = !DILocation(line: 446, column: 28, scope: !461)
!538 = !DILocation(line: 446, column: 2, scope: !461)
!539 = !DILocation(line: 447, column: 13, scope: !461)
!540 = !DILocation(line: 447, column: 17, scope: !461)
!541 = !DILocation(line: 447, column: 23, scope: !461)
!542 = !DILocation(line: 447, column: 28, scope: !461)
!543 = !DILocation(line: 447, column: 2, scope: !461)
!544 = !DILocation(line: 449, column: 8, scope: !461)
!545 = !DILocation(line: 449, column: 6, scope: !461)
!546 = !DILocation(line: 450, column: 2, scope: !461)
!547 = !DILocation(line: 450, column: 9, scope: !461)
!548 = !DILocation(line: 450, column: 16, scope: !461)
!549 = !DILocation(line: 450, column: 25, scope: !461)
!550 = !DILocation(line: 450, column: 13, scope: !461)
!551 = !DILocation(line: 451, column: 9, scope: !552)
!552 = distinct !DILexicalBlock(scope: !461, file: !1, line: 450, column: 31)
!553 = !DILocation(line: 451, column: 14, scope: !552)
!554 = !DILocation(line: 451, column: 7, scope: !552)
!555 = !DILocation(line: 453, column: 7, scope: !556)
!556 = distinct !DILexicalBlock(scope: !552, file: !1, line: 453, column: 7)
!557 = !DILocation(line: 453, column: 14, scope: !556)
!558 = !DILocation(line: 453, column: 11, scope: !556)
!559 = !DILocation(line: 453, column: 7, scope: !552)
!560 = !DILocation(line: 454, column: 13, scope: !556)
!561 = !DILocation(line: 454, column: 11, scope: !556)
!562 = !DILocation(line: 454, column: 4, scope: !556)
!563 = !DILocation(line: 455, column: 7, scope: !564)
!564 = distinct !DILexicalBlock(scope: !552, file: !1, line: 455, column: 7)
!565 = !DILocation(line: 455, column: 14, scope: !564)
!566 = !DILocation(line: 455, column: 11, scope: !564)
!567 = !DILocation(line: 455, column: 7, scope: !552)
!568 = !DILocation(line: 456, column: 13, scope: !564)
!569 = !DILocation(line: 456, column: 11, scope: !564)
!570 = !DILocation(line: 456, column: 4, scope: !564)
!571 = distinct !{!571, !546, !572}
!572 = !DILocation(line: 457, column: 2, scope: !461)
!573 = !DILocation(line: 459, column: 33, scope: !461)
!574 = !DILocation(line: 459, column: 36, scope: !461)
!575 = !DILocation(line: 459, column: 40, scope: !461)
!576 = !DILocation(line: 459, column: 46, scope: !461)
!577 = !DILocation(line: 459, column: 50, scope: !461)
!578 = !DILocation(line: 459, column: 17, scope: !461)
!579 = !DILocation(line: 459, column: 2, scope: !461)
!580 = !DILocation(line: 459, column: 10, scope: !461)
!581 = !DILocation(line: 459, column: 15, scope: !461)
!582 = !DILocation(line: 460, column: 15, scope: !461)
!583 = !DILocation(line: 460, column: 24, scope: !461)
!584 = !DILocation(line: 460, column: 31, scope: !461)
!585 = !DILocation(line: 460, column: 39, scope: !461)
!586 = !DILocation(line: 460, column: 2, scope: !461)
!587 = !DILocation(line: 462, column: 12, scope: !461)
!588 = !DILocation(line: 462, column: 16, scope: !461)
!589 = !DILocation(line: 462, column: 24, scope: !461)
!590 = !DILocation(line: 462, column: 10, scope: !461)
!591 = !DILocation(line: 463, column: 6, scope: !592)
!592 = distinct !DILexicalBlock(scope: !461, file: !1, line: 463, column: 6)
!593 = !DILocation(line: 463, column: 10, scope: !592)
!594 = !DILocation(line: 463, column: 18, scope: !592)
!595 = !DILocation(line: 463, column: 26, scope: !592)
!596 = !DILocation(line: 463, column: 23, scope: !592)
!597 = !DILocation(line: 463, column: 6, scope: !461)
!598 = !DILocation(line: 464, column: 7, scope: !599)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 464, column: 7)
!600 = distinct !DILexicalBlock(scope: !592, file: !1, line: 463, column: 30)
!601 = !DILocation(line: 464, column: 16, scope: !599)
!602 = !DILocation(line: 464, column: 24, scope: !599)
!603 = !DILocation(line: 464, column: 28, scope: !599)
!604 = !DILocation(line: 464, column: 21, scope: !599)
!605 = !DILocation(line: 464, column: 7, scope: !600)
!606 = !DILocation(line: 465, column: 28, scope: !599)
!607 = !DILocation(line: 465, column: 37, scope: !599)
!608 = !DILocation(line: 465, column: 41, scope: !599)
!609 = !DILocation(line: 465, column: 49, scope: !599)
!610 = !DILocation(line: 465, column: 4, scope: !599)
!611 = !DILocation(line: 466, column: 7, scope: !612)
!612 = distinct !DILexicalBlock(scope: !600, file: !1, line: 466, column: 7)
!613 = !DILocation(line: 466, column: 16, scope: !612)
!614 = !DILocation(line: 466, column: 25, scope: !612)
!615 = !DILocation(line: 466, column: 29, scope: !612)
!616 = !DILocation(line: 466, column: 22, scope: !612)
!617 = !DILocation(line: 466, column: 7, scope: !600)
!618 = !DILocation(line: 467, column: 29, scope: !612)
!619 = !DILocation(line: 467, column: 38, scope: !612)
!620 = !DILocation(line: 467, column: 42, scope: !612)
!621 = !DILocation(line: 467, column: 50, scope: !612)
!622 = !DILocation(line: 467, column: 4, scope: !612)
!623 = !DILocation(line: 468, column: 2, scope: !600)
!624 = !DILocation(line: 470, column: 7, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !1, line: 470, column: 7)
!626 = distinct !DILexicalBlock(scope: !592, file: !1, line: 469, column: 7)
!627 = !DILocation(line: 470, column: 16, scope: !625)
!628 = !DILocation(line: 470, column: 24, scope: !625)
!629 = !DILocation(line: 470, column: 28, scope: !625)
!630 = !DILocation(line: 470, column: 21, scope: !625)
!631 = !DILocation(line: 470, column: 7, scope: !626)
!632 = !DILocation(line: 471, column: 28, scope: !625)
!633 = !DILocation(line: 471, column: 37, scope: !625)
!634 = !DILocation(line: 471, column: 41, scope: !625)
!635 = !DILocation(line: 471, column: 49, scope: !625)
!636 = !DILocation(line: 471, column: 4, scope: !625)
!637 = !DILocation(line: 472, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !626, file: !1, line: 472, column: 7)
!639 = !DILocation(line: 472, column: 16, scope: !638)
!640 = !DILocation(line: 472, column: 25, scope: !638)
!641 = !DILocation(line: 472, column: 29, scope: !638)
!642 = !DILocation(line: 472, column: 22, scope: !638)
!643 = !DILocation(line: 472, column: 7, scope: !626)
!644 = !DILocation(line: 473, column: 29, scope: !638)
!645 = !DILocation(line: 473, column: 38, scope: !638)
!646 = !DILocation(line: 473, column: 42, scope: !638)
!647 = !DILocation(line: 473, column: 50, scope: !638)
!648 = !DILocation(line: 473, column: 4, scope: !638)
!649 = !DILocation(line: 476, column: 2, scope: !461)
!650 = !DILocation(line: 476, column: 12, scope: !461)
!651 = !DILocation(line: 476, column: 16, scope: !461)
!652 = !DILocation(line: 477, column: 2, scope: !461)
!653 = !DILocation(line: 477, column: 12, scope: !461)
!654 = !DILocation(line: 479, column: 22, scope: !461)
!655 = !DILocation(line: 479, column: 31, scope: !461)
!656 = !DILocation(line: 479, column: 2, scope: !461)
!657 = !DILocation(line: 480, column: 22, scope: !461)
!658 = !DILocation(line: 480, column: 31, scope: !461)
!659 = !DILocation(line: 480, column: 2, scope: !461)
!660 = !DILocation(line: 481, column: 1, scope: !461)
!661 = distinct !DISubprogram(name: "voronoi_finishEdge", scope: !1, file: !1, line: 483, type: !662, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !41)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !225, !59}
!664 = !DILocalVariable(name: "process", arg: 1, scope: !661, file: !1, line: 483, type: !225)
!665 = !DILocation(line: 483, column: 48, scope: !661)
!666 = !DILocalVariable(name: "parabola", arg: 2, scope: !661, file: !1, line: 483, type: !59)
!667 = !DILocation(line: 483, column: 74, scope: !661)
!668 = !DILocalVariable(name: "mx", scope: !661, file: !1, line: 485, type: !26)
!669 = !DILocation(line: 485, column: 8, scope: !661)
!670 = !DILocation(line: 487, column: 6, scope: !671)
!671 = distinct !DILexicalBlock(scope: !661, file: !1, line: 487, column: 6)
!672 = !DILocation(line: 487, column: 16, scope: !671)
!673 = !DILocation(line: 487, column: 6, scope: !661)
!674 = !DILocation(line: 488, column: 3, scope: !675)
!675 = distinct !DILexicalBlock(scope: !671, file: !1, line: 487, column: 25)
!676 = !DILocation(line: 488, column: 13, scope: !675)
!677 = !DILocation(line: 489, column: 3, scope: !675)
!678 = !DILocation(line: 492, column: 6, scope: !679)
!679 = distinct !DILexicalBlock(scope: !661, file: !1, line: 492, column: 6)
!680 = !DILocation(line: 492, column: 16, scope: !679)
!681 = !DILocation(line: 492, column: 22, scope: !679)
!682 = !DILocation(line: 492, column: 35, scope: !679)
!683 = !DILocation(line: 492, column: 6, scope: !661)
!684 = !DILocation(line: 493, column: 15, scope: !679)
!685 = !DILocation(line: 493, column: 24, scope: !679)
!686 = !DILocation(line: 493, column: 31, scope: !679)
!687 = !DILocation(line: 493, column: 41, scope: !679)
!688 = !DILocation(line: 493, column: 47, scope: !679)
!689 = !DILocation(line: 493, column: 56, scope: !679)
!690 = !DILocation(line: 493, column: 8, scope: !679)
!691 = !DILocation(line: 493, column: 6, scope: !679)
!692 = !DILocation(line: 493, column: 3, scope: !679)
!693 = !DILocation(line: 495, column: 21, scope: !679)
!694 = !DILocation(line: 495, column: 31, scope: !679)
!695 = !DILocation(line: 495, column: 37, scope: !679)
!696 = !DILocation(line: 495, column: 46, scope: !679)
!697 = !DILocation(line: 495, column: 8, scope: !679)
!698 = !DILocation(line: 495, column: 6, scope: !679)
!699 = !DILocation(line: 497, column: 27, scope: !661)
!700 = !DILocation(line: 497, column: 2, scope: !661)
!701 = !DILocation(line: 497, column: 12, scope: !661)
!702 = !DILocation(line: 497, column: 18, scope: !661)
!703 = !DILocation(line: 497, column: 25, scope: !661)
!704 = !DILocation(line: 498, column: 27, scope: !661)
!705 = !DILocation(line: 498, column: 32, scope: !661)
!706 = !DILocation(line: 498, column: 42, scope: !661)
!707 = !DILocation(line: 498, column: 48, scope: !661)
!708 = !DILocation(line: 498, column: 30, scope: !661)
!709 = !DILocation(line: 498, column: 52, scope: !661)
!710 = !DILocation(line: 498, column: 62, scope: !661)
!711 = !DILocation(line: 498, column: 68, scope: !661)
!712 = !DILocation(line: 498, column: 50, scope: !661)
!713 = !DILocation(line: 498, column: 2, scope: !661)
!714 = !DILocation(line: 498, column: 12, scope: !661)
!715 = !DILocation(line: 498, column: 18, scope: !661)
!716 = !DILocation(line: 498, column: 25, scope: !661)
!717 = !DILocation(line: 500, column: 21, scope: !661)
!718 = !DILocation(line: 500, column: 30, scope: !661)
!719 = !DILocation(line: 500, column: 40, scope: !661)
!720 = !DILocation(line: 500, column: 2, scope: !661)
!721 = !DILocation(line: 501, column: 21, scope: !661)
!722 = !DILocation(line: 501, column: 30, scope: !661)
!723 = !DILocation(line: 501, column: 40, scope: !661)
!724 = !DILocation(line: 501, column: 2, scope: !661)
!725 = !DILocation(line: 503, column: 2, scope: !661)
!726 = !DILocation(line: 503, column: 12, scope: !661)
!727 = !DILocation(line: 504, column: 1, scope: !661)
!728 = distinct !DISubprogram(name: "BLI_voronoi_triangulate", scope: !1, file: !1, line: 768, type: !729, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !41)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !18, !10, !33, !10, !10, !731, !9, !739, !9}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoronoiTriangulationPoint", file: !21, line: 62, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoronoiTriangulationPoint", file: !21, line: 58, size: 192, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !734, file: !21, line: 59, baseType: !25, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !734, file: !21, line: 60, baseType: !30, size: 96, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !734, file: !21, line: 61, baseType: !10, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !31)
!742 = !DILocalVariable(name: "sites", arg: 1, scope: !728, file: !1, line: 768, type: !18)
!743 = !DILocation(line: 768, column: 49, scope: !728)
!744 = !DILocalVariable(name: "sites_total", arg: 2, scope: !728, file: !1, line: 768, type: !10)
!745 = !DILocation(line: 768, column: 60, scope: !728)
!746 = !DILocalVariable(name: "edges", arg: 3, scope: !728, file: !1, line: 768, type: !33)
!747 = !DILocation(line: 768, column: 83, scope: !728)
!748 = !DILocalVariable(name: "width", arg: 4, scope: !728, file: !1, line: 768, type: !10)
!749 = !DILocation(line: 768, column: 94, scope: !728)
!750 = !DILocalVariable(name: "height", arg: 5, scope: !728, file: !1, line: 768, type: !10)
!751 = !DILocation(line: 768, column: 105, scope: !728)
!752 = !DILocalVariable(name: "triangulated_points_r", arg: 6, scope: !728, file: !1, line: 769, type: !731)
!753 = !DILocation(line: 769, column: 58, scope: !728)
!754 = !DILocalVariable(name: "triangulated_points_total_r", arg: 7, scope: !728, file: !1, line: 769, type: !9)
!755 = !DILocation(line: 769, column: 86, scope: !728)
!756 = !DILocalVariable(name: "triangles_r", arg: 8, scope: !728, file: !1, line: 770, type: !739)
!757 = !DILocation(line: 770, column: 37, scope: !728)
!758 = !DILocalVariable(name: "triangles_total_r", arg: 9, scope: !728, file: !1, line: 770, type: !9)
!759 = !DILocation(line: 770, column: 59, scope: !728)
!760 = !DILocalVariable(name: "triangulated_points", scope: !728, file: !1, line: 772, type: !732)
!761 = !DILocation(line: 772, column: 29, scope: !728)
!762 = !DILocalVariable(name: "triangles", scope: !728, file: !1, line: 773, type: !740)
!763 = !DILocation(line: 773, column: 8, scope: !728)
!764 = !DILocalVariable(name: "triangulated_points_total", scope: !728, file: !1, line: 774, type: !10)
!765 = !DILocation(line: 774, column: 6, scope: !728)
!766 = !DILocalVariable(name: "triangles_total", scope: !728, file: !1, line: 774, type: !10)
!767 = !DILocation(line: 774, column: 37, scope: !728)
!768 = !DILocalVariable(name: "i", scope: !728, file: !1, line: 775, type: !10)
!769 = !DILocation(line: 775, column: 6, scope: !728)
!770 = !DILocalVariable(name: "boundary_edges", scope: !728, file: !1, line: 776, type: !34)
!771 = !DILocation(line: 776, column: 11, scope: !728)
!772 = !DILocation(line: 778, column: 21, scope: !728)
!773 = !DILocation(line: 778, column: 28, scope: !728)
!774 = !DILocation(line: 778, column: 35, scope: !728)
!775 = !DILocation(line: 778, column: 2, scope: !728)
!776 = !DILocation(line: 779, column: 47, scope: !728)
!777 = !DILocation(line: 779, column: 54, scope: !728)
!778 = !DILocation(line: 779, column: 2, scope: !728)
!779 = !DILocation(line: 781, column: 9, scope: !780)
!780 = distinct !DILexicalBlock(scope: !728, file: !1, line: 781, column: 2)
!781 = !DILocation(line: 781, column: 7, scope: !780)
!782 = !DILocation(line: 781, column: 14, scope: !783)
!783 = distinct !DILexicalBlock(scope: !780, file: !1, line: 781, column: 2)
!784 = !DILocation(line: 781, column: 18, scope: !783)
!785 = !DILocation(line: 781, column: 16, scope: !783)
!786 = !DILocation(line: 781, column: 2, scope: !780)
!787 = !DILocalVariable(name: "edge", scope: !788, file: !1, line: 782, type: !79)
!788 = distinct !DILexicalBlock(scope: !783, file: !1, line: 781, column: 36)
!789 = !DILocation(line: 782, column: 16, scope: !788)
!790 = !DILocalVariable(name: "v1", scope: !788, file: !1, line: 783, type: !10)
!791 = !DILocation(line: 783, column: 7, scope: !788)
!792 = !DILocation(line: 785, column: 38, scope: !788)
!793 = !DILocation(line: 785, column: 44, scope: !788)
!794 = !DILocation(line: 785, column: 47, scope: !788)
