; ModuleID = 'blender/source/blender/blenkernel/intern/context.c'
source_filename = "blender/source/blender/blenkernel/intern/context.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PointerRNA = type { %struct.anon.1, %struct.StructRNA*, i8* }
%struct.anon.1 = type { i8* }
%struct.StructRNA = type opaque
%struct.bContext = type { i32, %struct.anon, %struct.anon.0 }
%struct.anon = type { %struct.wmWindowManager*, %struct.wmWindow*, %struct.bScreen*, %struct.ScrArea*, %struct.ARegion*, %struct.ARegion*, %struct.bContextStore*, i8* }
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "data_mode_strings", scope: !2, file: !3, line: 937, type: !2037, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !59, globals: !2036, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/context.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !31, !48}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !6, line: 1163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!9 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 93, baseType: !7, size: 32, elements: !33)
!32 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!34 = !DIEnumerator(name: "CTX_MODE_EDIT_MESH", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "CTX_MODE_EDIT_CURVE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "CTX_MODE_EDIT_SURFACE", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "CTX_MODE_EDIT_TEXT", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "CTX_MODE_EDIT_ARMATURE", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "CTX_MODE_EDIT_METABALL", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "CTX_MODE_EDIT_LATTICE", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "CTX_MODE_POSE", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "CTX_MODE_SCULPT", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "CTX_MODE_PAINT_WEIGHT", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "CTX_MODE_PAINT_VERTEX", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "CTX_MODE_PAINT_TEXTURE", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "CTX_MODE_PARTICLE", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "CTX_MODE_OBJECT", value: 13, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !49, line: 666, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58}
!51 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!56 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!57 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!58 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !32, line: 69, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !3, line: 60, size: 832, elements: !64)
!64 = !{!65, !67, !1969}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !63, file: !3, line: 61, baseType: !66, size: 32)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !63, file: !3, line: 73, baseType: !68, size: 512, offset: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !63, file: !3, line: 64, size: 512, elements: !69)
!69 = !{!70, !1716, !1717, !1718, !1847, !1959, !1960, !1968}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !68, file: !3, line: 65, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !73, line: 128, size: 2816, elements: !74)
!73 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!74 = !{!75, !145, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1695, !1696, !1697, !1698, !1699, !1710, !1711, !1712, !1713, !1714, !1715}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !72, file: !73, line: 129, baseType: !76, size: 960)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !77, line: 130, baseType: !78)
!77 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !77, line: 117, size: 960, elements: !79)
!79 = !{!80, !81, !82, !84, !104, !108, !110, !111, !112, !113}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !77, line: 118, baseType: !60, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !77, line: 118, baseType: !60, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !78, file: !77, line: 119, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !78, file: !77, line: 120, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !77, line: 136, size: 17600, elements: !87)
!87 = !{!88, !89, !91, !94, !99, !100, !101}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !86, file: !77, line: 137, baseType: !76, size: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !86, file: !77, line: 138, baseType: !90, size: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !86, file: !77, line: 139, baseType: !92, size: 64, offset: 1024)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !77, line: 43, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !77, line: 140, baseType: !95, size: 8192, offset: 1088)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8192, elements: !97)
!96 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !{!98}
!98 = !DISubrange(count: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !86, file: !77, line: 141, baseType: !95, size: 8192, offset: 9280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !86, file: !77, line: 148, baseType: !85, size: 64, offset: 17472)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !86, file: !77, line: 150, baseType: !102, size: 64, offset: 17536)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !77, line: 45, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !77, line: 121, baseType: !105, size: 528, offset: 256)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 528, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 66)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !77, line: 126, baseType: !109, size: 16, offset: 784)
!109 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !78, file: !77, line: 127, baseType: !66, size: 32, offset: 800)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !78, file: !77, line: 128, baseType: !66, size: 32, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !78, file: !77, line: 128, baseType: !66, size: 32, offset: 864)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !78, file: !77, line: 129, baseType: !114, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !77, line: 75, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !77, line: 62, size: 1024, elements: !117)
!117 = !{!118, !120, !121, !122, !123, !124, !128, !129, !143, !144}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !77, line: 63, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !116, file: !77, line: 63, baseType: !119, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !116, file: !77, line: 64, baseType: !96, size: 8, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !116, file: !77, line: 64, baseType: !96, size: 8, offset: 136)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !116, file: !77, line: 65, baseType: !109, size: 16, offset: 144)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !77, line: 66, baseType: !125, size: 512, offset: 160)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 512, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !116, file: !77, line: 67, baseType: !66, size: 32, offset: 672)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !77, line: 69, baseType: !130, size: 256, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !77, line: 60, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !77, line: 48, size: 256, elements: !132)
!132 = !{!133, !134, !141, !142}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !131, file: !77, line: 49, baseType: !60, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !131, file: !77, line: 58, baseType: !135, size: 128, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !136, line: 71, baseType: !137)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !136, line: 69, size: 128, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !137, file: !136, line: 70, baseType: !60, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !137, file: !136, line: 70, baseType: !60, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !131, file: !77, line: 59, baseType: !66, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !131, file: !77, line: 59, baseType: !66, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !116, file: !77, line: 70, baseType: !66, size: 32, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !116, file: !77, line: 74, baseType: !66, size: 32, offset: 992)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !72, file: !73, line: 131, baseType: !146, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !73, line: 169, size: 2048, elements: !148)
!148 = !{!149, !150, !151, !152, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1665, !1668, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !73, line: 170, baseType: !146, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !73, line: 170, baseType: !146, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !147, file: !73, line: 172, baseType: !60, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !147, file: !73, line: 174, baseType: !153, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !155, line: 49, size: 1984, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !158, !159, !160, !161, !162, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1644}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 50, baseType: !76, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !154, file: !155, line: 52, baseType: !135, size: 128, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !154, file: !155, line: 53, baseType: !135, size: 128, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !154, file: !155, line: 54, baseType: !135, size: 128, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !154, file: !155, line: 55, baseType: !135, size: 128, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !154, file: !155, line: 57, baseType: !163, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !165, line: 1216, size: 39680, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !171, !464, !467, !468, !469, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !495, !568, !994, !1209, !1212, !1500, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1522, !1523, !1524, !1525, !1526, !1534, !1601, !1608, !1609, !1616, !1617, !1618, !1619, !1620, !1621, !1622}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 1217, baseType: !76, size: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !164, file: !165, line: 1218, baseType: !169, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !165, line: 58, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !164, file: !165, line: 1220, baseType: !172, size: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !49, line: 115, size: 11392, elements: !174)
!174 = !{!175, !176, !177, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !195, !207, !221, !222, !265, !266, !269, !270, !286, !287, !288, !289, !290, !291, !292, !296, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !312, !313, !314, !315, !316, !317, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !377, !378, !379, !380, !381, !382, !383, !384, !385, !388, !391, !395, !396, !397, !398, !399, !402, !405, !408, !409, !415, !416, !417, !418, !419, !420, !422, !425, !428, !432, !452, !453}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !49, line: 116, baseType: !76, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !173, file: !49, line: 117, baseType: !169, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !173, file: !49, line: 119, baseType: !178, size: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !49, line: 57, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !173, file: !49, line: 121, baseType: !109, size: 16, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !173, file: !49, line: 121, baseType: !109, size: 16, offset: 1104)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !173, file: !49, line: 122, baseType: !66, size: 32, offset: 1120)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !173, file: !49, line: 122, baseType: !66, size: 32, offset: 1152)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !173, file: !49, line: 122, baseType: !66, size: 32, offset: 1184)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !173, file: !49, line: 123, baseType: !125, size: 512, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !173, file: !49, line: 124, baseType: !172, size: 64, offset: 1728)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !173, file: !49, line: 124, baseType: !172, size: 64, offset: 1792)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !173, file: !49, line: 127, baseType: !172, size: 64, offset: 1856)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !173, file: !49, line: 127, baseType: !172, size: 64, offset: 1920)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !173, file: !49, line: 127, baseType: !172, size: 64, offset: 1984)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !173, file: !49, line: 128, baseType: !192, size: 64, offset: 2048)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !194, line: 49, flags: DIFlagFwdDecl)
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !173, file: !49, line: 130, baseType: !196, size: 64, offset: 2112)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !49, line: 97, size: 832, elements: !198)
!198 = !{!199, !205, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !197, file: !49, line: 98, baseType: !200, size: 768)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 768, elements: !202)
!201 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!202 = !{!203, !204}
!203 = !DISubrange(count: 8)
!204 = !DISubrange(count: 3)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !49, line: 99, baseType: !66, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !197, file: !49, line: 99, baseType: !66, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !173, file: !49, line: 131, baseType: !208, size: 64, offset: 2176)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !210, line: 486, size: 1600, elements: !211)
!210 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !209, file: !210, line: 487, baseType: !76, size: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !209, file: !210, line: 489, baseType: !135, size: 128, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !209, file: !210, line: 490, baseType: !135, size: 128, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !209, file: !210, line: 491, baseType: !135, size: 128, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !209, file: !210, line: 492, baseType: !135, size: 128, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !209, file: !210, line: 494, baseType: !66, size: 32, offset: 1472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !209, file: !210, line: 495, baseType: !66, size: 32, offset: 1504)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !209, file: !210, line: 497, baseType: !66, size: 32, offset: 1536)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !209, file: !210, line: 498, baseType: !66, size: 32, offset: 1568)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !173, file: !49, line: 132, baseType: !208, size: 64, offset: 2240)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !173, file: !49, line: 133, baseType: !223, size: 64, offset: 2304)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !210, line: 334, size: 1728, elements: !225)
!225 = !{!226, !227, !230, !231, !232, !233, !234, !235, !238, !239, !240, !241, !242, !243, !244, !264}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !224, file: !210, line: 335, baseType: !135, size: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !224, file: !210, line: 336, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !6, line: 74, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !224, file: !210, line: 338, baseType: !109, size: 16, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !224, file: !210, line: 338, baseType: !109, size: 16, offset: 208)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !224, file: !210, line: 339, baseType: !7, size: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !224, file: !210, line: 340, baseType: !66, size: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !224, file: !210, line: 342, baseType: !201, size: 32, offset: 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !224, file: !210, line: 343, baseType: !236, size: 96, offset: 320)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 96, elements: !237)
!237 = !{!204}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !224, file: !210, line: 344, baseType: !236, size: 96, offset: 416)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !224, file: !210, line: 347, baseType: !135, size: 128, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !224, file: !210, line: 349, baseType: !66, size: 32, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !224, file: !210, line: 350, baseType: !66, size: 32, offset: 672)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !224, file: !210, line: 351, baseType: !60, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !224, file: !210, line: 352, baseType: !60, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !224, file: !210, line: 354, baseType: !245, size: 384, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !210, line: 116, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !210, line: 94, size: 384, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !246, file: !210, line: 96, baseType: !66, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !246, file: !210, line: 96, baseType: !66, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !246, file: !210, line: 97, baseType: !66, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !246, file: !210, line: 97, baseType: !66, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !246, file: !210, line: 99, baseType: !109, size: 16, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !246, file: !210, line: 100, baseType: !109, size: 16, offset: 144)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !246, file: !210, line: 102, baseType: !109, size: 16, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !246, file: !210, line: 105, baseType: !109, size: 16, offset: 176)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !246, file: !210, line: 108, baseType: !109, size: 16, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !246, file: !210, line: 109, baseType: !109, size: 16, offset: 208)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !246, file: !210, line: 111, baseType: !109, size: 16, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !246, file: !210, line: 112, baseType: !109, size: 16, offset: 240)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !246, file: !210, line: 114, baseType: !66, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !246, file: !210, line: 114, baseType: !66, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !246, file: !210, line: 115, baseType: !66, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !246, file: !210, line: 115, baseType: !66, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !224, file: !210, line: 355, baseType: !125, size: 512, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !49, line: 134, baseType: !60, size: 64, offset: 2368)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !173, file: !49, line: 136, baseType: !267, size: 64, offset: 2432)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !165, line: 61, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !173, file: !49, line: 138, baseType: !245, size: 384, offset: 2496)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !173, file: !49, line: 139, baseType: !271, size: 64, offset: 2880)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !210, line: 80, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !210, line: 72, size: 192, elements: !274)
!274 = !{!275, !282, !283, !284, !285}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !273, file: !210, line: 73, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !210, line: 59, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !210, line: 56, size: 128, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !278, file: !210, line: 57, baseType: !236, size: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !210, line: 58, baseType: !66, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !273, file: !210, line: 74, baseType: !66, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !273, file: !210, line: 76, baseType: !66, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !273, file: !210, line: 77, baseType: !66, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !273, file: !210, line: 79, baseType: !66, size: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !173, file: !49, line: 141, baseType: !135, size: 128, offset: 2944)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !173, file: !49, line: 142, baseType: !135, size: 128, offset: 3072)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !173, file: !49, line: 143, baseType: !135, size: 128, offset: 3200)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !173, file: !49, line: 144, baseType: !135, size: 128, offset: 3328)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !173, file: !49, line: 146, baseType: !66, size: 32, offset: 3456)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !173, file: !49, line: 147, baseType: !66, size: 32, offset: 3488)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !173, file: !49, line: 150, baseType: !293, size: 64, offset: 3520)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !165, line: 179, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !173, file: !49, line: 151, baseType: !297, size: 64, offset: 3584)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !173, file: !49, line: 152, baseType: !66, size: 32, offset: 3648)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !173, file: !49, line: 153, baseType: !66, size: 32, offset: 3680)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !173, file: !49, line: 156, baseType: !236, size: 96, offset: 3712)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !173, file: !49, line: 156, baseType: !236, size: 96, offset: 3808)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !173, file: !49, line: 156, baseType: !236, size: 96, offset: 3904)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !173, file: !49, line: 157, baseType: !236, size: 96, offset: 4000)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !173, file: !49, line: 158, baseType: !236, size: 96, offset: 4096)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !173, file: !49, line: 159, baseType: !236, size: 96, offset: 4192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !173, file: !49, line: 160, baseType: !236, size: 96, offset: 4288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !173, file: !49, line: 160, baseType: !236, size: 96, offset: 4384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !173, file: !49, line: 161, baseType: !309, size: 128, offset: 4480)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 128, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 4)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !173, file: !49, line: 161, baseType: !309, size: 128, offset: 4608)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !173, file: !49, line: 162, baseType: !236, size: 96, offset: 4736)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !173, file: !49, line: 162, baseType: !236, size: 96, offset: 4832)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !173, file: !49, line: 163, baseType: !201, size: 32, offset: 4928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !173, file: !49, line: 163, baseType: !201, size: 32, offset: 4960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !173, file: !49, line: 164, baseType: !318, size: 512, offset: 4992)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 512, elements: !319)
!319 = !{!311, !311}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !173, file: !49, line: 165, baseType: !318, size: 512, offset: 5504)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !173, file: !49, line: 166, baseType: !318, size: 512, offset: 6016)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !173, file: !49, line: 167, baseType: !318, size: 512, offset: 6528)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !173, file: !49, line: 176, baseType: !318, size: 512, offset: 7040)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !173, file: !49, line: 178, baseType: !7, size: 32, offset: 7552)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !49, line: 180, baseType: !109, size: 16, offset: 7584)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !173, file: !49, line: 181, baseType: !109, size: 16, offset: 7600)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !173, file: !49, line: 183, baseType: !109, size: 16, offset: 7616)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !173, file: !49, line: 183, baseType: !109, size: 16, offset: 7632)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !173, file: !49, line: 184, baseType: !109, size: 16, offset: 7648)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !173, file: !49, line: 184, baseType: !109, size: 16, offset: 7664)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !173, file: !49, line: 185, baseType: !109, size: 16, offset: 7680)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !173, file: !49, line: 186, baseType: !109, size: 16, offset: 7696)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !173, file: !49, line: 187, baseType: !109, size: 16, offset: 7712)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !173, file: !49, line: 188, baseType: !96, size: 8, offset: 7728)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !173, file: !49, line: 189, baseType: !96, size: 8, offset: 7736)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !173, file: !49, line: 192, baseType: !66, size: 32, offset: 7744)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !173, file: !49, line: 192, baseType: !66, size: 32, offset: 7776)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !173, file: !49, line: 192, baseType: !66, size: 32, offset: 7808)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !173, file: !49, line: 192, baseType: !66, size: 32, offset: 7840)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !173, file: !49, line: 194, baseType: !66, size: 32, offset: 7872)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !173, file: !49, line: 202, baseType: !201, size: 32, offset: 7904)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !173, file: !49, line: 202, baseType: !201, size: 32, offset: 7936)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !173, file: !49, line: 202, baseType: !201, size: 32, offset: 7968)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !173, file: !49, line: 211, baseType: !201, size: 32, offset: 8000)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !173, file: !49, line: 212, baseType: !201, size: 32, offset: 8032)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !173, file: !49, line: 213, baseType: !201, size: 32, offset: 8064)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !173, file: !49, line: 214, baseType: !201, size: 32, offset: 8096)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !173, file: !49, line: 215, baseType: !201, size: 32, offset: 8128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !173, file: !49, line: 216, baseType: !201, size: 32, offset: 8160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !173, file: !49, line: 219, baseType: !201, size: 32, offset: 8192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !173, file: !49, line: 220, baseType: !201, size: 32, offset: 8224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !173, file: !49, line: 221, baseType: !201, size: 32, offset: 8256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !173, file: !49, line: 224, baseType: !354, size: 16, offset: 8288)
!354 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !173, file: !49, line: 224, baseType: !354, size: 16, offset: 8304)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !173, file: !49, line: 226, baseType: !109, size: 16, offset: 8320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !173, file: !49, line: 228, baseType: !96, size: 8, offset: 8336)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !173, file: !49, line: 229, baseType: !96, size: 8, offset: 8344)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !173, file: !49, line: 231, baseType: !109, size: 16, offset: 8352)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !173, file: !49, line: 232, baseType: !96, size: 8, offset: 8368)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !173, file: !49, line: 233, baseType: !96, size: 8, offset: 8376)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !173, file: !49, line: 234, baseType: !201, size: 32, offset: 8384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !173, file: !49, line: 235, baseType: !201, size: 32, offset: 8416)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !173, file: !49, line: 237, baseType: !135, size: 128, offset: 8448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !173, file: !49, line: 238, baseType: !135, size: 128, offset: 8576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !173, file: !49, line: 239, baseType: !135, size: 128, offset: 8704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !173, file: !49, line: 240, baseType: !135, size: 128, offset: 8832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !173, file: !49, line: 242, baseType: !201, size: 32, offset: 8960)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !173, file: !49, line: 244, baseType: !109, size: 16, offset: 8992)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !173, file: !49, line: 245, baseType: !354, size: 16, offset: 9008)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !173, file: !49, line: 246, baseType: !309, size: 128, offset: 9024)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !173, file: !49, line: 248, baseType: !66, size: 32, offset: 9152)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !173, file: !49, line: 249, baseType: !66, size: 32, offset: 9184)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !173, file: !49, line: 251, baseType: !375, size: 64, offset: 9216)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !49, line: 251, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !173, file: !49, line: 253, baseType: !96, size: 8, offset: 9280)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !173, file: !49, line: 254, baseType: !96, size: 8, offset: 9288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !173, file: !49, line: 255, baseType: !109, size: 16, offset: 9296)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !173, file: !49, line: 256, baseType: !236, size: 96, offset: 9312)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !173, file: !49, line: 258, baseType: !135, size: 128, offset: 9408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !173, file: !49, line: 259, baseType: !135, size: 128, offset: 9536)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !173, file: !49, line: 260, baseType: !135, size: 128, offset: 9664)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !173, file: !49, line: 261, baseType: !135, size: 128, offset: 9792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !173, file: !49, line: 263, baseType: !386, size: 64, offset: 9920)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !49, line: 52, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !173, file: !49, line: 264, baseType: !389, size: 64, offset: 9984)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !49, line: 53, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !173, file: !49, line: 265, baseType: !392, size: 64, offset: 10048)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !394, line: 43, flags: DIFlagFwdDecl)
!394 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!395 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !173, file: !49, line: 267, baseType: !96, size: 8, offset: 10112)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !173, file: !49, line: 268, baseType: !96, size: 8, offset: 10120)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !173, file: !49, line: 269, baseType: !109, size: 16, offset: 10128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !173, file: !49, line: 270, baseType: !201, size: 32, offset: 10144)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !173, file: !49, line: 272, baseType: !400, size: 64, offset: 10176)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !49, line: 54, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !173, file: !49, line: 275, baseType: !403, size: 64, offset: 10240)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !49, line: 275, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !173, file: !49, line: 277, baseType: !406, size: 64, offset: 10304)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !49, line: 56, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !173, file: !49, line: 277, baseType: !406, size: 64, offset: 10368)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !173, file: !49, line: 278, baseType: !410, size: 64, offset: 10432)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !411, line: 27, baseType: !412)
!411 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !413, line: 45, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!414 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !173, file: !49, line: 279, baseType: !410, size: 64, offset: 10496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !173, file: !49, line: 280, baseType: !7, size: 32, offset: 10560)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !173, file: !49, line: 281, baseType: !7, size: 32, offset: 10592)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !173, file: !49, line: 283, baseType: !135, size: 128, offset: 10624)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !173, file: !49, line: 284, baseType: !135, size: 128, offset: 10752)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !173, file: !49, line: 285, baseType: !421, size: 64, offset: 10880)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !173, file: !49, line: 287, baseType: !423, size: 64, offset: 10944)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !49, line: 59, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !173, file: !49, line: 288, baseType: !426, size: 64, offset: 11008)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !49, line: 288, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !173, file: !49, line: 290, baseType: !429, size: 64, offset: 11072)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 64, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 2)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !173, file: !49, line: 291, baseType: !433, size: 64, offset: 11136)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !435, line: 65, baseType: !436)
!435 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !435, line: 50, size: 320, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !436, file: !435, line: 51, baseType: !163, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !436, file: !435, line: 53, baseType: !66, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !436, file: !435, line: 54, baseType: !66, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !436, file: !435, line: 55, baseType: !66, size: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !436, file: !435, line: 55, baseType: !66, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !436, file: !435, line: 56, baseType: !96, size: 8, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !436, file: !435, line: 56, baseType: !96, size: 8, offset: 200)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !436, file: !435, line: 57, baseType: !96, size: 8, offset: 208)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !436, file: !435, line: 57, baseType: !96, size: 8, offset: 216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !436, file: !435, line: 59, baseType: !109, size: 16, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !436, file: !435, line: 59, baseType: !109, size: 16, offset: 240)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !436, file: !435, line: 59, baseType: !109, size: 16, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !435, line: 61, baseType: !109, size: 16, offset: 272)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !436, file: !435, line: 63, baseType: !66, size: 32, offset: 288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !173, file: !49, line: 293, baseType: !135, size: 128, offset: 11200)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !173, file: !49, line: 294, baseType: !454, size: 64, offset: 11328)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !49, line: 113, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !49, line: 108, size: 256, elements: !457)
!457 = !{!458, !460, !461, !462, !463}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !49, line: 109, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !49, line: 109, baseType: !459, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !456, file: !49, line: 110, baseType: !172, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !456, file: !49, line: 111, baseType: !66, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !456, file: !49, line: 112, baseType: !201, size: 32, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !164, file: !165, line: 1221, baseType: !465, size: 64, offset: 1088)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !165, line: 52, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !164, file: !165, line: 1223, baseType: !163, size: 64, offset: 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !164, file: !165, line: 1225, baseType: !135, size: 128, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !164, file: !165, line: 1226, baseType: !470, size: 64, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !165, line: 69, size: 320, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !165, line: 70, baseType: !470, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !471, file: !165, line: 70, baseType: !470, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !471, file: !165, line: 71, baseType: !7, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !471, file: !165, line: 71, baseType: !7, size: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !165, line: 72, baseType: !66, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !471, file: !165, line: 73, baseType: !109, size: 16, offset: 224)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !471, file: !165, line: 73, baseType: !109, size: 16, offset: 240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !471, file: !165, line: 74, baseType: !172, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !164, file: !165, line: 1227, baseType: !172, size: 64, offset: 1408)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !164, file: !165, line: 1229, baseType: !236, size: 96, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !164, file: !165, line: 1230, baseType: !236, size: 96, offset: 1568)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !164, file: !165, line: 1231, baseType: !236, size: 96, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !164, file: !165, line: 1231, baseType: !236, size: 96, offset: 1760)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !164, file: !165, line: 1233, baseType: !7, size: 32, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !164, file: !165, line: 1234, baseType: !66, size: 32, offset: 1888)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !164, file: !165, line: 1235, baseType: !7, size: 32, offset: 1920)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 1237, baseType: !109, size: 16, offset: 1952)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !164, file: !165, line: 1239, baseType: !96, size: 8, offset: 1968)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !165, line: 1240, baseType: !492, size: 8, offset: 1976)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 1)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !164, file: !165, line: 1242, baseType: !496, size: 64, offset: 1984)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !498, line: 328, size: 3456, elements: !499)
!498 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!499 = !{!500, !501, !502, !505, !506, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !534, !535, !536, !539, !544, !545, !548, !552, !556, !560, !564, !565, !566, !567}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !497, file: !498, line: 329, baseType: !76, size: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !497, file: !498, line: 330, baseType: !169, size: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !497, file: !498, line: 332, baseType: !503, size: 64, offset: 1024)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !498, line: 332, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !497, file: !498, line: 333, baseType: !125, size: 512, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !497, file: !498, line: 335, baseType: !507, size: 64, offset: 1600)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !498, line: 335, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !497, file: !498, line: 337, baseType: !267, size: 64, offset: 1664)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !497, file: !498, line: 338, baseType: !429, size: 64, offset: 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !497, file: !498, line: 340, baseType: !135, size: 128, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !497, file: !498, line: 340, baseType: !135, size: 128, offset: 1920)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !497, file: !498, line: 342, baseType: !66, size: 32, offset: 2048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !497, file: !498, line: 342, baseType: !66, size: 32, offset: 2080)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !497, file: !498, line: 343, baseType: !66, size: 32, offset: 2112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !497, file: !498, line: 345, baseType: !66, size: 32, offset: 2144)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !497, file: !498, line: 346, baseType: !66, size: 32, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !497, file: !498, line: 347, baseType: !109, size: 16, offset: 2208)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !497, file: !498, line: 348, baseType: !109, size: 16, offset: 2224)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !497, file: !498, line: 349, baseType: !66, size: 32, offset: 2240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !497, file: !498, line: 351, baseType: !66, size: 32, offset: 2272)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !497, file: !498, line: 353, baseType: !109, size: 16, offset: 2304)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !497, file: !498, line: 354, baseType: !109, size: 16, offset: 2320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !497, file: !498, line: 355, baseType: !66, size: 32, offset: 2336)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !497, file: !498, line: 357, baseType: !526, size: 128, offset: 2368)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !527, line: 95, baseType: !528)
!527 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !527, line: 92, size: 128, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !528, file: !527, line: 93, baseType: !201, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !528, file: !527, line: 93, baseType: !201, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !528, file: !527, line: 94, baseType: !201, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !528, file: !527, line: 94, baseType: !201, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !497, file: !498, line: 363, baseType: !135, size: 128, offset: 2496)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !497, file: !498, line: 363, baseType: !135, size: 128, offset: 2624)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !497, file: !498, line: 368, baseType: !537, size: 64, offset: 2752)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !498, line: 48, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !497, file: !498, line: 372, baseType: !540, size: 32, offset: 2816)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !498, line: 274, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !498, line: 271, size: 32, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !541, file: !498, line: 273, baseType: !7, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !497, file: !498, line: 373, baseType: !66, size: 32, offset: 2848)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !497, file: !498, line: 382, baseType: !546, size: 64, offset: 2880)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !498, line: 46, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !497, file: !498, line: 385, baseType: !549, size: 64, offset: 2944)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !60, !201}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !497, file: !498, line: 386, baseType: !553, size: 64, offset: 3008)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !60, !297}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !497, file: !498, line: 387, baseType: !557, size: 64, offset: 3072)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!66, !60}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !497, file: !498, line: 388, baseType: !561, size: 64, offset: 3136)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !60}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !497, file: !498, line: 389, baseType: !60, size: 64, offset: 3200)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !497, file: !498, line: 389, baseType: !60, size: 64, offset: 3264)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !497, file: !498, line: 389, baseType: !60, size: 64, offset: 3328)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !497, file: !498, line: 389, baseType: !60, size: 64, offset: 3392)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !164, file: !165, line: 1244, baseType: !569, size: 64, offset: 2048)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !194, line: 200, size: 17024, elements: !571)
!571 = !{!572, !573, !574, !575, !987, !988, !989, !990, !991, !992, !993}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !570, file: !194, line: 201, baseType: !421, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !570, file: !194, line: 202, baseType: !135, size: 128, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !570, file: !194, line: 203, baseType: !135, size: 128, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !570, file: !194, line: 206, baseType: !576, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !194, line: 190, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !194, line: 126, size: 2816, elements: !579)
!579 = !{!580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !678, !679, !680, !681, !959, !962, !963, !964, !965, !966, !967, !968, !969, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !986}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !194, line: 127, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !578, file: !194, line: 127, baseType: !581, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !578, file: !194, line: 128, baseType: !60, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !578, file: !194, line: 129, baseType: !60, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !578, file: !194, line: 130, baseType: !125, size: 512, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !578, file: !194, line: 132, baseType: !66, size: 32, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !194, line: 132, baseType: !66, size: 32, offset: 800)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !578, file: !194, line: 133, baseType: !66, size: 32, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !578, file: !194, line: 134, baseType: !66, size: 32, offset: 864)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !578, file: !194, line: 134, baseType: !66, size: 32, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !578, file: !194, line: 134, baseType: !66, size: 32, offset: 928)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !578, file: !194, line: 135, baseType: !66, size: 32, offset: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !578, file: !194, line: 135, baseType: !66, size: 32, offset: 992)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !578, file: !194, line: 136, baseType: !66, size: 32, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !578, file: !194, line: 136, baseType: !66, size: 32, offset: 1056)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !578, file: !194, line: 137, baseType: !66, size: 32, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !578, file: !194, line: 137, baseType: !66, size: 32, offset: 1120)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !578, file: !194, line: 138, baseType: !201, size: 32, offset: 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !578, file: !194, line: 139, baseType: !201, size: 32, offset: 1184)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !578, file: !194, line: 139, baseType: !201, size: 32, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !578, file: !194, line: 141, baseType: !109, size: 16, offset: 1248)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !578, file: !194, line: 142, baseType: !109, size: 16, offset: 1264)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !578, file: !194, line: 143, baseType: !66, size: 32, offset: 1280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !578, file: !194, line: 144, baseType: !66, size: 32, offset: 1312)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !578, file: !194, line: 146, baseType: !606, size: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !194, line: 114, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !194, line: 99, size: 7232, elements: !609)
!609 = !{!610, !612, !613, !614, !615, !616, !617, !628, !632, !646, !655, !662, !672}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !608, file: !194, line: 100, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !608, file: !194, line: 100, baseType: !611, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !608, file: !194, line: 101, baseType: !66, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !608, file: !194, line: 101, baseType: !66, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !608, file: !194, line: 102, baseType: !66, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !608, file: !194, line: 102, baseType: !66, size: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !608, file: !194, line: 103, baseType: !618, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !194, line: 59, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !194, line: 56, size: 2112, elements: !621)
!621 = !{!622, !626, !627}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !620, file: !194, line: 57, baseType: !623, size: 2048)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2048, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !620, file: !194, line: 58, baseType: !66, size: 32, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !620, file: !194, line: 58, baseType: !66, size: 32, offset: 2080)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !608, file: !194, line: 106, baseType: !629, size: 6144, offset: 320)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 6144, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !608, file: !194, line: 107, baseType: !633, size: 64, offset: 6464)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !194, line: 97, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !194, line: 83, size: 8320, elements: !636)
!636 = !{!637, !638, !639, !642, !643, !644, !645}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !635, file: !194, line: 84, baseType: !629, size: 6144)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !635, file: !194, line: 87, baseType: !623, size: 2048, offset: 6144)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !635, file: !194, line: 88, baseType: !640, size: 64, offset: 8192)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !435, line: 41, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !635, file: !194, line: 90, baseType: !109, size: 16, offset: 8256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !635, file: !194, line: 92, baseType: !109, size: 16, offset: 8272)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !635, file: !194, line: 93, baseType: !109, size: 16, offset: 8288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !635, file: !194, line: 95, baseType: !109, size: 16, offset: 8304)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !608, file: !194, line: 108, baseType: !647, size: 64, offset: 6528)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !194, line: 66, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !194, line: 61, size: 128, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !649, file: !194, line: 62, baseType: !66, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !649, file: !194, line: 63, baseType: !66, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !649, file: !194, line: 64, baseType: !66, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !649, file: !194, line: 65, baseType: !66, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !608, file: !194, line: 109, baseType: !656, size: 64, offset: 6592)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !194, line: 71, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !194, line: 68, size: 64, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !658, file: !194, line: 69, baseType: !66, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !658, file: !194, line: 70, baseType: !66, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !608, file: !194, line: 110, baseType: !663, size: 64, offset: 6656)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !194, line: 81, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !194, line: 73, size: 352, elements: !666)
!666 = !{!667, !668, !669, !670, !671}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !665, file: !194, line: 74, baseType: !236, size: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !665, file: !194, line: 75, baseType: !236, size: 96, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !665, file: !194, line: 76, baseType: !236, size: 96, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !665, file: !194, line: 77, baseType: !66, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !665, file: !194, line: 78, baseType: !66, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !608, file: !194, line: 113, baseType: !673, size: 512, offset: 6720)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !674, line: 182, baseType: !675)
!674 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !674, line: 180, size: 512, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !674, line: 181, baseType: !125, size: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !578, file: !194, line: 148, baseType: !192, size: 64, offset: 1408)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !578, file: !194, line: 151, baseType: !163, size: 64, offset: 1472)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !578, file: !194, line: 152, baseType: !172, size: 64, offset: 1536)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !578, file: !194, line: 153, baseType: !682, size: 64, offset: 1600)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !684, line: 64, size: 19136, elements: !685)
!684 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!685 = !{!686, !687, !688, !689, !690, !691, !693, !694, !695, !696, !699, !700, !945, !946, !954, !955, !956, !957, !958}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !683, file: !684, line: 65, baseType: !76, size: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !683, file: !684, line: 66, baseType: !169, size: 64, offset: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !683, file: !684, line: 68, baseType: !95, size: 8192, offset: 1024)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !683, file: !684, line: 70, baseType: !66, size: 32, offset: 9216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !683, file: !684, line: 71, baseType: !66, size: 32, offset: 9248)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !683, file: !684, line: 72, baseType: !692, size: 64, offset: 9280)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !430)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !683, file: !684, line: 74, baseType: !201, size: 32, offset: 9344)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !683, file: !684, line: 74, baseType: !201, size: 32, offset: 9376)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !683, file: !684, line: 76, baseType: !640, size: 64, offset: 9408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !683, file: !684, line: 77, baseType: !697, size: 64, offset: 9472)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !684, line: 77, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !683, file: !684, line: 78, baseType: !267, size: 64, offset: 9536)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !683, file: !684, line: 80, baseType: !701, size: 2624, offset: 9600)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !702, line: 340, size: 2624, elements: !703)
!702 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!703 = !{!704, !732, !750, !751, !752, !767, !825, !826, !925, !926, !927, !928, !934}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !701, file: !702, line: 341, baseType: !705, size: 576)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !702, line: 251, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !702, line: 207, size: 576, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !706, file: !702, line: 208, baseType: !66, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !706, file: !702, line: 211, baseType: !109, size: 16, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !706, file: !702, line: 212, baseType: !109, size: 16, offset: 48)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !706, file: !702, line: 213, baseType: !201, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !706, file: !702, line: 214, baseType: !109, size: 16, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !706, file: !702, line: 215, baseType: !109, size: 16, offset: 112)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !706, file: !702, line: 216, baseType: !109, size: 16, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !706, file: !702, line: 217, baseType: !109, size: 16, offset: 144)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !706, file: !702, line: 218, baseType: !109, size: 16, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !706, file: !702, line: 219, baseType: !109, size: 16, offset: 176)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !706, file: !702, line: 220, baseType: !201, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !706, file: !702, line: 222, baseType: !109, size: 16, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !706, file: !702, line: 225, baseType: !109, size: 16, offset: 240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !706, file: !702, line: 228, baseType: !66, size: 32, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !706, file: !702, line: 229, baseType: !66, size: 32, offset: 288)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !706, file: !702, line: 233, baseType: !66, size: 32, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !706, file: !702, line: 236, baseType: !109, size: 16, offset: 352)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !706, file: !702, line: 236, baseType: !109, size: 16, offset: 368)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !706, file: !702, line: 241, baseType: !201, size: 32, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !706, file: !702, line: 244, baseType: !66, size: 32, offset: 416)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !706, file: !702, line: 244, baseType: !66, size: 32, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !706, file: !702, line: 245, baseType: !201, size: 32, offset: 480)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !706, file: !702, line: 248, baseType: !201, size: 32, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !706, file: !702, line: 250, baseType: !66, size: 32, offset: 544)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !701, file: !702, line: 342, baseType: !733, size: 448, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !702, line: 79, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !702, line: 61, size: 448, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !734, file: !702, line: 62, baseType: !60, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !734, file: !702, line: 64, baseType: !109, size: 16, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !734, file: !702, line: 65, baseType: !109, size: 16, offset: 80)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !734, file: !702, line: 67, baseType: !201, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !734, file: !702, line: 68, baseType: !201, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !734, file: !702, line: 69, baseType: !201, size: 32, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !734, file: !702, line: 70, baseType: !109, size: 16, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !734, file: !702, line: 71, baseType: !109, size: 16, offset: 208)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !734, file: !702, line: 72, baseType: !429, size: 64, offset: 224)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !734, file: !702, line: 75, baseType: !201, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !734, file: !702, line: 75, baseType: !201, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !734, file: !702, line: 75, baseType: !201, size: 32, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !734, file: !702, line: 78, baseType: !201, size: 32, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !734, file: !702, line: 78, baseType: !201, size: 32, offset: 416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !701, file: !702, line: 343, baseType: !135, size: 128, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !701, file: !702, line: 344, baseType: !135, size: 128, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !701, file: !702, line: 345, baseType: !753, size: 192, offset: 1280)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !702, line: 278, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !702, line: 270, size: 192, elements: !755)
!755 = !{!756, !757, !758, !759, !760}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !754, file: !702, line: 271, baseType: !66, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !754, file: !702, line: 273, baseType: !201, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !754, file: !702, line: 275, baseType: !66, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !754, file: !702, line: 276, baseType: !66, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !754, file: !702, line: 277, baseType: !761, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !702, line: 55, size: 576, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !762, file: !702, line: 56, baseType: !66, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !762, file: !702, line: 57, baseType: !201, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !762, file: !702, line: 58, baseType: !318, size: 512, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !701, file: !702, line: 346, baseType: !768, size: 384, offset: 1472)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !702, line: 268, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !702, line: 253, size: 384, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !819, !820, !821, !822, !823, !824}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !769, file: !702, line: 254, baseType: !66, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !769, file: !702, line: 255, baseType: !66, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !769, file: !702, line: 255, baseType: !66, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !769, file: !702, line: 258, baseType: !201, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !769, file: !702, line: 259, baseType: !776, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !702, line: 164, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !702, line: 108, size: 1664, elements: !779)
!779 = !{!780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !778, file: !702, line: 109, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !778, file: !702, line: 109, baseType: !781, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !778, file: !702, line: 111, baseType: !125, size: 512, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !778, file: !702, line: 119, baseType: !429, size: 64, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !778, file: !702, line: 119, baseType: !429, size: 64, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !778, file: !702, line: 125, baseType: !429, size: 64, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !778, file: !702, line: 125, baseType: !429, size: 64, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !778, file: !702, line: 127, baseType: !429, size: 64, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !778, file: !702, line: 130, baseType: !66, size: 32, offset: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !778, file: !702, line: 131, baseType: !66, size: 32, offset: 992)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !778, file: !702, line: 132, baseType: !792, size: 64, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !702, line: 106, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !702, line: 81, size: 512, elements: !795)
!795 = !{!796, !797, !800, !801, !802, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !794, file: !702, line: 82, baseType: !429, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !794, file: !702, line: 97, baseType: !798, size: 256, offset: 64)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 256, elements: !799)
!799 = !{!311, !431}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !794, file: !702, line: 102, baseType: !429, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !794, file: !702, line: 102, baseType: !429, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !794, file: !702, line: 104, baseType: !66, size: 32, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !702, line: 105, baseType: !66, size: 32, offset: 480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !778, file: !702, line: 135, baseType: !236, size: 96, offset: 1088)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !778, file: !702, line: 136, baseType: !201, size: 32, offset: 1184)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !778, file: !702, line: 139, baseType: !66, size: 32, offset: 1216)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !778, file: !702, line: 139, baseType: !66, size: 32, offset: 1248)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !778, file: !702, line: 139, baseType: !66, size: 32, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !778, file: !702, line: 140, baseType: !236, size: 96, offset: 1312)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !778, file: !702, line: 143, baseType: !109, size: 16, offset: 1408)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !778, file: !702, line: 144, baseType: !109, size: 16, offset: 1424)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !778, file: !702, line: 145, baseType: !109, size: 16, offset: 1440)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !778, file: !702, line: 148, baseType: !109, size: 16, offset: 1456)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !778, file: !702, line: 149, baseType: !66, size: 32, offset: 1472)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !778, file: !702, line: 150, baseType: !201, size: 32, offset: 1504)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !778, file: !702, line: 152, baseType: !267, size: 64, offset: 1536)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !778, file: !702, line: 163, baseType: !201, size: 32, offset: 1600)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !778, file: !702, line: 163, baseType: !201, size: 32, offset: 1632)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !769, file: !702, line: 261, baseType: !201, size: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !769, file: !702, line: 261, baseType: !201, size: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !769, file: !702, line: 261, baseType: !201, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !769, file: !702, line: 263, baseType: !66, size: 32, offset: 288)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !769, file: !702, line: 266, baseType: !66, size: 32, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !769, file: !702, line: 267, baseType: !201, size: 32, offset: 352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !701, file: !702, line: 347, baseType: !776, size: 64, offset: 1856)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !701, file: !702, line: 348, baseType: !827, size: 64, offset: 1920)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !702, line: 205, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !702, line: 186, size: 1024, elements: !830)
!830 = !{!831, !833, !834, !835, !837, !838, !839, !847, !848, !849, !923, !924}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !702, line: 187, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !829, file: !702, line: 187, baseType: !832, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !829, file: !702, line: 189, baseType: !125, size: 512, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !829, file: !702, line: 191, baseType: !836, size: 64, offset: 640)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
