; ModuleID = 'blender/source/blender/render/intern/source/rayshade.c'
source_filename = "blender/source/blender/render/intern/source/rayshade.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xso", scope: !2, file: !3, line: 1735, type: !2599, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "threadsafe_table_sphere", scope: !3, file: !3, line: 1733, type: !4, scopeLine: 1734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !2773)
!3 = !DIFile(filename: "blender/source/blender/render/intern/source/rayshade.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !8, !8, !8, !8, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !46, globals: !2768, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !12, line: 213, baseType: !8, size: 32, elements: !13)
!12 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!14 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!15 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!16 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!17 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!18 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!19 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!20 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!21 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!22 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!23 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!24 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!25 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!26 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!27 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!28 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!29 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!30 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!31 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!32 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!33 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!34 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!35 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!36 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!37 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!38 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!39 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!40 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!41 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!42 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!43 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!44 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!45 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!46 = !{!47, !48, !2517, !2395, !2519, !2522, !2524, !2526, !7, !2745}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "VlakPrimitive", file: !50, line: 98, baseType: !51)
!50 = !DIFile(filename: "blender/source/blender/render/intern/include/rayobject.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VlakPrimitive", file: !50, line: 95, size: 128, elements: !52)
!52 = !{!53, !2516}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !51, file: !50, line: 96, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectInstanceRen", file: !56, line: 345, size: 2304, elements: !57)
!56 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60, !2487, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2502, !2512, !2513, !2514, !2515}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !56, line: 346, baseType: !54, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !55, file: !56, line: 346, baseType: !54, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "obr", scope: !55, file: !56, line: 348, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectRen", file: !56, line: 343, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectRen", file: !56, line: 315, size: 2240, elements: !64)
!64 = !{!65, !67, !68, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2215, !2255, !2334, !2373, !2374, !2376, !2377, !2378, !2379, !2380, !2381, !2473, !2484, !2486}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !56, line: 316, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !63, file: !56, line: 316, baseType: !66, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !63, file: !56, line: 317, baseType: !69, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !71, line: 115, size: 11392, elements: !72)
!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !{!73, !143, !147, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !164, !175, !189, !190, !235, !236, !239, !240, !256, !257, !258, !259, !260, !261, !262, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2129, !2132, !2133, !2134, !2135, !2136, !2137, !2140, !2143, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2155, !2158, !2161, !2162, !2165, !2166}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !71, line: 116, baseType: !74, size: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !75, line: 130, baseType: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !75, line: 117, size: 960, elements: !77)
!77 = !{!78, !79, !80, !82, !102, !106, !108, !109, !110, !111}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !75, line: 118, baseType: !47, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !76, file: !75, line: 118, baseType: !47, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !76, file: !75, line: 119, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !76, file: !75, line: 120, baseType: !83, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !75, line: 136, size: 17600, elements: !85)
!85 = !{!86, !87, !89, !92, !97, !98, !99}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !84, file: !75, line: 137, baseType: !74, size: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !84, file: !75, line: 138, baseType: !88, size: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !84, file: !75, line: 139, baseType: !90, size: 64, offset: 1024)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !75, line: 43, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !75, line: 140, baseType: !93, size: 8192, offset: 1088)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8192, elements: !95)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !{!96}
!96 = !DISubrange(count: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !84, file: !75, line: 141, baseType: !93, size: 8192, offset: 9280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !84, file: !75, line: 148, baseType: !83, size: 64, offset: 17472)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !84, file: !75, line: 150, baseType: !100, size: 64, offset: 17536)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !75, line: 45, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !75, line: 121, baseType: !103, size: 528, offset: 256)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 528, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 66)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !76, file: !75, line: 126, baseType: !107, size: 16, offset: 784)
!107 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !76, file: !75, line: 127, baseType: !8, size: 32, offset: 800)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !76, file: !75, line: 128, baseType: !8, size: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !76, file: !75, line: 128, baseType: !8, size: 32, offset: 864)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !76, file: !75, line: 129, baseType: !112, size: 64, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !75, line: 75, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !75, line: 62, size: 1024, elements: !115)
!115 = !{!116, !118, !119, !120, !121, !122, !126, !127, !141, !142}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !75, line: 63, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !75, line: 63, baseType: !117, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !75, line: 64, baseType: !94, size: 8, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !114, file: !75, line: 64, baseType: !94, size: 8, offset: 136)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !75, line: 65, baseType: !107, size: 16, offset: 144)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !75, line: 66, baseType: !123, size: 512, offset: 160)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 512, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !114, file: !75, line: 67, baseType: !8, size: 32, offset: 672)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !75, line: 69, baseType: !128, size: 256, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !75, line: 60, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !75, line: 48, size: 256, elements: !130)
!130 = !{!131, !132, !139, !140}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !129, file: !75, line: 49, baseType: !47, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !129, file: !75, line: 58, baseType: !133, size: 128, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !134, line: 71, baseType: !135)
!134 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !134, line: 69, size: 128, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !135, file: !134, line: 70, baseType: !47, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !135, file: !134, line: 70, baseType: !47, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !129, file: !75, line: 59, baseType: !8, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !129, file: !75, line: 59, baseType: !8, size: 32, offset: 224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !75, line: 70, baseType: !8, size: 32, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !114, file: !75, line: 74, baseType: !8, size: 32, offset: 992)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !70, file: !71, line: 117, baseType: !144, size: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !146, line: 48, flags: DIFlagFwdDecl)
!146 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !70, file: !71, line: 119, baseType: !148, size: 64, offset: 1024)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !71, line: 57, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !71, line: 121, baseType: !107, size: 16, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !70, file: !71, line: 121, baseType: !107, size: 16, offset: 1104)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !70, file: !71, line: 122, baseType: !8, size: 32, offset: 1120)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !70, file: !71, line: 122, baseType: !8, size: 32, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !70, file: !71, line: 122, baseType: !8, size: 32, offset: 1184)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !70, file: !71, line: 123, baseType: !123, size: 512, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !70, file: !71, line: 124, baseType: !69, size: 64, offset: 1728)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !70, file: !71, line: 124, baseType: !69, size: 64, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !70, file: !71, line: 127, baseType: !69, size: 64, offset: 1856)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !70, file: !71, line: 127, baseType: !69, size: 64, offset: 1920)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !70, file: !71, line: 127, baseType: !69, size: 64, offset: 1984)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !70, file: !71, line: 128, baseType: !162, size: 64, offset: 2048)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !146, line: 49, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !70, file: !71, line: 130, baseType: !165, size: 64, offset: 2112)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !71, line: 97, size: 832, elements: !167)
!167 = !{!168, !173, !174}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !166, file: !71, line: 98, baseType: !169, size: 768)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 768, elements: !170)
!170 = !{!171, !172}
!171 = !DISubrange(count: 8)
!172 = !DISubrange(count: 3)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !71, line: 99, baseType: !8, size: 32, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !166, file: !71, line: 99, baseType: !8, size: 32, offset: 800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !70, file: !71, line: 131, baseType: !176, size: 64, offset: 2176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !178, line: 486, size: 1600, elements: !179)
!178 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !178, line: 487, baseType: !74, size: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !177, file: !178, line: 489, baseType: !133, size: 128, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !177, file: !178, line: 490, baseType: !133, size: 128, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !177, file: !178, line: 491, baseType: !133, size: 128, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !177, file: !178, line: 492, baseType: !133, size: 128, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !178, line: 494, baseType: !8, size: 32, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !177, file: !178, line: 495, baseType: !8, size: 32, offset: 1504)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !177, file: !178, line: 497, baseType: !8, size: 32, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !177, file: !178, line: 498, baseType: !8, size: 32, offset: 1568)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !70, file: !71, line: 132, baseType: !176, size: 64, offset: 2240)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !70, file: !71, line: 133, baseType: !191, size: 64, offset: 2304)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !178, line: 334, size: 1728, elements: !193)
!193 = !{!194, !195, !199, !200, !201, !203, !204, !205, !208, !209, !210, !211, !212, !213, !214, !234}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !192, file: !178, line: 335, baseType: !133, size: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !192, file: !178, line: 336, baseType: !196, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !198, line: 48, flags: DIFlagFwdDecl)
!198 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !178, line: 338, baseType: !107, size: 16, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !192, file: !178, line: 338, baseType: !107, size: 16, offset: 208)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !192, file: !178, line: 339, baseType: !202, size: 32, offset: 224)
!202 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !192, file: !178, line: 340, baseType: !8, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !192, file: !178, line: 342, baseType: !7, size: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !192, file: !178, line: 343, baseType: !206, size: 96, offset: 320)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !207)
!207 = !{!172}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !192, file: !178, line: 344, baseType: !206, size: 96, offset: 416)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !192, file: !178, line: 347, baseType: !133, size: 128, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !192, file: !178, line: 349, baseType: !8, size: 32, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !192, file: !178, line: 350, baseType: !8, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !192, file: !178, line: 351, baseType: !47, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !192, file: !178, line: 352, baseType: !47, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !192, file: !178, line: 354, baseType: !215, size: 384, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !178, line: 116, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !178, line: 94, size: 384, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !216, file: !178, line: 96, baseType: !8, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !216, file: !178, line: 96, baseType: !8, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !216, file: !178, line: 97, baseType: !8, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !216, file: !178, line: 97, baseType: !8, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !216, file: !178, line: 99, baseType: !107, size: 16, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !216, file: !178, line: 100, baseType: !107, size: 16, offset: 144)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !216, file: !178, line: 102, baseType: !107, size: 16, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !216, file: !178, line: 105, baseType: !107, size: 16, offset: 176)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !216, file: !178, line: 108, baseType: !107, size: 16, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !216, file: !178, line: 109, baseType: !107, size: 16, offset: 208)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !216, file: !178, line: 111, baseType: !107, size: 16, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !216, file: !178, line: 112, baseType: !107, size: 16, offset: 240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !216, file: !178, line: 114, baseType: !8, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !216, file: !178, line: 114, baseType: !8, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !216, file: !178, line: 115, baseType: !8, size: 32, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !216, file: !178, line: 115, baseType: !8, size: 32, offset: 352)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !192, file: !178, line: 355, baseType: !123, size: 512, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !71, line: 134, baseType: !47, size: 64, offset: 2368)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !70, file: !71, line: 136, baseType: !237, size: 64, offset: 2432)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !12, line: 61, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !70, file: !71, line: 138, baseType: !215, size: 384, offset: 2496)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !70, file: !71, line: 139, baseType: !241, size: 64, offset: 2880)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !178, line: 80, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !178, line: 72, size: 192, elements: !244)
!244 = !{!245, !252, !253, !254, !255}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !243, file: !178, line: 73, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !178, line: 59, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !178, line: 56, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !248, file: !178, line: 57, baseType: !206, size: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !248, file: !178, line: 58, baseType: !8, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !243, file: !178, line: 74, baseType: !8, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !243, file: !178, line: 76, baseType: !8, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !243, file: !178, line: 77, baseType: !8, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !178, line: 79, baseType: !8, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !70, file: !71, line: 141, baseType: !133, size: 128, offset: 2944)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !70, file: !71, line: 142, baseType: !133, size: 128, offset: 3072)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !70, file: !71, line: 143, baseType: !133, size: 128, offset: 3200)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !70, file: !71, line: 144, baseType: !133, size: 128, offset: 3328)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !70, file: !71, line: 146, baseType: !8, size: 32, offset: 3456)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !70, file: !71, line: 147, baseType: !8, size: 32, offset: 3488)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !70, file: !71, line: 150, baseType: !263, size: 64, offset: 3520)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !146, line: 93, size: 7552, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !315, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !384, !385, !386, !387, !388, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2042}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !265, file: !146, line: 94, baseType: !74, size: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !265, file: !146, line: 95, baseType: !144, size: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !265, file: !146, line: 97, baseType: !107, size: 16, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !146, line: 97, baseType: !107, size: 16, offset: 1040)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !265, file: !146, line: 99, baseType: !7, size: 32, offset: 1056)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !265, file: !146, line: 99, baseType: !7, size: 32, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !265, file: !146, line: 99, baseType: !7, size: 32, offset: 1120)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !265, file: !146, line: 100, baseType: !7, size: 32, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !265, file: !146, line: 100, baseType: !7, size: 32, offset: 1184)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !265, file: !146, line: 100, baseType: !7, size: 32, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !265, file: !146, line: 101, baseType: !7, size: 32, offset: 1248)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !265, file: !146, line: 101, baseType: !7, size: 32, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !265, file: !146, line: 101, baseType: !7, size: 32, offset: 1312)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !265, file: !146, line: 102, baseType: !7, size: 32, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !265, file: !146, line: 102, baseType: !7, size: 32, offset: 1376)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !265, file: !146, line: 102, baseType: !7, size: 32, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !265, file: !146, line: 103, baseType: !7, size: 32, offset: 1440)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !265, file: !146, line: 103, baseType: !7, size: 32, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !265, file: !146, line: 103, baseType: !7, size: 32, offset: 1504)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !265, file: !146, line: 103, baseType: !7, size: 32, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !265, file: !146, line: 103, baseType: !7, size: 32, offset: 1568)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !265, file: !146, line: 104, baseType: !7, size: 32, offset: 1600)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !265, file: !146, line: 104, baseType: !7, size: 32, offset: 1632)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !265, file: !146, line: 104, baseType: !7, size: 32, offset: 1664)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !265, file: !146, line: 104, baseType: !7, size: 32, offset: 1696)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !265, file: !146, line: 104, baseType: !7, size: 32, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !265, file: !146, line: 105, baseType: !7, size: 32, offset: 1760)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !265, file: !146, line: 108, baseType: !295, size: 704, offset: 1792)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !146, line: 53, size: 704, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !295, file: !146, line: 54, baseType: !7, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !295, file: !146, line: 55, baseType: !7, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !295, file: !146, line: 56, baseType: !7, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !295, file: !146, line: 57, baseType: !7, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !295, file: !146, line: 59, baseType: !206, size: 96, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !295, file: !146, line: 60, baseType: !206, size: 96, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !295, file: !146, line: 61, baseType: !206, size: 96, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !295, file: !146, line: 63, baseType: !7, size: 32, offset: 416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !295, file: !146, line: 64, baseType: !7, size: 32, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !295, file: !146, line: 65, baseType: !7, size: 32, offset: 480)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !295, file: !146, line: 67, baseType: !107, size: 16, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !295, file: !146, line: 68, baseType: !107, size: 16, offset: 528)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !295, file: !146, line: 69, baseType: !107, size: 16, offset: 544)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !295, file: !146, line: 70, baseType: !107, size: 16, offset: 560)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !295, file: !146, line: 72, baseType: !7, size: 32, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !295, file: !146, line: 73, baseType: !7, size: 32, offset: 608)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !295, file: !146, line: 74, baseType: !7, size: 32, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !295, file: !146, line: 75, baseType: !7, size: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !265, file: !146, line: 109, baseType: !316, size: 128, offset: 2496)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !146, line: 79, size: 128, elements: !317)
!317 = !{!318, !319, !320, !321}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !316, file: !146, line: 80, baseType: !8, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !316, file: !146, line: 81, baseType: !8, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !316, file: !146, line: 82, baseType: !8, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !316, file: !146, line: 83, baseType: !8, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !265, file: !146, line: 111, baseType: !7, size: 32, offset: 2624)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !265, file: !146, line: 111, baseType: !7, size: 32, offset: 2656)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !265, file: !146, line: 112, baseType: !7, size: 32, offset: 2688)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !265, file: !146, line: 112, baseType: !7, size: 32, offset: 2720)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !265, file: !146, line: 113, baseType: !7, size: 32, offset: 2752)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !265, file: !146, line: 114, baseType: !7, size: 32, offset: 2784)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !265, file: !146, line: 114, baseType: !7, size: 32, offset: 2816)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !265, file: !146, line: 115, baseType: !107, size: 16, offset: 2848)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !265, file: !146, line: 115, baseType: !107, size: 16, offset: 2864)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !265, file: !146, line: 116, baseType: !107, size: 16, offset: 2880)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !265, file: !146, line: 117, baseType: !94, size: 8, offset: 2896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !265, file: !146, line: 117, baseType: !94, size: 8, offset: 2904)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !265, file: !146, line: 119, baseType: !7, size: 32, offset: 2912)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !265, file: !146, line: 119, baseType: !7, size: 32, offset: 2944)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !265, file: !146, line: 120, baseType: !107, size: 16, offset: 2976)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !265, file: !146, line: 120, baseType: !107, size: 16, offset: 2992)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !265, file: !146, line: 121, baseType: !7, size: 32, offset: 3008)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !265, file: !146, line: 121, baseType: !7, size: 32, offset: 3040)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !265, file: !146, line: 122, baseType: !7, size: 32, offset: 3072)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !265, file: !146, line: 123, baseType: !7, size: 32, offset: 3104)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !265, file: !146, line: 124, baseType: !107, size: 16, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !265, file: !146, line: 125, baseType: !107, size: 16, offset: 3152)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !265, file: !146, line: 127, baseType: !8, size: 32, offset: 3168)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !265, file: !146, line: 127, baseType: !8, size: 32, offset: 3200)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !265, file: !146, line: 128, baseType: !8, size: 32, offset: 3232)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !265, file: !146, line: 128, baseType: !8, size: 32, offset: 3264)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !265, file: !146, line: 129, baseType: !107, size: 16, offset: 3296)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !265, file: !146, line: 129, baseType: !107, size: 16, offset: 3312)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !265, file: !146, line: 129, baseType: !107, size: 16, offset: 3328)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !265, file: !146, line: 129, baseType: !107, size: 16, offset: 3344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !265, file: !146, line: 130, baseType: !7, size: 32, offset: 3360)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !265, file: !146, line: 130, baseType: !7, size: 32, offset: 3392)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !265, file: !146, line: 130, baseType: !7, size: 32, offset: 3424)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !265, file: !146, line: 130, baseType: !7, size: 32, offset: 3456)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !265, file: !146, line: 131, baseType: !7, size: 32, offset: 3488)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !265, file: !146, line: 131, baseType: !7, size: 32, offset: 3520)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !265, file: !146, line: 131, baseType: !7, size: 32, offset: 3552)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !265, file: !146, line: 131, baseType: !7, size: 32, offset: 3584)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !265, file: !146, line: 132, baseType: !7, size: 32, offset: 3616)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !265, file: !146, line: 132, baseType: !7, size: 32, offset: 3648)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !265, file: !146, line: 133, baseType: !123, size: 512, offset: 3680)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !265, file: !146, line: 135, baseType: !7, size: 32, offset: 4192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !265, file: !146, line: 136, baseType: !7, size: 32, offset: 4224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !265, file: !146, line: 137, baseType: !7, size: 32, offset: 4256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !265, file: !146, line: 138, baseType: !8, size: 32, offset: 4288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !265, file: !146, line: 141, baseType: !94, size: 8, offset: 4320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !265, file: !146, line: 141, baseType: !94, size: 8, offset: 4328)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !265, file: !146, line: 141, baseType: !94, size: 8, offset: 4336)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !265, file: !146, line: 141, baseType: !94, size: 8, offset: 4344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !265, file: !146, line: 142, baseType: !107, size: 16, offset: 4352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !265, file: !146, line: 142, baseType: !107, size: 16, offset: 4368)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !265, file: !146, line: 142, baseType: !107, size: 16, offset: 4384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !265, file: !146, line: 145, baseType: !94, size: 8, offset: 4400)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !265, file: !146, line: 145, baseType: !94, size: 8, offset: 4408)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !265, file: !146, line: 148, baseType: !107, size: 16, offset: 4416)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !265, file: !146, line: 148, baseType: !107, size: 16, offset: 4432)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !265, file: !146, line: 149, baseType: !7, size: 32, offset: 4448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !265, file: !146, line: 149, baseType: !7, size: 32, offset: 4480)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !265, file: !146, line: 152, baseType: !381, size: 128, offset: 4512)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 4)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !265, file: !146, line: 153, baseType: !7, size: 32, offset: 4640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !265, file: !146, line: 154, baseType: !7, size: 32, offset: 4672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !265, file: !146, line: 157, baseType: !107, size: 16, offset: 4704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !265, file: !146, line: 157, baseType: !107, size: 16, offset: 4720)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !265, file: !146, line: 160, baseType: !389, size: 64, offset: 4736)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !391, line: 113, size: 6208, elements: !392)
!391 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!392 = !{!393, !394, !395, !396, !397, !398, !402}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !390, file: !391, line: 114, baseType: !107, size: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !390, file: !391, line: 114, baseType: !107, size: 16, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !390, file: !391, line: 115, baseType: !94, size: 8, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !390, file: !391, line: 115, baseType: !94, size: 8, offset: 40)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !390, file: !391, line: 116, baseType: !94, size: 8, offset: 48)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !390, file: !391, line: 117, baseType: !399, size: 8, offset: 56)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 1)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !391, line: 119, baseType: !403, size: 6144, offset: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 6144, elements: !413)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !391, line: 109, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !391, line: 106, size: 192, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !405, file: !391, line: 107, baseType: !7, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !405, file: !391, line: 107, baseType: !7, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !405, file: !391, line: 107, baseType: !7, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !405, file: !391, line: 107, baseType: !7, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !405, file: !391, line: 107, baseType: !7, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !405, file: !391, line: 108, baseType: !8, size: 32, offset: 160)
!413 = !{!414}
!414 = !DISubrange(count: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !265, file: !146, line: 161, baseType: !389, size: 64, offset: 4800)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !265, file: !146, line: 162, baseType: !94, size: 8, offset: 4864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !265, file: !146, line: 162, baseType: !94, size: 8, offset: 4872)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !265, file: !146, line: 163, baseType: !94, size: 8, offset: 4880)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !265, file: !146, line: 163, baseType: !94, size: 8, offset: 4888)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !265, file: !146, line: 164, baseType: !107, size: 16, offset: 4896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !265, file: !146, line: 164, baseType: !107, size: 16, offset: 4912)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !265, file: !146, line: 165, baseType: !7, size: 32, offset: 4928)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !265, file: !146, line: 165, baseType: !7, size: 32, offset: 4960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !265, file: !146, line: 167, baseType: !425, size: 1152, offset: 4992)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 1152, elements: !2000)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !391, line: 57, size: 2496, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !427, file: !391, line: 59, baseType: !107, size: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !427, file: !391, line: 59, baseType: !107, size: 16, offset: 16)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !427, file: !391, line: 59, baseType: !107, size: 16, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !427, file: !391, line: 59, baseType: !107, size: 16, offset: 48)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !427, file: !391, line: 60, baseType: !69, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !427, file: !391, line: 61, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !391, line: 202, size: 3328, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !1851, !1852, !1853, !1854, !1855, !1881, !1882, !1911, !1931, !1939, !1940}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !436, file: !391, line: 203, baseType: !74, size: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !436, file: !391, line: 204, baseType: !144, size: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !436, file: !391, line: 206, baseType: !7, size: 32, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !436, file: !391, line: 206, baseType: !7, size: 32, offset: 1056)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !436, file: !391, line: 207, baseType: !7, size: 32, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !436, file: !391, line: 207, baseType: !7, size: 32, offset: 1120)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !436, file: !391, line: 207, baseType: !7, size: 32, offset: 1152)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !436, file: !391, line: 207, baseType: !7, size: 32, offset: 1184)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !436, file: !391, line: 207, baseType: !7, size: 32, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !436, file: !391, line: 207, baseType: !7, size: 32, offset: 1248)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !436, file: !391, line: 208, baseType: !7, size: 32, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !436, file: !391, line: 208, baseType: !7, size: 32, offset: 1312)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !436, file: !391, line: 211, baseType: !7, size: 32, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !436, file: !391, line: 211, baseType: !7, size: 32, offset: 1376)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !436, file: !391, line: 211, baseType: !7, size: 32, offset: 1408)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !436, file: !391, line: 211, baseType: !7, size: 32, offset: 1440)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !436, file: !391, line: 211, baseType: !7, size: 32, offset: 1472)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !436, file: !391, line: 214, baseType: !7, size: 32, offset: 1504)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !436, file: !391, line: 214, baseType: !7, size: 32, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !436, file: !391, line: 217, baseType: !7, size: 32, offset: 1568)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !436, file: !391, line: 218, baseType: !7, size: 32, offset: 1600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !436, file: !391, line: 219, baseType: !7, size: 32, offset: 1632)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !436, file: !391, line: 220, baseType: !7, size: 32, offset: 1664)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !436, file: !391, line: 221, baseType: !7, size: 32, offset: 1696)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !436, file: !391, line: 222, baseType: !107, size: 16, offset: 1728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !436, file: !391, line: 222, baseType: !107, size: 16, offset: 1744)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !436, file: !391, line: 224, baseType: !107, size: 16, offset: 1760)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !436, file: !391, line: 224, baseType: !107, size: 16, offset: 1776)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !436, file: !391, line: 227, baseType: !107, size: 16, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !436, file: !391, line: 227, baseType: !107, size: 16, offset: 1808)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !436, file: !391, line: 229, baseType: !107, size: 16, offset: 1824)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !391, line: 229, baseType: !107, size: 16, offset: 1840)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !391, line: 230, baseType: !107, size: 16, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !436, file: !391, line: 230, baseType: !107, size: 16, offset: 1872)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !436, file: !391, line: 232, baseType: !7, size: 32, offset: 1888)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !436, file: !391, line: 232, baseType: !7, size: 32, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !436, file: !391, line: 232, baseType: !7, size: 32, offset: 1952)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !436, file: !391, line: 232, baseType: !7, size: 32, offset: 1984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !436, file: !391, line: 233, baseType: !8, size: 32, offset: 2016)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !436, file: !391, line: 234, baseType: !8, size: 32, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !436, file: !391, line: 235, baseType: !107, size: 16, offset: 2080)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !436, file: !391, line: 235, baseType: !107, size: 16, offset: 2096)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !436, file: !391, line: 236, baseType: !107, size: 16, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !436, file: !391, line: 239, baseType: !107, size: 16, offset: 2128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !436, file: !391, line: 240, baseType: !8, size: 32, offset: 2144)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !436, file: !391, line: 241, baseType: !8, size: 32, offset: 2176)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !436, file: !391, line: 241, baseType: !8, size: 32, offset: 2208)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !436, file: !391, line: 241, baseType: !8, size: 32, offset: 2240)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !436, file: !391, line: 243, baseType: !7, size: 32, offset: 2272)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !436, file: !391, line: 243, baseType: !7, size: 32, offset: 2304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !436, file: !391, line: 244, baseType: !7, size: 32, offset: 2336)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !436, file: !391, line: 246, baseType: !490, size: 320, offset: 2368)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !491, line: 50, size: 320, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !490, file: !491, line: 51, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !12, line: 1216, size: 39680, elements: !496)
!496 = !{!497, !498, !499, !500, !1052, !1053, !1054, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1081, !1420, !1423, !1706, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1728, !1729, !1730, !1731, !1732, !1740, !1807, !1814, !1815, !1822, !1825, !1831, !1832, !1833, !1834, !1835}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !495, file: !12, line: 1217, baseType: !74, size: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !495, file: !12, line: 1218, baseType: !144, size: 64, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !495, file: !12, line: 1220, baseType: !69, size: 64, offset: 1024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !495, file: !12, line: 1221, baseType: !501, size: 64, offset: 1088)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !503, line: 52, size: 4224, elements: !504)
!503 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !582, !598}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !502, file: !503, line: 53, baseType: !74, size: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !502, file: !503, line: 54, baseType: !144, size: 64, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !502, file: !503, line: 56, baseType: !107, size: 16, offset: 1024)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !502, file: !503, line: 56, baseType: !107, size: 16, offset: 1040)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !502, file: !503, line: 57, baseType: !107, size: 16, offset: 1056)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !502, file: !503, line: 57, baseType: !107, size: 16, offset: 1072)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !502, file: !503, line: 59, baseType: !7, size: 32, offset: 1088)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !502, file: !503, line: 59, baseType: !7, size: 32, offset: 1120)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !502, file: !503, line: 59, baseType: !7, size: 32, offset: 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !502, file: !503, line: 60, baseType: !7, size: 32, offset: 1184)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !502, file: !503, line: 60, baseType: !7, size: 32, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !502, file: !503, line: 60, baseType: !7, size: 32, offset: 1248)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !502, file: !503, line: 61, baseType: !7, size: 32, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !502, file: !503, line: 61, baseType: !7, size: 32, offset: 1312)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !502, file: !503, line: 61, baseType: !7, size: 32, offset: 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !502, file: !503, line: 68, baseType: !7, size: 32, offset: 1376)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !502, file: !503, line: 68, baseType: !7, size: 32, offset: 1408)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !502, file: !503, line: 68, baseType: !7, size: 32, offset: 1440)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !502, file: !503, line: 69, baseType: !7, size: 32, offset: 1472)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !502, file: !503, line: 69, baseType: !7, size: 32, offset: 1504)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !502, file: !503, line: 74, baseType: !7, size: 32, offset: 1536)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !502, file: !503, line: 79, baseType: !7, size: 32, offset: 1568)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !502, file: !503, line: 81, baseType: !107, size: 16, offset: 1600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !502, file: !503, line: 91, baseType: !107, size: 16, offset: 1616)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !502, file: !503, line: 92, baseType: !107, size: 16, offset: 1632)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !502, file: !503, line: 93, baseType: !107, size: 16, offset: 1648)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !502, file: !503, line: 94, baseType: !107, size: 16, offset: 1664)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !502, file: !503, line: 94, baseType: !107, size: 16, offset: 1680)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !502, file: !503, line: 94, baseType: !107, size: 16, offset: 1696)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !502, file: !503, line: 94, baseType: !107, size: 16, offset: 1712)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !502, file: !503, line: 96, baseType: !7, size: 32, offset: 1728)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !502, file: !503, line: 96, baseType: !7, size: 32, offset: 1760)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !502, file: !503, line: 96, baseType: !7, size: 32, offset: 1792)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !502, file: !503, line: 96, baseType: !7, size: 32, offset: 1824)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !502, file: !503, line: 98, baseType: !7, size: 32, offset: 1856)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !502, file: !503, line: 98, baseType: !7, size: 32, offset: 1888)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !502, file: !503, line: 98, baseType: !7, size: 32, offset: 1920)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !502, file: !503, line: 98, baseType: !7, size: 32, offset: 1952)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !502, file: !503, line: 99, baseType: !7, size: 32, offset: 1984)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !502, file: !503, line: 99, baseType: !7, size: 32, offset: 2016)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !502, file: !503, line: 100, baseType: !7, size: 32, offset: 2048)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !502, file: !503, line: 100, baseType: !7, size: 32, offset: 2080)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !502, file: !503, line: 103, baseType: !107, size: 16, offset: 2112)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !502, file: !503, line: 103, baseType: !107, size: 16, offset: 2128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !502, file: !503, line: 103, baseType: !107, size: 16, offset: 2144)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !502, file: !503, line: 103, baseType: !107, size: 16, offset: 2160)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !502, file: !503, line: 106, baseType: !7, size: 32, offset: 2176)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !502, file: !503, line: 106, baseType: !7, size: 32, offset: 2208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !502, file: !503, line: 106, baseType: !7, size: 32, offset: 2240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !502, file: !503, line: 106, baseType: !7, size: 32, offset: 2272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !502, file: !503, line: 107, baseType: !107, size: 16, offset: 2304)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !502, file: !503, line: 107, baseType: !107, size: 16, offset: 2320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !502, file: !503, line: 107, baseType: !107, size: 16, offset: 2336)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !502, file: !503, line: 107, baseType: !107, size: 16, offset: 2352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !502, file: !503, line: 108, baseType: !7, size: 32, offset: 2368)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !502, file: !503, line: 108, baseType: !7, size: 32, offset: 2400)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !502, file: !503, line: 109, baseType: !7, size: 32, offset: 2432)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !502, file: !503, line: 109, baseType: !7, size: 32, offset: 2464)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !502, file: !503, line: 110, baseType: !7, size: 32, offset: 2496)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !502, file: !503, line: 110, baseType: !7, size: 32, offset: 2528)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !502, file: !503, line: 110, baseType: !7, size: 32, offset: 2560)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !502, file: !503, line: 111, baseType: !107, size: 16, offset: 2592)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !502, file: !503, line: 111, baseType: !107, size: 16, offset: 2608)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !502, file: !503, line: 112, baseType: !107, size: 16, offset: 2624)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !502, file: !503, line: 112, baseType: !107, size: 16, offset: 2640)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !502, file: !503, line: 112, baseType: !107, size: 16, offset: 2656)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !503, line: 115, baseType: !107, size: 16, offset: 2672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !502, file: !503, line: 118, baseType: !6, size: 64, offset: 2688)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !502, file: !503, line: 118, baseType: !6, size: 64, offset: 2752)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !502, file: !503, line: 121, baseType: !162, size: 64, offset: 2816)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !502, file: !503, line: 122, baseType: !425, size: 1152, offset: 2880)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !502, file: !503, line: 123, baseType: !107, size: 16, offset: 4032)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !502, file: !503, line: 123, baseType: !107, size: 16, offset: 4048)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !502, file: !503, line: 123, baseType: !579, size: 32, offset: 4064)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 32, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 2)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !502, file: !503, line: 126, baseType: !583, size: 64, offset: 4096)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !75, line: 159, size: 448, elements: !585)
!585 = !{!586, !588, !589, !590, !591, !594}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !584, file: !75, line: 161, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !580)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !584, file: !75, line: 162, baseType: !587, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !584, file: !75, line: 163, baseType: !579, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !584, file: !75, line: 164, baseType: !579, size: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !584, file: !75, line: 165, baseType: !592, size: 128, offset: 192)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 128, elements: !580)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !584, file: !75, line: 166, baseType: !595, size: 128, offset: 320)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 128, elements: !580)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !75, line: 46, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !502, file: !503, line: 129, baseType: !599, size: 64, offset: 4160)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !601, line: 328, size: 3456, elements: !602)
!601 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!602 = !{!603, !604, !605, !1001, !1002, !1003, !1004, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1030, !1031, !1032, !1035, !1039, !1043, !1047, !1048, !1049, !1050, !1051}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !600, file: !601, line: 329, baseType: !74, size: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !600, file: !601, line: 330, baseType: !144, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !600, file: !601, line: 332, baseType: !606, size: 64, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !608, line: 283, size: 4096, elements: !609)
!608 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!609 = !{!610, !611, !612, !613, !617, !618, !622, !970, !978, !982, !988, !992, !993, !994, !995, !999, !1000}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !607, file: !608, line: 284, baseType: !8, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !607, file: !608, line: 285, baseType: !123, size: 512, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !607, file: !608, line: 287, baseType: !123, size: 512, offset: 544)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !607, file: !608, line: 288, baseType: !614, size: 2048, offset: 1056)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2048, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !607, file: !608, line: 289, baseType: !8, size: 32, offset: 3104)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !607, file: !608, line: 292, baseType: !619, size: 64, offset: 3136)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !599}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !607, file: !608, line: 293, baseType: !623, size: 64, offset: 3200)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !599, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !601, line: 167, size: 3712, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !962, !963, !964, !965, !966, !967}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !601, line: 168, baseType: !626, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !627, file: !601, line: 168, baseType: !626, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !627, file: !601, line: 168, baseType: !626, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !627, file: !601, line: 170, baseType: !112, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !627, file: !601, line: 172, baseType: !634, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !608, line: 144, size: 6016, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !812, !813, !814, !828, !832, !836, !837, !844, !849, !853, !854, !855, !856, !860, !861, !865, !869, !873, !877, !881, !885, !889, !890, !897, !899, !908, !917}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !635, file: !608, line: 145, baseType: !47, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !635, file: !608, line: 145, baseType: !47, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !635, file: !608, line: 146, baseType: !107, size: 16, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !635, file: !608, line: 148, baseType: !123, size: 512, offset: 144)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !635, file: !608, line: 149, baseType: !8, size: 32, offset: 672)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !635, file: !608, line: 151, baseType: !123, size: 512, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !635, file: !608, line: 152, baseType: !614, size: 2048, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !635, file: !608, line: 153, baseType: !8, size: 32, offset: 3264)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !635, file: !608, line: 155, baseType: !7, size: 32, offset: 3296)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !635, file: !608, line: 155, baseType: !7, size: 32, offset: 3328)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !635, file: !608, line: 155, baseType: !7, size: 32, offset: 3360)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !635, file: !608, line: 156, baseType: !7, size: 32, offset: 3392)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !635, file: !608, line: 156, baseType: !7, size: 32, offset: 3424)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !635, file: !608, line: 156, baseType: !7, size: 32, offset: 3456)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !635, file: !608, line: 157, baseType: !107, size: 16, offset: 3488)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !635, file: !608, line: 157, baseType: !107, size: 16, offset: 3504)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !635, file: !608, line: 157, baseType: !107, size: 16, offset: 3520)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !635, file: !608, line: 160, baseType: !655, size: 64, offset: 3584)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !608, line: 109, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !608, line: 98, size: 1408, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !811}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !657, file: !608, line: 99, baseType: !8, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !657, file: !608, line: 99, baseType: !8, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !608, line: 100, baseType: !123, size: 512, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !657, file: !608, line: 101, baseType: !7, size: 32, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !657, file: !608, line: 101, baseType: !7, size: 32, offset: 608)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !657, file: !608, line: 101, baseType: !7, size: 32, offset: 640)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !657, file: !608, line: 101, baseType: !7, size: 32, offset: 672)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !657, file: !608, line: 102, baseType: !7, size: 32, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !657, file: !608, line: 102, baseType: !7, size: 32, offset: 736)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !657, file: !608, line: 103, baseType: !8, size: 32, offset: 768)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !608, line: 104, baseType: !8, size: 32, offset: 800)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !657, file: !608, line: 107, baseType: !671, size: 64, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !601, line: 87, size: 2816, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !796}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !672, file: !601, line: 88, baseType: !671, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !672, file: !601, line: 88, baseType: !671, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !672, file: !601, line: 88, baseType: !671, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !672, file: !601, line: 90, baseType: !112, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !672, file: !601, line: 92, baseType: !123, size: 512, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !601, line: 94, baseType: !123, size: 512, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !672, file: !601, line: 99, baseType: !47, size: 64, offset: 1280)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !672, file: !601, line: 101, baseType: !107, size: 16, offset: 1344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !601, line: 101, baseType: !107, size: 16, offset: 1360)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !672, file: !601, line: 102, baseType: !107, size: 16, offset: 1376)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !672, file: !601, line: 103, baseType: !107, size: 16, offset: 1392)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !672, file: !601, line: 104, baseType: !686, size: 64, offset: 1408)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !608, line: 114, size: 1600, elements: !688)
!688 = !{!689, !690, !712, !716, !720, !724, !728, !732, !733, !737, !766, !767, !768}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !687, file: !608, line: 115, baseType: !123, size: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !687, file: !608, line: 117, baseType: !691, size: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !694, !697, !699, !699, !710}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !696, line: 44, flags: DIFlagFwdDecl)
!696 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !608, line: 73, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !696, line: 55, size: 192, elements: !701)
!701 = !{!702, !706, !709}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !700, file: !696, line: 58, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !696, line: 56, size: 64, elements: !704)
!704 = !{!705}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !703, file: !696, line: 57, baseType: !47, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !696, line: 60, baseType: !707, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !601, line: 335, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !700, file: !696, line: 61, baseType: !47, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !687, file: !608, line: 118, baseType: !713, size: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !694, !699, !699, !6}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !687, file: !608, line: 120, baseType: !717, size: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !694, !697, !699}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !687, file: !608, line: 121, baseType: !721, size: 64, offset: 704)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !694, !699, !6}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !687, file: !608, line: 122, baseType: !725, size: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !599, !671, !707}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !687, file: !608, line: 123, baseType: !729, size: 64, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !599, !671, !626, !671, !710}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !687, file: !608, line: 124, baseType: !729, size: 64, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !687, file: !608, line: 125, baseType: !734, size: 64, offset: 960)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !599, !671, !626, !671}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !687, file: !608, line: 128, baseType: !738, size: 256, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !696, line: 436, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !696, line: 430, size: 256, elements: !740)
!740 = !{!741, !742, !745, !761}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !739, file: !696, line: 431, baseType: !47, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !739, file: !696, line: 432, baseType: !743, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !696, line: 417, baseType: !708)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !739, file: !696, line: 433, baseType: !746, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !696, line: 408, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!8, !694, !699, !750, !752}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !696, line: 38, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !696, line: 348, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !696, line: 337, size: 256, elements: !755)
!755 = !{!756, !757, !758, !759, !760}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !696, line: 339, baseType: !47, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !754, file: !696, line: 342, baseType: !750, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !754, file: !696, line: 345, baseType: !8, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !754, file: !696, line: 347, baseType: !8, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !754, file: !696, line: 347, baseType: !8, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !739, file: !696, line: 434, baseType: !762, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !696, line: 409, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !47}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !687, file: !608, line: 129, baseType: !738, size: 256, offset: 1280)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !608, line: 132, baseType: !8, size: 32, offset: 1536)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !687, file: !608, line: 132, baseType: !8, size: 32, offset: 1568)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !672, file: !601, line: 105, baseType: !123, size: 512, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !672, file: !601, line: 107, baseType: !7, size: 32, offset: 1984)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !672, file: !601, line: 107, baseType: !7, size: 32, offset: 2016)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !672, file: !601, line: 109, baseType: !47, size: 64, offset: 2048)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !672, file: !601, line: 112, baseType: !107, size: 16, offset: 2112)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !672, file: !601, line: 114, baseType: !107, size: 16, offset: 2128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !672, file: !601, line: 115, baseType: !8, size: 32, offset: 2144)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !672, file: !601, line: 117, baseType: !47, size: 64, offset: 2176)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !672, file: !601, line: 122, baseType: !8, size: 32, offset: 2240)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !672, file: !601, line: 124, baseType: !8, size: 32, offset: 2272)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !672, file: !601, line: 126, baseType: !671, size: 64, offset: 2304)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !672, file: !601, line: 128, baseType: !781, size: 64, offset: 2368)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !601, line: 298, size: 448, elements: !783)
!783 = !{!784, !785, !786, !789, !790, !793, !794, !795}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !601, line: 299, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !782, file: !601, line: 299, baseType: !781, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !782, file: !601, line: 301, baseType: !787, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !601, line: 218, baseType: !627)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !782, file: !601, line: 301, baseType: !787, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !782, file: !601, line: 302, baseType: !791, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !601, line: 132, baseType: !672)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !782, file: !601, line: 302, baseType: !791, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !782, file: !601, line: 304, baseType: !8, size: 32, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !782, file: !601, line: 305, baseType: !8, size: 32, offset: 416)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !672, file: !601, line: 131, baseType: !797, size: 384, offset: 2432)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !601, line: 73, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !601, line: 62, size: 384, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !798, file: !601, line: 63, baseType: !381, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !798, file: !601, line: 64, baseType: !7, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !798, file: !601, line: 64, baseType: !7, size: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !601, line: 65, baseType: !47, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !798, file: !601, line: 66, baseType: !107, size: 16, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !798, file: !601, line: 67, baseType: !107, size: 16, offset: 272)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !798, file: !601, line: 68, baseType: !107, size: 16, offset: 288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !798, file: !601, line: 69, baseType: !107, size: 16, offset: 304)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !798, file: !601, line: 70, baseType: !107, size: 16, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !798, file: !601, line: 71, baseType: !107, size: 16, offset: 336)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !798, file: !601, line: 72, baseType: !579, size: 32, offset: 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !657, file: !608, line: 108, baseType: !123, size: 512, offset: 896)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !635, file: !608, line: 160, baseType: !655, size: 64, offset: 3648)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !635, file: !608, line: 162, baseType: !123, size: 512, offset: 3712)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !635, file: !608, line: 165, baseType: !815, size: 64, offset: 4224)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !818, !820, !822, !599, !626, !824}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !608, line: 81, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !601, line: 43, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !601, line: 274, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !601, line: 271, size: 32, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !825, file: !601, line: 273, baseType: !202, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !635, file: !608, line: 168, baseType: !829, size: 64, offset: 4288)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !818, !599, !626}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !635, file: !608, line: 171, baseType: !833, size: 64, offset: 4352)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !697, !694, !699}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !635, file: !608, line: 173, baseType: !833, size: 64, offset: 4416)
