; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_marking.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_marking.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }

!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !43, line: 57, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!45 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 260, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 249, baseType: !5, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!75 = !{!76, !77, !143, !145, !147, !152, !153, !157, !127, !89, !161}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !60, line: 123, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !60, line: 110, size: 640, elements: !80)
!80 = !{!81, !92, !98, !112, !113, !136, !142}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !79, file: !60, line: 111, baseType: !82, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !60, line: 82, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !60, line: 64, size: 128, elements: !84)
!84 = !{!85, !86, !88, !90, !91}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !60, line: 65, baseType: !76, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !83, file: !60, line: 66, baseType: !87, size: 32, offset: 64)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !83, file: !60, line: 73, baseType: !89, size: 8, offset: 96)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !83, file: !60, line: 74, baseType: !89, size: 8, offset: 104)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !83, file: !60, line: 80, baseType: !89, size: 8, offset: 112)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !79, file: !60, line: 112, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !60, line: 180, size: 16, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !94, file: !60, line: 181, baseType: !97, size: 16)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !79, file: !60, line: 114, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !60, line: 90, size: 448, elements: !101)
!101 = !{!102, !103, !104, !109, !110}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !100, file: !60, line: 91, baseType: !82, size: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !100, file: !60, line: 92, baseType: !93, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !100, file: !60, line: 94, baseType: !105, size: 96, offset: 192)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 96, elements: !107)
!106 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !100, file: !60, line: 95, baseType: !105, size: 96, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !100, file: !60, line: 102, baseType: !111, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !79, file: !60, line: 114, baseType: !99, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !79, file: !60, line: 118, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !60, line: 125, size: 576, elements: !116)
!116 = !{!117, !118, !119, !120, !132, !133, !134, !135}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !60, line: 126, baseType: !82, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !115, file: !60, line: 129, baseType: !99, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !115, file: !60, line: 130, baseType: !111, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !115, file: !60, line: 131, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !60, line: 164, size: 448, elements: !123)
!123 = !{!124, !125, !126, !129, !130, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !60, line: 165, baseType: !82, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !122, file: !60, line: 166, baseType: !93, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !122, file: !60, line: 172, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !60, line: 140, baseType: !115)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, file: !60, line: 174, baseType: !87, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !122, file: !60, line: 175, baseType: !105, size: 96, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !122, file: !60, line: 176, baseType: !97, size: 16, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !115, file: !60, line: 135, baseType: !114, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !115, file: !60, line: 135, baseType: !114, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !60, line: 139, baseType: !114, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !60, line: 139, baseType: !114, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !79, file: !60, line: 122, baseType: !137, size: 128, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !60, line: 108, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !60, line: 106, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !60, line: 107, baseType: !111, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !60, line: 107, baseType: !111, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !79, file: !60, line: 122, baseType: !137, size: 128, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !60, line: 178, baseType: !122)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !60, line: 103, baseType: !100)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !60, line: 154, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !60, line: 152, size: 128, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !149, file: !60, line: 153, baseType: !82, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !76}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!76, !76}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEditSelection", file: !163, line: 34, baseType: !164)
!163 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_marking.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditSelection", file: !163, line: 30, size: 256, elements: !165)
!165 = !{!166, !168, !169, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !163, line: 31, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !163, line: 31, baseType: !167, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !164, file: !163, line: 32, baseType: !147, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !164, file: !163, line: 33, baseType: !89, size: 8, offset: 192)
!171 = !{i32 7, !"Dwarf Version", i32 4}
!172 = !{i32 2, !"Debug Info Version", i32 3}
!173 = !{i32 1, !"wchar_size", i32 4}
!174 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!175 = distinct !DISubprogram(name: "BM_mesh_select_mode_clean_ex", scope: !1, file: !1, line: 82, type: !176, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !320)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178, !319}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !60, line: 246, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !60, line: 186, size: 8064, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !195, !196, !197, !198, !200, !202, !204, !205, !206, !207, !208, !209, !210, !211, !263, !302, !303, !304, !305, !306, !307, !308, !309, !316, !317, !318}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !180, file: !60, line: 187, baseType: !87, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !180, file: !60, line: 187, baseType: !87, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !180, file: !60, line: 187, baseType: !87, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !180, file: !60, line: 187, baseType: !87, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !180, file: !60, line: 188, baseType: !87, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !180, file: !60, line: 188, baseType: !87, size: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !180, file: !60, line: 188, baseType: !87, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !180, file: !60, line: 193, baseType: !89, size: 8, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !180, file: !60, line: 197, baseType: !89, size: 8, offset: 232)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !180, file: !60, line: 201, baseType: !192, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !194, line: 71, flags: DIFlagFwdDecl)
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !180, file: !60, line: 201, baseType: !192, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !180, file: !60, line: 201, baseType: !192, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !180, file: !60, line: 201, baseType: !192, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !180, file: !60, line: 208, baseType: !199, size: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !180, file: !60, line: 209, baseType: !201, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !180, file: !60, line: 210, baseType: !203, size: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !180, file: !60, line: 213, baseType: !87, size: 32, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !180, file: !60, line: 214, baseType: !87, size: 32, offset: 736)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !180, file: !60, line: 215, baseType: !87, size: 32, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !180, file: !60, line: 218, baseType: !192, size: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !180, file: !60, line: 218, baseType: !192, size: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !180, file: !60, line: 218, baseType: !192, size: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !180, file: !60, line: 220, baseType: !87, size: 32, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !180, file: !60, line: 221, baseType: !212, size: 64, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !214)
!214 = !{!215, !251, !252, !256, !259, !260, !262}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !213, file: !4, line: 191, baseType: !216, size: 5120)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 5120, elements: !249)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !218)
!218 = !{!219, !222, !224, !234, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !217, file: !4, line: 148, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !217, file: !4, line: 149, baseType: !223, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !217, file: !4, line: 150, baseType: !225, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !227)
!227 = !{!228, !230, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !226, file: !4, line: 139, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !226, file: !4, line: 140, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !226, file: !4, line: 141, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !217, file: !4, line: 152, baseType: !87, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !4, line: 162, baseType: !236, size: 128, offset: 192)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !4, line: 155, size: 128, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !236, file: !4, line: 156, baseType: !87, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !236, file: !4, line: 157, baseType: !106, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !236, file: !4, line: 158, baseType: !76, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !236, file: !4, line: 159, baseType: !105, size: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !236, file: !4, line: 160, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !236, file: !4, line: 161, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !247, line: 48, baseType: !248)
!247 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !247, line: 48, flags: DIFlagFwdDecl)
!249 = !{!250}
!250 = !DISubrange(count: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !213, file: !4, line: 192, baseType: !216, size: 5120, offset: 5120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !213, file: !4, line: 193, baseType: !253, size: 64, offset: 10240)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !178, !212}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !213, file: !4, line: 194, baseType: !257, size: 64, offset: 10304)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !4, line: 195, baseType: !87, size: 32, offset: 10368)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !213, file: !4, line: 196, baseType: !261, size: 32, offset: 10400)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !213, file: !4, line: 197, baseType: !87, size: 32, offset: 10432)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !180, file: !60, line: 223, baseType: !264, size: 1600, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !194, line: 73, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !194, line: 64, size: 1600, elements: !266)
!266 = !{!267, !285, !289, !290, !291, !292, !293}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !265, file: !194, line: 65, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !194, line: 53, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !194, line: 42, size: 832, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !284}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !194, line: 43, baseType: !87, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !270, file: !194, line: 44, baseType: !87, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !194, line: 45, baseType: !87, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !270, file: !194, line: 46, baseType: !87, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !270, file: !194, line: 47, baseType: !87, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !270, file: !194, line: 48, baseType: !87, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !270, file: !194, line: 49, baseType: !87, size: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !270, file: !194, line: 50, baseType: !87, size: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !270, file: !194, line: 51, baseType: !281, size: 512, offset: 256)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 512, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !270, file: !194, line: 52, baseType: !76, size: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !265, file: !194, line: 66, baseType: !286, size: 1312, offset: 64)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1312, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 41)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !265, file: !194, line: 69, baseType: !87, size: 32, offset: 1376)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !265, file: !194, line: 69, baseType: !87, size: 32, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !265, file: !194, line: 70, baseType: !87, size: 32, offset: 1440)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !265, file: !194, line: 71, baseType: !192, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !265, file: !194, line: 72, baseType: !294, size: 64, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !194, line: 59, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !194, line: 57, size: 8192, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !296, file: !194, line: 58, baseType: !299, size: 8192)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 1024)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !180, file: !60, line: 223, baseType: !264, size: 1600, offset: 2752)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !180, file: !60, line: 223, baseType: !264, size: 1600, offset: 4352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !180, file: !60, line: 223, baseType: !264, size: 1600, offset: 5952)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !180, file: !60, line: 233, baseType: !97, size: 16, offset: 7552)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !180, file: !60, line: 236, baseType: !87, size: 32, offset: 7584)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !180, file: !60, line: 238, baseType: !87, size: 32, offset: 7616)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !180, file: !60, line: 238, baseType: !87, size: 32, offset: 7648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !180, file: !60, line: 239, baseType: !310, size: 128, offset: 7680)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !311, line: 71, baseType: !312)
!311 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !311, line: 69, size: 128, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !312, file: !311, line: 70, baseType: !76, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !312, file: !311, line: 70, baseType: !76, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !180, file: !60, line: 241, baseType: !143, size: 64, offset: 7808)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !180, file: !60, line: 243, baseType: !310, size: 128, offset: 7872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !180, file: !60, line: 245, baseType: !76, size: 64, offset: 8000)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!320 = !{}
!321 = !DILocalVariable(name: "bm", arg: 1, scope: !175, file: !1, line: 82, type: !178)
!322 = !DILocation(line: 82, column: 42, scope: !175)
!323 = !DILocalVariable(name: "selectmode", arg: 2, scope: !175, file: !1, line: 82, type: !319)
!324 = !DILocation(line: 82, column: 58, scope: !175)
!325 = !DILocation(line: 84, column: 6, scope: !326)
!326 = distinct !DILexicalBlock(scope: !175, file: !1, line: 84, column: 6)
!327 = !DILocation(line: 84, column: 17, scope: !326)
!328 = !DILocation(line: 84, column: 6, scope: !175)
!329 = !DILocation(line: 86, column: 2, scope: !330)
!330 = distinct !DILexicalBlock(scope: !326, file: !1, line: 84, column: 38)
!331 = !DILocation(line: 87, column: 11, scope: !332)
!332 = distinct !DILexicalBlock(scope: !326, file: !1, line: 87, column: 11)
!333 = !DILocation(line: 87, column: 22, scope: !332)
!334 = !DILocation(line: 87, column: 11, scope: !326)
!335 = !DILocalVariable(name: "iter", scope: !336, file: !1, line: 88, type: !337)
!336 = distinct !DILexicalBlock(scope: !332, file: !1, line: 87, column: 41)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !339)
!339 = !{!340, !420, !421, !422, !423}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !43, line: 179, baseType: !341, size: 320)
!341 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !338, file: !43, line: 166, size: 320, elements: !342)
!342 = !{!343, !358, !364, !372, !380, !386, !392, !398, !402, !408, !414}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !341, file: !43, line: 167, baseType: !344, size: 192)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !344, file: !43, line: 114, baseType: !347, size: 192)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !348, line: 80, baseType: !349)
!348 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !348, line: 76, size: 192, elements: !350)
!350 = !{!351, !354, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !349, file: !348, line: 77, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !348, line: 47, baseType: !193)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !349, file: !348, line: 78, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !348, line: 45, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !349, file: !348, line: 79, baseType: !5, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !341, file: !43, line: 169, baseType: !359, size: 192)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !359, file: !43, line: 117, baseType: !145, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !359, file: !43, line: 118, baseType: !77, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !359, file: !43, line: 118, baseType: !77, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !341, file: !43, line: 170, baseType: !365, size: 320)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !366)
!366 = !{!367, !368, !369, !370, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !365, file: !43, line: 121, baseType: !145, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !365, file: !43, line: 122, baseType: !127, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !365, file: !43, line: 122, baseType: !127, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !365, file: !43, line: 123, baseType: !77, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !365, file: !43, line: 123, baseType: !77, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !341, file: !43, line: 171, baseType: !373, size: 320)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !374)
!374 = !{!375, !376, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !373, file: !43, line: 126, baseType: !145, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !373, file: !43, line: 127, baseType: !127, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !373, file: !43, line: 127, baseType: !127, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !373, file: !43, line: 128, baseType: !77, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !373, file: !43, line: 128, baseType: !77, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !341, file: !43, line: 172, baseType: !381, size: 192)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !382)
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !381, file: !43, line: 131, baseType: !77, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !381, file: !43, line: 132, baseType: !127, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !381, file: !43, line: 132, baseType: !127, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !341, file: !43, line: 173, baseType: !387, size: 192)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !388)
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !387, file: !43, line: 135, baseType: !127, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !387, file: !43, line: 136, baseType: !127, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !387, file: !43, line: 136, baseType: !127, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !341, file: !43, line: 174, baseType: !393, size: 192)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !393, file: !43, line: 139, baseType: !77, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !393, file: !43, line: 140, baseType: !127, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !393, file: !43, line: 140, baseType: !127, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !341, file: !43, line: 175, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !399, file: !43, line: 143, baseType: !77, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !341, file: !43, line: 176, baseType: !403, size: 192)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !404)
!404 = !{!405, !406, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !403, file: !43, line: 146, baseType: !143, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !403, file: !43, line: 147, baseType: !127, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !403, file: !43, line: 147, baseType: !127, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !341, file: !43, line: 177, baseType: !409, size: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !409, file: !43, line: 150, baseType: !143, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !409, file: !43, line: 151, baseType: !127, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !409, file: !43, line: 151, baseType: !127, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !341, file: !43, line: 178, baseType: !415, size: 192)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !415, file: !43, line: 154, baseType: !143, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !415, file: !43, line: 155, baseType: !127, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !415, file: !43, line: 155, baseType: !127, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !338, file: !43, line: 181, baseType: !153, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !338, file: !43, line: 182, baseType: !157, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !338, file: !43, line: 184, baseType: !87, size: 32, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !338, file: !43, line: 185, baseType: !89, size: 8, offset: 480)
!424 = !DILocation(line: 88, column: 10, scope: !336)
!425 = !DILocation(line: 90, column: 7, scope: !426)
!426 = distinct !DILexicalBlock(scope: !336, file: !1, line: 90, column: 7)
!427 = !DILocation(line: 90, column: 11, scope: !426)
!428 = !DILocation(line: 90, column: 7, scope: !336)
!429 = !DILocalVariable(name: "v", scope: !430, file: !1, line: 91, type: !145)
!430 = distinct !DILexicalBlock(scope: !426, file: !1, line: 90, column: 23)
!431 = !DILocation(line: 91, column: 12, scope: !430)
!432 = !DILocation(line: 92, column: 4, scope: !433)
!433 = distinct !DILexicalBlock(scope: !430, file: !1, line: 92, column: 4)
!434 = !DILocation(line: 92, column: 4, scope: !435)
!435 = distinct !DILexicalBlock(scope: !433, file: !1, line: 92, column: 4)
!436 = !DILocation(line: 93, column: 5, scope: !437)
!437 = distinct !DILexicalBlock(scope: !435, file: !1, line: 92, column: 50)
!438 = !DILocation(line: 94, column: 4, scope: !437)
!439 = distinct !{!439, !432, !440}
!440 = !DILocation(line: 94, column: 4, scope: !433)
!441 = !DILocation(line: 95, column: 4, scope: !430)
!442 = !DILocation(line: 95, column: 8, scope: !430)
!443 = !DILocation(line: 95, column: 19, scope: !430)
!444 = !DILocation(line: 96, column: 3, scope: !430)
!445 = !DILocation(line: 98, column: 7, scope: !446)
!446 = distinct !DILexicalBlock(scope: !336, file: !1, line: 98, column: 7)
!447 = !DILocation(line: 98, column: 11, scope: !446)
!448 = !DILocation(line: 98, column: 7, scope: !336)
!449 = !DILocalVariable(name: "e", scope: !450, file: !1, line: 99, type: !77)
!450 = distinct !DILexicalBlock(scope: !446, file: !1, line: 98, column: 23)
!451 = !DILocation(line: 99, column: 12, scope: !450)
!452 = !DILocation(line: 100, column: 4, scope: !453)
!453 = distinct !DILexicalBlock(scope: !450, file: !1, line: 100, column: 4)
!454 = !DILocation(line: 100, column: 4, scope: !455)
!455 = distinct !DILexicalBlock(scope: !453, file: !1, line: 100, column: 4)
!456 = !DILocation(line: 101, column: 9, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 101, column: 9)
!458 = distinct !DILexicalBlock(scope: !455, file: !1, line: 100, column: 50)
!459 = !DILocation(line: 101, column: 9, scope: !458)
!460 = !DILocation(line: 102, column: 25, scope: !461)
!461 = distinct !DILexicalBlock(scope: !457, file: !1, line: 101, column: 47)
!462 = !DILocation(line: 102, column: 29, scope: !461)
!463 = !DILocation(line: 102, column: 32, scope: !461)
!464 = !DILocation(line: 102, column: 6, scope: !461)
!465 = !DILocation(line: 103, column: 25, scope: !461)
!466 = !DILocation(line: 103, column: 29, scope: !461)
!467 = !DILocation(line: 103, column: 32, scope: !461)
!468 = !DILocation(line: 103, column: 6, scope: !461)
!469 = !DILocation(line: 104, column: 5, scope: !461)
!470 = !DILocation(line: 105, column: 4, scope: !458)
!471 = distinct !{!471, !452, !472}
!472 = !DILocation(line: 105, column: 4, scope: !453)
!473 = !DILocation(line: 106, column: 3, scope: !450)
!474 = !DILocation(line: 107, column: 2, scope: !336)
!475 = !DILocation(line: 108, column: 11, scope: !476)
!476 = distinct !DILexicalBlock(scope: !332, file: !1, line: 108, column: 11)
!477 = !DILocation(line: 108, column: 22, scope: !476)
!478 = !DILocation(line: 108, column: 11, scope: !332)
!479 = !DILocalVariable(name: "iter", scope: !480, file: !1, line: 109, type: !337)
!480 = distinct !DILexicalBlock(scope: !476, file: !1, line: 108, column: 41)
!481 = !DILocation(line: 109, column: 10, scope: !480)
!482 = !DILocation(line: 111, column: 7, scope: !483)
!483 = distinct !DILexicalBlock(scope: !480, file: !1, line: 111, column: 7)
!484 = !DILocation(line: 111, column: 11, scope: !483)
!485 = !DILocation(line: 111, column: 7, scope: !480)
!486 = !DILocalVariable(name: "v", scope: !487, file: !1, line: 112, type: !145)
!487 = distinct !DILexicalBlock(scope: !483, file: !1, line: 111, column: 23)
