; ModuleID = 'blender/intern/raskter/raskter.c'
source_filename = "blender/intern/raskter/raskter.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PolyVert = type { i32, i32 }
%struct.r_FillContext = type { %struct.e_Status*, %struct.e_Status*, %struct.r_BufferStats }
%struct.e_Status = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.e_Status* }
%struct.r_BufferStats = type { float*, i32, i32, i32, i32, i32, i32 }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @PLX_raskterize([2 x float]* %base_verts, i32 %num_base_verts, float* %buf, i32 %buf_x, i32 %buf_y) #0 !dbg !28 {
entry:
  %retval = alloca i32, align 4
  %base_verts.addr = alloca [2 x float]*, align 8
  %num_base_verts.addr = alloca i32, align 4
  %buf.addr = alloca float*, align 8
  %buf_x.addr = alloca i32, align 4
  %buf_y.addr = alloca i32, align 4
  %i = alloca i32, align 4
  %ply = alloca %struct.PolyVert*, align 8
  %ctx = alloca %struct.r_FillContext, align 8
  %buf_x_f = alloca float, align 4
  %buf_y_f = alloca float, align 4
  store [2 x float]* %base_verts, [2 x float]** %base_verts.addr, align 8
  call void @llvm.dbg.declare(metadata [2 x float]** %base_verts.addr, metadata !36, metadata !DIExpression()), !dbg !37
  store i32 %num_base_verts, i32* %num_base_verts.addr, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/intern/raskter/raskter.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !11, !9, !12}
!4 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PolyVert", file: !1, line: 39, size: 64, elements: !7)
!7 = !{!8, !10}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !6, file: !1, line: 40, baseType: !9, size: 32)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !6, file: !1, line: 41, baseType: !9, size: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "e_Status", file: !1, line: 44, size: 320, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !13, file: !1, line: 45, baseType: !9, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ybeg", scope: !13, file: !1, line: 46, baseType: !9, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "xshift", scope: !13, file: !1, line: 47, baseType: !9, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "xdir", scope: !13, file: !1, line: 48, baseType: !9, size: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "drift", scope: !13, file: !1, line: 49, baseType: !9, size: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "drift_inc", scope: !13, file: !1, line: 50, baseType: !9, size: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "drift_dec", scope: !13, file: !1, line: 51, baseType: !9, size: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !13, file: !1, line: 52, baseType: !9, size: 32, offset: 224)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !13, file: !1, line: 53, baseType: !12, size: 64, offset: 256)
!24 = !{i32 7, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!28 = distinct !DISubprogram(name: "PLX_raskterize", scope: !1, file: !1, line: 418, type: !29, scopeLine: 420, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{!9, !31, !9, !35, !9, !9}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 2)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!36 = !DILocalVariable(name: "base_verts", arg: 1, scope: !28, file: !1, line: 418, type: !31)
!37 = !DILocation(line: 418, column: 27, scope: !28)
!38 = !DILocalVariable(name: "num_base_verts", arg: 2, scope: !28, file: !1, line: 418, type: !9)
!39 = !DILocation(line: 418, column: 47, scope: !28)
!40 = !DILocalVariable(name: "buf", arg: 3, scope: !28, file: !1, line: 419, type: !35)
!41 = !DILocation(line: 419, column: 27, scope: !28)
!42 = !DILocalVariable(name: "buf_x", arg: 4, scope: !28, file: !1, line: 419, type: !9)
!43 = !DILocation(line: 419, column: 36, scope: !28)
!44 = !DILocalVariable(name: "buf_y", arg: 5, scope: !28, file: !1, line: 419, type: !9)
!45 = !DILocation(line: 419, column: 47, scope: !28)
!46 = !DILocalVariable(name: "i", scope: !28, file: !1, line: 421, type: !9)
!47 = !DILocation(line: 421, column: 6, scope: !28)
!48 = !DILocalVariable(name: "ply", scope: !28, file: !1, line: 422, type: !5)
!49 = !DILocation(line: 422, column: 19, scope: !28)
!50 = !DILocalVariable(name: "ctx", scope: !28, file: !1, line: 423, type: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "r_FillContext", file: !1, line: 66, size: 384, elements: !52)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "all_edges", scope: !51, file: !1, line: 67, baseType: !12, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "possible_edges", scope: !51, file: !1, line: 67, baseType: !12, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !51, file: !1, line: 68, baseType: !56, size: 256, offset: 128)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "r_BufferStats", file: !1, line: 56, size: 256, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !56, file: !1, line: 57, baseType: !35, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !56, file: !1, line: 58, baseType: !9, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !56, file: !1, line: 59, baseType: !9, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !56, file: !1, line: 60, baseType: !9, size: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !56, file: !1, line: 61, baseType: !9, size: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !56, file: !1, line: 62, baseType: !9, size: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !56, file: !1, line: 63, baseType: !9, size: 32, offset: 224)
!65 = !DILocation(line: 423, column: 23, scope: !28)
!66 = !DILocalVariable(name: "buf_x_f", scope: !28, file: !1, line: 424, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!68 = !DILocation(line: 424, column: 14, scope: !28)
!69 = !DILocation(line: 424, column: 32, scope: !28)
!70 = !DILocation(line: 424, column: 24, scope: !28)
!71 = !DILocalVariable(name: "buf_y_f", scope: !28, file: !1, line: 425, type: !67)
!72 = !DILocation(line: 425, column: 14, scope: !28)
!73 = !DILocation(line: 425, column: 32, scope: !28)
!74 = !DILocation(line: 425, column: 24, scope: !28)
!75 = !DILocation(line: 433, column: 66, scope: !76)
!76 = distinct !DILexicalBlock(scope: !28, file: !1, line: 433, column: 6)
!77 = !DILocation(line: 433, column: 64, scope: !76)
!78 = !DILocation(line: 433, column: 33, scope: !76)
!79 = !DILocation(line: 433, column: 13, scope: !76)
!80 = !DILocation(line: 433, column: 11, scope: !76)
!81 = !DILocation(line: 433, column: 84, scope: !76)
!82 = !DILocation(line: 433, column: 6, scope: !28)
!83 = !DILocation(line: 434, column: 3, scope: !84)
!84 = distinct !DILexicalBlock(scope: !76, file: !1, line: 433, column: 93)
!85 = !DILocation(line: 437, column: 15, scope: !28)
!86 = !DILocation(line: 437, column: 6, scope: !28)
!87 = !DILocation(line: 437, column: 9, scope: !28)
!88 = !DILocation(line: 437, column: 13, scope: !28)
!89 = !DILocation(line: 438, column: 17, scope: !28)
!90 = !DILocation(line: 438, column: 6, scope: !28)
!91 = !DILocation(line: 438, column: 9, scope: !28)
!92 = !DILocation(line: 438, column: 15, scope: !28)
!93 = !DILocation(line: 439, column: 17, scope: !28)
!94 = !DILocation(line: 439, column: 6, scope: !28)
!95 = !DILocation(line: 439, column: 9, scope: !28)
!96 = !DILocation(line: 439, column: 15, scope: !28)
!97 = !DILocation(line: 449, column: 9, scope: !98)
!98 = distinct !DILexicalBlock(scope: !28, file: !1, line: 449, column: 2)
!99 = !DILocation(line: 449, column: 7, scope: !98)
!100 = !DILocation(line: 449, column: 14, scope: !101)
!101 = distinct !DILexicalBlock(scope: !98, file: !1, line: 449, column: 2)
!102 = !DILocation(line: 449, column: 18, scope: !101)
!103 = !DILocation(line: 449, column: 16, scope: !101)
!104 = !DILocation(line: 449, column: 2, scope: !98)
!105 = !DILocation(line: 450, column: 21, scope: !106)
!106 = distinct !DILexicalBlock(scope: !101, file: !1, line: 449, column: 39)
!107 = !DILocation(line: 450, column: 32, scope: !106)
!108 = !DILocation(line: 450, column: 40, scope: !106)
!109 = !DILocation(line: 450, column: 38, scope: !106)
!110 = !DILocation(line: 450, column: 49, scope: !106)
!111 = !DILocation(line: 450, column: 14, scope: !106)
!112 = !DILocation(line: 450, column: 3, scope: !106)
!113 = !DILocation(line: 450, column: 7, scope: !106)
!114 = !DILocation(line: 450, column: 10, scope: !106)
!115 = !DILocation(line: 450, column: 12, scope: !106)
!116 = !DILocation(line: 451, column: 21, scope: !106)
!117 = !DILocation(line: 451, column: 32, scope: !106)
!118 = !DILocation(line: 451, column: 40, scope: !106)
!119 = !DILocation(line: 451, column: 38, scope: !106)
!120 = !DILocation(line: 451, column: 49, scope: !106)
!121 = !DILocation(line: 451, column: 14, scope: !106)
!122 = !DILocation(line: 451, column: 3, scope: !106)
!123 = !DILocation(line: 451, column: 7, scope: !106)
!124 = !DILocation(line: 451, column: 10, scope: !106)
!125 = !DILocation(line: 451, column: 12, scope: !106)
!126 = !DILocation(line: 452, column: 2, scope: !106)
!127 = !DILocation(line: 449, column: 35, scope: !101)
!128 = !DILocation(line: 449, column: 2, scope: !101)
!129 = distinct !{!129, !104, !130}
!130 = !DILocation(line: 452, column: 2, scope: !98)
!131 = !DILocation(line: 454, column: 27, scope: !28)
!132 = !DILocation(line: 454, column: 32, scope: !28)
!133 = !DILocation(line: 454, column: 6, scope: !28)
