; ModuleID = 'blender/source/blender/blenkernel/intern/seqcache.c'
source_filename = "blender/source/blender/blenkernel/intern/seqcache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MovieCache = type opaque
%struct.SeqPreprocessCache = type { i32, %struct.ListBase }
%struct.ListBase = type { i8*, i8* }
%struct.SeqCacheKey = type { %struct.Sequence*, %struct.SeqRenderData, float, i32 }
%struct.Sequence = type { %struct.Sequence*, %struct.Sequence*, i8*, i8*, [64 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i16, i16, i32, i32, %struct.Strip*, %struct.Ipo*, %struct.Scene*, %struct.Object*, %struct.MovieClip*, %struct.Mask*, %struct.anim*, float, float, %struct.Sequence*, %struct.Sequence*, %struct.Sequence*, %struct.ListBase, %struct.bSound*, i8*, float, float, float, float, i8*, i32, i32, i32, float, i32, i8, [3 x i8], %struct.ListBase }
%struct.Strip = type { %struct.Strip*, %struct.Strip*, i32, i32, i32, i32, %struct.StripElem*, [768 x i8], %struct.StripProxy*, %struct.StripCrop*, %struct.StripTransform*, %struct.StripColorBalance*, %struct.ColorManagedColorspaceSettings }
%struct.StripElem = type { [256 x i8], i32, i32 }
%struct.StripProxy = type { [768 x i8], [256 x i8], %struct.anim*, i16, i16, i16, i16 }
%struct.StripCrop = type { i32, i32, i32, i32 }
%struct.StripTransform = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "moviecache", scope: !2, file: !3, line: 67, type: !213, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !205, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/seqcache.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 247, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sequencer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF_COMP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF_STARTSTILL", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF_ENDSTILL", value: 3, isUnsigned: true)
!13 = !{!14, !15, !199, !200, !34, !203}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "SeqCacheKey", file: !3, line: 50, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SeqCacheKey", file: !3, line: 45, size: 512, elements: !18)
!18 = !{!19, !177, !196, !197}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !17, file: !3, line: 46, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !22, line: 126, size: 2816, elements: !23)
!22 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = !{!24, !25, !26, !27, !28, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !48, !49, !50, !52, !53, !54, !55, !131, !134, !137, !140, !143, !146, !147, !148, !149, !150, !151, !152, !159, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !22, line: 127, baseType: !20, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !22, line: 127, baseType: !20, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !21, file: !22, line: 128, baseType: !14, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !21, file: !22, line: 129, baseType: !14, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !22, line: 130, baseType: !29, size: 512, offset: 256)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !31)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !{!32}
!32 = !DISubrange(count: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !21, file: !22, line: 132, baseType: !34, size: 32, offset: 768)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !22, line: 132, baseType: !34, size: 32, offset: 800)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, file: !22, line: 133, baseType: !34, size: 32, offset: 832)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !21, file: !22, line: 134, baseType: !34, size: 32, offset: 864)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !21, file: !22, line: 134, baseType: !34, size: 32, offset: 896)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !21, file: !22, line: 134, baseType: !34, size: 32, offset: 928)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !21, file: !22, line: 135, baseType: !34, size: 32, offset: 960)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !21, file: !22, line: 135, baseType: !34, size: 32, offset: 992)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !21, file: !22, line: 136, baseType: !34, size: 32, offset: 1024)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !21, file: !22, line: 136, baseType: !34, size: 32, offset: 1056)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !21, file: !22, line: 137, baseType: !34, size: 32, offset: 1088)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !21, file: !22, line: 137, baseType: !34, size: 32, offset: 1120)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !21, file: !22, line: 138, baseType: !47, size: 32, offset: 1152)
!47 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !21, file: !22, line: 139, baseType: !47, size: 32, offset: 1184)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !21, file: !22, line: 139, baseType: !47, size: 32, offset: 1216)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !21, file: !22, line: 141, baseType: !51, size: 16, offset: 1248)
!51 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !21, file: !22, line: 142, baseType: !51, size: 16, offset: 1264)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !21, file: !22, line: 143, baseType: !34, size: 32, offset: 1280)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !21, file: !22, line: 144, baseType: !34, size: 32, offset: 1312)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !21, file: !22, line: 146, baseType: !56, size: 64, offset: 1344)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !22, line: 114, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !22, line: 99, size: 7232, elements: !59)
!59 = !{!60, !62, !63, !64, !65, !66, !67, !78, !82, !96, !105, !112, !125}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !22, line: 100, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !58, file: !22, line: 100, baseType: !61, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !58, file: !22, line: 101, baseType: !34, size: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !58, file: !22, line: 101, baseType: !34, size: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !58, file: !22, line: 102, baseType: !34, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !58, file: !22, line: 102, baseType: !34, size: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !58, file: !22, line: 103, baseType: !68, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !22, line: 59, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !22, line: 56, size: 2112, elements: !71)
!71 = !{!72, !76, !77}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !22, line: 57, baseType: !73, size: 2048)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2048, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !70, file: !22, line: 58, baseType: !34, size: 32, offset: 2048)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !70, file: !22, line: 58, baseType: !34, size: 32, offset: 2080)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !58, file: !22, line: 106, baseType: !79, size: 6144, offset: 320)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 6144, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 768)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !58, file: !22, line: 107, baseType: !83, size: 64, offset: 6464)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !22, line: 97, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !22, line: 83, size: 8320, elements: !86)
!86 = !{!87, !88, !89, !92, !93, !94, !95}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !85, file: !22, line: 84, baseType: !79, size: 6144)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !85, file: !22, line: 87, baseType: !73, size: 2048, offset: 6144)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !85, file: !22, line: 88, baseType: !90, size: 64, offset: 8192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !22, line: 88, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !85, file: !22, line: 90, baseType: !51, size: 16, offset: 8256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !85, file: !22, line: 92, baseType: !51, size: 16, offset: 8272)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !85, file: !22, line: 93, baseType: !51, size: 16, offset: 8288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !85, file: !22, line: 95, baseType: !51, size: 16, offset: 8304)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !58, file: !22, line: 108, baseType: !97, size: 64, offset: 6528)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !22, line: 66, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !22, line: 61, size: 128, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !99, file: !22, line: 62, baseType: !34, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !99, file: !22, line: 63, baseType: !34, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !99, file: !22, line: 64, baseType: !34, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !99, file: !22, line: 65, baseType: !34, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !58, file: !22, line: 109, baseType: !106, size: 64, offset: 6592)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !22, line: 71, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !22, line: 68, size: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !108, file: !22, line: 69, baseType: !34, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !108, file: !22, line: 70, baseType: !34, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !58, file: !22, line: 110, baseType: !113, size: 64, offset: 6656)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !22, line: 81, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !22, line: 73, size: 352, elements: !116)
!116 = !{!117, !121, !122, !123, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !115, file: !22, line: 74, baseType: !118, size: 96)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !115, file: !22, line: 75, baseType: !118, size: 96, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !115, file: !22, line: 76, baseType: !118, size: 96, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !115, file: !22, line: 77, baseType: !34, size: 32, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !115, file: !22, line: 78, baseType: !34, size: 32, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !58, file: !22, line: 113, baseType: !126, size: 512, offset: 6720)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !127, line: 182, baseType: !128)
!127 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !127, line: 180, size: 512, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !127, line: 181, baseType: !29, size: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !21, file: !22, line: 148, baseType: !132, size: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !22, line: 49, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !21, file: !22, line: 151, baseType: !135, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !22, line: 50, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !21, file: !22, line: 152, baseType: !138, size: 64, offset: 1536)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !22, line: 152, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !21, file: !22, line: 153, baseType: !141, size: 64, offset: 1600)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !22, line: 52, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !21, file: !22, line: 154, baseType: !144, size: 64, offset: 1664)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !22, line: 154, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !21, file: !22, line: 156, baseType: !90, size: 64, offset: 1728)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !21, file: !22, line: 158, baseType: !47, size: 32, offset: 1792)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !21, file: !22, line: 159, baseType: !47, size: 32, offset: 1824)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !21, file: !22, line: 162, baseType: !20, size: 64, offset: 1856)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !21, file: !22, line: 162, baseType: !20, size: 64, offset: 1920)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !21, file: !22, line: 162, baseType: !20, size: 64, offset: 1984)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !21, file: !22, line: 164, baseType: !153, size: 128, offset: 2048)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !154, line: 71, baseType: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !154, line: 69, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !155, file: !154, line: 70, baseType: !14, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !155, file: !154, line: 70, baseType: !14, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !21, file: !22, line: 166, baseType: !160, size: 64, offset: 2176)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !22, line: 51, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !21, file: !22, line: 167, baseType: !14, size: 64, offset: 2240)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !21, file: !22, line: 168, baseType: !47, size: 32, offset: 2304)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !21, file: !22, line: 170, baseType: !47, size: 32, offset: 2336)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !21, file: !22, line: 170, baseType: !47, size: 32, offset: 2368)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !21, file: !22, line: 171, baseType: !47, size: 32, offset: 2400)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !21, file: !22, line: 173, baseType: !14, size: 64, offset: 2432)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !21, file: !22, line: 175, baseType: !34, size: 32, offset: 2496)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !21, file: !22, line: 176, baseType: !34, size: 32, offset: 2528)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !21, file: !22, line: 179, baseType: !34, size: 32, offset: 2560)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !21, file: !22, line: 180, baseType: !47, size: 32, offset: 2592)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !21, file: !22, line: 183, baseType: !34, size: 32, offset: 2624)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !21, file: !22, line: 185, baseType: !30, size: 8, offset: 2656)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !21, file: !22, line: 186, baseType: !175, size: 24, offset: 2664)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 24, elements: !119)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !21, file: !22, line: 189, baseType: !153, size: 128, offset: 2688)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !17, file: !3, line: 47, baseType: !178, size: 384, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "SeqRenderData", file: !6, line: 103, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SeqRenderData", file: !6, line: 92, size: 384, elements: !180)
!180 = !{!181, !184, !187, !188, !189, !190, !191, !192, !193, !195}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !179, file: !6, line: 93, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !6, line: 34, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bmain", scope: !179, file: !6, line: 94, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !6, line: 38, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !179, file: !6, line: 95, baseType: !135, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !179, file: !6, line: 96, baseType: !34, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !179, file: !6, line: 97, baseType: !34, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "preview_render_size", scope: !179, file: !6, line: 98, baseType: !34, size: 32, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "motion_blur_samples", scope: !179, file: !6, line: 99, baseType: !34, size: 32, offset: 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "motion_blur_shutter", scope: !179, file: !6, line: 100, baseType: !47, size: 32, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "skip_cache", scope: !179, file: !6, line: 101, baseType: !194, size: 8, offset: 352)
!194 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "is_proxy_render", scope: !179, file: !6, line: 102, baseType: !194, size: 8, offset: 360)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !17, file: !3, line: 48, baseType: !47, size: 32, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !3, line: 49, baseType: !198, size: 32, offset: 480)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_stripelem_ibuf_t", file: !6, line: 252, baseType: !5)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !201, line: 87, baseType: !202)
!201 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!202 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !22, line: 190, baseType: !21)
!205 = !{!0, !206}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "preprocess_cache", scope: !2, file: !3, line: 68, type: !208, isLocal: true, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SeqPreprocessCache", file: !3, line: 62, size: 192, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !209, file: !3, line: 63, baseType: !34, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !209, file: !3, line: 64, baseType: !153, size: 128, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !215, line: 43, flags: DIFlagFwdDecl)
!215 = !DIFile(filename: "blender/source/blender/imbuf/IMB_moviecache.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = !{i32 7, !"Dwarf Version", i32 4}
!217 = !{i32 2, !"Debug Info Version", i32 3}
!218 = !{i32 1, !"wchar_size", i32 4}
!219 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!220 = distinct !DISubprogram(name: "BKE_sequencer_cache_destruct", scope: !3, file: !3, line: 119, type: !221, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !223)
!221 = !DISubroutineType(types: !222)
!222 = !{null}
!223 = !{}
!224 = !DILocation(line: 121, column: 6, scope: !225)
!225 = distinct !DILexicalBlock(scope: !220, file: !3, line: 121, column: 6)
!226 = !DILocation(line: 121, column: 6, scope: !220)
!227 = !DILocation(line: 122, column: 23, scope: !225)
!228 = !DILocation(line: 122, column: 3, scope: !225)
!229 = !DILocation(line: 124, column: 2, scope: !220)
!230 = !DILocation(line: 125, column: 1, scope: !220)
!231 = distinct !DISubprogram(name: "preprocessed_cache_destruct", scope: !3, file: !3, line: 202, type: !221, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!232 = !DILocation(line: 204, column: 7, scope: !233)
!233 = distinct !DILexicalBlock(scope: !231, file: !3, line: 204, column: 6)
!234 = !DILocation(line: 204, column: 6, scope: !231)
!235 = !DILocation(line: 205, column: 3, scope: !233)
!236 = !DILocation(line: 207, column: 2, scope: !231)
!237 = !DILocation(line: 209, column: 2, scope: !231)
!238 = !DILocation(line: 209, column: 12, scope: !231)
!239 = !DILocation(line: 210, column: 19, scope: !231)
!240 = !DILocation(line: 211, column: 1, scope: !231)
!241 = distinct !DISubprogram(name: "BKE_sequencer_cache_cleanup", scope: !3, file: !3, line: 127, type: !221, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !223)
!242 = !DILocation(line: 129, column: 6, scope: !243)
!243 = distinct !DILexicalBlock(scope: !241, file: !3, line: 129, column: 6)
!244 = !DILocation(line: 129, column: 6, scope: !241)
!245 = !DILocation(line: 130, column: 23, scope: !246)
!246 = distinct !DILexicalBlock(scope: !243, file: !3, line: 129, column: 18)
!247 = !DILocation(line: 130, column: 3, scope: !246)
!248 = !DILocation(line: 131, column: 16, scope: !246)
!249 = !DILocation(line: 131, column: 14, scope: !246)
!250 = !DILocation(line: 132, column: 2, scope: !246)
!251 = !DILocation(line: 134, column: 2, scope: !241)
!252 = !DILocation(line: 135, column: 1, scope: !241)
!253 = distinct !DISubprogram(name: "seqcache_hashhash", scope: !3, file: !3, line: 96, type: !254, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!254 = !DISubroutineType(types: !255)
!255 = !{!7, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!258 = !DILocalVariable(name: "key_", arg: 1, scope: !253, file: !3, line: 96, type: !256)
!259 = !DILocation(line: 96, column: 51, scope: !253)
!260 = !DILocalVariable(name: "key", scope: !253, file: !3, line: 98, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!263 = !DILocation(line: 98, column: 21, scope: !253)
!264 = !DILocation(line: 98, column: 43, scope: !253)
!265 = !DILocation(line: 98, column: 27, scope: !253)
!266 = !DILocalVariable(name: "rval", scope: !253, file: !3, line: 99, type: !7)
!267 = !DILocation(line: 99, column: 15, scope: !253)
!268 = !DILocation(line: 99, column: 44, scope: !253)
!269 = !DILocation(line: 99, column: 49, scope: !253)
!270 = !DILocation(line: 99, column: 22, scope: !253)
!271 = !DILocation(line: 101, column: 29, scope: !253)
!272 = !DILocation(line: 101, column: 34, scope: !253)
!273 = !DILocation(line: 101, column: 10, scope: !253)
!274 = !DILocation(line: 101, column: 7, scope: !253)
!275 = !DILocation(line: 102, column: 10, scope: !253)
!276 = !DILocation(line: 102, column: 15, scope: !253)
!277 = !DILocation(line: 102, column: 7, scope: !253)
!278 = !DILocation(line: 103, column: 22, scope: !253)
!279 = !DILocation(line: 103, column: 27, scope: !253)
!280 = !DILocation(line: 103, column: 11, scope: !253)
!281 = !DILocation(line: 103, column: 32, scope: !253)
!282 = !DILocation(line: 103, column: 7, scope: !253)
!283 = !DILocation(line: 105, column: 9, scope: !253)
!284 = !DILocation(line: 105, column: 2, scope: !253)
!285 = distinct !DISubprogram(name: "seqcache_hashcmp", scope: !3, file: !3, line: 108, type: !286, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!286 = !DISubroutineType(types: !287)
!287 = !{!194, !256, !256}
!288 = !DILocalVariable(name: "a_", arg: 1, scope: !285, file: !3, line: 108, type: !256)
!289 = !DILocation(line: 108, column: 42, scope: !285)
!290 = !DILocalVariable(name: "b_", arg: 2, scope: !285, file: !3, line: 108, type: !256)
!291 = !DILocation(line: 108, column: 58, scope: !285)
!292 = !DILocalVariable(name: "a", scope: !285, file: !3, line: 110, type: !261)
!293 = !DILocation(line: 110, column: 21, scope: !285)
!294 = !DILocation(line: 110, column: 41, scope: !285)
!295 = !DILocation(line: 110, column: 25, scope: !285)
!296 = !DILocalVariable(name: "b", scope: !285, file: !3, line: 111, type: !261)
!297 = !DILocation(line: 111, column: 21, scope: !285)
!298 = !DILocation(line: 111, column: 41, scope: !285)
!299 = !DILocation(line: 111, column: 25, scope: !285)
!300 = !DILocation(line: 113, column: 11, scope: !285)
!301 = !DILocation(line: 113, column: 14, scope: !285)
!302 = !DILocation(line: 113, column: 21, scope: !285)
!303 = !DILocation(line: 113, column: 24, scope: !285)
!304 = !DILocation(line: 113, column: 18, scope: !285)
!305 = !DILocation(line: 113, column: 29, scope: !285)
!306 = !DILocation(line: 114, column: 11, scope: !285)
!307 = !DILocation(line: 114, column: 14, scope: !285)
!308 = !DILocation(line: 114, column: 22, scope: !285)
!309 = !DILocation(line: 114, column: 25, scope: !285)
!310 = !DILocation(line: 114, column: 19, scope: !285)
!311 = !DILocation(line: 114, column: 31, scope: !285)
!312 = !DILocation(line: 115, column: 11, scope: !285)
!313 = !DILocation(line: 115, column: 14, scope: !285)
!314 = !DILocation(line: 115, column: 22, scope: !285)
!315 = !DILocation(line: 115, column: 25, scope: !285)
!316 = !DILocation(line: 115, column: 19, scope: !285)
!317 = !DILocation(line: 115, column: 31, scope: !285)
!318 = !DILocation(line: 116, column: 31, scope: !285)
!319 = !DILocation(line: 116, column: 34, scope: !285)
!320 = !DILocation(line: 116, column: 44, scope: !285)
!321 = !DILocation(line: 116, column: 47, scope: !285)
!322 = !DILocation(line: 116, column: 10, scope: !285)
!323 = !DILocation(line: 113, column: 9, scope: !285)
!324 = !DILocation(line: 113, column: 2, scope: !285)
!325 = distinct !DISubprogram(name: "BKE_sequencer_preprocessed_cache_cleanup", scope: !3, file: !3, line: 187, type: !221, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !223)
!326 = !DILocalVariable(name: "elem", scope: !325, file: !3, line: 189, type: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "SeqPreprocessCacheElem", file: !3, line: 60, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SeqPreprocessCacheElem", file: !3, line: 52, size: 704, elements: !330)
!330 = !{!331, !333, !334, !335, !336, !337}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !3, line: 53, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !329, file: !3, line: 53, baseType: !332, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !329, file: !3, line: 55, baseType: !20, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !329, file: !3, line: 56, baseType: !178, size: 384, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !3, line: 57, baseType: !198, size: 32, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !329, file: !3, line: 59, baseType: !338, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !340, line: 141, baseType: !341)
!340 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !340, line: 70, size: 19840, elements: !342)
!342 = !{!343, !345, !346, !347, !348, !349, !350, !351, !352, !353, !355, !360, !361, !362, !363, !364, !366, !368, !369, !370, !374, !375, !376, !377, !378, !381, !382, !383, !387, !388, !391, !392, !394, !395, !396, !399, !400, !401, !404, !405, !414}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !340, line: 71, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !341, file: !340, line: 71, baseType: !344, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !341, file: !340, line: 74, baseType: !34, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !341, file: !340, line: 74, baseType: !34, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !341, file: !340, line: 79, baseType: !194, size: 8, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !341, file: !340, line: 80, baseType: !34, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !341, file: !340, line: 83, baseType: !34, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !341, file: !340, line: 84, baseType: !34, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !341, file: !340, line: 87, baseType: !199, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !341, file: !340, line: 88, baseType: !354, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !341, file: !340, line: 93, baseType: !356, size: 128, offset: 448)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 128, elements: !358)
!357 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!358 = !{!359}
!359 = !DISubrange(count: 2)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !341, file: !340, line: 96, baseType: !34, size: 32, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !341, file: !340, line: 96, baseType: !34, size: 32, offset: 608)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !341, file: !340, line: 97, baseType: !34, size: 32, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !341, file: !340, line: 97, baseType: !34, size: 32, offset: 672)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !341, file: !340, line: 98, baseType: !365, size: 64, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !341, file: !340, line: 101, baseType: !367, size: 64, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !341, file: !340, line: 102, baseType: !354, size: 64, offset: 832)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !341, file: !340, line: 105, baseType: !47, size: 32, offset: 896)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !341, file: !340, line: 108, baseType: !371, size: 1280, offset: 960)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 1280, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 20)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !341, file: !340, line: 109, baseType: !34, size: 32, offset: 2240)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !341, file: !340, line: 109, baseType: !34, size: 32, offset: 2272)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !341, file: !340, line: 112, baseType: !34, size: 32, offset: 2304)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !341, file: !340, line: 113, baseType: !34, size: 32, offset: 2336)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !341, file: !340, line: 114, baseType: !379, size: 64, offset: 2368)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !340, line: 50, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !341, file: !340, line: 115, baseType: !14, size: 64, offset: 2432)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !341, file: !340, line: 118, baseType: !34, size: 32, offset: 2496)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !340, line: 119, baseType: !384, size: 8192, offset: 2528)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8192, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 1024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !341, file: !340, line: 120, baseType: !384, size: 8192, offset: 10720)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !341, file: !340, line: 123, baseType: !389, size: 64, offset: 18944)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !340, line: 123, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !341, file: !340, line: 124, baseType: !34, size: 32, offset: 19008)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !341, file: !340, line: 127, baseType: !393, size: 64, offset: 19072)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !341, file: !340, line: 128, baseType: !7, size: 32, offset: 19136)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !341, file: !340, line: 129, baseType: !7, size: 32, offset: 19168)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !341, file: !340, line: 132, baseType: !397, size: 64, offset: 19200)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !340, line: 132, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !341, file: !340, line: 133, baseType: !397, size: 64, offset: 19264)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !341, file: !340, line: 134, baseType: !199, size: 64, offset: 19328)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !341, file: !340, line: 135, baseType: !402, size: 64, offset: 19392)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !340, line: 135, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !341, file: !340, line: 136, baseType: !34, size: 32, offset: 19456)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !341, file: !340, line: 137, baseType: !406, size: 128, offset: 19488)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !407, line: 89, baseType: !408)
!407 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !407, line: 86, size: 128, elements: !409)
!409 = !{!410, !411, !412, !413}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !408, file: !407, line: 87, baseType: !34, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !408, file: !407, line: 87, baseType: !34, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !408, file: !407, line: 88, baseType: !34, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !408, file: !407, line: 88, baseType: !34, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !341, file: !340, line: 140, baseType: !415, size: 192, offset: 19648)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !340, line: 55, size: 192, elements: !416)
!416 = !{!417, !418, !419, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !415, file: !340, line: 56, baseType: !7, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !415, file: !340, line: 57, baseType: !7, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !340, line: 58, baseType: !393, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !415, file: !340, line: 59, baseType: !7, size: 32, offset: 128)
!421 = !DILocation(line: 189, column: 26, scope: !325)
!422 = !DILocation(line: 191, column: 7, scope: !423)
!423 = distinct !DILexicalBlock(scope: !325, file: !3, line: 191, column: 6)
!424 = !DILocation(line: 191, column: 6, scope: !325)
!425 = !DILocation(line: 192, column: 3, scope: !423)
!426 = !DILocation(line: 194, column: 14, scope: !427)
!427 = distinct !DILexicalBlock(scope: !325, file: !3, line: 194, column: 2)
!428 = !DILocation(line: 194, column: 32, scope: !427)
!429 = !DILocation(line: 194, column: 38, scope: !427)
!430 = !DILocation(line: 194, column: 12, scope: !427)
!431 = !DILocation(line: 194, column: 7, scope: !427)
!432 = !DILocation(line: 194, column: 45, scope: !433)
!433 = distinct !DILexicalBlock(scope: !427, file: !3, line: 194, column: 2)
!434 = !DILocation(line: 194, column: 2, scope: !427)
!435 = !DILocation(line: 195, column: 17, scope: !436)
!436 = distinct !DILexicalBlock(scope: !433, file: !3, line: 194, column: 70)
!437 = !DILocation(line: 195, column: 23, scope: !436)
!438 = !DILocation(line: 195, column: 3, scope: !436)
!439 = !DILocation(line: 196, column: 2, scope: !436)
!440 = !DILocation(line: 194, column: 58, scope: !433)
!441 = !DILocation(line: 194, column: 64, scope: !433)
!442 = !DILocation(line: 194, column: 56, scope: !433)
!443 = !DILocation(line: 194, column: 2, scope: !433)
!444 = distinct !{!444, !434, !445}
!445 = !DILocation(line: 196, column: 2, scope: !427)
!446 = !DILocation(line: 197, column: 17, scope: !325)
!447 = !DILocation(line: 197, column: 35, scope: !325)
!448 = !DILocation(line: 197, column: 2, scope: !325)
!449 = !DILocation(line: 199, column: 22, scope: !325)
!450 = !DILocation(line: 199, column: 40, scope: !325)
!451 = !DILocation(line: 199, column: 2, scope: !325)
!452 = !DILocation(line: 200, column: 1, scope: !325)
!453 = distinct !DISubprogram(name: "BKE_sequencer_cache_cleanup_sequence", scope: !3, file: !3, line: 145, type: !454, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !223)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !203}
!456 = !DILocalVariable(name: "seq", arg: 1, scope: !453, file: !3, line: 145, type: !203)
!457 = !DILocation(line: 145, column: 53, scope: !453)
!458 = !DILocation(line: 147, column: 6, scope: !459)
!459 = distinct !DILexicalBlock(scope: !453, file: !3, line: 147, column: 6)
!460 = !DILocation(line: 147, column: 6, scope: !453)
!461 = !DILocation(line: 148, column: 26, scope: !459)
!462 = !DILocation(line: 148, column: 62, scope: !459)
!463 = !DILocation(line: 148, column: 3, scope: !459)
!464 = !DILocation(line: 149, column: 1, scope: !453)
!465 = distinct !DISubprogram(name: "seqcache_key_check_seq", scope: !3, file: !3, line: 137, type: !466, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!466 = !DISubroutineType(types: !467)
!467 = !{!194, !338, !14, !14}
!468 = !DILocalVariable(name: "UNUSED_ibuf", arg: 1, scope: !465, file: !3, line: 137, type: !338)
!469 = !DILocation(line: 137, column: 43, scope: !465)
!470 = !DILocalVariable(name: "userkey", arg: 2, scope: !465, file: !3, line: 137, type: !14)
!471 = !DILocation(line: 137, column: 63, scope: !465)
!472 = !DILocalVariable(name: "userdata", arg: 3, scope: !465, file: !3, line: 137, type: !14)
!473 = !DILocation(line: 137, column: 78, scope: !465)
!474 = !DILocalVariable(name: "key", scope: !465, file: !3, line: 139, type: !15)
!475 = !DILocation(line: 139, column: 15, scope: !465)
!476 = !DILocation(line: 139, column: 37, scope: !465)
!477 = !DILocation(line: 139, column: 21, scope: !465)
!478 = !DILocalVariable(name: "seq", scope: !465, file: !3, line: 140, type: !203)
!479 = !DILocation(line: 140, column: 12, scope: !465)
!480 = !DILocation(line: 140, column: 31, scope: !465)
!481 = !DILocation(line: 140, column: 18, scope: !465)
