; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_movieclip_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_movieclip_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !57, line: 1163, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!59 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!64 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!65 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!66 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!67 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!68 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!69 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!70 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!72 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!73 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!74 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!75 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!76 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!77 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!78 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!79 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!80 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 145, baseType: !7, size: 32, elements: !83)
!82 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !{!84, !85, !86}
!84 = !DIEnumerator(name: "MCLIP_USE_PROXY", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "MCLIP_USE_PROXY_CUSTOM_DIR", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "MCLIP_TIMECODE_FLAGS", value: 3, isUnsigned: true)
!87 = !{!88, !175, !48, !108, !467, !1715, !1717, !536, !1724, !1725, !1727}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !82, line: 101, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !82, line: 64, size: 19136, elements: !91)
!91 = !{!92, !163, !167, !168, !169, !170, !174, !176, !177, !180, !183, !186, !450, !451, !462, !463, !464, !465, !466}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !90, file: !82, line: 65, baseType: !93, size: 960)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !94, line: 130, baseType: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !94, line: 117, size: 960, elements: !96)
!96 = !{!97, !99, !100, !102, !122, !126, !128, !129, !130, !131}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !94, line: 118, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !94, line: 118, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !95, file: !94, line: 119, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !95, file: !94, line: 120, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !94, line: 136, size: 17600, elements: !105)
!105 = !{!106, !107, !109, !112, !117, !118, !119}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !104, file: !94, line: 137, baseType: !93, size: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !104, file: !94, line: 138, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !104, file: !94, line: 139, baseType: !110, size: 64, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !94, line: 43, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !94, line: 140, baseType: !113, size: 8192, offset: 1088)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 8192, elements: !115)
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !{!116}
!116 = !DISubrange(count: 1024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !104, file: !94, line: 141, baseType: !113, size: 8192, offset: 9280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !104, file: !94, line: 148, baseType: !103, size: 64, offset: 17472)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !104, file: !94, line: 150, baseType: !120, size: 64, offset: 17536)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !94, line: 45, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !94, line: 121, baseType: !123, size: 528, offset: 256)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 528, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 66)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !94, line: 126, baseType: !127, size: 16, offset: 784)
!127 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !95, file: !94, line: 127, baseType: !48, size: 32, offset: 800)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !95, file: !94, line: 128, baseType: !48, size: 32, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !95, file: !94, line: 128, baseType: !48, size: 32, offset: 864)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !95, file: !94, line: 129, baseType: !132, size: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !94, line: 75, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !94, line: 62, size: 1024, elements: !135)
!135 = !{!136, !138, !139, !140, !141, !142, !146, !147, !161, !162}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !94, line: 63, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !94, line: 63, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !94, line: 64, baseType: !114, size: 8, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !134, file: !94, line: 64, baseType: !114, size: 8, offset: 136)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !94, line: 65, baseType: !127, size: 16, offset: 144)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !94, line: 66, baseType: !143, size: 512, offset: 160)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 512, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !134, file: !94, line: 67, baseType: !48, size: 32, offset: 672)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !94, line: 69, baseType: !148, size: 256, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !94, line: 60, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !94, line: 48, size: 256, elements: !150)
!150 = !{!151, !152, !159, !160}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !149, file: !94, line: 49, baseType: !98, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !149, file: !94, line: 58, baseType: !153, size: 128, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !154, line: 71, baseType: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !154, line: 69, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !155, file: !154, line: 70, baseType: !98, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !155, file: !154, line: 70, baseType: !98, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !94, line: 59, baseType: !48, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !149, file: !94, line: 59, baseType: !48, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !94, line: 70, baseType: !48, size: 32, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !134, file: !94, line: 74, baseType: !48, size: 32, offset: 992)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !90, file: !82, line: 66, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !166, line: 58, flags: DIFlagFwdDecl)
!166 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !82, line: 68, baseType: !113, size: 8192, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !90, file: !82, line: 70, baseType: !48, size: 32, offset: 9216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !90, file: !82, line: 71, baseType: !48, size: 32, offset: 9248)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !90, file: !82, line: 72, baseType: !171, size: 64, offset: 9280)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 2)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !90, file: !82, line: 74, baseType: !175, size: 32, offset: 9344)
!175 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !90, file: !82, line: 74, baseType: !175, size: 32, offset: 9376)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !90, file: !82, line: 76, baseType: !178, size: 64, offset: 9408)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !82, line: 42, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !90, file: !82, line: 77, baseType: !181, size: 64, offset: 9472)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !82, line: 77, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !90, file: !82, line: 78, baseType: !184, size: 64, offset: 9536)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !166, line: 61, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !90, file: !82, line: 80, baseType: !187, size: 2624, offset: 9600)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !188, line: 340, size: 2624, elements: !189)
!188 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!189 = !{!190, !218, !237, !238, !239, !257, !318, !319, !427, !428, !429, !430, !439}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !187, file: !188, line: 341, baseType: !191, size: 576)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !188, line: 251, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !188, line: 207, size: 576, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !188, line: 208, baseType: !48, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !192, file: !188, line: 211, baseType: !127, size: 16, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !192, file: !188, line: 212, baseType: !127, size: 16, offset: 48)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !192, file: !188, line: 213, baseType: !175, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !192, file: !188, line: 214, baseType: !127, size: 16, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !192, file: !188, line: 215, baseType: !127, size: 16, offset: 112)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !192, file: !188, line: 216, baseType: !127, size: 16, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !192, file: !188, line: 217, baseType: !127, size: 16, offset: 144)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !192, file: !188, line: 218, baseType: !127, size: 16, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !192, file: !188, line: 219, baseType: !127, size: 16, offset: 176)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !192, file: !188, line: 220, baseType: !175, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !192, file: !188, line: 222, baseType: !127, size: 16, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !192, file: !188, line: 225, baseType: !127, size: 16, offset: 240)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !192, file: !188, line: 228, baseType: !48, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !192, file: !188, line: 229, baseType: !48, size: 32, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !192, file: !188, line: 233, baseType: !48, size: 32, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !192, file: !188, line: 236, baseType: !127, size: 16, offset: 352)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !192, file: !188, line: 236, baseType: !127, size: 16, offset: 368)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !192, file: !188, line: 241, baseType: !175, size: 32, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !192, file: !188, line: 244, baseType: !48, size: 32, offset: 416)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !192, file: !188, line: 244, baseType: !48, size: 32, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !192, file: !188, line: 245, baseType: !175, size: 32, offset: 480)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !192, file: !188, line: 248, baseType: !175, size: 32, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !192, file: !188, line: 250, baseType: !48, size: 32, offset: 544)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !187, file: !188, line: 342, baseType: !219, size: 448, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !188, line: 79, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !188, line: 61, size: 448, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !232, !233, !234, !235, !236}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !220, file: !188, line: 62, baseType: !98, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !220, file: !188, line: 64, baseType: !127, size: 16, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !220, file: !188, line: 65, baseType: !127, size: 16, offset: 80)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !220, file: !188, line: 67, baseType: !175, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !220, file: !188, line: 68, baseType: !175, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !220, file: !188, line: 69, baseType: !175, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !220, file: !188, line: 70, baseType: !127, size: 16, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !220, file: !188, line: 71, baseType: !127, size: 16, offset: 208)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !220, file: !188, line: 72, baseType: !231, size: 64, offset: 224)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 64, elements: !172)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !220, file: !188, line: 75, baseType: !175, size: 32, offset: 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !220, file: !188, line: 75, baseType: !175, size: 32, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !220, file: !188, line: 75, baseType: !175, size: 32, offset: 352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !220, file: !188, line: 78, baseType: !175, size: 32, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !220, file: !188, line: 78, baseType: !175, size: 32, offset: 416)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !187, file: !188, line: 343, baseType: !153, size: 128, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !187, file: !188, line: 344, baseType: !153, size: 128, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !187, file: !188, line: 345, baseType: !240, size: 192, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !188, line: 278, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !188, line: 270, size: 192, elements: !242)
!242 = !{!243, !244, !245, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !241, file: !188, line: 271, baseType: !48, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !241, file: !188, line: 273, baseType: !175, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !241, file: !188, line: 275, baseType: !48, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !241, file: !188, line: 276, baseType: !48, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !241, file: !188, line: 277, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !188, line: 55, size: 576, elements: !250)
!250 = !{!251, !252, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !249, file: !188, line: 56, baseType: !48, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !249, file: !188, line: 57, baseType: !175, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !249, file: !188, line: 58, baseType: !254, size: 512, offset: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 512, elements: !255)
!255 = !{!256, !256}
!256 = !DISubrange(count: 4)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !187, file: !188, line: 346, baseType: !258, size: 384, offset: 1472)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !188, line: 268, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !188, line: 253, size: 384, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !312, !313, !314, !315, !316, !317}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !259, file: !188, line: 254, baseType: !48, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !259, file: !188, line: 255, baseType: !48, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !259, file: !188, line: 255, baseType: !48, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !259, file: !188, line: 258, baseType: !175, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !259, file: !188, line: 259, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !188, line: 164, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !188, line: 108, size: 1664, elements: !269)
!269 = !{!270, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !188, line: 109, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !188, line: 109, baseType: !271, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !188, line: 111, baseType: !143, size: 512, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !268, file: !188, line: 119, baseType: !231, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !268, file: !188, line: 119, baseType: !231, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !268, file: !188, line: 125, baseType: !231, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !268, file: !188, line: 125, baseType: !231, size: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !268, file: !188, line: 127, baseType: !231, size: 64, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !268, file: !188, line: 130, baseType: !48, size: 32, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !268, file: !188, line: 131, baseType: !48, size: 32, offset: 992)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !268, file: !188, line: 132, baseType: !282, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !188, line: 106, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !188, line: 81, size: 512, elements: !285)
!285 = !{!286, !287, !290, !291, !292, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !284, file: !188, line: 82, baseType: !231, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !284, file: !188, line: 97, baseType: !288, size: 256, offset: 64)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 256, elements: !289)
!289 = !{!256, !173}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !284, file: !188, line: 102, baseType: !231, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !284, file: !188, line: 102, baseType: !231, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !284, file: !188, line: 104, baseType: !48, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !188, line: 105, baseType: !48, size: 32, offset: 480)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !268, file: !188, line: 135, baseType: !295, size: 96, offset: 1088)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 96, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 3)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !268, file: !188, line: 136, baseType: !175, size: 32, offset: 1184)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !188, line: 139, baseType: !48, size: 32, offset: 1216)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !268, file: !188, line: 139, baseType: !48, size: 32, offset: 1248)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !268, file: !188, line: 139, baseType: !48, size: 32, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !268, file: !188, line: 140, baseType: !295, size: 96, offset: 1312)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !268, file: !188, line: 143, baseType: !127, size: 16, offset: 1408)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !268, file: !188, line: 144, baseType: !127, size: 16, offset: 1424)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !268, file: !188, line: 145, baseType: !127, size: 16, offset: 1440)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !268, file: !188, line: 148, baseType: !127, size: 16, offset: 1456)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !268, file: !188, line: 149, baseType: !48, size: 32, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !268, file: !188, line: 150, baseType: !175, size: 32, offset: 1504)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !268, file: !188, line: 152, baseType: !184, size: 64, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !268, file: !188, line: 163, baseType: !175, size: 32, offset: 1600)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !268, file: !188, line: 163, baseType: !175, size: 32, offset: 1632)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !259, file: !188, line: 261, baseType: !175, size: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !259, file: !188, line: 261, baseType: !175, size: 32, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !259, file: !188, line: 261, baseType: !175, size: 32, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !259, file: !188, line: 263, baseType: !48, size: 32, offset: 288)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !259, file: !188, line: 266, baseType: !48, size: 32, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !259, file: !188, line: 267, baseType: !175, size: 32, offset: 352)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !187, file: !188, line: 347, baseType: !266, size: 64, offset: 1856)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !187, file: !188, line: 348, baseType: !320, size: 64, offset: 1920)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !188, line: 205, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !188, line: 186, size: 1024, elements: !323)
!323 = !{!324, !326, !327, !328, !330, !331, !332, !340, !341, !342, !425, !426}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !188, line: 187, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !322, file: !188, line: 187, baseType: !325, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !188, line: 189, baseType: !143, size: 512, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !322, file: !188, line: 191, baseType: !329, size: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !322, file: !188, line: 193, baseType: !48, size: 32, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !322, file: !188, line: 193, baseType: !48, size: 32, offset: 736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !322, file: !188, line: 195, baseType: !333, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !188, line: 184, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !188, line: 166, size: 320, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !335, file: !188, line: 180, baseType: !288, size: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !335, file: !188, line: 182, baseType: !48, size: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !188, line: 183, baseType: !48, size: 32, offset: 288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !322, file: !188, line: 196, baseType: !48, size: 32, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !188, line: 198, baseType: !48, size: 32, offset: 864)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !322, file: !188, line: 200, baseType: !343, size: 64, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !345, line: 77, size: 15424, elements: !346)
!345 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!346 = !{!347, !348, !349, !352, !355, !356, !359, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !379, !380, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !406, !407, !408, !414, !415, !419}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !344, file: !345, line: 78, baseType: !93, size: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !345, line: 80, baseType: !113, size: 8192, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !344, file: !345, line: 82, baseType: !350, size: 64, offset: 9152)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !345, line: 43, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !344, file: !345, line: 83, baseType: !353, size: 64, offset: 9216)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !94, line: 46, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !344, file: !345, line: 86, baseType: !178, size: 64, offset: 9280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !344, file: !345, line: 87, baseType: !357, size: 64, offset: 9344)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !345, line: 44, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !344, file: !345, line: 89, baseType: !360, size: 512, offset: 9408)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 512, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !344, file: !345, line: 90, baseType: !127, size: 16, offset: 9920)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !344, file: !345, line: 90, baseType: !127, size: 16, offset: 9936)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !344, file: !345, line: 92, baseType: !127, size: 16, offset: 9952)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !344, file: !345, line: 92, baseType: !127, size: 16, offset: 9968)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !344, file: !345, line: 93, baseType: !127, size: 16, offset: 9984)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !345, line: 93, baseType: !127, size: 16, offset: 10000)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !344, file: !345, line: 94, baseType: !48, size: 32, offset: 10016)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !344, file: !345, line: 97, baseType: !127, size: 16, offset: 10048)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !344, file: !345, line: 97, baseType: !127, size: 16, offset: 10064)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !344, file: !345, line: 98, baseType: !127, size: 16, offset: 10080)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !344, file: !345, line: 98, baseType: !127, size: 16, offset: 10096)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !344, file: !345, line: 99, baseType: !127, size: 16, offset: 10112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !344, file: !345, line: 99, baseType: !127, size: 16, offset: 10128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !344, file: !345, line: 100, baseType: !7, size: 32, offset: 10144)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !344, file: !345, line: 101, baseType: !378, size: 64, offset: 10176)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !344, file: !345, line: 103, baseType: !120, size: 64, offset: 10240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !344, file: !345, line: 104, baseType: !381, size: 64, offset: 10304)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !94, line: 159, size: 448, elements: !383)
!383 = !{!384, !386, !387, !389, !390, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !382, file: !94, line: 161, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !172)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !382, file: !94, line: 162, baseType: !385, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !382, file: !94, line: 163, baseType: !388, size: 32, offset: 128)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 32, elements: !172)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !382, file: !94, line: 164, baseType: !388, size: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !382, file: !94, line: 165, baseType: !391, size: 128, offset: 192)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !172)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !382, file: !94, line: 166, baseType: !393, size: 128, offset: 320)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 128, elements: !172)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !344, file: !345, line: 107, baseType: !175, size: 32, offset: 10368)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !344, file: !345, line: 108, baseType: !48, size: 32, offset: 10400)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !344, file: !345, line: 109, baseType: !127, size: 16, offset: 10432)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !344, file: !345, line: 110, baseType: !127, size: 16, offset: 10448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !344, file: !345, line: 113, baseType: !48, size: 32, offset: 10464)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !344, file: !345, line: 113, baseType: !48, size: 32, offset: 10496)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !344, file: !345, line: 114, baseType: !114, size: 8, offset: 10528)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !344, file: !345, line: 114, baseType: !114, size: 8, offset: 10536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !344, file: !345, line: 115, baseType: !127, size: 16, offset: 10544)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !344, file: !345, line: 116, baseType: !404, size: 128, offset: 10560)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, elements: !405)
!405 = !{!256}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !344, file: !345, line: 119, baseType: !175, size: 32, offset: 10688)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !344, file: !345, line: 119, baseType: !175, size: 32, offset: 10720)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !344, file: !345, line: 122, baseType: !409, size: 512, offset: 10752)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !410, line: 182, baseType: !411)
!410 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !410, line: 180, size: 512, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !410, line: 181, baseType: !143, size: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !344, file: !345, line: 123, baseType: !114, size: 8, offset: 11264)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !344, file: !345, line: 125, baseType: !416, size: 56, offset: 11272)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 56, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 7)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !344, file: !345, line: 126, baseType: !420, size: 4096, offset: 11328)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 4096, elements: !361)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !345, line: 69, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !345, line: 67, size: 512, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !345, line: 68, baseType: !143, size: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !322, file: !188, line: 201, baseType: !175, size: 32, offset: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !322, file: !188, line: 204, baseType: !48, size: 32, offset: 992)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !187, file: !188, line: 350, baseType: !153, size: 128, offset: 1984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !187, file: !188, line: 351, baseType: !48, size: 32, offset: 2112)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !187, file: !188, line: 351, baseType: !48, size: 32, offset: 2144)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !187, file: !188, line: 353, baseType: !431, size: 64, offset: 2176)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !188, line: 297, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !188, line: 295, size: 2048, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !433, file: !188, line: 296, baseType: !436, size: 2048)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 2048, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !187, file: !188, line: 355, baseType: !440, size: 384, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !188, line: 338, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !188, line: 322, size: 384, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !441, file: !188, line: 323, baseType: !48, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !441, file: !188, line: 325, baseType: !127, size: 16, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !441, file: !188, line: 326, baseType: !127, size: 16, offset: 48)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !441, file: !188, line: 331, baseType: !153, size: 128, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !441, file: !188, line: 334, baseType: !153, size: 128, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !441, file: !188, line: 335, baseType: !48, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !441, file: !188, line: 337, baseType: !48, size: 32, offset: 352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !90, file: !82, line: 81, baseType: !98, size: 64, offset: 12224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !90, file: !82, line: 85, baseType: !452, size: 6208, offset: 12288)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !82, line: 55, size: 6208, elements: !453)
!453 = !{!454, !458, !459, !460, !461}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !452, file: !82, line: 56, baseType: !455, size: 6144)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 6144, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 768)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !452, file: !82, line: 58, baseType: !127, size: 16, offset: 6144)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !452, file: !82, line: 59, baseType: !127, size: 16, offset: 6160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !452, file: !82, line: 60, baseType: !127, size: 16, offset: 6176)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !452, file: !82, line: 61, baseType: !127, size: 16, offset: 6192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !90, file: !82, line: 86, baseType: !48, size: 32, offset: 18496)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !90, file: !82, line: 88, baseType: !48, size: 32, offset: 18528)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !90, file: !82, line: 90, baseType: !48, size: 32, offset: 18560)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !90, file: !82, line: 94, baseType: !48, size: 32, offset: 18592)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !90, file: !82, line: 100, baseType: !409, size: 512, offset: 18624)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !470, line: 157, size: 1344, elements: !471)
!470 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!471 = !{!472, !474, !475, !476, !479, !480, !481, !482, !483, !484, !486, !488, !1690, !1691, !1693, !1694, !1699, !1700, !1705, !1710, !1711, !1713, !1714}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !470, line: 158, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !469, file: !470, line: 158, baseType: !473, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !469, file: !470, line: 161, baseType: !48, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !469, file: !470, line: 164, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !469, file: !470, line: 166, baseType: !48, size: 32, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !470, line: 169, baseType: !477, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !469, file: !470, line: 171, baseType: !477, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !469, file: !470, line: 173, baseType: !48, size: 32, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !469, file: !470, line: 175, baseType: !477, size: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !470, line: 178, baseType: !485, size: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !469, file: !470, line: 180, baseType: !487, size: 32, offset: 608)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !469, file: !470, line: 182, baseType: !489, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !470, line: 73, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!48, !493, !1640}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !495)
!495 = !{!496, !500, !1689}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !494, file: !6, line: 58, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !6, line: 56, size: 64, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !497, file: !6, line: 57, baseType: !98, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !6, line: 60, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !470, line: 339, size: 1600, elements: !503)
!503 = !{!504, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !531, !537, !1672, !1677, !1683, !1688}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !502, file: !470, line: 341, baseType: !505, size: 320)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !470, line: 135, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !470, line: 130, size: 320, elements: !507)
!507 = !{!508, !509, !510, !513}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !470, line: 131, baseType: !98, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !506, file: !470, line: 131, baseType: !98, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !506, file: !470, line: 133, baseType: !511, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !470, line: 46, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !506, file: !470, line: 134, baseType: !153, size: 128, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !502, file: !470, line: 344, baseType: !477, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !502, file: !470, line: 348, baseType: !98, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !502, file: !470, line: 349, baseType: !98, size: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !470, line: 352, baseType: !48, size: 32, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !470, line: 355, baseType: !477, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !502, file: !470, line: 357, baseType: !477, size: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !502, file: !470, line: 359, baseType: !477, size: 64, offset: 704)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !502, file: !470, line: 361, baseType: !48, size: 32, offset: 768)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !502, file: !470, line: 364, baseType: !467, size: 64, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !502, file: !470, line: 367, baseType: !467, size: 64, offset: 896)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !502, file: !470, line: 370, baseType: !501, size: 64, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !502, file: !470, line: 376, baseType: !501, size: 64, offset: 1024)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !502, file: !470, line: 379, baseType: !527, size: 64, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !470, line: 70, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!501, !493}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !502, file: !470, line: 382, baseType: !532, size: 64, offset: 1152)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !470, line: 71, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!536, !493}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !502, file: !470, line: 385, baseType: !538, size: 64, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!501, !542, !609, !98, !477, !1636, !1641, !1671}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !544, line: 53, size: 15232, elements: !545)
!544 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !559, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !606}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !544, line: 54, baseType: !542, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !543, file: !544, line: 54, baseType: !542, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !543, file: !544, line: 55, baseType: !113, size: 8192, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !543, file: !544, line: 56, baseType: !127, size: 16, offset: 8320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !543, file: !544, line: 56, baseType: !127, size: 16, offset: 8336)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !543, file: !544, line: 57, baseType: !127, size: 16, offset: 8352)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !543, file: !544, line: 57, baseType: !127, size: 16, offset: 8368)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !543, file: !544, line: 58, baseType: !554, size: 64, offset: 8384)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !555, line: 27, baseType: !556)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !557, line: 45, baseType: !558)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!558 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !543, file: !544, line: 59, baseType: !560, size: 128, offset: 8448)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !543, file: !544, line: 60, baseType: !127, size: 16, offset: 8576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !543, file: !544, line: 62, baseType: !103, size: 64, offset: 8640)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !543, file: !544, line: 63, baseType: !153, size: 128, offset: 8704)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !543, file: !544, line: 64, baseType: !153, size: 128, offset: 8832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !543, file: !544, line: 65, baseType: !153, size: 128, offset: 8960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !543, file: !544, line: 66, baseType: !153, size: 128, offset: 9088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !543, file: !544, line: 67, baseType: !153, size: 128, offset: 9216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !543, file: !544, line: 68, baseType: !153, size: 128, offset: 9344)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !543, file: !544, line: 69, baseType: !153, size: 128, offset: 9472)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !543, file: !544, line: 70, baseType: !153, size: 128, offset: 9600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !543, file: !544, line: 71, baseType: !153, size: 128, offset: 9728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !543, file: !544, line: 72, baseType: !153, size: 128, offset: 9856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !543, file: !544, line: 73, baseType: !153, size: 128, offset: 9984)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !543, file: !544, line: 74, baseType: !153, size: 128, offset: 10112)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !543, file: !544, line: 75, baseType: !153, size: 128, offset: 10240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !543, file: !544, line: 76, baseType: !153, size: 128, offset: 10368)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !543, file: !544, line: 77, baseType: !153, size: 128, offset: 10496)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !543, file: !544, line: 78, baseType: !153, size: 128, offset: 10624)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !543, file: !544, line: 79, baseType: !153, size: 128, offset: 10752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !543, file: !544, line: 80, baseType: !153, size: 128, offset: 10880)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !543, file: !544, line: 81, baseType: !153, size: 128, offset: 11008)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !543, file: !544, line: 82, baseType: !153, size: 128, offset: 11136)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !543, file: !544, line: 83, baseType: !153, size: 128, offset: 11264)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !543, file: !544, line: 84, baseType: !153, size: 128, offset: 11392)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !543, file: !544, line: 85, baseType: !153, size: 128, offset: 11520)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !543, file: !544, line: 86, baseType: !153, size: 128, offset: 11648)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !543, file: !544, line: 87, baseType: !153, size: 128, offset: 11776)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !543, file: !544, line: 88, baseType: !153, size: 128, offset: 11904)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !543, file: !544, line: 89, baseType: !153, size: 128, offset: 12032)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !543, file: !544, line: 90, baseType: !153, size: 128, offset: 12160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !543, file: !544, line: 91, baseType: !153, size: 128, offset: 12288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !543, file: !544, line: 92, baseType: !153, size: 128, offset: 12416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !543, file: !544, line: 93, baseType: !153, size: 128, offset: 12544)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !543, file: !544, line: 94, baseType: !153, size: 128, offset: 12672)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !543, file: !544, line: 95, baseType: !153, size: 128, offset: 12800)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !543, file: !544, line: 96, baseType: !153, size: 128, offset: 12928)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !543, file: !544, line: 98, baseType: !436, size: 2048, offset: 13056)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !543, file: !544, line: 101, baseType: !601, size: 64, offset: 15104)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !603, line: 58, size: 32, elements: !604)
!603 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !602, file: !603, line: 59, baseType: !48, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !543, file: !544, line: 103, baseType: !607, size: 64, offset: 15168)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !544, line: 51, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !611, line: 106, size: 320, elements: !612)
!611 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !{!613, !614, !615, !616, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !610, file: !611, line: 107, baseType: !153, size: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !610, file: !611, line: 108, baseType: !48, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !610, file: !611, line: 109, baseType: !48, size: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !611, line: 110, baseType: !48, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !610, file: !611, line: 110, baseType: !48, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !610, file: !611, line: 111, baseType: !619, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !621, line: 490, size: 768, elements: !622)
!621 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !{!623, !624, !625, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !621, line: 491, baseType: !619, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !620, file: !621, line: 491, baseType: !619, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !620, file: !621, line: 493, baseType: !626, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !611, line: 169, size: 2048, elements: !628)
!628 = !{!629, !630, !631, !632, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1602, !1605, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !611, line: 170, baseType: !626, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !627, file: !611, line: 170, baseType: !626, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !627, file: !611, line: 172, baseType: !98, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !627, file: !611, line: 174, baseType: !633, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !635, line: 49, size: 1984, elements: !636)
!635 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!636 = !{!637, !638, !639, !640, !641, !642, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !634, file: !635, line: 50, baseType: !93, size: 960)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !634, file: !635, line: 52, baseType: !153, size: 128, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !634, file: !635, line: 53, baseType: !153, size: 128, offset: 1088)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !634, file: !635, line: 54, baseType: !153, size: 128, offset: 1216)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !634, file: !635, line: 55, baseType: !153, size: 128, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !634, file: !635, line: 57, baseType: !643, size: 64, offset: 1472)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !166, line: 1216, size: 39680, elements: !645)
!645 = !{!646, !647, !648, !651, !654, !655, !656, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !682, !753, !895, !1110, !1113, !1402, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1424, !1425, !1426, !1427, !1428, !1436, !1503, !1510, !1511, !1518, !1519, !1520, !1521, !1522, !1523, !1524}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !644, file: !166, line: 1217, baseType: !93, size: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !644, file: !166, line: 1218, baseType: !164, size: 64, offset: 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !644, file: !166, line: 1220, baseType: !649, size: 64, offset: 1024)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !166, line: 50, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !644, file: !166, line: 1221, baseType: !652, size: 64, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !166, line: 52, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !644, file: !166, line: 1223, baseType: !643, size: 64, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !644, file: !166, line: 1225, baseType: !153, size: 128, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !644, file: !166, line: 1226, baseType: !657, size: 64, offset: 1344)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !166, line: 69, size: 320, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !658, file: !166, line: 70, baseType: !657, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !658, file: !166, line: 70, baseType: !657, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !658, file: !166, line: 71, baseType: !7, size: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !658, file: !166, line: 71, baseType: !7, size: 32, offset: 160)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !166, line: 72, baseType: !48, size: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !658, file: !166, line: 73, baseType: !127, size: 16, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !658, file: !166, line: 73, baseType: !127, size: 16, offset: 240)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !658, file: !166, line: 74, baseType: !649, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !644, file: !166, line: 1227, baseType: !649, size: 64, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !644, file: !166, line: 1229, baseType: !295, size: 96, offset: 1472)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !644, file: !166, line: 1230, baseType: !295, size: 96, offset: 1568)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !644, file: !166, line: 1231, baseType: !295, size: 96, offset: 1664)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !644, file: !166, line: 1231, baseType: !295, size: 96, offset: 1760)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !644, file: !166, line: 1233, baseType: !7, size: 32, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !644, file: !166, line: 1234, baseType: !48, size: 32, offset: 1888)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !644, file: !166, line: 1235, baseType: !7, size: 32, offset: 1920)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !644, file: !166, line: 1237, baseType: !127, size: 16, offset: 1952)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !644, file: !166, line: 1239, baseType: !114, size: 8, offset: 1968)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !644, file: !166, line: 1240, baseType: !679, size: 8, offset: 1976)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 8, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 1)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !644, file: !166, line: 1242, baseType: !683, size: 64, offset: 1984)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !685, line: 328, size: 3456, elements: !686)
!685 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !{!687, !688, !689, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !719, !720, !721, !724, !729, !730, !733, !737, !741, !745, !749, !750, !751, !752}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !684, file: !685, line: 329, baseType: !93, size: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !684, file: !685, line: 330, baseType: !164, size: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !684, file: !685, line: 332, baseType: !690, size: 64, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !685, line: 332, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !684, file: !685, line: 333, baseType: !143, size: 512, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !684, file: !685, line: 335, baseType: !501, size: 64, offset: 1600)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !684, file: !685, line: 337, baseType: !184, size: 64, offset: 1664)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !684, file: !685, line: 338, baseType: !231, size: 64, offset: 1728)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !684, file: !685, line: 340, baseType: !153, size: 128, offset: 1792)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !684, file: !685, line: 340, baseType: !153, size: 128, offset: 1920)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !685, line: 342, baseType: !48, size: 32, offset: 2048)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !684, file: !685, line: 342, baseType: !48, size: 32, offset: 2080)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !684, file: !685, line: 343, baseType: !48, size: 32, offset: 2112)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !684, file: !685, line: 345, baseType: !48, size: 32, offset: 2144)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !684, file: !685, line: 346, baseType: !48, size: 32, offset: 2176)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !684, file: !685, line: 347, baseType: !127, size: 16, offset: 2208)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !684, file: !685, line: 348, baseType: !127, size: 16, offset: 2224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !684, file: !685, line: 349, baseType: !48, size: 32, offset: 2240)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !684, file: !685, line: 351, baseType: !48, size: 32, offset: 2272)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !684, file: !685, line: 353, baseType: !127, size: 16, offset: 2304)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !684, file: !685, line: 354, baseType: !127, size: 16, offset: 2320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !684, file: !685, line: 355, baseType: !48, size: 32, offset: 2336)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !684, file: !685, line: 357, baseType: !711, size: 128, offset: 2368)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !712, line: 95, baseType: !713)
!712 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !712, line: 92, size: 128, elements: !714)
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !713, file: !712, line: 93, baseType: !175, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !713, file: !712, line: 93, baseType: !175, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !713, file: !712, line: 94, baseType: !175, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !713, file: !712, line: 94, baseType: !175, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !684, file: !685, line: 363, baseType: !153, size: 128, offset: 2496)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !684, file: !685, line: 363, baseType: !153, size: 128, offset: 2624)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !684, file: !685, line: 368, baseType: !722, size: 64, offset: 2752)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !685, line: 48, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !684, file: !685, line: 372, baseType: !725, size: 32, offset: 2816)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !685, line: 274, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !685, line: 271, size: 32, elements: !727)
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !726, file: !685, line: 273, baseType: !7, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !684, file: !685, line: 373, baseType: !48, size: 32, offset: 2848)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !684, file: !685, line: 382, baseType: !731, size: 64, offset: 2880)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !685, line: 46, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !684, file: !685, line: 385, baseType: !734, size: 64, offset: 2944)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !98, !175}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !684, file: !685, line: 386, baseType: !738, size: 64, offset: 3008)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !98, !536}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !684, file: !685, line: 387, baseType: !742, size: 64, offset: 3072)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!48, !98}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !684, file: !685, line: 388, baseType: !746, size: 64, offset: 3136)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !98}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !684, file: !685, line: 389, baseType: !98, size: 64, offset: 3200)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !684, file: !685, line: 389, baseType: !98, size: 64, offset: 3264)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !684, file: !685, line: 389, baseType: !98, size: 64, offset: 3328)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !684, file: !685, line: 389, baseType: !98, size: 64, offset: 3392)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !644, file: !166, line: 1244, baseType: !754, size: 64, offset: 2048)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !756, line: 200, size: 17024, elements: !757)
!756 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!757 = !{!758, !760, !761, !762, !888, !889, !890, !891, !892, !893, !894}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !755, file: !756, line: 201, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !755, file: !756, line: 202, baseType: !153, size: 128, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !755, file: !756, line: 203, baseType: !153, size: 128, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !755, file: !756, line: 206, baseType: !763, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !756, line: 190, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !756, line: 126, size: 2816, elements: !766)
!766 = !{!767, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !852, !855, !856, !857, !859, !863, !864, !865, !866, !867, !868, !869, !870, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !887}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !756, line: 127, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !765, file: !756, line: 127, baseType: !768, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !765, file: !756, line: 128, baseType: !98, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !765, file: !756, line: 129, baseType: !98, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !765, file: !756, line: 130, baseType: !143, size: 512, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !765, file: !756, line: 132, baseType: !48, size: 32, offset: 768)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !765, file: !756, line: 132, baseType: !48, size: 32, offset: 800)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !765, file: !756, line: 133, baseType: !48, size: 32, offset: 832)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !765, file: !756, line: 134, baseType: !48, size: 32, offset: 864)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !765, file: !756, line: 134, baseType: !48, size: 32, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !765, file: !756, line: 134, baseType: !48, size: 32, offset: 928)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !765, file: !756, line: 135, baseType: !48, size: 32, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !765, file: !756, line: 135, baseType: !48, size: 32, offset: 992)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !765, file: !756, line: 136, baseType: !48, size: 32, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !765, file: !756, line: 136, baseType: !48, size: 32, offset: 1056)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !765, file: !756, line: 137, baseType: !48, size: 32, offset: 1088)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !765, file: !756, line: 137, baseType: !48, size: 32, offset: 1120)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !765, file: !756, line: 138, baseType: !175, size: 32, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !765, file: !756, line: 139, baseType: !175, size: 32, offset: 1184)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !765, file: !756, line: 139, baseType: !175, size: 32, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !765, file: !756, line: 141, baseType: !127, size: 16, offset: 1248)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !765, file: !756, line: 142, baseType: !127, size: 16, offset: 1264)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !765, file: !756, line: 143, baseType: !48, size: 32, offset: 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !765, file: !756, line: 144, baseType: !48, size: 32, offset: 1312)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !765, file: !756, line: 146, baseType: !793, size: 64, offset: 1344)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !756, line: 114, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !756, line: 99, size: 7232, elements: !796)
!796 = !{!797, !799, !800, !801, !802, !803, !804, !812, !813, !825, !834, !841, !851}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !756, line: 100, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !795, file: !756, line: 100, baseType: !798, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !795, file: !756, line: 101, baseType: !48, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !795, file: !756, line: 101, baseType: !48, size: 32, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !795, file: !756, line: 102, baseType: !48, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !795, file: !756, line: 102, baseType: !48, size: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !795, file: !756, line: 103, baseType: !805, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !756, line: 59, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !756, line: 56, size: 2112, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !807, file: !756, line: 57, baseType: !436, size: 2048)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !807, file: !756, line: 58, baseType: !48, size: 32, offset: 2048)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !807, file: !756, line: 58, baseType: !48, size: 32, offset: 2080)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !795, file: !756, line: 106, baseType: !455, size: 6144, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !795, file: !756, line: 107, baseType: !814, size: 64, offset: 6464)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !756, line: 97, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !756, line: 83, size: 8320, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !816, file: !756, line: 84, baseType: !455, size: 6144)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !816, file: !756, line: 87, baseType: !436, size: 2048, offset: 6144)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !816, file: !756, line: 88, baseType: !178, size: 64, offset: 8192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !816, file: !756, line: 90, baseType: !127, size: 16, offset: 8256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !816, file: !756, line: 92, baseType: !127, size: 16, offset: 8272)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !816, file: !756, line: 93, baseType: !127, size: 16, offset: 8288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !816, file: !756, line: 95, baseType: !127, size: 16, offset: 8304)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !795, file: !756, line: 108, baseType: !826, size: 64, offset: 6528)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !756, line: 66, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !756, line: 61, size: 128, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !828, file: !756, line: 62, baseType: !48, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !828, file: !756, line: 63, baseType: !48, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !828, file: !756, line: 64, baseType: !48, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !828, file: !756, line: 65, baseType: !48, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !795, file: !756, line: 109, baseType: !835, size: 64, offset: 6592)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !756, line: 71, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !756, line: 68, size: 64, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !837, file: !756, line: 69, baseType: !48, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !837, file: !756, line: 70, baseType: !48, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !795, file: !756, line: 110, baseType: !842, size: 64, offset: 6656)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !756, line: 81, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !756, line: 73, size: 352, elements: !845)
!845 = !{!846, !847, !848, !849, !850}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !844, file: !756, line: 74, baseType: !295, size: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !844, file: !756, line: 75, baseType: !295, size: 96, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !844, file: !756, line: 76, baseType: !295, size: 96, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !844, file: !756, line: 77, baseType: !48, size: 32, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !844, file: !756, line: 78, baseType: !48, size: 32, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !795, file: !756, line: 113, baseType: !409, size: 512, offset: 6720)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !765, file: !756, line: 148, baseType: !853, size: 64, offset: 1408)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !756, line: 49, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !765, file: !756, line: 151, baseType: !643, size: 64, offset: 1472)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !765, file: !756, line: 152, baseType: !649, size: 64, offset: 1536)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !765, file: !756, line: 153, baseType: !858, size: 64, offset: 1600)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !765, file: !756, line: 154, baseType: !860, size: 64, offset: 1664)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !862, line: 264, flags: DIFlagFwdDecl)
!862 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!863 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !765, file: !756, line: 156, baseType: !178, size: 64, offset: 1728)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !765, file: !756, line: 158, baseType: !175, size: 32, offset: 1792)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !765, file: !756, line: 159, baseType: !175, size: 32, offset: 1824)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !765, file: !756, line: 162, baseType: !768, size: 64, offset: 1856)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !765, file: !756, line: 162, baseType: !768, size: 64, offset: 1920)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !765, file: !756, line: 162, baseType: !768, size: 64, offset: 1984)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !765, file: !756, line: 164, baseType: !153, size: 128, offset: 2048)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !765, file: !756, line: 166, baseType: !871, size: 64, offset: 2176)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !756, line: 51, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !765, file: !756, line: 167, baseType: !98, size: 64, offset: 2240)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !765, file: !756, line: 168, baseType: !175, size: 32, offset: 2304)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !765, file: !756, line: 170, baseType: !175, size: 32, offset: 2336)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !765, file: !756, line: 170, baseType: !175, size: 32, offset: 2368)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !765, file: !756, line: 171, baseType: !175, size: 32, offset: 2400)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !765, file: !756, line: 173, baseType: !98, size: 64, offset: 2432)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !765, file: !756, line: 175, baseType: !48, size: 32, offset: 2496)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !765, file: !756, line: 176, baseType: !48, size: 32, offset: 2528)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !765, file: !756, line: 179, baseType: !48, size: 32, offset: 2560)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !765, file: !756, line: 180, baseType: !175, size: 32, offset: 2592)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !765, file: !756, line: 183, baseType: !48, size: 32, offset: 2624)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !765, file: !756, line: 185, baseType: !114, size: 8, offset: 2656)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !765, file: !756, line: 186, baseType: !886, size: 24, offset: 2664)
