; ModuleID = 'blender/source/blender/editors/mesh/editmesh_add.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_add.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !39, line: 94, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48}
!41 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!48 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !39, line: 116, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!54 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !39, line: 131, baseType: !7, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!58 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!59 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!60 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !39, line: 123, baseType: !7, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!64 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!65 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!66 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!67 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!68 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 182, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75}
!71 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 351, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!84 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 339, baseType: !7, size: 32, elements: !87)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!88 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!92 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!94 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!95 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!96 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!97 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!98 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !103, line: 130, baseType: !104)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !103, line: 117, size: 960, elements: !105)
!105 = !{!106, !107, !108, !110, !129, !133, !135, !137, !138, !139}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !103, line: 118, baseType: !100, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !103, line: 118, baseType: !100, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !104, file: !103, line: 119, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !104, file: !103, line: 120, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !103, line: 136, size: 17600, elements: !113)
!113 = !{!114, !115, !116, !119, !124, !125, !126}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !103, line: 137, baseType: !102, size: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !112, file: !103, line: 138, baseType: !101, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !112, file: !103, line: 139, baseType: !117, size: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !103, line: 43, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !103, line: 140, baseType: !120, size: 8192, offset: 1088)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 8192, elements: !122)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !{!123}
!123 = !DISubrange(count: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !112, file: !103, line: 141, baseType: !120, size: 8192, offset: 9280)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !112, file: !103, line: 148, baseType: !111, size: 64, offset: 17472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !112, file: !103, line: 150, baseType: !127, size: 64, offset: 17536)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !103, line: 45, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !103, line: 121, baseType: !130, size: 528, offset: 256)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 528, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 66)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !103, line: 126, baseType: !134, size: 16, offset: 784)
!134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !104, file: !103, line: 127, baseType: !136, size: 32, offset: 800)
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !104, file: !103, line: 128, baseType: !136, size: 32, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !104, file: !103, line: 128, baseType: !136, size: 32, offset: 864)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !104, file: !103, line: 129, baseType: !140, size: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !103, line: 75, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !103, line: 62, size: 1024, elements: !143)
!143 = !{!144, !146, !147, !148, !149, !150, !154, !155, !169, !170}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !103, line: 63, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !142, file: !103, line: 63, baseType: !145, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !103, line: 64, baseType: !121, size: 8, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !142, file: !103, line: 64, baseType: !121, size: 8, offset: 136)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !142, file: !103, line: 65, baseType: !134, size: 16, offset: 144)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !103, line: 66, baseType: !151, size: 512, offset: 160)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 512, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !142, file: !103, line: 67, baseType: !136, size: 32, offset: 672)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !103, line: 69, baseType: !156, size: 256, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !103, line: 60, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !103, line: 48, size: 256, elements: !158)
!158 = !{!159, !160, !167, !168}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !157, file: !103, line: 49, baseType: !100, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !157, file: !103, line: 58, baseType: !161, size: 128, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !162, line: 71, baseType: !163)
!162 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !162, line: 69, size: 128, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !163, file: !162, line: 70, baseType: !100, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !163, file: !162, line: 70, baseType: !100, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !157, file: !103, line: 59, baseType: !136, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !157, file: !103, line: 59, baseType: !136, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !142, file: !103, line: 70, baseType: !136, size: 32, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !142, file: !103, line: 74, baseType: !136, size: 32, offset: 992)
!171 = !{!0}
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 1280, elements: !184)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !6, line: 308, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !6, line: 302, size: 320, elements: !176)
!176 = !{!177, !178, !181, !182, !183}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !175, file: !6, line: 303, baseType: !136, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !175, file: !6, line: 304, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !175, file: !6, line: 305, baseType: !136, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !6, line: 306, baseType: !179, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !175, file: !6, line: 307, baseType: !179, size: 64, offset: 256)
!184 = !{!185}
!185 = !DISubrange(count: 4)
!186 = !{i32 7, !"Dwarf Version", i32 4}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{i32 1, !"wchar_size", i32 4}
!189 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!190 = distinct !DISubprogram(name: "MESH_OT_primitive_plane_add", scope: !3, file: !3, line: 125, type: !191, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1914)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !195, line: 568, baseType: !196)
!195 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !195, line: 508, size: 1536, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !1840, !1844, !1850, !1854, !1855, !1859, !1860, !1861, !1862, !1866, !1867, !1882, !1883, !1887, !1913}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !195, line: 509, baseType: !179, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !196, file: !195, line: 510, baseType: !179, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !196, file: !195, line: 511, baseType: !179, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !196, file: !195, line: 512, baseType: !179, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !196, file: !195, line: 518, baseType: !203, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!136, !206, !208}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !77, line: 328, size: 1344, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !217, !218, !219, !231, !1833, !1834, !1835, !1838, !1839}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !77, line: 329, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !209, file: !77, line: 329, baseType: !208, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !209, file: !77, line: 332, baseType: !151, size: 512, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !209, file: !77, line: 333, baseType: !140, size: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !77, line: 336, baseType: !216, size: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !209, file: !77, line: 337, baseType: !100, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !209, file: !77, line: 338, baseType: !100, size: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !209, file: !77, line: 340, baseType: !220, size: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !222)
!222 = !{!223, !227, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !221, file: !6, line: 58, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !221, file: !6, line: 56, size: 64, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !6, line: 57, baseType: !100, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !6, line: 60, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !6, line: 41, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !221, file: !6, line: 61, baseType: !100, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !209, file: !77, line: 341, baseType: !232, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !77, line: 106, size: 320, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !233, file: !77, line: 107, baseType: !161, size: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !233, file: !77, line: 108, baseType: !136, size: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !233, file: !77, line: 109, baseType: !136, size: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !77, line: 110, baseType: !136, size: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !233, file: !77, line: 110, baseType: !136, size: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !233, file: !77, line: 111, baseType: !241, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !195, line: 490, size: 768, elements: !243)
!243 = !{!244, !245, !246, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !195, line: 491, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !195, line: 491, baseType: !241, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !242, file: !195, line: 493, baseType: !247, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !77, line: 169, size: 2048, elements: !249)
!249 = !{!250, !251, !252, !253, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1799, !1802, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !77, line: 170, baseType: !247, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !248, file: !77, line: 170, baseType: !247, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !248, file: !77, line: 172, baseType: !100, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !248, file: !77, line: 174, baseType: !254, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !256, line: 49, size: 1984, elements: !257)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = !{!258, !259, !260, !261, !262, !263, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !255, file: !256, line: 50, baseType: !102, size: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !255, file: !256, line: 52, baseType: !161, size: 128, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !255, file: !256, line: 53, baseType: !161, size: 128, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !255, file: !256, line: 54, baseType: !161, size: 128, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !255, file: !256, line: 55, baseType: !161, size: 128, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !255, file: !256, line: 57, baseType: !264, size: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !266, line: 1216, size: 39680, elements: !267)
!266 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!267 = !{!268, !269, !273, !562, !565, !566, !567, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !593, !664, !1092, !1307, !1310, !1599, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1621, !1622, !1623, !1624, !1625, !1633, !1700, !1707, !1708, !1715, !1716, !1717, !1718, !1719, !1720, !1721}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !265, file: !266, line: 1217, baseType: !102, size: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !265, file: !266, line: 1218, baseType: !270, size: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !272, line: 45, flags: DIFlagFwdDecl)
!272 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !265, file: !266, line: 1220, baseType: !274, size: 64, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !86, line: 115, size: 11392, elements: !276)
!276 = !{!277, !278, !279, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !296, !308, !322, !323, !366, !367, !370, !371, !387, !388, !389, !390, !391, !392, !393, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !411, !412, !413, !414, !415, !416, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !476, !477, !478, !479, !480, !481, !482, !483, !484, !487, !490, !493, !494, !495, !496, !497, !500, !503, !506, !507, !513, !514, !515, !516, !517, !518, !520, !523, !526, !530, !550, !551}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !275, file: !86, line: 116, baseType: !102, size: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !275, file: !86, line: 117, baseType: !270, size: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !275, file: !86, line: 119, baseType: !280, size: 64, offset: 1024)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !86, line: 57, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !86, line: 121, baseType: !134, size: 16, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !275, file: !86, line: 121, baseType: !134, size: 16, offset: 1104)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !275, file: !86, line: 122, baseType: !136, size: 32, offset: 1120)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !275, file: !86, line: 122, baseType: !136, size: 32, offset: 1152)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !275, file: !86, line: 122, baseType: !136, size: 32, offset: 1184)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !275, file: !86, line: 123, baseType: !151, size: 512, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !275, file: !86, line: 124, baseType: !274, size: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !275, file: !86, line: 124, baseType: !274, size: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !275, file: !86, line: 127, baseType: !274, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !275, file: !86, line: 127, baseType: !274, size: 64, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !275, file: !86, line: 127, baseType: !274, size: 64, offset: 1984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !275, file: !86, line: 128, baseType: !294, size: 64, offset: 2048)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !272, line: 46, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !275, file: !86, line: 130, baseType: !297, size: 64, offset: 2112)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !86, line: 97, size: 832, elements: !299)
!299 = !{!300, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !298, file: !86, line: 98, baseType: !301, size: 768)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 768, elements: !303)
!302 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!303 = !{!304, !305}
!304 = !DISubrange(count: 8)
!305 = !DISubrange(count: 3)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !86, line: 99, baseType: !136, size: 32, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !298, file: !86, line: 99, baseType: !136, size: 32, offset: 800)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !275, file: !86, line: 131, baseType: !309, size: 64, offset: 2176)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !311, line: 486, size: 1600, elements: !312)
!311 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !310, file: !311, line: 487, baseType: !102, size: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !310, file: !311, line: 489, baseType: !161, size: 128, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !310, file: !311, line: 490, baseType: !161, size: 128, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !310, file: !311, line: 491, baseType: !161, size: 128, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !310, file: !311, line: 492, baseType: !161, size: 128, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !311, line: 494, baseType: !136, size: 32, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !310, file: !311, line: 495, baseType: !136, size: 32, offset: 1504)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !310, file: !311, line: 497, baseType: !136, size: 32, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !310, file: !311, line: 498, baseType: !136, size: 32, offset: 1568)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !275, file: !86, line: 132, baseType: !309, size: 64, offset: 2240)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !275, file: !86, line: 133, baseType: !324, size: 64, offset: 2304)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !311, line: 334, size: 1728, elements: !326)
!326 = !{!327, !328, !331, !332, !333, !334, !335, !336, !339, !340, !341, !342, !343, !344, !345, !365}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !325, file: !311, line: 335, baseType: !161, size: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !325, file: !311, line: 336, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !311, line: 47, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !311, line: 338, baseType: !134, size: 16, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !325, file: !311, line: 338, baseType: !134, size: 16, offset: 208)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !325, file: !311, line: 339, baseType: !7, size: 32, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !325, file: !311, line: 340, baseType: !136, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !325, file: !311, line: 342, baseType: !302, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !325, file: !311, line: 343, baseType: !337, size: 96, offset: 320)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 96, elements: !338)
!338 = !{!305}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !325, file: !311, line: 344, baseType: !337, size: 96, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !325, file: !311, line: 347, baseType: !161, size: 128, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !325, file: !311, line: 349, baseType: !136, size: 32, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !325, file: !311, line: 350, baseType: !136, size: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !325, file: !311, line: 351, baseType: !100, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !325, file: !311, line: 352, baseType: !100, size: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !325, file: !311, line: 354, baseType: !346, size: 384, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !311, line: 116, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !311, line: 94, size: 384, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !347, file: !311, line: 96, baseType: !136, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !347, file: !311, line: 96, baseType: !136, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !347, file: !311, line: 97, baseType: !136, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !347, file: !311, line: 97, baseType: !136, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !347, file: !311, line: 99, baseType: !134, size: 16, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !347, file: !311, line: 100, baseType: !134, size: 16, offset: 144)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !347, file: !311, line: 102, baseType: !134, size: 16, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !347, file: !311, line: 105, baseType: !134, size: 16, offset: 176)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !347, file: !311, line: 108, baseType: !134, size: 16, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !347, file: !311, line: 109, baseType: !134, size: 16, offset: 208)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !347, file: !311, line: 111, baseType: !134, size: 16, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !347, file: !311, line: 112, baseType: !134, size: 16, offset: 240)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !347, file: !311, line: 114, baseType: !136, size: 32, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !347, file: !311, line: 114, baseType: !136, size: 32, offset: 288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !347, file: !311, line: 115, baseType: !136, size: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !347, file: !311, line: 115, baseType: !136, size: 32, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !325, file: !311, line: 355, baseType: !151, size: 512, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !86, line: 134, baseType: !100, size: 64, offset: 2368)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !275, file: !86, line: 136, baseType: !368, size: 64, offset: 2432)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !86, line: 58, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !275, file: !86, line: 138, baseType: !346, size: 384, offset: 2496)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !275, file: !86, line: 139, baseType: !372, size: 64, offset: 2880)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !311, line: 80, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !311, line: 72, size: 192, elements: !375)
!375 = !{!376, !383, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !374, file: !311, line: 73, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !311, line: 59, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !311, line: 56, size: 128, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !379, file: !311, line: 57, baseType: !337, size: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !311, line: 58, baseType: !136, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !374, file: !311, line: 74, baseType: !136, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !374, file: !311, line: 76, baseType: !136, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !374, file: !311, line: 77, baseType: !136, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !311, line: 79, baseType: !136, size: 32, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !275, file: !86, line: 141, baseType: !161, size: 128, offset: 2944)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !275, file: !86, line: 142, baseType: !161, size: 128, offset: 3072)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !275, file: !86, line: 143, baseType: !161, size: 128, offset: 3200)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !275, file: !86, line: 144, baseType: !161, size: 128, offset: 3328)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !275, file: !86, line: 146, baseType: !136, size: 32, offset: 3456)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !275, file: !86, line: 147, baseType: !136, size: 32, offset: 3488)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !275, file: !86, line: 150, baseType: !394, size: 64, offset: 3520)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !86, line: 50, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !275, file: !86, line: 151, baseType: !398, size: 64, offset: 3584)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !275, file: !86, line: 152, baseType: !136, size: 32, offset: 3648)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !275, file: !86, line: 153, baseType: !136, size: 32, offset: 3680)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !275, file: !86, line: 156, baseType: !337, size: 96, offset: 3712)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !275, file: !86, line: 156, baseType: !337, size: 96, offset: 3808)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !275, file: !86, line: 156, baseType: !337, size: 96, offset: 3904)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !86, line: 157, baseType: !337, size: 96, offset: 4000)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !275, file: !86, line: 158, baseType: !337, size: 96, offset: 4096)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !275, file: !86, line: 159, baseType: !337, size: 96, offset: 4192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !275, file: !86, line: 160, baseType: !337, size: 96, offset: 4288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !275, file: !86, line: 160, baseType: !337, size: 96, offset: 4384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !275, file: !86, line: 161, baseType: !410, size: 128, offset: 4480)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !184)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !275, file: !86, line: 161, baseType: !410, size: 128, offset: 4608)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !275, file: !86, line: 162, baseType: !337, size: 96, offset: 4736)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !275, file: !86, line: 162, baseType: !337, size: 96, offset: 4832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !275, file: !86, line: 163, baseType: !302, size: 32, offset: 4928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !275, file: !86, line: 163, baseType: !302, size: 32, offset: 4960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !275, file: !86, line: 164, baseType: !417, size: 512, offset: 4992)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 512, elements: !418)
!418 = !{!185, !185}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !275, file: !86, line: 165, baseType: !417, size: 512, offset: 5504)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !275, file: !86, line: 166, baseType: !417, size: 512, offset: 6016)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !275, file: !86, line: 167, baseType: !417, size: 512, offset: 6528)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !275, file: !86, line: 176, baseType: !417, size: 512, offset: 7040)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !275, file: !86, line: 178, baseType: !7, size: 32, offset: 7552)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !86, line: 180, baseType: !134, size: 16, offset: 7584)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !275, file: !86, line: 181, baseType: !134, size: 16, offset: 7600)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !275, file: !86, line: 183, baseType: !134, size: 16, offset: 7616)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !275, file: !86, line: 183, baseType: !134, size: 16, offset: 7632)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !275, file: !86, line: 184, baseType: !134, size: 16, offset: 7648)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !275, file: !86, line: 184, baseType: !134, size: 16, offset: 7664)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !275, file: !86, line: 185, baseType: !134, size: 16, offset: 7680)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !275, file: !86, line: 186, baseType: !134, size: 16, offset: 7696)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !275, file: !86, line: 187, baseType: !134, size: 16, offset: 7712)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !275, file: !86, line: 188, baseType: !121, size: 8, offset: 7728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !275, file: !86, line: 189, baseType: !121, size: 8, offset: 7736)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !275, file: !86, line: 192, baseType: !136, size: 32, offset: 7744)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !275, file: !86, line: 192, baseType: !136, size: 32, offset: 7776)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !275, file: !86, line: 192, baseType: !136, size: 32, offset: 7808)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !275, file: !86, line: 192, baseType: !136, size: 32, offset: 7840)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !275, file: !86, line: 194, baseType: !136, size: 32, offset: 7872)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !275, file: !86, line: 202, baseType: !302, size: 32, offset: 7904)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !275, file: !86, line: 202, baseType: !302, size: 32, offset: 7936)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !275, file: !86, line: 202, baseType: !302, size: 32, offset: 7968)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !275, file: !86, line: 211, baseType: !302, size: 32, offset: 8000)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !275, file: !86, line: 212, baseType: !302, size: 32, offset: 8032)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !275, file: !86, line: 213, baseType: !302, size: 32, offset: 8064)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !275, file: !86, line: 214, baseType: !302, size: 32, offset: 8096)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !275, file: !86, line: 215, baseType: !302, size: 32, offset: 8128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !275, file: !86, line: 216, baseType: !302, size: 32, offset: 8160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !275, file: !86, line: 219, baseType: !302, size: 32, offset: 8192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !275, file: !86, line: 220, baseType: !302, size: 32, offset: 8224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !275, file: !86, line: 221, baseType: !302, size: 32, offset: 8256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !275, file: !86, line: 224, baseType: !453, size: 16, offset: 8288)
!453 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !275, file: !86, line: 224, baseType: !453, size: 16, offset: 8304)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !275, file: !86, line: 226, baseType: !134, size: 16, offset: 8320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !275, file: !86, line: 228, baseType: !121, size: 8, offset: 8336)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !275, file: !86, line: 229, baseType: !121, size: 8, offset: 8344)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !275, file: !86, line: 231, baseType: !134, size: 16, offset: 8352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !275, file: !86, line: 232, baseType: !121, size: 8, offset: 8368)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !275, file: !86, line: 233, baseType: !121, size: 8, offset: 8376)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !275, file: !86, line: 234, baseType: !302, size: 32, offset: 8384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !275, file: !86, line: 235, baseType: !302, size: 32, offset: 8416)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !275, file: !86, line: 237, baseType: !161, size: 128, offset: 8448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !275, file: !86, line: 238, baseType: !161, size: 128, offset: 8576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !275, file: !86, line: 239, baseType: !161, size: 128, offset: 8704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !275, file: !86, line: 240, baseType: !161, size: 128, offset: 8832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !275, file: !86, line: 242, baseType: !302, size: 32, offset: 8960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !275, file: !86, line: 244, baseType: !134, size: 16, offset: 8992)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !275, file: !86, line: 245, baseType: !453, size: 16, offset: 9008)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !275, file: !86, line: 246, baseType: !410, size: 128, offset: 9024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !275, file: !86, line: 248, baseType: !136, size: 32, offset: 9152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !275, file: !86, line: 249, baseType: !136, size: 32, offset: 9184)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !275, file: !86, line: 251, baseType: !474, size: 64, offset: 9216)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !86, line: 251, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !275, file: !86, line: 253, baseType: !121, size: 8, offset: 9280)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !275, file: !86, line: 254, baseType: !121, size: 8, offset: 9288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !275, file: !86, line: 255, baseType: !134, size: 16, offset: 9296)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !275, file: !86, line: 256, baseType: !337, size: 96, offset: 9312)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !275, file: !86, line: 258, baseType: !161, size: 128, offset: 9408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !275, file: !86, line: 259, baseType: !161, size: 128, offset: 9536)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !275, file: !86, line: 260, baseType: !161, size: 128, offset: 9664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !275, file: !86, line: 261, baseType: !161, size: 128, offset: 9792)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !275, file: !86, line: 263, baseType: !485, size: 64, offset: 9920)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !86, line: 52, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !275, file: !86, line: 264, baseType: !488, size: 64, offset: 9984)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !86, line: 53, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !275, file: !86, line: 265, baseType: !491, size: 64, offset: 10048)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !311, line: 46, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !275, file: !86, line: 267, baseType: !121, size: 8, offset: 10112)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !275, file: !86, line: 268, baseType: !121, size: 8, offset: 10120)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !275, file: !86, line: 269, baseType: !134, size: 16, offset: 10128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !275, file: !86, line: 270, baseType: !302, size: 32, offset: 10144)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !275, file: !86, line: 272, baseType: !498, size: 64, offset: 10176)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !86, line: 54, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !275, file: !86, line: 275, baseType: !501, size: 64, offset: 10240)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !86, line: 275, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !275, file: !86, line: 277, baseType: !504, size: 64, offset: 10304)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !86, line: 56, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !275, file: !86, line: 277, baseType: !504, size: 64, offset: 10368)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !275, file: !86, line: 278, baseType: !508, size: 64, offset: 10432)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !509, line: 27, baseType: !510)
!509 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !511, line: 45, baseType: !512)
!511 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!512 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !275, file: !86, line: 279, baseType: !508, size: 64, offset: 10496)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !275, file: !86, line: 280, baseType: !7, size: 32, offset: 10560)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !275, file: !86, line: 281, baseType: !7, size: 32, offset: 10592)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !275, file: !86, line: 283, baseType: !161, size: 128, offset: 10624)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !275, file: !86, line: 284, baseType: !161, size: 128, offset: 10752)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !275, file: !86, line: 285, baseType: !519, size: 64, offset: 10880)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !275, file: !86, line: 287, baseType: !521, size: 64, offset: 10944)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !86, line: 59, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !275, file: !86, line: 288, baseType: !524, size: 64, offset: 11008)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !86, line: 288, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !275, file: !86, line: 290, baseType: !527, size: 64, offset: 11072)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 64, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 2)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !275, file: !86, line: 291, baseType: !531, size: 64, offset: 11136)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !533, line: 65, baseType: !534)
!533 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !533, line: 50, size: 320, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !534, file: !533, line: 51, baseType: !264, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !534, file: !533, line: 53, baseType: !136, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !534, file: !533, line: 54, baseType: !136, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !534, file: !533, line: 55, baseType: !136, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !534, file: !533, line: 55, baseType: !136, size: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !534, file: !533, line: 56, baseType: !121, size: 8, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !534, file: !533, line: 56, baseType: !121, size: 8, offset: 200)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !534, file: !533, line: 57, baseType: !121, size: 8, offset: 208)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !534, file: !533, line: 57, baseType: !121, size: 8, offset: 216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !534, file: !533, line: 59, baseType: !134, size: 16, offset: 224)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !534, file: !533, line: 59, baseType: !134, size: 16, offset: 240)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !534, file: !533, line: 59, baseType: !134, size: 16, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !534, file: !533, line: 61, baseType: !134, size: 16, offset: 272)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !534, file: !533, line: 63, baseType: !136, size: 32, offset: 288)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !275, file: !86, line: 293, baseType: !161, size: 128, offset: 11200)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !275, file: !86, line: 294, baseType: !552, size: 64, offset: 11328)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !86, line: 113, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !86, line: 108, size: 256, elements: !555)
!555 = !{!556, !558, !559, !560, !561}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !86, line: 109, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !554, file: !86, line: 109, baseType: !557, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !554, file: !86, line: 110, baseType: !274, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !554, file: !86, line: 111, baseType: !136, size: 32, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !554, file: !86, line: 112, baseType: !302, size: 32, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !265, file: !266, line: 1221, baseType: !563, size: 64, offset: 1088)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !266, line: 52, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !265, file: !266, line: 1223, baseType: !264, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !265, file: !266, line: 1225, baseType: !161, size: 128, offset: 1216)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !265, file: !266, line: 1226, baseType: !568, size: 64, offset: 1344)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !266, line: 69, size: 320, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !266, line: 70, baseType: !568, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !569, file: !266, line: 70, baseType: !568, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !569, file: !266, line: 71, baseType: !7, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !569, file: !266, line: 71, baseType: !7, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !266, line: 72, baseType: !136, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !569, file: !266, line: 73, baseType: !134, size: 16, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !569, file: !266, line: 73, baseType: !134, size: 16, offset: 240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !569, file: !266, line: 74, baseType: !274, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !265, file: !266, line: 1227, baseType: !274, size: 64, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !265, file: !266, line: 1229, baseType: !337, size: 96, offset: 1472)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !265, file: !266, line: 1230, baseType: !337, size: 96, offset: 1568)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !265, file: !266, line: 1231, baseType: !337, size: 96, offset: 1664)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !265, file: !266, line: 1231, baseType: !337, size: 96, offset: 1760)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !265, file: !266, line: 1233, baseType: !7, size: 32, offset: 1856)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !265, file: !266, line: 1234, baseType: !136, size: 32, offset: 1888)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !265, file: !266, line: 1235, baseType: !7, size: 32, offset: 1920)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !266, line: 1237, baseType: !134, size: 16, offset: 1952)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !265, file: !266, line: 1239, baseType: !121, size: 8, offset: 1968)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !265, file: !266, line: 1240, baseType: !590, size: 8, offset: 1976)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 8, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 1)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !265, file: !266, line: 1242, baseType: !594, size: 64, offset: 1984)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !596, line: 328, size: 3456, elements: !597)
!596 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!597 = !{!598, !599, !600, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !630, !631, !632, !635, !640, !641, !644, !648, !652, !656, !660, !661, !662, !663}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !595, file: !596, line: 329, baseType: !102, size: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !595, file: !596, line: 330, baseType: !270, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !595, file: !596, line: 332, baseType: !601, size: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !596, line: 332, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !595, file: !596, line: 333, baseType: !151, size: 512, offset: 1088)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !595, file: !596, line: 335, baseType: !228, size: 64, offset: 1600)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !595, file: !596, line: 337, baseType: !368, size: 64, offset: 1664)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !595, file: !596, line: 338, baseType: !527, size: 64, offset: 1728)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !595, file: !596, line: 340, baseType: !161, size: 128, offset: 1792)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !595, file: !596, line: 340, baseType: !161, size: 128, offset: 1920)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !595, file: !596, line: 342, baseType: !136, size: 32, offset: 2048)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !595, file: !596, line: 342, baseType: !136, size: 32, offset: 2080)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !595, file: !596, line: 343, baseType: !136, size: 32, offset: 2112)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !596, line: 345, baseType: !136, size: 32, offset: 2144)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !595, file: !596, line: 346, baseType: !136, size: 32, offset: 2176)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !595, file: !596, line: 347, baseType: !134, size: 16, offset: 2208)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !595, file: !596, line: 348, baseType: !134, size: 16, offset: 2224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !595, file: !596, line: 349, baseType: !136, size: 32, offset: 2240)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !595, file: !596, line: 351, baseType: !136, size: 32, offset: 2272)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !595, file: !596, line: 353, baseType: !134, size: 16, offset: 2304)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !595, file: !596, line: 354, baseType: !134, size: 16, offset: 2320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !595, file: !596, line: 355, baseType: !136, size: 32, offset: 2336)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !595, file: !596, line: 357, baseType: !622, size: 128, offset: 2368)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !623, line: 95, baseType: !624)
!623 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !623, line: 92, size: 128, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !624, file: !623, line: 93, baseType: !302, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !624, file: !623, line: 93, baseType: !302, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !624, file: !623, line: 94, baseType: !302, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !624, file: !623, line: 94, baseType: !302, size: 32, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !595, file: !596, line: 363, baseType: !161, size: 128, offset: 2496)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !595, file: !596, line: 363, baseType: !161, size: 128, offset: 2624)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !595, file: !596, line: 368, baseType: !633, size: 64, offset: 2752)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !596, line: 48, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !595, file: !596, line: 372, baseType: !636, size: 32, offset: 2816)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !596, line: 274, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !596, line: 271, size: 32, elements: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !637, file: !596, line: 273, baseType: !7, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !595, file: !596, line: 373, baseType: !136, size: 32, offset: 2848)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !595, file: !596, line: 382, baseType: !642, size: 64, offset: 2880)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !596, line: 46, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !595, file: !596, line: 385, baseType: !645, size: 64, offset: 2944)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !100, !302}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !595, file: !596, line: 386, baseType: !649, size: 64, offset: 3008)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !100, !398}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !595, file: !596, line: 387, baseType: !653, size: 64, offset: 3072)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!136, !100}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !595, file: !596, line: 388, baseType: !657, size: 64, offset: 3136)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !100}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !595, file: !596, line: 389, baseType: !100, size: 64, offset: 3200)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !595, file: !596, line: 389, baseType: !100, size: 64, offset: 3264)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !595, file: !596, line: 389, baseType: !100, size: 64, offset: 3328)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !595, file: !596, line: 389, baseType: !100, size: 64, offset: 3392)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !265, file: !266, line: 1244, baseType: !665, size: 64, offset: 2048)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !667, line: 200, size: 17024, elements: !668)
!667 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!668 = !{!669, !670, !671, !672, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !666, file: !667, line: 201, baseType: !519, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !666, file: !667, line: 202, baseType: !161, size: 128, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !666, file: !667, line: 203, baseType: !161, size: 128, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !666, file: !667, line: 206, baseType: !673, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !667, line: 190, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !667, line: 126, size: 2816, elements: !676)
!676 = !{!677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !775, !776, !777, !778, !1056, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1084}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !667, line: 127, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !675, file: !667, line: 127, baseType: !678, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !675, file: !667, line: 128, baseType: !100, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !675, file: !667, line: 129, baseType: !100, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !667, line: 130, baseType: !151, size: 512, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !675, file: !667, line: 132, baseType: !136, size: 32, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !667, line: 132, baseType: !136, size: 32, offset: 800)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !675, file: !667, line: 133, baseType: !136, size: 32, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !675, file: !667, line: 134, baseType: !136, size: 32, offset: 864)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !675, file: !667, line: 134, baseType: !136, size: 32, offset: 896)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !675, file: !667, line: 134, baseType: !136, size: 32, offset: 928)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !675, file: !667, line: 135, baseType: !136, size: 32, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !675, file: !667, line: 135, baseType: !136, size: 32, offset: 992)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !675, file: !667, line: 136, baseType: !136, size: 32, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !675, file: !667, line: 136, baseType: !136, size: 32, offset: 1056)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !675, file: !667, line: 137, baseType: !136, size: 32, offset: 1088)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !675, file: !667, line: 137, baseType: !136, size: 32, offset: 1120)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !675, file: !667, line: 138, baseType: !302, size: 32, offset: 1152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !675, file: !667, line: 139, baseType: !302, size: 32, offset: 1184)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !675, file: !667, line: 139, baseType: !302, size: 32, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !675, file: !667, line: 141, baseType: !134, size: 16, offset: 1248)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !675, file: !667, line: 142, baseType: !134, size: 16, offset: 1264)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !675, file: !667, line: 143, baseType: !136, size: 32, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !675, file: !667, line: 144, baseType: !136, size: 32, offset: 1312)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !675, file: !667, line: 146, baseType: !703, size: 64, offset: 1344)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !667, line: 114, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !667, line: 99, size: 7232, elements: !706)
!706 = !{!707, !709, !710, !711, !712, !713, !714, !725, !729, !743, !752, !759, !769}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !667, line: 100, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !705, file: !667, line: 100, baseType: !708, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !705, file: !667, line: 101, baseType: !136, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !705, file: !667, line: 101, baseType: !136, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !705, file: !667, line: 102, baseType: !136, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !705, file: !667, line: 102, baseType: !136, size: 32, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !705, file: !667, line: 103, baseType: !715, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !667, line: 59, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !667, line: 56, size: 2112, elements: !718)
!718 = !{!719, !723, !724}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !667, line: 57, baseType: !720, size: 2048)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2048, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !717, file: !667, line: 58, baseType: !136, size: 32, offset: 2048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !717, file: !667, line: 58, baseType: !136, size: 32, offset: 2080)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !705, file: !667, line: 106, baseType: !726, size: 6144, offset: 320)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 6144, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 768)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !705, file: !667, line: 107, baseType: !730, size: 64, offset: 6464)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !667, line: 97, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !667, line: 83, size: 8320, elements: !733)
!733 = !{!734, !735, !736, !739, !740, !741, !742}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !732, file: !667, line: 84, baseType: !726, size: 6144)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !732, file: !667, line: 87, baseType: !720, size: 2048, offset: 6144)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !732, file: !667, line: 88, baseType: !737, size: 64, offset: 8192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !533, line: 41, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !732, file: !667, line: 90, baseType: !134, size: 16, offset: 8256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !732, file: !667, line: 92, baseType: !134, size: 16, offset: 8272)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !732, file: !667, line: 93, baseType: !134, size: 16, offset: 8288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !732, file: !667, line: 95, baseType: !134, size: 16, offset: 8304)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !705, file: !667, line: 108, baseType: !744, size: 64, offset: 6528)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !667, line: 66, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !667, line: 61, size: 128, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !746, file: !667, line: 62, baseType: !136, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !746, file: !667, line: 63, baseType: !136, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !746, file: !667, line: 64, baseType: !136, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !746, file: !667, line: 65, baseType: !136, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !705, file: !667, line: 109, baseType: !753, size: 64, offset: 6592)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !667, line: 71, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !667, line: 68, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !755, file: !667, line: 69, baseType: !136, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !755, file: !667, line: 70, baseType: !136, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !705, file: !667, line: 110, baseType: !760, size: 64, offset: 6656)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !667, line: 81, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !667, line: 73, size: 352, elements: !763)
!763 = !{!764, !765, !766, !767, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !762, file: !667, line: 74, baseType: !337, size: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !762, file: !667, line: 75, baseType: !337, size: 96, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !762, file: !667, line: 76, baseType: !337, size: 96, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !667, line: 77, baseType: !136, size: 32, offset: 288)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !762, file: !667, line: 78, baseType: !136, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !705, file: !667, line: 113, baseType: !770, size: 512, offset: 6720)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !771, line: 182, baseType: !772)
!771 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !771, line: 180, size: 512, elements: !773)
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !772, file: !771, line: 181, baseType: !151, size: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !675, file: !667, line: 148, baseType: !294, size: 64, offset: 1408)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !675, file: !667, line: 151, baseType: !264, size: 64, offset: 1472)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !675, file: !667, line: 152, baseType: !274, size: 64, offset: 1536)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !675, file: !667, line: 153, baseType: !779, size: 64, offset: 1600)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !781, line: 64, size: 19136, elements: !782)
!781 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!782 = !{!783, !784, !785, !786, !787, !788, !790, !791, !792, !793, !796, !797, !1042, !1043, !1051, !1052, !1053, !1054, !1055}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !780, file: !781, line: 65, baseType: !102, size: 960)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !780, file: !781, line: 66, baseType: !270, size: 64, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !781, line: 68, baseType: !120, size: 8192, offset: 1024)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !780, file: !781, line: 70, baseType: !136, size: 32, offset: 9216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !780, file: !781, line: 71, baseType: !136, size: 32, offset: 9248)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !780, file: !781, line: 72, baseType: !789, size: 64, offset: 9280)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !528)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !780, file: !781, line: 74, baseType: !302, size: 32, offset: 9344)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !780, file: !781, line: 74, baseType: !302, size: 32, offset: 9376)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !780, file: !781, line: 76, baseType: !737, size: 64, offset: 9408)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !780, file: !781, line: 77, baseType: !794, size: 64, offset: 9472)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !781, line: 77, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !780, file: !781, line: 78, baseType: !368, size: 64, offset: 9536)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !780, file: !781, line: 80, baseType: !798, size: 2624, offset: 9600)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !799, line: 340, size: 2624, elements: !800)
!799 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!800 = !{!801, !829, !847, !848, !849, !864, !922, !923, !1022, !1023, !1024, !1025, !1031}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !798, file: !799, line: 341, baseType: !802, size: 576)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !799, line: 251, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !799, line: 207, size: 576, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !803, file: !799, line: 208, baseType: !136, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !803, file: !799, line: 211, baseType: !134, size: 16, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !803, file: !799, line: 212, baseType: !134, size: 16, offset: 48)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !803, file: !799, line: 213, baseType: !302, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !803, file: !799, line: 214, baseType: !134, size: 16, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !803, file: !799, line: 215, baseType: !134, size: 16, offset: 112)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !803, file: !799, line: 216, baseType: !134, size: 16, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !803, file: !799, line: 217, baseType: !134, size: 16, offset: 144)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !803, file: !799, line: 218, baseType: !134, size: 16, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !803, file: !799, line: 219, baseType: !134, size: 16, offset: 176)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !803, file: !799, line: 220, baseType: !302, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !803, file: !799, line: 222, baseType: !134, size: 16, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !803, file: !799, line: 225, baseType: !134, size: 16, offset: 240)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !803, file: !799, line: 228, baseType: !136, size: 32, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !803, file: !799, line: 229, baseType: !136, size: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !803, file: !799, line: 233, baseType: !136, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !803, file: !799, line: 236, baseType: !134, size: 16, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !803, file: !799, line: 236, baseType: !134, size: 16, offset: 368)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !803, file: !799, line: 241, baseType: !302, size: 32, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !803, file: !799, line: 244, baseType: !136, size: 32, offset: 416)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !803, file: !799, line: 244, baseType: !136, size: 32, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !803, file: !799, line: 245, baseType: !302, size: 32, offset: 480)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !803, file: !799, line: 248, baseType: !302, size: 32, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !803, file: !799, line: 250, baseType: !136, size: 32, offset: 544)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !798, file: !799, line: 342, baseType: !830, size: 448, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !799, line: 79, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !799, line: 61, size: 448, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !831, file: !799, line: 62, baseType: !100, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !831, file: !799, line: 64, baseType: !134, size: 16, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !831, file: !799, line: 65, baseType: !134, size: 16, offset: 80)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !831, file: !799, line: 67, baseType: !302, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !831, file: !799, line: 68, baseType: !302, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !831, file: !799, line: 69, baseType: !302, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !831, file: !799, line: 70, baseType: !134, size: 16, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !831, file: !799, line: 71, baseType: !134, size: 16, offset: 208)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !831, file: !799, line: 72, baseType: !527, size: 64, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !831, file: !799, line: 75, baseType: !302, size: 32, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !831, file: !799, line: 75, baseType: !302, size: 32, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !831, file: !799, line: 75, baseType: !302, size: 32, offset: 352)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !831, file: !799, line: 78, baseType: !302, size: 32, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !831, file: !799, line: 78, baseType: !302, size: 32, offset: 416)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !798, file: !799, line: 343, baseType: !161, size: 128, offset: 1024)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !798, file: !799, line: 344, baseType: !161, size: 128, offset: 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !798, file: !799, line: 345, baseType: !850, size: 192, offset: 1280)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !799, line: 278, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !799, line: 270, size: 192, elements: !852)
!852 = !{!853, !854, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !851, file: !799, line: 271, baseType: !136, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !851, file: !799, line: 273, baseType: !302, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !851, file: !799, line: 275, baseType: !136, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !851, file: !799, line: 276, baseType: !136, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !851, file: !799, line: 277, baseType: !858, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !799, line: 55, size: 576, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !859, file: !799, line: 56, baseType: !136, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !859, file: !799, line: 57, baseType: !302, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !859, file: !799, line: 58, baseType: !417, size: 512, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !798, file: !799, line: 346, baseType: !865, size: 384, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !799, line: 268, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !799, line: 253, size: 384, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !916, !917, !918, !919, !920, !921}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !866, file: !799, line: 254, baseType: !136, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !866, file: !799, line: 255, baseType: !136, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !866, file: !799, line: 255, baseType: !136, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !866, file: !799, line: 258, baseType: !302, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !866, file: !799, line: 259, baseType: !873, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !799, line: 164, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !799, line: 108, size: 1664, elements: !876)
!876 = !{!877, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !875, file: !799, line: 109, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !875, file: !799, line: 109, baseType: !878, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !875, file: !799, line: 111, baseType: !151, size: 512, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !875, file: !799, line: 119, baseType: !527, size: 64, offset: 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !875, file: !799, line: 119, baseType: !527, size: 64, offset: 704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !875, file: !799, line: 125, baseType: !527, size: 64, offset: 768)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !875, file: !799, line: 125, baseType: !527, size: 64, offset: 832)
