; ModuleID = 'blender/source/blender/nodes/composite/nodes/node_composite_common.c'
source_filename = "blender/source/blender/nodes/composite/nodes/node_composite_common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 46, type: !24, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_cmp_group", scope: !3, file: !3, line: 44, type: !4, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !23)
!3 = !DIFile(filename: "blender/source/blender/nodes/composite/nodes/node_composite_common.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, globals: !22, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !{!0}
!23 = !{}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeType", file: !25, line: 221, baseType: !26)
!25 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !25, line: 144, size: 6016, elements: !27)
!27 = !{!28, !30, !31, !33, !38, !40, !41, !45, !46, !48, !49, !50, !51, !52, !53, !54, !55, !56, !2098, !2099, !2100, !2108, !2112, !2116, !2117, !2121, !2125, !2129, !2130, !2131, !2132, !2136, !2137, !2141, !2145, !2149, !2153, !2157, !2161, !2165, !2166, !2175, !2176, !2183, !2203}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !25, line: 145, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !26, file: !25, line: 145, baseType: !29, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !26, file: !25, line: 146, baseType: !32, size: 16, offset: 128)
!32 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !26, file: !25, line: 148, baseType: !34, size: 512, offset: 144)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !36)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!37}
!37 = !DISubrange(count: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !25, line: 149, baseType: !39, size: 32, offset: 672)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !26, file: !25, line: 151, baseType: !34, size: 512, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !26, file: !25, line: 152, baseType: !42, size: 2048, offset: 1216)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !26, file: !25, line: 153, baseType: !39, size: 32, offset: 3264)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !26, file: !25, line: 155, baseType: !47, size: 32, offset: 3296)
!47 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !26, file: !25, line: 155, baseType: !47, size: 32, offset: 3328)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !26, file: !25, line: 155, baseType: !47, size: 32, offset: 3360)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !26, file: !25, line: 156, baseType: !47, size: 32, offset: 3392)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !26, file: !25, line: 156, baseType: !47, size: 32, offset: 3424)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !26, file: !25, line: 156, baseType: !47, size: 32, offset: 3456)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !26, file: !25, line: 157, baseType: !32, size: 16, offset: 3488)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !26, file: !25, line: 157, baseType: !32, size: 16, offset: 3504)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !26, file: !25, line: 157, baseType: !32, size: 16, offset: 3520)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !26, file: !25, line: 160, baseType: !57, size: 64, offset: 3584)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !25, line: 109, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !25, line: 98, size: 1408, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !2097}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !25, line: 99, baseType: !39, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !59, file: !25, line: 99, baseType: !39, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !25, line: 100, baseType: !34, size: 512, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !59, file: !25, line: 101, baseType: !47, size: 32, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !59, file: !25, line: 101, baseType: !47, size: 32, offset: 608)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !59, file: !25, line: 101, baseType: !47, size: 32, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !59, file: !25, line: 101, baseType: !47, size: 32, offset: 672)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !59, file: !25, line: 102, baseType: !47, size: 32, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !59, file: !25, line: 102, baseType: !47, size: 32, offset: 736)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !25, line: 103, baseType: !39, size: 32, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !25, line: 104, baseType: !39, size: 32, offset: 800)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !59, file: !25, line: 107, baseType: !73, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !75, line: 87, size: 2816, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !78, !79, !80, !110, !111, !112, !113, !114, !115, !116, !117, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !75, line: 88, baseType: !73, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !74, file: !75, line: 88, baseType: !73, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !74, file: !75, line: 88, baseType: !73, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !74, file: !75, line: 90, baseType: !81, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !83, line: 75, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !83, line: 62, size: 1024, elements: !85)
!85 = !{!86, !88, !89, !90, !91, !92, !93, !94, !108, !109}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !83, line: 63, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !83, line: 63, baseType: !87, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !83, line: 64, baseType: !35, size: 8, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !84, file: !83, line: 64, baseType: !35, size: 8, offset: 136)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !84, file: !83, line: 65, baseType: !32, size: 16, offset: 144)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !83, line: 66, baseType: !34, size: 512, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !84, file: !83, line: 67, baseType: !39, size: 32, offset: 672)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !83, line: 69, baseType: !95, size: 256, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !83, line: 60, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !83, line: 48, size: 256, elements: !97)
!97 = !{!98, !99, !106, !107}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !96, file: !83, line: 49, baseType: !29, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !96, file: !83, line: 58, baseType: !100, size: 128, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !101, line: 71, baseType: !102)
!101 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !101, line: 69, size: 128, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !102, file: !101, line: 70, baseType: !29, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !102, file: !101, line: 70, baseType: !29, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !96, file: !83, line: 59, baseType: !39, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !96, file: !83, line: 59, baseType: !39, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, file: !83, line: 70, baseType: !39, size: 32, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !84, file: !83, line: 74, baseType: !39, size: 32, offset: 992)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !74, file: !75, line: 92, baseType: !34, size: 512, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !75, line: 94, baseType: !34, size: 512, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !74, file: !75, line: 99, baseType: !29, size: 64, offset: 1280)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 101, baseType: !32, size: 16, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !74, file: !75, line: 101, baseType: !32, size: 16, offset: 1360)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !74, file: !75, line: 102, baseType: !32, size: 16, offset: 1376)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !74, file: !75, line: 103, baseType: !32, size: 16, offset: 1392)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !74, file: !75, line: 104, baseType: !118, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !25, line: 114, size: 1600, elements: !120)
!120 = !{!121, !122, !144, !149, !153, !157, !2070, !2074, !2075, !2079, !2080, !2081, !2082}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !119, file: !25, line: 115, baseType: !34, size: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !119, file: !25, line: 117, baseType: !123, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126, !129, !131, !131, !142}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !128, line: 44, flags: DIFlagFwdDecl)
!128 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !25, line: 73, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !128, line: 55, size: 192, elements: !133)
!133 = !{!134, !138, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !132, file: !128, line: 58, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !128, line: 56, size: 64, elements: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !135, file: !128, line: 57, baseType: !29, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !128, line: 60, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !75, line: 335, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !132, file: !128, line: 61, baseType: !29, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !119, file: !25, line: 118, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !126, !131, !131, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !119, file: !25, line: 120, baseType: !150, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !126, !129, !131}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !119, file: !25, line: 121, baseType: !154, size: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !126, !131, !148}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !119, file: !25, line: 122, baseType: !158, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !161, !73, !139}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !75, line: 328, size: 3456, elements: !163)
!163 = !{!164, !200, !204, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1994, !1999, !2000, !2053, !2057, !2061, !2065, !2066, !2067, !2068, !2069}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !75, line: 329, baseType: !165, size: 960)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !83, line: 130, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !83, line: 117, size: 960, elements: !167)
!167 = !{!168, !169, !170, !172, !191, !195, !196, !197, !198, !199}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !83, line: 118, baseType: !29, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !83, line: 118, baseType: !29, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !166, file: !83, line: 119, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !166, file: !83, line: 120, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !83, line: 136, size: 17600, elements: !175)
!175 = !{!176, !177, !179, !182, !186, !187, !188}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !174, file: !83, line: 137, baseType: !165, size: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !174, file: !83, line: 138, baseType: !178, size: 64, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !174, file: !83, line: 139, baseType: !180, size: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !83, line: 43, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !83, line: 140, baseType: !183, size: 8192, offset: 1088)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 1024)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !174, file: !83, line: 141, baseType: !183, size: 8192, offset: 9280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !174, file: !83, line: 148, baseType: !173, size: 64, offset: 17472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !174, file: !83, line: 150, baseType: !189, size: 64, offset: 17536)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !83, line: 45, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !83, line: 121, baseType: !192, size: 528, offset: 256)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 528, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 66)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !83, line: 126, baseType: !32, size: 16, offset: 784)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !166, file: !83, line: 127, baseType: !39, size: 32, offset: 800)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !166, file: !83, line: 128, baseType: !39, size: 32, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !166, file: !83, line: 128, baseType: !39, size: 32, offset: 864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !166, file: !83, line: 129, baseType: !81, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !162, file: !75, line: 330, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !203, line: 45, flags: DIFlagFwdDecl)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !162, file: !75, line: 332, baseType: !205, size: 64, offset: 1024)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !25, line: 283, size: 4096, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !217, !285, !1896, !1902, !1908, !1912, !1913, !1914, !1915, !1934, !1935}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !206, file: !25, line: 284, baseType: !39, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !206, file: !25, line: 285, baseType: !34, size: 512, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !206, file: !25, line: 287, baseType: !34, size: 512, offset: 544)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !206, file: !25, line: 288, baseType: !42, size: 2048, offset: 1056)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !206, file: !25, line: 289, baseType: !39, size: 32, offset: 3104)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !206, file: !25, line: 292, baseType: !214, size: 64, offset: 3136)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !161}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !206, file: !25, line: 293, baseType: !218, size: 64, offset: 3200)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !161, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !75, line: 167, size: 3712, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !277, !278, !279, !280, !281, !282}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !75, line: 168, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !75, line: 168, baseType: !221, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !222, file: !75, line: 168, baseType: !221, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !222, file: !75, line: 170, baseType: !81, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !222, file: !75, line: 172, baseType: !229, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !222, file: !75, line: 173, baseType: !34, size: 512, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !75, line: 175, baseType: !34, size: 512, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !222, file: !75, line: 176, baseType: !39, size: 32, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !75, line: 177, baseType: !32, size: 16, offset: 1376)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !222, file: !75, line: 177, baseType: !32, size: 16, offset: 1392)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !222, file: !75, line: 178, baseType: !32, size: 16, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !222, file: !75, line: 178, baseType: !32, size: 16, offset: 1424)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !222, file: !75, line: 179, baseType: !32, size: 16, offset: 1440)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !222, file: !75, line: 179, baseType: !32, size: 16, offset: 1456)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !222, file: !75, line: 180, baseType: !32, size: 16, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !222, file: !75, line: 181, baseType: !32, size: 16, offset: 1488)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !222, file: !75, line: 182, baseType: !242, size: 96, offset: 1504)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 3)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !222, file: !75, line: 184, baseType: !100, size: 128, offset: 1600)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !222, file: !75, line: 184, baseType: !100, size: 128, offset: 1728)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !222, file: !75, line: 185, baseType: !221, size: 64, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !222, file: !75, line: 186, baseType: !171, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !222, file: !75, line: 187, baseType: !29, size: 64, offset: 1984)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !222, file: !75, line: 188, baseType: !221, size: 64, offset: 2048)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !222, file: !75, line: 189, baseType: !100, size: 128, offset: 2112)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !222, file: !75, line: 191, baseType: !47, size: 32, offset: 2240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !222, file: !75, line: 191, baseType: !47, size: 32, offset: 2272)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !222, file: !75, line: 192, baseType: !47, size: 32, offset: 2304)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !222, file: !75, line: 192, baseType: !47, size: 32, offset: 2336)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !222, file: !75, line: 193, baseType: !47, size: 32, offset: 2368)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !222, file: !75, line: 194, baseType: !47, size: 32, offset: 2400)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !222, file: !75, line: 194, baseType: !47, size: 32, offset: 2432)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !222, file: !75, line: 196, baseType: !39, size: 32, offset: 2464)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !222, file: !75, line: 198, baseType: !34, size: 512, offset: 2496)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !222, file: !75, line: 199, baseType: !32, size: 16, offset: 3008)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !222, file: !75, line: 199, baseType: !32, size: 16, offset: 3024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !222, file: !75, line: 200, baseType: !47, size: 32, offset: 3040)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !222, file: !75, line: 200, baseType: !47, size: 32, offset: 3072)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !222, file: !75, line: 202, baseType: !32, size: 16, offset: 3104)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !222, file: !75, line: 202, baseType: !32, size: 16, offset: 3120)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !222, file: !75, line: 203, baseType: !29, size: 64, offset: 3136)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !222, file: !75, line: 204, baseType: !269, size: 128, offset: 3200)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !270, line: 95, baseType: !271)
!270 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !270, line: 92, size: 128, elements: !272)
!272 = !{!273, !274, !275, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !271, file: !270, line: 93, baseType: !47, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !271, file: !270, line: 93, baseType: !47, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !271, file: !270, line: 94, baseType: !47, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !271, file: !270, line: 94, baseType: !47, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !222, file: !75, line: 205, baseType: !269, size: 128, offset: 3328)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !222, file: !75, line: 206, baseType: !269, size: 128, offset: 3456)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !222, file: !75, line: 215, baseType: !32, size: 16, offset: 3584)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !222, file: !75, line: 215, baseType: !32, size: 16, offset: 3600)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !222, file: !75, line: 216, baseType: !39, size: 32, offset: 3616)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !222, file: !75, line: 217, baseType: !283, size: 64, offset: 3648)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !75, line: 51, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !206, file: !25, line: 294, baseType: !286, size: 64, offset: 3264)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289, !29, !1892}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !291, line: 1216, size: 39680, elements: !292)
!291 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = !{!293, !294, !295, !298, !1071, !1072, !1073, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1100, !1312, !1315, !1557, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1579, !1580, !1581, !1582, !1583, !1591, !1657, !1664, !1667, !1674, !1879, !1885, !1886, !1887, !1888, !1889}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !290, file: !291, line: 1217, baseType: !165, size: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !290, file: !291, line: 1218, baseType: !201, size: 64, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !290, file: !291, line: 1220, baseType: !296, size: 64, offset: 1024)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !203, line: 49, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !290, file: !291, line: 1221, baseType: !299, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !301, line: 52, size: 4224, elements: !302)
!301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !375, !1066, !1067, !1068, !1069, !1070}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !300, file: !301, line: 53, baseType: !165, size: 960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !300, file: !301, line: 54, baseType: !201, size: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !300, file: !301, line: 56, baseType: !32, size: 16, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !300, file: !301, line: 56, baseType: !32, size: 16, offset: 1040)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !300, file: !301, line: 57, baseType: !32, size: 16, offset: 1056)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !300, file: !301, line: 57, baseType: !32, size: 16, offset: 1072)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !300, file: !301, line: 59, baseType: !47, size: 32, offset: 1088)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !300, file: !301, line: 59, baseType: !47, size: 32, offset: 1120)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !300, file: !301, line: 59, baseType: !47, size: 32, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !300, file: !301, line: 60, baseType: !47, size: 32, offset: 1184)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !300, file: !301, line: 60, baseType: !47, size: 32, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !300, file: !301, line: 60, baseType: !47, size: 32, offset: 1248)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !300, file: !301, line: 61, baseType: !47, size: 32, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !300, file: !301, line: 61, baseType: !47, size: 32, offset: 1312)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !300, file: !301, line: 61, baseType: !47, size: 32, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !300, file: !301, line: 68, baseType: !47, size: 32, offset: 1376)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !300, file: !301, line: 68, baseType: !47, size: 32, offset: 1408)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !300, file: !301, line: 68, baseType: !47, size: 32, offset: 1440)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !300, file: !301, line: 69, baseType: !47, size: 32, offset: 1472)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !300, file: !301, line: 69, baseType: !47, size: 32, offset: 1504)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !300, file: !301, line: 74, baseType: !47, size: 32, offset: 1536)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !300, file: !301, line: 79, baseType: !47, size: 32, offset: 1568)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !300, file: !301, line: 81, baseType: !32, size: 16, offset: 1600)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !300, file: !301, line: 91, baseType: !32, size: 16, offset: 1616)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !300, file: !301, line: 92, baseType: !32, size: 16, offset: 1632)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !300, file: !301, line: 93, baseType: !32, size: 16, offset: 1648)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !300, file: !301, line: 94, baseType: !32, size: 16, offset: 1664)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !300, file: !301, line: 94, baseType: !32, size: 16, offset: 1680)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !300, file: !301, line: 94, baseType: !32, size: 16, offset: 1696)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !300, file: !301, line: 94, baseType: !32, size: 16, offset: 1712)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !300, file: !301, line: 96, baseType: !47, size: 32, offset: 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !300, file: !301, line: 96, baseType: !47, size: 32, offset: 1760)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !300, file: !301, line: 96, baseType: !47, size: 32, offset: 1792)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !300, file: !301, line: 96, baseType: !47, size: 32, offset: 1824)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !300, file: !301, line: 98, baseType: !47, size: 32, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !300, file: !301, line: 98, baseType: !47, size: 32, offset: 1888)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !300, file: !301, line: 98, baseType: !47, size: 32, offset: 1920)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !300, file: !301, line: 98, baseType: !47, size: 32, offset: 1952)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !300, file: !301, line: 99, baseType: !47, size: 32, offset: 1984)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !300, file: !301, line: 99, baseType: !47, size: 32, offset: 2016)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !300, file: !301, line: 100, baseType: !47, size: 32, offset: 2048)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !300, file: !301, line: 100, baseType: !47, size: 32, offset: 2080)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !300, file: !301, line: 103, baseType: !32, size: 16, offset: 2112)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !300, file: !301, line: 103, baseType: !32, size: 16, offset: 2128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !300, file: !301, line: 103, baseType: !32, size: 16, offset: 2144)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !300, file: !301, line: 103, baseType: !32, size: 16, offset: 2160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !300, file: !301, line: 106, baseType: !47, size: 32, offset: 2176)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !300, file: !301, line: 106, baseType: !47, size: 32, offset: 2208)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !300, file: !301, line: 106, baseType: !47, size: 32, offset: 2240)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !300, file: !301, line: 106, baseType: !47, size: 32, offset: 2272)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !300, file: !301, line: 107, baseType: !32, size: 16, offset: 2304)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !300, file: !301, line: 107, baseType: !32, size: 16, offset: 2320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !300, file: !301, line: 107, baseType: !32, size: 16, offset: 2336)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !300, file: !301, line: 107, baseType: !32, size: 16, offset: 2352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !300, file: !301, line: 108, baseType: !47, size: 32, offset: 2368)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !300, file: !301, line: 108, baseType: !47, size: 32, offset: 2400)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !300, file: !301, line: 109, baseType: !47, size: 32, offset: 2432)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !300, file: !301, line: 109, baseType: !47, size: 32, offset: 2464)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !300, file: !301, line: 110, baseType: !47, size: 32, offset: 2496)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !300, file: !301, line: 110, baseType: !47, size: 32, offset: 2528)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !300, file: !301, line: 110, baseType: !47, size: 32, offset: 2560)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !300, file: !301, line: 111, baseType: !32, size: 16, offset: 2592)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !300, file: !301, line: 111, baseType: !32, size: 16, offset: 2608)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !300, file: !301, line: 112, baseType: !32, size: 16, offset: 2624)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !300, file: !301, line: 112, baseType: !32, size: 16, offset: 2640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !300, file: !301, line: 112, baseType: !32, size: 16, offset: 2656)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !300, file: !301, line: 115, baseType: !32, size: 16, offset: 2672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !300, file: !301, line: 118, baseType: !148, size: 64, offset: 2688)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !300, file: !301, line: 118, baseType: !148, size: 64, offset: 2752)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !300, file: !301, line: 121, baseType: !373, size: 64, offset: 2816)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !203, line: 46, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !300, file: !301, line: 122, baseType: !376, size: 1152, offset: 2880)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 1152, elements: !1064)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !203, line: 57, size: 2496, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !378, file: !203, line: 59, baseType: !32, size: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !378, file: !203, line: 59, baseType: !32, size: 16, offset: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !378, file: !203, line: 59, baseType: !32, size: 16, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !378, file: !203, line: 59, baseType: !32, size: 16, offset: 48)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !378, file: !203, line: 60, baseType: !296, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !378, file: !203, line: 61, baseType: !386, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !203, line: 202, size: 3328, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !458, !459, !460, !809, !810, !905, !906, !974, !995, !1003, !1004}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !387, file: !203, line: 203, baseType: !165, size: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !387, file: !203, line: 204, baseType: !201, size: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !387, file: !203, line: 206, baseType: !47, size: 32, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !387, file: !203, line: 206, baseType: !47, size: 32, offset: 1056)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !387, file: !203, line: 207, baseType: !47, size: 32, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !387, file: !203, line: 207, baseType: !47, size: 32, offset: 1120)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !387, file: !203, line: 207, baseType: !47, size: 32, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !387, file: !203, line: 207, baseType: !47, size: 32, offset: 1184)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !387, file: !203, line: 207, baseType: !47, size: 32, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !387, file: !203, line: 207, baseType: !47, size: 32, offset: 1248)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !387, file: !203, line: 208, baseType: !47, size: 32, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !387, file: !203, line: 208, baseType: !47, size: 32, offset: 1312)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !387, file: !203, line: 211, baseType: !47, size: 32, offset: 1344)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !387, file: !203, line: 211, baseType: !47, size: 32, offset: 1376)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !387, file: !203, line: 211, baseType: !47, size: 32, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !387, file: !203, line: 211, baseType: !47, size: 32, offset: 1440)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !387, file: !203, line: 211, baseType: !47, size: 32, offset: 1472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !387, file: !203, line: 214, baseType: !47, size: 32, offset: 1504)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !387, file: !203, line: 214, baseType: !47, size: 32, offset: 1536)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !387, file: !203, line: 217, baseType: !47, size: 32, offset: 1568)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !387, file: !203, line: 218, baseType: !47, size: 32, offset: 1600)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !387, file: !203, line: 219, baseType: !47, size: 32, offset: 1632)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !387, file: !203, line: 220, baseType: !47, size: 32, offset: 1664)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !387, file: !203, line: 221, baseType: !47, size: 32, offset: 1696)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !387, file: !203, line: 222, baseType: !32, size: 16, offset: 1728)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !387, file: !203, line: 222, baseType: !32, size: 16, offset: 1744)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !387, file: !203, line: 224, baseType: !32, size: 16, offset: 1760)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !387, file: !203, line: 224, baseType: !32, size: 16, offset: 1776)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !387, file: !203, line: 227, baseType: !32, size: 16, offset: 1792)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !387, file: !203, line: 227, baseType: !32, size: 16, offset: 1808)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !387, file: !203, line: 229, baseType: !32, size: 16, offset: 1824)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !203, line: 229, baseType: !32, size: 16, offset: 1840)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !387, file: !203, line: 230, baseType: !32, size: 16, offset: 1856)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !387, file: !203, line: 230, baseType: !32, size: 16, offset: 1872)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !387, file: !203, line: 232, baseType: !47, size: 32, offset: 1888)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !387, file: !203, line: 232, baseType: !47, size: 32, offset: 1920)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !387, file: !203, line: 232, baseType: !47, size: 32, offset: 1952)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !387, file: !203, line: 232, baseType: !47, size: 32, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !387, file: !203, line: 233, baseType: !39, size: 32, offset: 2016)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !387, file: !203, line: 234, baseType: !39, size: 32, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !387, file: !203, line: 235, baseType: !32, size: 16, offset: 2080)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !387, file: !203, line: 235, baseType: !32, size: 16, offset: 2096)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !387, file: !203, line: 236, baseType: !32, size: 16, offset: 2112)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !387, file: !203, line: 239, baseType: !32, size: 16, offset: 2128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !387, file: !203, line: 240, baseType: !39, size: 32, offset: 2144)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !387, file: !203, line: 241, baseType: !39, size: 32, offset: 2176)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !387, file: !203, line: 241, baseType: !39, size: 32, offset: 2208)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !387, file: !203, line: 241, baseType: !39, size: 32, offset: 2240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !387, file: !203, line: 243, baseType: !47, size: 32, offset: 2272)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !387, file: !203, line: 243, baseType: !47, size: 32, offset: 2304)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !387, file: !203, line: 244, baseType: !47, size: 32, offset: 2336)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !387, file: !203, line: 246, baseType: !441, size: 320, offset: 2368)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !442, line: 50, size: 320, elements: !443)
!442 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !441, file: !442, line: 51, baseType: !289, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !441, file: !442, line: 53, baseType: !39, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !441, file: !442, line: 54, baseType: !39, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !441, file: !442, line: 55, baseType: !39, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !441, file: !442, line: 55, baseType: !39, size: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !441, file: !442, line: 56, baseType: !35, size: 8, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !441, file: !442, line: 56, baseType: !35, size: 8, offset: 200)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !441, file: !442, line: 57, baseType: !35, size: 8, offset: 208)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !441, file: !442, line: 57, baseType: !35, size: 8, offset: 216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !441, file: !442, line: 59, baseType: !32, size: 16, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !441, file: !442, line: 59, baseType: !32, size: 16, offset: 240)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !441, file: !442, line: 59, baseType: !32, size: 16, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !441, file: !442, line: 61, baseType: !32, size: 16, offset: 272)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !441, file: !442, line: 63, baseType: !39, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !387, file: !203, line: 248, baseType: !161, size: 64, offset: 2688)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !387, file: !203, line: 249, baseType: !373, size: 64, offset: 2752)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !387, file: !203, line: 250, baseType: !461, size: 64, offset: 2816)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !442, line: 77, size: 15424, elements: !463)
!463 = !{!464, !465, !466, !469, !472, !475, !759, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !798, !799, !803}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !462, file: !442, line: 78, baseType: !165, size: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !462, file: !442, line: 80, baseType: !183, size: 8192, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !462, file: !442, line: 82, baseType: !467, size: 64, offset: 9152)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !442, line: 43, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !462, file: !442, line: 83, baseType: !470, size: 64, offset: 9216)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !83, line: 46, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !462, file: !442, line: 86, baseType: !473, size: 64, offset: 9280)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !442, line: 41, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !462, file: !442, line: 87, baseType: !476, size: 64, offset: 9344)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !478, line: 110, size: 1152, elements: !479)
!478 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !488, !489, !490, !498, !499, !500, !501, !503, !755, !756, !757, !758}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !478, line: 111, baseType: !476, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !477, file: !478, line: 111, baseType: !476, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !477, file: !478, line: 114, baseType: !39, size: 32, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !477, file: !478, line: 114, baseType: !39, size: 32, offset: 160)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !477, file: !478, line: 115, baseType: !32, size: 16, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !477, file: !478, line: 115, baseType: !32, size: 16, offset: 208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !477, file: !478, line: 118, baseType: !487, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !477, file: !478, line: 120, baseType: !148, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !477, file: !478, line: 122, baseType: !148, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !477, file: !478, line: 125, baseType: !491, size: 128, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !270, line: 89, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !270, line: 86, size: 128, elements: !493)
!493 = !{!494, !495, !496, !497}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !492, file: !270, line: 87, baseType: !39, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !492, file: !270, line: 87, baseType: !39, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !492, file: !270, line: 88, baseType: !39, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !492, file: !270, line: 88, baseType: !39, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !477, file: !478, line: 127, baseType: !39, size: 32, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !477, file: !478, line: 127, baseType: !39, size: 32, offset: 608)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !477, file: !478, line: 130, baseType: !100, size: 128, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !477, file: !478, line: 133, baseType: !502, size: 128, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !491)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !477, file: !478, line: 134, baseType: !504, size: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !478, line: 108, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !478, line: 85, size: 1600, elements: !508)
!508 = !{!509, !511, !512, !516, !517, !518, !519, !520, !521, !522, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !478, line: 86, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !507, file: !478, line: 86, baseType: !510, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !507, file: !478, line: 89, baseType: !513, size: 592, offset: 128)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 592, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 74)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !507, file: !478, line: 90, baseType: !10, size: 32, offset: 736)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !507, file: !478, line: 90, baseType: !10, size: 32, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !507, file: !478, line: 90, baseType: !10, size: 32, offset: 800)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !507, file: !478, line: 91, baseType: !39, size: 32, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !507, file: !478, line: 91, baseType: !39, size: 32, offset: 864)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !507, file: !478, line: 91, baseType: !39, size: 32, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !507, file: !478, line: 93, baseType: !523, size: 64, offset: 960)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !525, line: 93, size: 7552, elements: !526)
!525 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !575, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !644, !645, !646, !647, !648, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !690, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !736, !745}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !524, file: !525, line: 94, baseType: !165, size: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !524, file: !525, line: 95, baseType: !201, size: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !524, file: !525, line: 97, baseType: !32, size: 16, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !525, line: 97, baseType: !32, size: 16, offset: 1040)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !524, file: !525, line: 99, baseType: !47, size: 32, offset: 1056)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !524, file: !525, line: 99, baseType: !47, size: 32, offset: 1088)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !524, file: !525, line: 99, baseType: !47, size: 32, offset: 1120)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !524, file: !525, line: 100, baseType: !47, size: 32, offset: 1152)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !524, file: !525, line: 100, baseType: !47, size: 32, offset: 1184)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !524, file: !525, line: 100, baseType: !47, size: 32, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !524, file: !525, line: 101, baseType: !47, size: 32, offset: 1248)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !524, file: !525, line: 101, baseType: !47, size: 32, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !524, file: !525, line: 101, baseType: !47, size: 32, offset: 1312)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !524, file: !525, line: 102, baseType: !47, size: 32, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !524, file: !525, line: 102, baseType: !47, size: 32, offset: 1376)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !524, file: !525, line: 102, baseType: !47, size: 32, offset: 1408)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !524, file: !525, line: 103, baseType: !47, size: 32, offset: 1440)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !524, file: !525, line: 103, baseType: !47, size: 32, offset: 1472)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !524, file: !525, line: 103, baseType: !47, size: 32, offset: 1504)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !524, file: !525, line: 103, baseType: !47, size: 32, offset: 1536)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !524, file: !525, line: 103, baseType: !47, size: 32, offset: 1568)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !524, file: !525, line: 104, baseType: !47, size: 32, offset: 1600)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !524, file: !525, line: 104, baseType: !47, size: 32, offset: 1632)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !524, file: !525, line: 104, baseType: !47, size: 32, offset: 1664)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !524, file: !525, line: 104, baseType: !47, size: 32, offset: 1696)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !524, file: !525, line: 104, baseType: !47, size: 32, offset: 1728)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !524, file: !525, line: 105, baseType: !47, size: 32, offset: 1760)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !524, file: !525, line: 108, baseType: !555, size: 704, offset: 1792)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !525, line: 53, size: 704, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !555, file: !525, line: 54, baseType: !47, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !555, file: !525, line: 55, baseType: !47, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !555, file: !525, line: 56, baseType: !47, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !555, file: !525, line: 57, baseType: !47, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !555, file: !525, line: 59, baseType: !242, size: 96, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !555, file: !525, line: 60, baseType: !242, size: 96, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !555, file: !525, line: 61, baseType: !242, size: 96, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !555, file: !525, line: 63, baseType: !47, size: 32, offset: 416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !555, file: !525, line: 64, baseType: !47, size: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !555, file: !525, line: 65, baseType: !47, size: 32, offset: 480)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !555, file: !525, line: 67, baseType: !32, size: 16, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !555, file: !525, line: 68, baseType: !32, size: 16, offset: 528)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !555, file: !525, line: 69, baseType: !32, size: 16, offset: 544)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !555, file: !525, line: 70, baseType: !32, size: 16, offset: 560)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !555, file: !525, line: 72, baseType: !47, size: 32, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !555, file: !525, line: 73, baseType: !47, size: 32, offset: 608)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !555, file: !525, line: 74, baseType: !47, size: 32, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !555, file: !525, line: 75, baseType: !47, size: 32, offset: 672)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !524, file: !525, line: 109, baseType: !576, size: 128, offset: 2496)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !525, line: 79, size: 128, elements: !577)
!577 = !{!578, !579, !580, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !525, line: 80, baseType: !39, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !576, file: !525, line: 81, baseType: !39, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !576, file: !525, line: 82, baseType: !39, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !576, file: !525, line: 83, baseType: !39, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !524, file: !525, line: 111, baseType: !47, size: 32, offset: 2624)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !524, file: !525, line: 111, baseType: !47, size: 32, offset: 2656)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !524, file: !525, line: 112, baseType: !47, size: 32, offset: 2688)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !524, file: !525, line: 112, baseType: !47, size: 32, offset: 2720)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !524, file: !525, line: 113, baseType: !47, size: 32, offset: 2752)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !524, file: !525, line: 114, baseType: !47, size: 32, offset: 2784)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !524, file: !525, line: 114, baseType: !47, size: 32, offset: 2816)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !524, file: !525, line: 115, baseType: !32, size: 16, offset: 2848)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !524, file: !525, line: 115, baseType: !32, size: 16, offset: 2864)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !524, file: !525, line: 116, baseType: !32, size: 16, offset: 2880)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !524, file: !525, line: 117, baseType: !35, size: 8, offset: 2896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !524, file: !525, line: 117, baseType: !35, size: 8, offset: 2904)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !524, file: !525, line: 119, baseType: !47, size: 32, offset: 2912)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !524, file: !525, line: 119, baseType: !47, size: 32, offset: 2944)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !524, file: !525, line: 120, baseType: !32, size: 16, offset: 2976)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !524, file: !525, line: 120, baseType: !32, size: 16, offset: 2992)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !524, file: !525, line: 121, baseType: !47, size: 32, offset: 3008)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !524, file: !525, line: 121, baseType: !47, size: 32, offset: 3040)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !524, file: !525, line: 122, baseType: !47, size: 32, offset: 3072)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !524, file: !525, line: 123, baseType: !47, size: 32, offset: 3104)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !524, file: !525, line: 124, baseType: !32, size: 16, offset: 3136)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !524, file: !525, line: 125, baseType: !32, size: 16, offset: 3152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !524, file: !525, line: 127, baseType: !39, size: 32, offset: 3168)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !524, file: !525, line: 127, baseType: !39, size: 32, offset: 3200)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !524, file: !525, line: 128, baseType: !39, size: 32, offset: 3232)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !524, file: !525, line: 128, baseType: !39, size: 32, offset: 3264)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !524, file: !525, line: 129, baseType: !32, size: 16, offset: 3296)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !524, file: !525, line: 129, baseType: !32, size: 16, offset: 3312)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !524, file: !525, line: 129, baseType: !32, size: 16, offset: 3328)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !524, file: !525, line: 129, baseType: !32, size: 16, offset: 3344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !524, file: !525, line: 130, baseType: !47, size: 32, offset: 3360)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !524, file: !525, line: 130, baseType: !47, size: 32, offset: 3392)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !524, file: !525, line: 130, baseType: !47, size: 32, offset: 3424)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !524, file: !525, line: 130, baseType: !47, size: 32, offset: 3456)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !524, file: !525, line: 131, baseType: !47, size: 32, offset: 3488)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !524, file: !525, line: 131, baseType: !47, size: 32, offset: 3520)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !524, file: !525, line: 131, baseType: !47, size: 32, offset: 3552)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !524, file: !525, line: 131, baseType: !47, size: 32, offset: 3584)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !524, file: !525, line: 132, baseType: !47, size: 32, offset: 3616)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !524, file: !525, line: 132, baseType: !47, size: 32, offset: 3648)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !524, file: !525, line: 133, baseType: !34, size: 512, offset: 3680)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !524, file: !525, line: 135, baseType: !47, size: 32, offset: 4192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !524, file: !525, line: 136, baseType: !47, size: 32, offset: 4224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !524, file: !525, line: 137, baseType: !47, size: 32, offset: 4256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !524, file: !525, line: 138, baseType: !39, size: 32, offset: 4288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !524, file: !525, line: 141, baseType: !35, size: 8, offset: 4320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !524, file: !525, line: 141, baseType: !35, size: 8, offset: 4328)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !524, file: !525, line: 141, baseType: !35, size: 8, offset: 4336)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !524, file: !525, line: 141, baseType: !35, size: 8, offset: 4344)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !524, file: !525, line: 142, baseType: !32, size: 16, offset: 4352)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !524, file: !525, line: 142, baseType: !32, size: 16, offset: 4368)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !524, file: !525, line: 142, baseType: !32, size: 16, offset: 4384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !524, file: !525, line: 145, baseType: !35, size: 8, offset: 4400)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !524, file: !525, line: 145, baseType: !35, size: 8, offset: 4408)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !524, file: !525, line: 148, baseType: !32, size: 16, offset: 4416)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !524, file: !525, line: 148, baseType: !32, size: 16, offset: 4432)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !524, file: !525, line: 149, baseType: !47, size: 32, offset: 4448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !524, file: !525, line: 149, baseType: !47, size: 32, offset: 4480)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !524, file: !525, line: 152, baseType: !641, size: 128, offset: 4512)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 128, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 4)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !524, file: !525, line: 153, baseType: !47, size: 32, offset: 4640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !524, file: !525, line: 154, baseType: !47, size: 32, offset: 4672)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !524, file: !525, line: 157, baseType: !32, size: 16, offset: 4704)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !524, file: !525, line: 157, baseType: !32, size: 16, offset: 4720)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !524, file: !525, line: 160, baseType: !649, size: 64, offset: 4736)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !203, line: 113, size: 6208, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !661}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !650, file: !203, line: 114, baseType: !32, size: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !650, file: !203, line: 114, baseType: !32, size: 16, offset: 16)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !650, file: !203, line: 115, baseType: !35, size: 8, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !650, file: !203, line: 115, baseType: !35, size: 8, offset: 40)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !650, file: !203, line: 116, baseType: !35, size: 8, offset: 48)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !650, file: !203, line: 117, baseType: !658, size: 8, offset: 56)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 1)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !650, file: !203, line: 119, baseType: !662, size: 6144, offset: 64)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 6144, elements: !672)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !203, line: 109, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !203, line: 106, size: 192, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !664, file: !203, line: 107, baseType: !47, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !664, file: !203, line: 107, baseType: !47, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !664, file: !203, line: 107, baseType: !47, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !664, file: !203, line: 107, baseType: !47, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !664, file: !203, line: 107, baseType: !47, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !664, file: !203, line: 108, baseType: !39, size: 32, offset: 160)
!672 = !{!673}
!673 = !DISubrange(count: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !524, file: !525, line: 161, baseType: !649, size: 64, offset: 4800)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !524, file: !525, line: 162, baseType: !35, size: 8, offset: 4864)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !524, file: !525, line: 162, baseType: !35, size: 8, offset: 4872)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !524, file: !525, line: 163, baseType: !35, size: 8, offset: 4880)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !524, file: !525, line: 163, baseType: !35, size: 8, offset: 4888)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !524, file: !525, line: 164, baseType: !32, size: 16, offset: 4896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !524, file: !525, line: 164, baseType: !32, size: 16, offset: 4912)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !524, file: !525, line: 165, baseType: !47, size: 32, offset: 4928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !524, file: !525, line: 165, baseType: !47, size: 32, offset: 4960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !524, file: !525, line: 167, baseType: !376, size: 1152, offset: 4992)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !524, file: !525, line: 168, baseType: !161, size: 64, offset: 6144)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !524, file: !525, line: 169, baseType: !373, size: 64, offset: 6208)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !524, file: !525, line: 170, baseType: !687, size: 64, offset: 6272)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !689, line: 43, flags: DIFlagFwdDecl)
!689 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!690 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !524, file: !525, line: 171, baseType: !691, size: 64, offset: 6336)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !83, line: 159, size: 448, elements: !693)
!693 = !{!694, !698, !699, !701, !702, !705}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !692, file: !83, line: 161, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 2)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !692, file: !83, line: 162, baseType: !695, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !692, file: !83, line: 163, baseType: !700, size: 32, offset: 128)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !696)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !692, file: !83, line: 164, baseType: !700, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !692, file: !83, line: 165, baseType: !703, size: 128, offset: 192)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 128, elements: !696)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !692, file: !83, line: 166, baseType: !706, size: 128, offset: 320)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 128, elements: !696)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !524, file: !525, line: 174, baseType: !47, size: 32, offset: 6400)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !524, file: !525, line: 174, baseType: !47, size: 32, offset: 6432)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reflect", scope: !524, file: !525, line: 174, baseType: !47, size: 32, offset: 6464)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fhdist", scope: !524, file: !525, line: 175, baseType: !47, size: 32, offset: 6496)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "xyfrict", scope: !524, file: !525, line: 175, baseType: !47, size: 32, offset: 6528)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dynamode", scope: !524, file: !525, line: 176, baseType: !32, size: 16, offset: 6560)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !524, file: !525, line: 176, baseType: !32, size: 16, offset: 6576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sss_radius", scope: !524, file: !525, line: 179, baseType: !242, size: 96, offset: 6592)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sss_col", scope: !524, file: !525, line: 179, baseType: !242, size: 96, offset: 6688)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sss_error", scope: !524, file: !525, line: 180, baseType: !47, size: 32, offset: 6784)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sss_scale", scope: !524, file: !525, line: 180, baseType: !47, size: 32, offset: 6816)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sss_ior", scope: !524, file: !525, line: 180, baseType: !47, size: 32, offset: 6848)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sss_colfac", scope: !524, file: !525, line: 181, baseType: !47, size: 32, offset: 6880)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sss_texfac", scope: !524, file: !525, line: 181, baseType: !47, size: 32, offset: 6912)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sss_front", scope: !524, file: !525, line: 182, baseType: !47, size: 32, offset: 6944)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sss_back", scope: !524, file: !525, line: 182, baseType: !47, size: 32, offset: 6976)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sss_flag", scope: !524, file: !525, line: 183, baseType: !32, size: 16, offset: 7008)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sss_preset", scope: !524, file: !525, line: 183, baseType: !32, size: 16, offset: 7024)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "mapto_textured", scope: !524, file: !525, line: 185, baseType: !39, size: 32, offset: 7040)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "shadowonly_flag", scope: !524, file: !525, line: 186, baseType: !32, size: 16, offset: 7072)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !524, file: !525, line: 187, baseType: !32, size: 16, offset: 7088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "line_col", scope: !524, file: !525, line: 190, baseType: !641, size: 128, offset: 7104)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "line_priority", scope: !524, file: !525, line: 191, baseType: !32, size: 16, offset: 7232)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vcol_alpha", scope: !524, file: !525, line: 192, baseType: !32, size: 16, offset: 7248)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "paint_active_slot", scope: !524, file: !525, line: 195, baseType: !32, size: 16, offset: 7264)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "paint_clone_slot", scope: !524, file: !525, line: 196, baseType: !32, size: 16, offset: 7280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tot_slots", scope: !524, file: !525, line: 197, baseType: !32, size: 16, offset: 7296)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !524, file: !525, line: 198, baseType: !735, size: 48, offset: 7312)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 48, elements: !243)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "texpaintslot", scope: !524, file: !525, line: 200, baseType: !737, size: 64, offset: 7360)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TexPaintSlot", file: !525, line: 86, size: 192, elements: !739)
!739 = !{!740, !741, !743, !744}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !738, file: !525, line: 87, baseType: !461, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !738, file: !525, line: 88, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !738, file: !525, line: 89, baseType: !39, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !738, file: !525, line: 90, baseType: !39, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gpumaterial", scope: !524, file: !525, line: 202, baseType: !100, size: 128, offset: 7424)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !507, file: !478, line: 94, baseType: !687, size: 64, offset: 1024)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !507, file: !478, line: 96, baseType: !148, size: 64, offset: 1088)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !507, file: !478, line: 97, baseType: !148, size: 64, offset: 1152)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !507, file: !478, line: 98, baseType: !148, size: 64, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !507, file: !478, line: 99, baseType: !487, size: 64, offset: 1280)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !507, file: !478, line: 101, baseType: !39, size: 32, offset: 1344)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !507, file: !478, line: 101, baseType: !39, size: 32, offset: 1376)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !507, file: !478, line: 104, baseType: !29, size: 64, offset: 1408)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !507, file: !478, line: 106, baseType: !100, size: 128, offset: 1472)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !477, file: !478, line: 137, baseType: !39, size: 32, offset: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !477, file: !478, line: 140, baseType: !39, size: 32, offset: 992)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !477, file: !478, line: 143, baseType: !39, size: 32, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !477, file: !478, line: 146, baseType: !742, size: 64, offset: 1088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !462, file: !442, line: 89, baseType: !760, size: 512, offset: 9408)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 512, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 8)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !462, file: !442, line: 90, baseType: !32, size: 16, offset: 9920)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !462, file: !442, line: 90, baseType: !32, size: 16, offset: 9936)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !462, file: !442, line: 92, baseType: !32, size: 16, offset: 9952)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !462, file: !442, line: 92, baseType: !32, size: 16, offset: 9968)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !462, file: !442, line: 93, baseType: !32, size: 16, offset: 9984)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !442, line: 93, baseType: !32, size: 16, offset: 10000)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !462, file: !442, line: 94, baseType: !39, size: 32, offset: 10016)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !462, file: !442, line: 97, baseType: !32, size: 16, offset: 10048)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !462, file: !442, line: 97, baseType: !32, size: 16, offset: 10064)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !462, file: !442, line: 98, baseType: !32, size: 16, offset: 10080)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !462, file: !442, line: 98, baseType: !32, size: 16, offset: 10096)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !462, file: !442, line: 99, baseType: !32, size: 16, offset: 10112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !462, file: !442, line: 99, baseType: !32, size: 16, offset: 10128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !462, file: !442, line: 100, baseType: !10, size: 32, offset: 10144)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !462, file: !442, line: 101, baseType: !704, size: 64, offset: 10176)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !462, file: !442, line: 103, baseType: !189, size: 64, offset: 10240)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !462, file: !442, line: 104, baseType: !691, size: 64, offset: 10304)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !462, file: !442, line: 107, baseType: !47, size: 32, offset: 10368)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !462, file: !442, line: 108, baseType: !39, size: 32, offset: 10400)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !462, file: !442, line: 109, baseType: !32, size: 16, offset: 10432)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !462, file: !442, line: 110, baseType: !32, size: 16, offset: 10448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !462, file: !442, line: 113, baseType: !39, size: 32, offset: 10464)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !462, file: !442, line: 113, baseType: !39, size: 32, offset: 10496)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !462, file: !442, line: 114, baseType: !35, size: 8, offset: 10528)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !462, file: !442, line: 114, baseType: !35, size: 8, offset: 10536)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !462, file: !442, line: 115, baseType: !32, size: 16, offset: 10544)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !462, file: !442, line: 116, baseType: !641, size: 128, offset: 10560)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !462, file: !442, line: 119, baseType: !47, size: 32, offset: 10688)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !462, file: !442, line: 119, baseType: !47, size: 32, offset: 10720)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !462, file: !442, line: 122, baseType: !793, size: 512, offset: 10752)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !794, line: 182, baseType: !795)
!794 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !794, line: 180, size: 512, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !794, line: 181, baseType: !34, size: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !462, file: !442, line: 123, baseType: !35, size: 8, offset: 11264)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !462, file: !442, line: 125, baseType: !800, size: 56, offset: 11272)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 56, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 7)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !462, file: !442, line: 126, baseType: !804, size: 4096, offset: 11328)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 4096, elements: !761)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !442, line: 69, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !442, line: 67, size: 512, elements: !807)
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !806, file: !442, line: 68, baseType: !34, size: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !387, file: !203, line: 251, baseType: !649, size: 64, offset: 2880)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !387, file: !203, line: 252, baseType: !811, size: 64, offset: 2944)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !203, line: 122, size: 1600, elements: !813)
!813 = !{!814, !815, !816, !887, !890, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !812, file: !203, line: 123, baseType: !296, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !812, file: !203, line: 124, baseType: !461, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !812, file: !203, line: 125, baseType: !817, size: 384, offset: 128)
