; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_edgeloop.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_edgeloop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !43, line: 57, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!45 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 260, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 249, baseType: !5, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 83, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!80 = !{!81, !82, !83, !105, !166, !174, !175, !179, !183, !185, !150, !116}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdgeLoopStore", file: !1, line: 47, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdgeLoopStore", file: !1, line: 40, size: 512, elements: !86)
!86 = !{!87, !89, !90, !97, !99, !100, !104}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !1, line: 41, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !1, line: 41, baseType: !88, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !85, file: !1, line: 42, baseType: !91, size: 128, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !92, line: 71, baseType: !93)
!92 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !92, line: 69, size: 128, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !93, file: !92, line: 70, baseType: !81, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !93, file: !92, line: 70, baseType: !81, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !85, file: !1, line: 43, baseType: !98, size: 32, offset: 256)
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, file: !1, line: 44, baseType: !98, size: 32, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !85, file: !1, line: 46, baseType: !101, size: 96, offset: 320)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 96, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 3)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !85, file: !1, line: 46, baseType: !101, size: 96, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !60, line: 103, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !60, line: 90, size: 448, elements: !108)
!108 = !{!109, !119, !125, !126, !127}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !107, file: !60, line: 91, baseType: !110, size: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !60, line: 82, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !60, line: 64, size: 128, elements: !112)
!112 = !{!113, !114, !115, !117, !118}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !60, line: 65, baseType: !81, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !111, file: !60, line: 66, baseType: !98, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !111, file: !60, line: 73, baseType: !116, size: 8, offset: 96)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !111, file: !60, line: 74, baseType: !116, size: 8, offset: 104)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !111, file: !60, line: 80, baseType: !116, size: 8, offset: 112)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !107, file: !60, line: 92, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !60, line: 180, size: 16, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !121, file: !60, line: 181, baseType: !124, size: 16)
!124 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !107, file: !60, line: 94, baseType: !101, size: 96, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !107, file: !60, line: 95, baseType: !101, size: 96, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !107, file: !60, line: 102, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !60, line: 110, size: 640, elements: !130)
!130 = !{!131, !132, !133, !135, !136, !159, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !60, line: 111, baseType: !110, size: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !129, file: !60, line: 112, baseType: !120, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !129, file: !60, line: 114, baseType: !134, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !129, file: !60, line: 114, baseType: !134, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !129, file: !60, line: 118, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !60, line: 125, size: 576, elements: !139)
!139 = !{!140, !141, !142, !143, !155, !156, !157, !158}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !138, file: !60, line: 126, baseType: !110, size: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !138, file: !60, line: 129, baseType: !134, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !138, file: !60, line: 130, baseType: !128, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !138, file: !60, line: 131, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !60, line: 164, size: 448, elements: !146)
!146 = !{!147, !148, !149, !152, !153, !154}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !145, file: !60, line: 165, baseType: !110, size: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !145, file: !60, line: 166, baseType: !120, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !145, file: !60, line: 172, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !60, line: 140, baseType: !138)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !145, file: !60, line: 174, baseType: !98, size: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !145, file: !60, line: 175, baseType: !101, size: 96, offset: 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !145, file: !60, line: 176, baseType: !124, size: 16, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !138, file: !60, line: 135, baseType: !137, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !138, file: !60, line: 135, baseType: !137, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !60, line: 139, baseType: !137, size: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !60, line: 139, baseType: !137, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !129, file: !60, line: 122, baseType: !160, size: 128, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !60, line: 108, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !60, line: 106, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !60, line: 107, baseType: !128, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !60, line: 107, baseType: !128, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !129, file: !60, line: 122, baseType: !160, size: 128, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkData", file: !92, line: 66, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkData", file: !92, line: 63, size: 192, elements: !169)
!169 = !{!170, !172, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !92, line: 64, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !168, file: !92, line: 64, baseType: !171, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !92, line: 65, baseType: !81, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !81}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!81, !81}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !60, line: 123, baseType: !129)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !60, line: 178, baseType: !145)
!187 = !{i32 7, !"Dwarf Version", i32 4}
!188 = !{i32 2, !"Debug Info Version", i32 3}
!189 = !{i32 1, !"wchar_size", i32 4}
!190 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!191 = distinct !DISubprogram(name: "BM_mesh_edgeloops_find", scope: !1, file: !1, line: 128, type: !192, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !334)
!192 = !DISubroutineType(types: !193)
!193 = !{!98, !194, !329, !330, !81}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !60, line: 246, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !60, line: 186, size: 8064, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !210, !211, !212, !213, !215, !217, !219, !220, !221, !222, !223, !224, !225, !226, !278, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !196, file: !60, line: 187, baseType: !98, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !196, file: !60, line: 187, baseType: !98, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !196, file: !60, line: 187, baseType: !98, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !196, file: !60, line: 187, baseType: !98, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !196, file: !60, line: 188, baseType: !98, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !196, file: !60, line: 188, baseType: !98, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !196, file: !60, line: 188, baseType: !98, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !196, file: !60, line: 193, baseType: !116, size: 8, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !196, file: !60, line: 197, baseType: !116, size: 8, offset: 232)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !196, file: !60, line: 201, baseType: !208, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !76, line: 44, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !196, file: !60, line: 201, baseType: !208, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !196, file: !60, line: 201, baseType: !208, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !196, file: !60, line: 201, baseType: !208, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !196, file: !60, line: 208, baseType: !214, size: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !196, file: !60, line: 209, baseType: !216, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !196, file: !60, line: 210, baseType: !218, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !196, file: !60, line: 213, baseType: !98, size: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !196, file: !60, line: 214, baseType: !98, size: 32, offset: 736)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !196, file: !60, line: 215, baseType: !98, size: 32, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !196, file: !60, line: 218, baseType: !208, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !196, file: !60, line: 218, baseType: !208, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !196, file: !60, line: 218, baseType: !208, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !196, file: !60, line: 220, baseType: !98, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !196, file: !60, line: 221, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !229)
!229 = !{!230, !266, !267, !271, !274, !275, !277}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !228, file: !4, line: 191, baseType: !231, size: 5120)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 5120, elements: !264)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !233)
!233 = !{!234, !237, !239, !249, !250}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !232, file: !4, line: 148, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !232, file: !4, line: 149, baseType: !238, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !232, file: !4, line: 150, baseType: !240, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !242)
!242 = !{!243, !245, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !241, file: !4, line: 139, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !241, file: !4, line: 140, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !241, file: !4, line: 141, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !232, file: !4, line: 152, baseType: !98, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !4, line: 162, baseType: !251, size: 128, offset: 192)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !4, line: 155, size: 128, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !259}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !251, file: !4, line: 156, baseType: !98, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !251, file: !4, line: 157, baseType: !82, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !251, file: !4, line: 158, baseType: !81, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !251, file: !4, line: 159, baseType: !101, size: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !251, file: !4, line: 160, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !251, file: !4, line: 161, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !262, line: 48, baseType: !263)
!262 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !262, line: 48, flags: DIFlagFwdDecl)
!264 = !{!265}
!265 = !DISubrange(count: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !228, file: !4, line: 192, baseType: !231, size: 5120, offset: 5120)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !228, file: !4, line: 193, baseType: !268, size: 64, offset: 10240)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !194, !227}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !228, file: !4, line: 194, baseType: !272, size: 64, offset: 10304)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !4, line: 195, baseType: !98, size: 32, offset: 10368)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !228, file: !4, line: 196, baseType: !276, size: 32, offset: 10400)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !228, file: !4, line: 197, baseType: !98, size: 32, offset: 10432)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !196, file: !60, line: 223, baseType: !279, size: 1600, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !280, line: 73, baseType: !281)
!280 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !280, line: 64, size: 1600, elements: !282)
!282 = !{!283, !301, !305, !306, !307, !308, !309}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !281, file: !280, line: 65, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !280, line: 53, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !280, line: 42, size: 832, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !300}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !280, line: 43, baseType: !98, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !286, file: !280, line: 44, baseType: !98, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !280, line: 45, baseType: !98, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !286, file: !280, line: 46, baseType: !98, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !286, file: !280, line: 47, baseType: !98, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !286, file: !280, line: 48, baseType: !98, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !286, file: !280, line: 49, baseType: !98, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !286, file: !280, line: 50, baseType: !98, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !286, file: !280, line: 51, baseType: !297, size: 512, offset: 256)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 512, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !280, line: 52, baseType: !81, size: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !281, file: !280, line: 66, baseType: !302, size: 1312, offset: 64)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 1312, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 41)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !281, file: !280, line: 69, baseType: !98, size: 32, offset: 1376)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !281, file: !280, line: 69, baseType: !98, size: 32, offset: 1408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !281, file: !280, line: 70, baseType: !98, size: 32, offset: 1440)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !281, file: !280, line: 71, baseType: !208, size: 64, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !281, file: !280, line: 72, baseType: !310, size: 64, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !280, line: 59, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !280, line: 57, size: 8192, elements: !313)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !312, file: !280, line: 58, baseType: !315, size: 8192)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 8192, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 1024)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !196, file: !60, line: 223, baseType: !279, size: 1600, offset: 2752)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !196, file: !60, line: 223, baseType: !279, size: 1600, offset: 4352)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !196, file: !60, line: 223, baseType: !279, size: 1600, offset: 5952)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !196, file: !60, line: 233, baseType: !124, size: 16, offset: 7552)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !196, file: !60, line: 236, baseType: !98, size: 32, offset: 7584)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !196, file: !60, line: 238, baseType: !98, size: 32, offset: 7616)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !196, file: !60, line: 238, baseType: !98, size: 32, offset: 7648)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !196, file: !60, line: 239, baseType: !91, size: 128, offset: 7680)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !196, file: !60, line: 241, baseType: !185, size: 64, offset: 7808)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !196, file: !60, line: 243, baseType: !91, size: 128, offset: 7872)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !196, file: !60, line: 245, baseType: !81, size: 64, offset: 8000)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !183, !81}
!333 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!334 = !{}
!335 = !DILocalVariable(name: "bm", arg: 1, scope: !191, file: !1, line: 128, type: !194)
!336 = !DILocation(line: 128, column: 35, scope: !191)
!337 = !DILocalVariable(name: "r_eloops", arg: 2, scope: !191, file: !1, line: 128, type: !329)
!338 = !DILocation(line: 128, column: 49, scope: !191)
!339 = !DILocalVariable(name: "test_fn", arg: 3, scope: !191, file: !1, line: 129, type: !330)
!340 = !DILocation(line: 129, column: 35, scope: !191)
!341 = !DILocalVariable(name: "user_data", arg: 4, scope: !191, file: !1, line: 129, type: !81)
!342 = !DILocation(line: 129, column: 78, scope: !191)
!343 = !DILocalVariable(name: "iter", scope: !191, file: !1, line: 131, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !346)
!346 = !{!347, !426, !427, !428, !429}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !43, line: 179, baseType: !348, size: 320)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !43, line: 166, size: 320, elements: !349)
!349 = !{!350, !364, !370, !378, !386, !392, !398, !404, !408, !414, !420}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !348, file: !43, line: 167, baseType: !351, size: 192)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !351, file: !43, line: 114, baseType: !354, size: 192)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !76, line: 80, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !76, line: 76, size: 192, elements: !356)
!356 = !{!357, !360, !363}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !355, file: !76, line: 77, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !76, line: 47, baseType: !209)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !355, file: !76, line: 78, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !76, line: 45, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !355, file: !76, line: 79, baseType: !5, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !348, file: !43, line: 169, baseType: !365, size: 192)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !365, file: !43, line: 117, baseType: !105, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !365, file: !43, line: 118, baseType: !183, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !365, file: !43, line: 118, baseType: !183, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !348, file: !43, line: 170, baseType: !371, size: 320)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !372)
!372 = !{!373, !374, !375, !376, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !371, file: !43, line: 121, baseType: !105, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !371, file: !43, line: 122, baseType: !150, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !371, file: !43, line: 122, baseType: !150, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !371, file: !43, line: 123, baseType: !183, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !371, file: !43, line: 123, baseType: !183, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !348, file: !43, line: 171, baseType: !379, size: 320)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !380)
!380 = !{!381, !382, !383, !384, !385}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !379, file: !43, line: 126, baseType: !105, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !379, file: !43, line: 127, baseType: !150, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !379, file: !43, line: 127, baseType: !150, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !379, file: !43, line: 128, baseType: !183, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !379, file: !43, line: 128, baseType: !183, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !348, file: !43, line: 172, baseType: !387, size: 192)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !388)
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !387, file: !43, line: 131, baseType: !183, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !387, file: !43, line: 132, baseType: !150, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !387, file: !43, line: 132, baseType: !150, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !348, file: !43, line: 173, baseType: !393, size: 192)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !393, file: !43, line: 135, baseType: !150, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !393, file: !43, line: 136, baseType: !150, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !393, file: !43, line: 136, baseType: !150, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !348, file: !43, line: 174, baseType: !399, size: 192)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !399, file: !43, line: 139, baseType: !183, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !399, file: !43, line: 140, baseType: !150, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !399, file: !43, line: 140, baseType: !150, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !348, file: !43, line: 175, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !405, file: !43, line: 143, baseType: !183, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !348, file: !43, line: 176, baseType: !409, size: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !409, file: !43, line: 146, baseType: !185, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !409, file: !43, line: 147, baseType: !150, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !409, file: !43, line: 147, baseType: !150, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !348, file: !43, line: 177, baseType: !415, size: 192)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !415, file: !43, line: 150, baseType: !185, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !415, file: !43, line: 151, baseType: !150, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !415, file: !43, line: 151, baseType: !150, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !348, file: !43, line: 178, baseType: !421, size: 192)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !421, file: !43, line: 154, baseType: !185, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !421, file: !43, line: 155, baseType: !150, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !421, file: !43, line: 155, baseType: !150, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !345, file: !43, line: 181, baseType: !175, size: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !345, file: !43, line: 182, baseType: !179, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !345, file: !43, line: 184, baseType: !98, size: 32, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !345, file: !43, line: 185, baseType: !116, size: 8, offset: 480)
!430 = !DILocation(line: 131, column: 9, scope: !191)
!431 = !DILocalVariable(name: "e", scope: !191, file: !1, line: 132, type: !183)
!432 = !DILocation(line: 132, column: 10, scope: !191)
!433 = !DILocalVariable(name: "v", scope: !191, file: !1, line: 133, type: !105)
!434 = !DILocation(line: 133, column: 10, scope: !191)
!435 = !DILocalVariable(name: "count", scope: !191, file: !1, line: 134, type: !98)
!436 = !DILocation(line: 134, column: 6, scope: !191)
!437 = !DILocation(line: 136, column: 2, scope: !438)
!438 = distinct !DILexicalBlock(scope: !191, file: !1, line: 136, column: 2)
!439 = !DILocation(line: 136, column: 2, scope: !440)
!440 = distinct !DILexicalBlock(scope: !438, file: !1, line: 136, column: 2)
!441 = !DILocation(line: 137, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !440, file: !1, line: 136, column: 48)
!443 = !DILocation(line: 138, column: 2, scope: !442)
!444 = distinct !{!444, !437, !445}
!445 = !DILocation(line: 138, column: 2, scope: !438)
!446 = !DILocation(line: 141, column: 2, scope: !447)
!447 = distinct !DILexicalBlock(scope: !191, file: !1, line: 141, column: 2)
!448 = !DILocation(line: 141, column: 2, scope: !449)
!449 = distinct !DILexicalBlock(scope: !447, file: !1, line: 141, column: 2)
!450 = !DILocation(line: 142, column: 7, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 142, column: 7)
!452 = distinct !DILexicalBlock(scope: !449, file: !1, line: 141, column: 48)
!453 = !DILocation(line: 142, column: 15, scope: !451)
!454 = !DILocation(line: 142, column: 18, scope: !451)
!455 = !DILocation(line: 142, column: 7, scope: !452)
!456 = !DILocation(line: 143, column: 4, scope: !457)
!457 = distinct !DILexicalBlock(scope: !451, file: !1, line: 142, column: 30)
!458 = !DILocation(line: 144, column: 4, scope: !457)
!459 = !DILocation(line: 145, column: 4, scope: !457)
!460 = !DILocation(line: 146, column: 3, scope: !457)
!461 = !DILocation(line: 148, column: 4, scope: !462)
!462 = distinct !DILexicalBlock(scope: !451, file: !1, line: 147, column: 8)
!463 = !DILocation(line: 150, column: 2, scope: !452)
!464 = distinct !{!464, !446, !465}
!465 = !DILocation(line: 150, column: 2, scope: !447)
!466 = !DILocation(line: 152, column: 2, scope: !467)
!467 = distinct !DILexicalBlock(scope: !191, file: !1, line: 152, column: 2)
!468 = !DILocation(line: 152, column: 2, scope: !469)
!469 = distinct !DILexicalBlock(scope: !467, file: !1, line: 152, column: 2)
!470 = !DILocation(line: 153, column: 7, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !1, line: 153, column: 7)
!472 = distinct !DILexicalBlock(scope: !469, file: !1, line: 152, column: 48)
!473 = !DILocation(line: 153, column: 7, scope: !472)
!474 = !DILocalVariable(name: "el_store", scope: !475, file: !1, line: 154, type: !83)
!475 = distinct !DILexicalBlock(scope: !471, file: !1, line: 153, column: 51)
!476 = !DILocation(line: 154, column: 21, scope: !475)
!477 = !DILocation(line: 154, column: 32, scope: !475)
!478 = !DILocation(line: 157, column: 22, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !1, line: 157, column: 8)
!480 = !DILocation(line: 157, column: 32, scope: !479)
!481 = !DILocation(line: 157, column: 35, scope: !479)
!482 = !DILocation(line: 157, column: 39, scope: !479)
!483 = !DILocation(line: 157, column: 42, scope: !479)
!484 = !DILocation(line: 157, column: 8, scope: !479)
!485 = !DILocation(line: 157, column: 50, scope: !479)
!486 = !DILocation(line: 158, column: 22, scope: !479)
!487 = !DILocation(line: 158, column: 32, scope: !479)
!488 = !DILocation(line: 158, column: 35, scope: !479)
!489 = !DILocation(line: 158, column: 39, scope: !479)
!490 = !DILocation(line: 158, column: 42, scope: !479)
!491 = !DILocation(line: 158, column: 8, scope: !479)
!492 = !DILocation(line: 158, column: 50, scope: !479)
!493 = !DILocation(line: 159, column: 8, scope: !479)
!494 = !DILocation(line: 159, column: 18, scope: !479)
!495 = !DILocation(line: 159, column: 22, scope: !479)
!496 = !DILocation(line: 157, column: 8, scope: !475)
!497 = !DILocation(line: 161, column: 17, scope: !498)
!498 = distinct !DILexicalBlock(scope: !479, file: !1, line: 160, column: 4)
!499 = !DILocation(line: 161, column: 27, scope: !498)
!500 = !DILocation(line: 161, column: 5, scope: !498)
!501 = !DILocation(line: 162, column: 5, scope: !498)
!502 = !DILocation(line: 163, column: 10, scope: !498)
!503 = !DILocation(line: 164, column: 4, scope: !498)
!504 = !DILocation(line: 166, column: 22, scope: !505)
!505 = distinct !DILexicalBlock(scope: !479, file: !1, line: 165, column: 9)
!506 = !DILocation(line: 166, column: 5, scope: !505)
!507 = !DILocation(line: 168, column: 3, scope: !475)
!508 = !DILocation(line: 169, column: 2, scope: !472)
!509 = distinct !{!509, !466, !510}
!510 = !DILocation(line: 169, column: 2, scope: !467)
!511 = !DILocation(line: 170, column: 9, scope: !191)
!512 = !DILocation(line: 170, column: 2, scope: !191)
!513 = distinct !DISubprogram(name: "BM_iter_new", scope: !514, file: !514, line: 172, type: !515, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!514 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!515 = !DISubroutineType(types: !516)
!516 = !{!81, !517, !194, !236, !81}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!518 = !DILocalVariable(name: "iter", arg: 1, scope: !513, file: !514, line: 172, type: !517)
!519 = !DILocation(line: 172, column: 38, scope: !513)
!520 = !DILocalVariable(name: "bm", arg: 2, scope: !513, file: !514, line: 172, type: !194)
!521 = !DILocation(line: 172, column: 51, scope: !513)
!522 = !DILocalVariable(name: "itype", arg: 3, scope: !513, file: !514, line: 172, type: !236)
!523 = !DILocation(line: 172, column: 66, scope: !513)
!524 = !DILocalVariable(name: "data", arg: 4, scope: !513, file: !514, line: 172, type: !81)
!525 = !DILocation(line: 172, column: 79, scope: !513)
!526 = !DILocation(line: 174, column: 6, scope: !527)
!527 = distinct !DILexicalBlock(scope: !513, file: !514, line: 174, column: 6)
!528 = !DILocation(line: 174, column: 6, scope: !513)
!529 = !DILocation(line: 175, column: 23, scope: !530)
!530 = distinct !DILexicalBlock(scope: !527, file: !514, line: 174, column: 51)
!531 = !DILocation(line: 175, column: 10, scope: !530)
!532 = !DILocation(line: 175, column: 3, scope: !530)
!533 = !DILocation(line: 178, column: 3, scope: !534)
!534 = distinct !DILexicalBlock(scope: !527, file: !514, line: 177, column: 7)
!535 = !DILocation(line: 180, column: 1, scope: !513)
!536 = distinct !DISubprogram(name: "_bm_elem_flag_disable", scope: !537, file: !537, line: 57, type: !538, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!537 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DISubroutineType(types: !539)
!539 = !{null, !540, !236}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!541 = !DILocalVariable(name: "head", arg: 1, scope: !536, file: !537, line: 57, type: !540)
!542 = !DILocation(line: 57, column: 49, scope: !536)
!543 = !DILocalVariable(name: "hflag", arg: 2, scope: !536, file: !537, line: 57, type: !236)
!544 = !DILocation(line: 57, column: 66, scope: !536)
!545 = !DILocation(line: 59, column: 24, scope: !536)
!546 = !DILocation(line: 59, column: 23, scope: !536)
!547 = !DILocation(line: 59, column: 17, scope: !536)
!548 = !DILocation(line: 59, column: 2, scope: !536)
!549 = !DILocation(line: 59, column: 8, scope: !536)
!550 = !DILocation(line: 59, column: 14, scope: !536)
!551 = !DILocation(line: 60, column: 1, scope: !536)
!552 = distinct !DISubprogram(name: "BM_iter_step", scope: !514, file: !514, line: 40, type: !553, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!553 = !DISubroutineType(types: !554)
!554 = !{!81, !517}
!555 = !DILocalVariable(name: "iter", arg: 1, scope: !552, file: !514, line: 40, type: !517)
!556 = !DILocation(line: 40, column: 39, scope: !552)
!557 = !DILocation(line: 42, column: 9, scope: !552)
!558 = !DILocation(line: 42, column: 15, scope: !552)
!559 = !DILocation(line: 42, column: 20, scope: !552)
!560 = !DILocation(line: 42, column: 2, scope: !552)
!561 = distinct !DISubprogram(name: "_bm_elem_flag_enable", scope: !537, file: !537, line: 52, type: !538, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!562 = !DILocalVariable(name: "head", arg: 1, scope: !561, file: !537, line: 52, type: !540)
!563 = !DILocation(line: 52, column: 48, scope: !561)
!564 = !DILocalVariable(name: "hflag", arg: 2, scope: !561, file: !537, line: 52, type: !236)
!565 = !DILocation(line: 52, column: 65, scope: !561)
!566 = !DILocation(line: 54, column: 17, scope: !561)
!567 = !DILocation(line: 54, column: 2, scope: !561)
!568 = !DILocation(line: 54, column: 8, scope: !561)
!569 = !DILocation(line: 54, column: 14, scope: !561)
!570 = !DILocation(line: 55, column: 1, scope: !561)
!571 = distinct !DISubprogram(name: "_bm_elem_flag_test", scope: !537, file: !537, line: 42, type: !572, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!572 = !DISubroutineType(types: !573)
!573 = !{!116, !574, !236}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!576 = !DILocalVariable(name: "head", arg: 1, scope: !571, file: !537, line: 42, type: !574)
!577 = !DILocation(line: 42, column: 52, scope: !571)
!578 = !DILocalVariable(name: "hflag", arg: 2, scope: !571, file: !537, line: 42, type: !236)
!579 = !DILocation(line: 42, column: 69, scope: !571)
!580 = !DILocation(line: 44, column: 9, scope: !571)
!581 = !DILocation(line: 44, column: 15, scope: !571)
!582 = !DILocation(line: 44, column: 23, scope: !571)
!583 = !DILocation(line: 44, column: 21, scope: !571)
!584 = !DILocation(line: 44, column: 2, scope: !571)
!585 = distinct !DISubprogram(name: "bm_loop_build", scope: !1, file: !1, line: 79, type: !586, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!586 = !DISubroutineType(types: !587)
!587 = !{!333, !83, !105, !105, !98}
!588 = !DILocalVariable(name: "el_store", arg: 1, scope: !585, file: !1, line: 79, type: !83)
!589 = !DILocation(line: 79, column: 44, scope: !585)
!590 = !DILocalVariable(name: "v_prev", arg: 2, scope: !585, file: !1, line: 79, type: !105)
!591 = !DILocation(line: 79, column: 62, scope: !585)
!592 = !DILocalVariable(name: "v", arg: 3, scope: !585, file: !1, line: 79, type: !105)
!593 = !DILocation(line: 79, column: 78, scope: !585)
!594 = !DILocalVariable(name: "dir", arg: 4, scope: !585, file: !1, line: 79, type: !98)
!595 = !DILocation(line: 79, column: 85, scope: !585)
!596 = !DILocalVariable(name: "add_fn", scope: !585, file: !1, line: 81, type: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !329, !81}
!600 = !DILocation(line: 81, column: 9, scope: !585)
!601 = !DILocation(line: 81, column: 39, scope: !585)
!602 = !DILocation(line: 81, column: 43, scope: !585)
!603 = !DILocalVariable(name: "e_next", scope: !585, file: !1, line: 82, type: !183)
!604 = !DILocation(line: 82, column: 10, scope: !585)
!605 = !DILocalVariable(name: "v_next", scope: !585, file: !1, line: 83, type: !105)
!606 = !DILocation(line: 83, column: 10, scope: !585)
!607 = !DILocalVariable(name: "v_first", scope: !585, file: !1, line: 84, type: !105)
!608 = !DILocation(line: 84, column: 10, scope: !585)
!609 = !DILocation(line: 84, column: 20, scope: !585)
!610 = !DILocation(line: 88, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !585, file: !1, line: 88, column: 6)
!612 = !DILocation(line: 88, column: 6, scope: !585)
!613 = !DILocation(line: 89, column: 3, scope: !614)
!614 = distinct !DILexicalBlock(scope: !611, file: !1, line: 88, column: 51)
!615 = !DILocation(line: 92, column: 2, scope: !585)
!616 = !DILocation(line: 92, column: 9, scope: !585)
!617 = !DILocalVariable(name: "node", scope: !618, file: !1, line: 93, type: !166)
!618 = distinct !DILexicalBlock(scope: !585, file: !1, line: 92, column: 12)
!619 = !DILocation(line: 93, column: 13, scope: !618)
!620 = !DILocation(line: 93, column: 20, scope: !618)
!621 = !DILocalVariable(name: "count", scope: !618, file: !1, line: 94, type: !98)
!622 = !DILocation(line: 94, column: 7, scope: !618)
!623 = !DILocation(line: 95, column: 16, scope: !618)
!624 = !DILocation(line: 95, column: 3, scope: !618)
!625 = !DILocation(line: 95, column: 9, scope: !618)
!626 = !DILocation(line: 95, column: 14, scope: !618)
!627 = !DILocation(line: 96, column: 3, scope: !618)
!628 = !DILocation(line: 96, column: 11, scope: !618)
!629 = !DILocation(line: 96, column: 21, scope: !618)
!630 = !DILocation(line: 96, column: 28, scope: !618)
!631 = !DILocation(line: 97, column: 3, scope: !618)
!632 = !DILocation(line: 97, column: 13, scope: !618)
!633 = !DILocation(line: 97, column: 16, scope: !618)
!634 = !DILocation(line: 98, column: 3, scope: !618)
!635 = !DILocation(line: 100, column: 29, scope: !618)
!636 = !DILocation(line: 100, column: 32, scope: !618)
!637 = !DILocation(line: 100, column: 11, scope: !618)
!638 = !DILocation(line: 100, column: 9, scope: !618)
!639 = !DILocation(line: 101, column: 7, scope: !640)
!640 = distinct !DILexicalBlock(scope: !618, file: !1, line: 101, column: 7)
!641 = !DILocation(line: 101, column: 13, scope: !640)
!642 = !DILocation(line: 101, column: 7, scope: !618)
!643 = !DILocation(line: 102, column: 32, scope: !644)
!644 = distinct !DILexicalBlock(scope: !640, file: !1, line: 101, column: 19)
!645 = !DILocation(line: 102, column: 40, scope: !644)
!646 = !DILocation(line: 102, column: 13, scope: !644)
!647 = !DILocation(line: 102, column: 11, scope: !644)
!648 = !DILocation(line: 103, column: 4, scope: !644)
!649 = !DILocation(line: 104, column: 8, scope: !650)
!650 = distinct !DILexicalBlock(scope: !644, file: !1, line: 104, column: 8)
!651 = !DILocation(line: 104, column: 8, scope: !644)
!652 = !DILocation(line: 105, column: 5, scope: !653)
!653 = distinct !DILexicalBlock(scope: !650, file: !1, line: 104, column: 37)
!654 = !DILocation(line: 105, column: 15, scope: !653)
!655 = !DILocation(line: 105, column: 20, scope: !653)
!656 = !DILocation(line: 106, column: 12, scope: !653)
!657 = !DILocation(line: 107, column: 4, scope: !653)
!658 = !DILocation(line: 108, column: 3, scope: !644)
!659 = !DILocation(line: 109, column: 12, scope: !660)
!660 = distinct !DILexicalBlock(scope: !640, file: !1, line: 109, column: 12)
!661 = !DILocation(line: 109, column: 18, scope: !660)
!662 = !DILocation(line: 109, column: 12, scope: !640)
!663 = !DILocation(line: 111, column: 11, scope: !664)
!664 = distinct !DILexicalBlock(scope: !660, file: !1, line: 109, column: 24)
!665 = !DILocation(line: 112, column: 3, scope: !664)
!666 = !DILocation(line: 114, column: 11, scope: !667)
!667 = distinct !DILexicalBlock(scope: !660, file: !1, line: 113, column: 8)
!668 = !DILocation(line: 115, column: 4, scope: !667)
!669 = !DILocation(line: 118, column: 12, scope: !618)
!670 = !DILocation(line: 118, column: 10, scope: !618)
!671 = !DILocation(line: 119, column: 7, scope: !618)
!672 = !DILocation(line: 119, column: 5, scope: !618)
!673 = distinct !{!673, !615, !674}
!674 = !DILocation(line: 120, column: 2, scope: !585)
!675 = !DILocation(line: 122, column: 2, scope: !585)
!676 = !DILocation(line: 123, column: 1, scope: !585)
!677 = distinct !DISubprogram(name: "BM_edgeloop_free", scope: !1, file: !1, line: 489, type: !678, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !334)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !83}
!680 = !DILocalVariable(name: "el_store", arg: 1, scope: !677, file: !1, line: 489, type: !83)
!681 = !DILocation(line: 489, column: 40, scope: !677)
!682 = !DILocation(line: 491, column: 17, scope: !677)
!683 = !DILocation(line: 491, column: 27, scope: !677)
!684 = !DILocation(line: 491, column: 2, scope: !677)
!685 = !DILocation(line: 492, column: 2, scope: !677)
!686 = !DILocation(line: 492, column: 12, scope: !677)
!687 = !DILocation(line: 493, column: 1, scope: !677)
!688 = distinct !DISubprogram(name: "BM_mesh_edgeloops_find_path", scope: !1, file: !1, line: 259, type: !689, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !334)
!689 = !DISubroutineType(types: !690)
!690 = !{!333, !194, !329, !330, !81, !105, !105}
!691 = !DILocalVariable(name: "bm", arg: 1, scope: !688, file: !1, line: 259, type: !194)
!692 = !DILocation(line: 259, column: 41, scope: !688)
!693 = !DILocalVariable(name: "r_eloops", arg: 2, scope: !688, file: !1, line: 259, type: !329)
!694 = !DILocation(line: 259, column: 55, scope: !688)
!695 = !DILocalVariable(name: "test_fn", arg: 3, scope: !688, file: !1, line: 260, type: !330)
!696 = !DILocation(line: 260, column: 41, scope: !688)
!697 = !DILocalVariable(name: "user_data", arg: 4, scope: !688, file: !1, line: 260, type: !81)
!698 = !DILocation(line: 260, column: 84, scope: !688)
!699 = !DILocalVariable(name: "v_src", arg: 5, scope: !688, file: !1, line: 261, type: !105)
!700 = !DILocation(line: 261, column: 42, scope: !688)
!701 = !DILocalVariable(name: "v_dst", arg: 6, scope: !688, file: !1, line: 261, type: !105)
!702 = !DILocation(line: 261, column: 57, scope: !688)
!703 = !DILocalVariable(name: "iter", scope: !688, file: !1, line: 263, type: !344)
!704 = !DILocation(line: 263, column: 9, scope: !688)
!705 = !DILocalVariable(name: "e", scope: !688, file: !1, line: 264, type: !183)
!706 = !DILocation(line: 264, column: 10, scope: !688)
!707 = !DILocalVariable(name: "v", scope: !708, file: !1, line: 269, type: !105)
!708 = distinct !DILexicalBlock(scope: !688, file: !1, line: 268, column: 2)
!709 = !DILocation(line: 269, column: 11, scope: !708)
!710 = !DILocation(line: 270, column: 3, scope: !711)
!711 = distinct !DILexicalBlock(scope: !708, file: !1, line: 270, column: 3)
!712 = !DILocation(line: 270, column: 3, scope: !713)
!713 = distinct !DILexicalBlock(scope: !711, file: !1, line: 270, column: 3)
!714 = !DILocation(line: 271, column: 4, scope: !715)
!715 = distinct !DILexicalBlock(scope: !713, file: !1, line: 270, column: 49)
!716 = !DILocation(line: 272, column: 3, scope: !715)
!717 = distinct !{!717, !710, !718}
!718 = !DILocation(line: 272, column: 3, scope: !711)
!719 = !DILocation(line: 274, column: 2, scope: !688)
!720 = !DILocation(line: 274, column: 6, scope: !688)
!721 = !DILocation(line: 274, column: 23, scope: !688)
!722 = !DILocation(line: 277, column: 6, scope: !723)
!723 = distinct !DILexicalBlock(scope: !688, file: !1, line: 277, column: 6)
!724 = !DILocation(line: 277, column: 6, scope: !688)
!725 = !DILocation(line: 278, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 278, column: 3)
!727 = distinct !DILexicalBlock(scope: !723, file: !1, line: 277, column: 15)
!728 = !DILocation(line: 278, column: 3, scope: !729)
!729 = distinct !DILexicalBlock(scope: !726, file: !1, line: 278, column: 3)
!730 = !DILocation(line: 279, column: 8, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !1, line: 279, column: 8)
!732 = distinct !DILexicalBlock(scope: !729, file: !1, line: 278, column: 49)
!733 = !DILocation(line: 279, column: 16, scope: !731)
!734 = !DILocation(line: 279, column: 19, scope: !731)
!735 = !DILocation(line: 279, column: 8, scope: !732)
!736 = !DILocation(line: 280, column: 5, scope: !737)
!737 = distinct !DILexicalBlock(scope: !731, file: !1, line: 279, column: 31)
!738 = !DILocation(line: 281, column: 5, scope: !737)
!739 = !DILocation(line: 282, column: 5, scope: !737)
!740 = !DILocation(line: 283, column: 4, scope: !737)
!741 = !DILocation(line: 285, column: 5, scope: !742)
!742 = distinct !DILexicalBlock(scope: !731, file: !1, line: 284, column: 9)
!743 = !DILocation(line: 287, column: 3, scope: !732)
!744 = distinct !{!744, !725, !745}
!745 = !DILocation(line: 287, column: 3, scope: !726)
!746 = !DILocation(line: 288, column: 2, scope: !727)
!747 = !DILocation(line: 290, column: 3, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !1, line: 290, column: 3)
!749 = distinct !DILexicalBlock(scope: !723, file: !1, line: 289, column: 7)
!750 = !DILocation(line: 290, column: 3, scope: !751)
!751 = distinct !DILexicalBlock(scope: !748, file: !1, line: 290, column: 3)
!752 = !DILocation(line: 291, column: 4, scope: !753)
!753 = distinct !DILexicalBlock(scope: !751, file: !1, line: 290, column: 49)
!754 = !DILocation(line: 292, column: 4, scope: !753)
!755 = !DILocation(line: 293, column: 4, scope: !753)
!756 = !DILocation(line: 294, column: 3, scope: !753)
!757 = distinct !{!757, !747, !758}
!758 = !DILocation(line: 294, column: 3, scope: !748)
!759 = !DILocalVariable(name: "v_match", scope: !760, file: !1, line: 299, type: !761)
!760 = distinct !DILexicalBlock(scope: !688, file: !1, line: 298, column: 2)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 2)
!764 = !DILocation(line: 299, column: 11, scope: !760)
!765 = !DILocalVariable(name: "lb_src", scope: !760, file: !1, line: 300, type: !91)
!766 = !DILocation(line: 300, column: 12, scope: !760)
!767 = !DILocalVariable(name: "lb_dst", scope: !760, file: !1, line: 301, type: !91)
!768 = !DILocation(line: 301, column: 12, scope: !760)
!769 = !DILocalVariable(name: "vs_pool", scope: !760, file: !1, line: 302, type: !358)
!770 = !DILocation(line: 302, column: 16, scope: !760)
!771 = !DILocation(line: 302, column: 26, scope: !760)
!772 = !DILocation(line: 305, column: 10, scope: !760)
!773 = !DILocation(line: 305, column: 28, scope: !760)
!774 = !DILocation(line: 305, column: 35, scope: !760)
!775 = !DILocation(line: 305, column: 42, scope: !760)
!776 = !DILocation(line: 305, column: 3, scope: !760)
!777 = !DILocation(line: 306, column: 10, scope: !760)
!778 = !DILocation(line: 306, column: 28, scope: !760)
!779 = !DILocation(line: 306, column: 35, scope: !760)
!780 = !DILocation(line: 306, column: 42, scope: !760)
!781 = !DILocation(line: 306, column: 3, scope: !760)
!782 = !DILocation(line: 307, column: 3, scope: !760)
!783 = !DILocation(line: 307, column: 7, scope: !760)
!784 = !DILocation(line: 307, column: 24, scope: !760)
!785 = !DILocation(line: 309, column: 3, scope: !760)
!786 = !DILocation(line: 310, column: 33, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !1, line: 310, column: 8)
!788 = distinct !DILexicalBlock(scope: !760, file: !1, line: 309, column: 6)
!789 = !DILocation(line: 310, column: 54, scope: !787)
!790 = !DILocation(line: 310, column: 9, scope: !787)
!791 = !DILocation(line: 310, column: 63, scope: !787)
!792 = !DILocation(line: 310, column: 73, scope: !787)
!793 = !DILocation(line: 310, column: 76, scope: !787)
!794 = !DILocation(line: 310, column: 8, scope: !788)
!795 = !DILocation(line: 311, column: 5, scope: !796)
!796 = distinct !DILexicalBlock(scope: !787, file: !1, line: 310, column: 88)
!797 = !DILocation(line: 313, column: 33, scope: !798)
!798 = distinct !DILexicalBlock(scope: !788, file: !1, line: 313, column: 8)
!799 = !DILocation(line: 313, column: 55, scope: !798)
!800 = !DILocation(line: 313, column: 9, scope: !798)
!801 = !DILocation(line: 313, column: 64, scope: !798)
!802 = !DILocation(line: 313, column: 74, scope: !798)
!803 = !DILocation(line: 313, column: 77, scope: !798)
!804 = !DILocation(line: 313, column: 8, scope: !788)
!805 = !DILocation(line: 314, column: 5, scope: !806)
!806 = distinct !DILexicalBlock(scope: !798, file: !1, line: 313, column: 89)
!807 = !DILocation(line: 316, column: 3, scope: !788)
!808 = distinct !{!808, !785, !809}
!809 = !DILocation(line: 316, column: 16, scope: !760)
!810 = !DILocation(line: 318, column: 23, scope: !760)
!811 = !DILocation(line: 318, column: 3, scope: !760)
!812 = !DILocation(line: 320, column: 7, scope: !813)
!813 = distinct !DILexicalBlock(scope: !760, file: !1, line: 320, column: 7)
!814 = !DILocation(line: 320, column: 7, scope: !760)
!815 = !DILocalVariable(name: "el_store", scope: !816, file: !1, line: 321, type: !83)
!816 = distinct !DILexicalBlock(scope: !813, file: !1, line: 320, column: 19)
!817 = !DILocation(line: 321, column: 21, scope: !816)
!818 = !DILocation(line: 321, column: 32, scope: !816)
!819 = !DILocalVariable(name: "v", scope: !816, file: !1, line: 322, type: !105)
!820 = !DILocation(line: 322, column: 12, scope: !816)
!821 = !DILocation(line: 325, column: 8, scope: !816)
!822 = !DILocation(line: 325, column: 6, scope: !816)
!823 = !DILocation(line: 326, column: 4, scope: !816)
!824 = !DILocalVariable(name: "node", scope: !825, file: !1, line: 327, type: !166)
!825 = distinct !DILexicalBlock(scope: !816, file: !1, line: 326, column: 17)
!826 = !DILocation(line: 327, column: 15, scope: !825)
!827 = !DILocation(line: 327, column: 22, scope: !825)
!828 = !DILocation(line: 328, column: 18, scope: !825)
!829 = !DILocation(line: 328, column: 5, scope: !825)
!830 = !DILocation(line: 328, column: 11, scope: !825)
!831 = !DILocation(line: 328, column: 16, scope: !825)
!832 = !DILocation(line: 329, column: 18, scope: !825)
!833 = !DILocation(line: 329, column: 28, scope: !825)
!834 = !DILocation(line: 329, column: 35, scope: !825)
!835 = !DILocation(line: 329, column: 5, scope: !825)
!836 = !DILocation(line: 330, column: 5, scope: !825)
!837 = !DILocation(line: 330, column: 15, scope: !825)
!838 = !DILocation(line: 330, column: 18, scope: !825)
!839 = !DILocation(line: 331, column: 9, scope: !840)
!840 = distinct !DILexicalBlock(scope: !825, file: !1, line: 331, column: 9)
!841 = !DILocation(line: 331, column: 14, scope: !840)
!842 = !DILocation(line: 331, column: 11, scope: !840)
!843 = !DILocation(line: 331, column: 9, scope: !825)
!844 = !DILocation(line: 332, column: 6, scope: !845)
!845 = distinct !DILexicalBlock(scope: !840, file: !1, line: 331, column: 21)
!846 = !DILocation(line: 334, column: 28, scope: !825)
!847 = !DILocation(line: 334, column: 31, scope: !825)
!848 = !DILocation(line: 334, column: 34, scope: !825)
!849 = !DILocation(line: 334, column: 9, scope: !825)
!850 = !DILocation(line: 334, column: 7, scope: !825)
!851 = distinct !{!851, !823, !852}
!852 = !DILocation(line: 335, column: 4, scope: !816)
!853 = !DILocation(line: 337, column: 8, scope: !816)
!854 = !DILocation(line: 337, column: 6, scope: !816)
!855 = !DILocation(line: 338, column: 4, scope: !816)
!856 = !DILocalVariable(name: "node", scope: !857, file: !1, line: 339, type: !166)
!857 = distinct !DILexicalBlock(scope: !816, file: !1, line: 338, column: 17)
!858 = !DILocation(line: 339, column: 15, scope: !857)
!859 = !DILocation(line: 339, column: 22, scope: !857)
!860 = !DILocation(line: 340, column: 18, scope: !857)
!861 = !DILocation(line: 340, column: 5, scope: !857)
!862 = !DILocation(line: 340, column: 11, scope: !857)
!863 = !DILocation(line: 340, column: 16, scope: !857)
!864 = !DILocation(line: 341, column: 18, scope: !857)
!865 = !DILocation(line: 341, column: 28, scope: !857)
!866 = !DILocation(line: 341, column: 35, scope: !857)
!867 = !DILocation(line: 341, column: 5, scope: !857)
!868 = !DILocation(line: 342, column: 5, scope: !857)
!869 = !DILocation(line: 342, column: 15, scope: !857)
!870 = !DILocation(line: 342, column: 18, scope: !857)
!871 = !DILocation(line: 343, column: 9, scope: !872)
!872 = distinct !DILexicalBlock(scope: !857, file: !1, line: 343, column: 9)
!873 = !DILocation(line: 343, column: 14, scope: !872)
!874 = !DILocation(line: 343, column: 11, scope: !872)
!875 = !DILocation(line: 343, column: 9, scope: !857)
!876 = !DILocation(line: 344, column: 6, scope: !877)
!877 = distinct !DILexicalBlock(scope: !872, file: !1, line: 343, column: 21)
!878 = !DILocation(line: 346, column: 28, scope: !857)
!879 = !DILocation(line: 346, column: 31, scope: !857)
!880 = !DILocation(line: 346, column: 34, scope: !857)
!881 = !DILocation(line: 346, column: 9, scope: !857)
!882 = !DILocation(line: 346, column: 7, scope: !857)
!883 = distinct !{!883, !855, !884}
!884 = !DILocation(line: 347, column: 4, scope: !816)
!885 = !DILocation(line: 350, column: 16, scope: !816)
!886 = !DILocation(line: 350, column: 26, scope: !816)
!887 = !DILocation(line: 350, column: 4, scope: !816)
!888 = !DILocation(line: 352, column: 4, scope: !816)
!889 = !DILocation(line: 356, column: 2, scope: !688)
!890 = !DILocation(line: 357, column: 1, scope: !688)
!891 = distinct !DISubprogram(name: "_bm_elem_index_set", scope: !537, file: !537, line: 114, type: !892, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !540, !894}
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!895 = !DILocalVariable(name: "head", arg: 1, scope: !891, file: !537, line: 114, type: !540)
!896 = !DILocation(line: 114, column: 46, scope: !891)
!897 = !DILocalVariable(name: "index", arg: 2, scope: !891, file: !537, line: 114, type: !894)
!898 = !DILocation(line: 114, column: 62, scope: !891)
!899 = !DILocation(line: 116, column: 16, scope: !891)
!900 = !DILocation(line: 116, column: 2, scope: !891)
!901 = !DILocation(line: 116, column: 8, scope: !891)
!902 = !DILocation(line: 116, column: 14, scope: !891)
!903 = !DILocation(line: 117, column: 1, scope: !891)
!904 = distinct !DISubprogram(name: "vs_add", scope: !1, file: !1, line: 186, type: !905, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !358, !329, !105, !183, !894}
!907 = !DILocalVariable(name: "vs_pool", arg: 1, scope: !904, file: !1, line: 186, type: !358)
!908 = !DILocation(line: 186, column: 33, scope: !904)
!909 = !DILocalVariable(name: "lb", arg: 2, scope: !904, file: !1, line: 186, type: !329)
!910 = !DILocation(line: 186, column: 52, scope: !904)
!911 = !DILocalVariable(name: "v", arg: 3, scope: !904, file: !1, line: 187, type: !105)
!912 = !DILocation(line: 187, column: 28, scope: !904)
!913 = !DILocalVariable(name: "e_prev", arg: 4, scope: !904, file: !1, line: 187, type: !183)
!914 = !DILocation(line: 187, column: 39, scope: !904)
!915 = !DILocalVariable(name: "iter_tot", arg: 5, scope: !904, file: !1, line: 187, type: !894)
!916 = !DILocation(line: 187, column: 57, scope: !904)
!917 = !DILocalVariable(name: "vs_new", scope: !904, file: !1, line: 189, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VertStep", file: !1, line: 181, size: 192, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !919, file: !1, line: 182, baseType: !918, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !919, file: !1, line: 182, baseType: !918, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !919, file: !1, line: 183, baseType: !105, size: 64, offset: 128)
!924 = !DILocation(line: 189, column: 19, scope: !904)
!925 = !DILocation(line: 189, column: 46, scope: !904)
!926 = !DILocation(line: 189, column: 28, scope: !904)
!927 = !DILocation(line: 190, column: 14, scope: !904)
!928 = !DILocation(line: 190, column: 2, scope: !904)
!929 = !DILocation(line: 190, column: 10, scope: !904)
!930 = !DILocation(line: 190, column: 12, scope: !904)
!931 = !DILocation(line: 192, column: 2, scope: !904)
!932 = !DILocation(line: 200, column: 9, scope: !904)
!933 = !DILocation(line: 200, column: 2, scope: !904)
!934 = !DILocation(line: 200, column: 5, scope: !904)
!935 = !DILocation(line: 200, column: 7, scope: !904)
!936 = !DILocation(line: 202, column: 14, scope: !904)
!937 = !DILocation(line: 202, column: 18, scope: !904)
!938 = !DILocation(line: 202, column: 2, scope: !904)
!939 = !DILocation(line: 203, column: 1, scope: !904)
!940 = distinct !DISubprogram(name: "bm_loop_path_build_step", scope: !1, file: !1, line: 205, type: !941, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !334)
!941 = !DISubroutineType(types: !942)
!942 = !{!333, !358, !329, !894, !214}
!943 = !DILocalVariable(name: "vs_pool", arg: 1, scope: !940, file: !1, line: 205, type: !358)
!944 = !DILocation(line: 205, column: 50, scope: !940)
!945 = !DILocalVariable(name: "lb", arg: 2, scope: !940, file: !1, line: 205, type: !329)
!946 = !DILocation(line: 205, column: 69, scope: !940)
!947 = !DILocalVariable(name: "dir", arg: 3, scope: !940, file: !1, line: 205, type: !894)
!948 = !DILocation(line: 205, column: 83, scope: !940)
!949 = !DILocalVariable(name: "v_match", arg: 4, scope: !940, file: !1, line: 205, type: !214)
!950 = !DILocation(line: 205, column: 96, scope: !940)
!951 = !DILocalVariable(name: "lb_tmp", scope: !940, file: !1, line: 207, type: !91)
!952 = !DILocation(line: 207, column: 11, scope: !940)
!953 = !DILocalVariable(name: "vs", scope: !940, file: !1, line: 208, type: !918)
!954 = !DILocation(line: 208, column: 19, scope: !940)
!955 = !DILocalVariable(name: "vs_next", scope: !940, file: !1, line: 208, type: !918)
!956 = !DILocation(line: 208, column: 24, scope: !940)
!957 = !DILocation(line: 211, column: 12, scope: !958)
!958 = distinct !DILexicalBlock(scope: !940, file: !1, line: 211, column: 2)
!959 = !DILocation(line: 211, column: 16, scope: !958)
!960 = !DILocation(line: 211, column: 10, scope: !958)
!961 = !DILocation(line: 211, column: 7, scope: !958)
!962 = !DILocation(line: 211, column: 23, scope: !963)
!963 = distinct !DILexicalBlock(scope: !958, file: !1, line: 211, column: 2)
!964 = !DILocation(line: 211, column: 2, scope: !958)
!965 = !DILocalVariable(name: "iter", scope: !966, file: !1, line: 212, type: !344)
!966 = distinct !DILexicalBlock(scope: !963, file: !1, line: 211, column: 41)
!967 = !DILocation(line: 212, column: 10, scope: !966)
!968 = !DILocalVariable(name: "e", scope: !966, file: !1, line: 213, type: !183)
!969 = !DILocation(line: 213, column: 11, scope: !966)
!970 = !DILocalVariable(name: "vs_iter_tot", scope: !966, file: !1, line: 215, type: !894)
!971 = !DILocation(line: 215, column: 13, scope: !966)
!972 = !DILocation(line: 215, column: 28, scope: !966)
!973 = !DILocalVariable(name: "vs_iter_next", scope: !966, file: !1, line: 216, type: !894)
!974 = !DILocation(line: 216, column: 13, scope: !966)
!975 = !DILocation(line: 216, column: 28, scope: !966)
!976 = !DILocation(line: 216, column: 42, scope: !966)
!977 = !DILocation(line: 216, column: 40, scope: !966)
!978 = !DILocation(line: 218, column: 13, scope: !966)
!979 = !DILocation(line: 218, column: 17, scope: !966)
!980 = !DILocation(line: 218, column: 11, scope: !966)
!981 = !DILocation(line: 220, column: 3, scope: !982)
!982 = distinct !DILexicalBlock(scope: !966, file: !1, line: 220, column: 3)
!983 = !DILocation(line: 220, column: 3, scope: !984)
