; ModuleID = 'blender/source/blender/imbuf/intern/cache.c'
source_filename = "blender/source/blender/imbuf/intern/cache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImGlobalTileCache = type { %struct.ListBase, %struct.ListBase, %struct.GHash*, %struct.MemArena*, i64, i64, [2 x %struct.ImThreadTileCache], i32, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.GHash = type opaque
%struct.MemArena = type opaque
%struct.ImThreadTileCache = type { %struct.ListBase, %struct.ListBase, %struct.GHash* }
%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.ImGlobalTile = type { %struct.ImGlobalTile*, %struct.ImGlobalTile*, %struct.ImBuf*, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_CACHE", scope: !2, file: !3, line: 93, type: !12, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !11, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/imbuf/intern/cache.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !10}
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !8, line: 87, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!9 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !{!0}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImGlobalTileCache", file: !3, line: 91, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImGlobalTileCache", file: !3, line: 77, size: 1280, elements: !14)
!14 = !{!15, !22, !23, !28, !33, !36, !37, !47, !49, !56}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !13, file: !3, line: 78, baseType: !16, size: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !17, line: 71, baseType: !18)
!17 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !17, line: 69, size: 128, elements: !19)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !18, file: !17, line: 70, baseType: !10, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !18, file: !17, line: 70, baseType: !10, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !13, file: !3, line: 79, baseType: !16, size: 128, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tilehash", scope: !13, file: !3, line: 80, baseType: !24, size: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !26, line: 48, baseType: !27)
!26 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !26, line: 48, flags: DIFlagFwdDecl)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "memarena", scope: !13, file: !3, line: 82, baseType: !29, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemArena", file: !31, line: 53, baseType: !32)
!31 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !31, line: 52, flags: DIFlagFwdDecl)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "totmem", scope: !13, file: !3, line: 83, baseType: !34, size: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !8, line: 90, baseType: !35)
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxmem", scope: !13, file: !3, line: 83, baseType: !34, size: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cache", scope: !13, file: !3, line: 85, baseType: !38, size: 640, offset: 512)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 640, elements: !45)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImThreadTileCache", file: !3, line: 75, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImThreadTileCache", file: !3, line: 71, size: 320, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !40, file: !3, line: 72, baseType: !16, size: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !40, file: !3, line: 73, baseType: !16, size: 128, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tilehash", scope: !40, file: !3, line: 74, baseType: !24, size: 64, offset: 256)
!45 = !{!46}
!46 = !DISubrange(count: 2)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "totthread", scope: !13, file: !3, line: 86, baseType: !48, size: 32, offset: 1152)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !13, file: !3, line: 88, baseType: !50, size: 32, offset: 1184)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadMutex", file: !51, line: 107, baseType: !52)
!51 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 26, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !55, line: 42, baseType: !6)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !13, file: !3, line: 90, baseType: !48, size: 32, offset: 1216)
!57 = !{i32 7, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!61 = distinct !DISubprogram(name: "imb_tile_cache_tile_free", scope: !3, file: !3, line: 156, type: !62, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64, !48, !48}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !66, line: 141, baseType: !67)
!66 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !66, line: 70, size: 19840, elements: !68)
!68 = !{!69, !71, !72, !73, !74, !76, !77, !78, !79, !81, !84, !87, !88, !89, !90, !91, !93, !95, !96, !97, !101, !102, !103, !104, !105, !108, !109, !110, !115, !116, !119, !120, !122, !123, !124, !127, !128, !129, !132, !133, !142}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !66, line: 71, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !67, file: !66, line: 71, baseType: !70, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !67, file: !66, line: 74, baseType: !48, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !67, file: !66, line: 74, baseType: !48, size: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !67, file: !66, line: 79, baseType: !75, size: 8, offset: 192)
!75 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !67, file: !66, line: 80, baseType: !48, size: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !66, line: 83, baseType: !48, size: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !67, file: !66, line: 84, baseType: !48, size: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !67, file: !66, line: 87, baseType: !80, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !67, file: !66, line: 88, baseType: !82, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !67, file: !66, line: 93, baseType: !85, size: 128, offset: 448)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, elements: !45)
!86 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !67, file: !66, line: 96, baseType: !48, size: 32, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !67, file: !66, line: 96, baseType: !48, size: 32, offset: 608)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !67, file: !66, line: 97, baseType: !48, size: 32, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !67, file: !66, line: 97, baseType: !48, size: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !67, file: !66, line: 98, baseType: !92, size: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !67, file: !66, line: 101, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !67, file: !66, line: 102, baseType: !82, size: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !67, file: !66, line: 105, baseType: !83, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !67, file: !66, line: 108, baseType: !98, size: 1280, offset: 960)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1280, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !67, file: !66, line: 109, baseType: !48, size: 32, offset: 2240)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !67, file: !66, line: 109, baseType: !48, size: 32, offset: 2272)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !67, file: !66, line: 112, baseType: !48, size: 32, offset: 2304)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !67, file: !66, line: 113, baseType: !48, size: 32, offset: 2336)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !67, file: !66, line: 114, baseType: !106, size: 64, offset: 2368)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !66, line: 50, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !67, file: !66, line: 115, baseType: !10, size: 64, offset: 2432)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !67, file: !66, line: 118, baseType: !48, size: 32, offset: 2496)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !66, line: 119, baseType: !111, size: 8192, offset: 2528)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 8192, elements: !113)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !{!114}
!114 = !DISubrange(count: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !67, file: !66, line: 120, baseType: !111, size: 8192, offset: 10720)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !67, file: !66, line: 123, baseType: !117, size: 64, offset: 18944)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !66, line: 123, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !67, file: !66, line: 124, baseType: !48, size: 32, offset: 19008)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !67, file: !66, line: 127, baseType: !121, size: 64, offset: 19072)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !67, file: !66, line: 128, baseType: !6, size: 32, offset: 19136)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !67, file: !66, line: 129, baseType: !6, size: 32, offset: 19168)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !67, file: !66, line: 132, baseType: !125, size: 64, offset: 19200)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !66, line: 132, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !67, file: !66, line: 133, baseType: !125, size: 64, offset: 19264)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !67, file: !66, line: 134, baseType: !80, size: 64, offset: 19328)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !67, file: !66, line: 135, baseType: !130, size: 64, offset: 19392)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !66, line: 135, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !67, file: !66, line: 136, baseType: !48, size: 32, offset: 19456)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !67, file: !66, line: 137, baseType: !134, size: 128, offset: 19488)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !135, line: 89, baseType: !136)
!135 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !135, line: 86, size: 128, elements: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !136, file: !135, line: 87, baseType: !48, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !136, file: !135, line: 87, baseType: !48, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !136, file: !135, line: 88, baseType: !48, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !136, file: !135, line: 88, baseType: !48, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !67, file: !66, line: 140, baseType: !143, size: 192, offset: 19648)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !66, line: 55, size: 192, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !143, file: !66, line: 56, baseType: !6, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !143, file: !66, line: 57, baseType: !6, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !143, file: !66, line: 58, baseType: !121, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !143, file: !66, line: 59, baseType: !6, size: 32, offset: 128)
!149 = !DILocalVariable(name: "ibuf", arg: 1, scope: !61, file: !3, line: 156, type: !64)
!150 = !DILocation(line: 156, column: 38, scope: !61)
!151 = !DILocalVariable(name: "tx", arg: 2, scope: !61, file: !3, line: 156, type: !48)
!152 = !DILocation(line: 156, column: 48, scope: !61)
!153 = !DILocalVariable(name: "ty", arg: 3, scope: !61, file: !3, line: 156, type: !48)
!154 = !DILocation(line: 156, column: 56, scope: !61)
!155 = !DILocalVariable(name: "gtile", scope: !61, file: !3, line: 158, type: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImGlobalTile", file: !3, line: 60, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImGlobalTile", file: !3, line: 53, size: 320, elements: !159)
!159 = !{!160, !162, !163, !164, !165, !166, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !3, line: 54, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !158, file: !3, line: 54, baseType: !161, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !158, file: !3, line: 56, baseType: !64, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !158, file: !3, line: 57, baseType: !48, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !158, file: !3, line: 57, baseType: !48, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !158, file: !3, line: 58, baseType: !48, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !158, file: !3, line: 59, baseType: !168, size: 32, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!169 = !DILocation(line: 158, column: 16, scope: !61)
!170 = !DILocalVariable(name: "lookuptile", scope: !61, file: !3, line: 158, type: !157)
!171 = !DILocation(line: 158, column: 23, scope: !61)
!172 = !DILocation(line: 160, column: 2, scope: !61)
!173 = !DILocation(line: 162, column: 20, scope: !61)
!174 = !DILocation(line: 162, column: 13, scope: !61)
!175 = !DILocation(line: 162, column: 18, scope: !61)
!176 = !DILocation(line: 163, column: 18, scope: !61)
!177 = !DILocation(line: 163, column: 13, scope: !61)
!178 = !DILocation(line: 163, column: 16, scope: !61)
!179 = !DILocation(line: 164, column: 18, scope: !61)
!180 = !DILocation(line: 164, column: 13, scope: !61)
!181 = !DILocation(line: 164, column: 16, scope: !61)
!182 = !DILocation(line: 165, column: 40, scope: !61)
!183 = !DILocation(line: 165, column: 50, scope: !61)
!184 = !DILocation(line: 165, column: 10, scope: !61)
!185 = !DILocation(line: 165, column: 8, scope: !61)
!186 = !DILocation(line: 167, column: 6, scope: !187)
!187 = distinct !DILexicalBlock(scope: !61, file: !3, line: 167, column: 6)
!188 = !DILocation(line: 167, column: 6, scope: !61)
!189 = !DILocation(line: 169, column: 3, scope: !190)
!190 = distinct !DILexicalBlock(scope: !187, file: !3, line: 167, column: 13)
!191 = !DILocation(line: 169, column: 10, scope: !190)
!192 = !DILocation(line: 169, column: 17, scope: !190)
!193 = distinct !{!193, !189, !194}
!194 = !DILocation(line: 170, column: 4, scope: !190)
!195 = !DILocation(line: 172, column: 33, scope: !190)
!196 = !DILocation(line: 172, column: 43, scope: !190)
!197 = !DILocation(line: 172, column: 3, scope: !190)
!198 = !DILocation(line: 173, column: 36, scope: !190)
!199 = !DILocation(line: 173, column: 3, scope: !190)
!200 = !DILocation(line: 174, column: 37, scope: !190)
!201 = !DILocation(line: 174, column: 3, scope: !190)
!202 = !DILocation(line: 175, column: 2, scope: !190)
!203 = !DILocation(line: 177, column: 2, scope: !61)
!204 = !DILocation(line: 178, column: 1, scope: !61)
!205 = distinct !DISubprogram(name: "imb_tile_cache_init", scope: !3, file: !3, line: 203, type: !206, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!206 = !DISubroutineType(types: !207)
!207 = !{null}
!208 = !DILocation(line: 205, column: 2, scope: !205)
!209 = !DILocation(line: 207, column: 2, scope: !205)
!210 = !DILocation(line: 211, column: 2, scope: !205)
!211 = !DILocation(line: 213, column: 27, scope: !205)
!212 = !DILocation(line: 214, column: 1, scope: !205)
!213 = distinct !DISubprogram(name: "IMB_tile_cache_params", scope: !3, file: !3, line: 241, type: !214, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !48, !48}
!216 = !DILocalVariable(name: "totthread", arg: 1, scope: !213, file: !3, line: 241, type: !48)
!217 = !DILocation(line: 241, column: 32, scope: !213)
!218 = !DILocalVariable(name: "maxmem", arg: 2, scope: !213, file: !3, line: 241, type: !48)
!219 = !DILocation(line: 241, column: 47, scope: !213)
!220 = !DILocalVariable(name: "a", scope: !213, file: !3, line: 243, type: !48)
!221 = !DILocation(line: 243, column: 6, scope: !213)
!222 = !DILocation(line: 246, column: 11, scope: !213)
!223 = !DILocation(line: 249, column: 19, scope: !224)
!224 = distinct !DILexicalBlock(scope: !213, file: !3, line: 249, column: 6)
!225 = !DILocation(line: 249, column: 32, scope: !224)
!226 = !DILocation(line: 249, column: 29, scope: !224)
!227 = !DILocation(line: 249, column: 42, scope: !224)
!228 = !DILocation(line: 249, column: 58, scope: !224)
!229 = !DILocation(line: 249, column: 68, scope: !224)
!230 = !DILocation(line: 249, column: 65, scope: !224)
!231 = !DILocation(line: 249, column: 6, scope: !213)
!232 = !DILocation(line: 250, column: 3, scope: !224)
!233 = !DILocation(line: 252, column: 2, scope: !213)
!234 = !DILocation(line: 254, column: 2, scope: !213)
!235 = !DILocation(line: 256, column: 26, scope: !213)
!236 = !DILocation(line: 256, column: 24, scope: !213)
!237 = !DILocation(line: 258, column: 26, scope: !213)
!238 = !DILocation(line: 258, column: 24, scope: !213)
!239 = !DILocation(line: 259, column: 39, scope: !213)
!240 = !DILocation(line: 259, column: 2, scope: !213)
!241 = !DILocation(line: 261, column: 24, scope: !213)
!242 = !DILocation(line: 261, column: 31, scope: !213)
!243 = !DILocation(line: 261, column: 38, scope: !213)
!244 = !DILocation(line: 261, column: 22, scope: !213)
!245 = !DILocation(line: 263, column: 27, scope: !213)
!246 = !DILocation(line: 263, column: 25, scope: !213)
!247 = !DILocation(line: 264, column: 9, scope: !248)
!248 = distinct !DILexicalBlock(scope: !213, file: !3, line: 264, column: 2)
!249 = !DILocation(line: 264, column: 7, scope: !248)
!250 = !DILocation(line: 264, column: 14, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !3, line: 264, column: 2)
!252 = !DILocation(line: 264, column: 18, scope: !251)
!253 = !DILocation(line: 264, column: 16, scope: !251)
!254 = !DILocation(line: 264, column: 2, scope: !248)
!255 = !DILocation(line: 265, column: 52, scope: !251)
!256 = !DILocation(line: 265, column: 26, scope: !251)
!257 = !DILocation(line: 265, column: 3, scope: !251)
!258 = !DILocation(line: 264, column: 30, scope: !251)
!259 = !DILocation(line: 264, column: 2, scope: !251)
!260 = distinct !{!260, !254, !261}
!261 = !DILocation(line: 265, column: 54, scope: !248)
!262 = !DILocation(line: 267, column: 2, scope: !213)
!263 = !DILocation(line: 268, column: 1, scope: !213)
!264 = distinct !DISubprogram(name: "imb_tile_cache_exit", scope: !3, file: !3, line: 216, type: !206, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!265 = !DILocalVariable(name: "gtile", scope: !264, file: !3, line: 218, type: !156)
!266 = !DILocation(line: 218, column: 16, scope: !264)
!267 = !DILocalVariable(name: "a", scope: !264, file: !3, line: 219, type: !48)
!268 = !DILocation(line: 219, column: 6, scope: !264)
!269 = !DILocation(line: 221, column: 19, scope: !270)
!270 = distinct !DILexicalBlock(scope: !264, file: !3, line: 221, column: 6)
!271 = !DILocation(line: 221, column: 6, scope: !270)
!272 = !DILocation(line: 221, column: 6, scope: !264)
!273 = !DILocation(line: 222, column: 35, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 222, column: 3)
!275 = distinct !DILexicalBlock(scope: !270, file: !3, line: 221, column: 32)
!276 = !DILocation(line: 222, column: 16, scope: !274)
!277 = !DILocation(line: 222, column: 14, scope: !274)
!278 = !DILocation(line: 222, column: 8, scope: !274)
!279 = !DILocation(line: 222, column: 42, scope: !280)
!280 = distinct !DILexicalBlock(scope: !274, file: !3, line: 222, column: 3)
!281 = !DILocation(line: 222, column: 3, scope: !274)
!282 = !DILocation(line: 223, column: 33, scope: !280)
!283 = !DILocation(line: 223, column: 4, scope: !280)
!284 = !DILocation(line: 222, column: 57, scope: !280)
!285 = !DILocation(line: 222, column: 64, scope: !280)
!286 = !DILocation(line: 222, column: 55, scope: !280)
!287 = !DILocation(line: 222, column: 3, scope: !280)
!288 = distinct !{!288, !281, !289}
!289 = !DILocation(line: 223, column: 38, scope: !274)
!290 = !DILocation(line: 225, column: 10, scope: !291)
!291 = distinct !DILexicalBlock(scope: !275, file: !3, line: 225, column: 3)
!292 = !DILocation(line: 225, column: 8, scope: !291)
!293 = !DILocation(line: 225, column: 15, scope: !294)
!294 = distinct !DILexicalBlock(scope: !291, file: !3, line: 225, column: 3)
!295 = !DILocation(line: 225, column: 32, scope: !294)
!296 = !DILocation(line: 225, column: 17, scope: !294)
!297 = !DILocation(line: 225, column: 3, scope: !291)
!298 = !DILocation(line: 226, column: 53, scope: !294)
!299 = !DILocation(line: 226, column: 27, scope: !294)
!300 = !DILocation(line: 226, column: 4, scope: !294)
!301 = !DILocation(line: 225, column: 44, scope: !294)
!302 = !DILocation(line: 225, column: 3, scope: !294)
!303 = distinct !{!303, !297, !304}
!304 = !DILocation(line: 226, column: 55, scope: !291)
!305 = !DILocation(line: 228, column: 20, scope: !306)
!306 = distinct !DILexicalBlock(scope: !275, file: !3, line: 228, column: 7)
!307 = !DILocation(line: 228, column: 7, scope: !306)
!308 = !DILocation(line: 228, column: 7, scope: !275)
!309 = !DILocation(line: 229, column: 35, scope: !306)
!310 = !DILocation(line: 229, column: 4, scope: !306)
!311 = !DILocation(line: 231, column: 20, scope: !312)
!312 = distinct !DILexicalBlock(scope: !275, file: !3, line: 231, column: 7)
!313 = !DILocation(line: 231, column: 7, scope: !312)
!314 = !DILocation(line: 231, column: 7, scope: !275)
!315 = !DILocation(line: 232, column: 32, scope: !312)
!316 = !DILocation(line: 232, column: 4, scope: !312)
!317 = !DILocation(line: 234, column: 3, scope: !275)
!318 = !DILocation(line: 236, column: 3, scope: !275)
!319 = !DILocation(line: 237, column: 2, scope: !275)
!320 = !DILocation(line: 238, column: 1, scope: !264)
!321 = distinct !DISubprogram(name: "imb_global_cache_tile_unload", scope: !3, file: !3, line: 144, type: !322, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !156}
!324 = !DILocalVariable(name: "gtile", arg: 1, scope: !321, file: !3, line: 144, type: !156)
!325 = !DILocation(line: 144, column: 56, scope: !321)
!326 = !DILocalVariable(name: "ibuf", scope: !321, file: !3, line: 146, type: !64)
!327 = !DILocation(line: 146, column: 9, scope: !321)
!328 = !DILocation(line: 146, column: 16, scope: !321)
!329 = !DILocation(line: 146, column: 23, scope: !321)
!330 = !DILocalVariable(name: "toffs", scope: !321, file: !3, line: 147, type: !48)
!331 = !DILocation(line: 147, column: 6, scope: !321)
!332 = !DILocation(line: 147, column: 14, scope: !321)
!333 = !DILocation(line: 147, column: 20, scope: !321)
!334 = !DILocation(line: 147, column: 29, scope: !321)
!335 = !DILocation(line: 147, column: 36, scope: !321)
!336 = !DILocation(line: 147, column: 27, scope: !321)
!337 = !DILocation(line: 147, column: 41, scope: !321)
!338 = !DILocation(line: 147, column: 48, scope: !321)
!339 = !DILocation(line: 147, column: 39, scope: !321)
!340 = !DILocation(line: 149, column: 2, scope: !321)
!341 = !DILocation(line: 149, column: 12, scope: !321)
!342 = !DILocation(line: 149, column: 18, scope: !321)
!343 = !DILocation(line: 149, column: 24, scope: !321)
!344 = !DILocation(line: 150, column: 2, scope: !321)
!345 = !DILocation(line: 150, column: 8, scope: !321)
!346 = !DILocation(line: 150, column: 14, scope: !321)
!347 = !DILocation(line: 150, column: 21, scope: !321)
!348 = !DILocation(line: 152, column: 48, scope: !321)
!349 = !DILocation(line: 152, column: 54, scope: !321)
!350 = !DILocation(line: 152, column: 46, scope: !321)
!351 = !DILocation(line: 152, column: 62, scope: !321)
!352 = !DILocation(line: 152, column: 68, scope: !321)
!353 = !DILocation(line: 152, column: 60, scope: !321)
!354 = !DILocation(line: 152, column: 22, scope: !321)
!355 = !DILocation(line: 153, column: 1, scope: !321)
!356 = distinct !DISubprogram(name: "imb_thread_cache_exit", scope: !3, file: !3, line: 198, type: !357, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!360 = !DILocalVariable(name: "cache", arg: 1, scope: !356, file: !3, line: 198, type: !359)
!361 = !DILocation(line: 198, column: 54, scope: !356)
!362 = !DILocation(line: 200, column: 17, scope: !356)
!363 = !DILocation(line: 200, column: 24, scope: !356)
!364 = !DILocation(line: 200, column: 2, scope: !356)
!365 = !DILocation(line: 201, column: 1, scope: !356)
!366 = distinct !DISubprogram(name: "imb_global_tile_hash", scope: !3, file: !3, line: 97, type: !367, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!367 = !DISubroutineType(types: !368)
!368 = !{!6, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!371 = !DILocalVariable(name: "gtile_p", arg: 1, scope: !366, file: !3, line: 97, type: !369)
!372 = !DILocation(line: 97, column: 54, scope: !366)
!373 = !DILocalVariable(name: "gtile", scope: !366, file: !3, line: 99, type: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!376 = !DILocation(line: 99, column: 22, scope: !366)
!377 = !DILocation(line: 99, column: 30, scope: !366)
!378 = !DILocation(line: 101, column: 34, scope: !366)
!379 = !DILocation(line: 101, column: 41, scope: !366)
!380 = !DILocation(line: 101, column: 24, scope: !366)
!381 = !DILocation(line: 101, column: 10, scope: !366)
!382 = !DILocation(line: 101, column: 47, scope: !366)
!383 = !DILocation(line: 101, column: 55, scope: !366)
!384 = !DILocation(line: 101, column: 62, scope: !366)
!385 = !DILocation(line: 101, column: 65, scope: !366)
!386 = !DILocation(line: 101, column: 53, scope: !366)
!387 = !DILocation(line: 101, column: 72, scope: !366)
!388 = !DILocation(line: 101, column: 79, scope: !366)
!389 = !DILocation(line: 101, column: 82, scope: !366)
!390 = !DILocation(line: 101, column: 70, scope: !366)
!391 = !DILocation(line: 101, column: 2, scope: !366)
!392 = distinct !DISubprogram(name: "imb_global_tile_cmp", scope: !3, file: !3, line: 104, type: !393, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!393 = !DISubroutineType(types: !394)
!394 = !{!75, !369, !369}
!395 = !DILocalVariable(name: "a_p", arg: 1, scope: !392, file: !3, line: 104, type: !369)
!396 = !DILocation(line: 104, column: 45, scope: !392)
!397 = !DILocalVariable(name: "b_p", arg: 2, scope: !392, file: !3, line: 104, type: !369)
!398 = !DILocation(line: 104, column: 62, scope: !392)
!399 = !DILocalVariable(name: "a", scope: !392, file: !3, line: 106, type: !374)
!400 = !DILocation(line: 106, column: 22, scope: !392)
!401 = !DILocation(line: 106, column: 26, scope: !392)
!402 = !DILocalVariable(name: "b", scope: !392, file: !3, line: 107, type: !374)
!403 = !DILocation(line: 107, column: 22, scope: !392)
!404 = !DILocation(line: 107, column: 26, scope: !392)
!405 = !DILocation(line: 109, column: 11, scope: !392)
!406 = !DILocation(line: 109, column: 14, scope: !392)
!407 = !DILocation(line: 109, column: 22, scope: !392)
!408 = !DILocation(line: 109, column: 25, scope: !392)
!409 = !DILocation(line: 109, column: 19, scope: !392)
!410 = !DILocation(line: 109, column: 31, scope: !392)
!411 = !DILocation(line: 110, column: 11, scope: !392)
!412 = !DILocation(line: 110, column: 14, scope: !392)
!413 = !DILocation(line: 110, column: 20, scope: !392)
!414 = !DILocation(line: 110, column: 23, scope: !392)
!415 = !DILocation(line: 110, column: 17, scope: !392)
!416 = !DILocation(line: 110, column: 27, scope: !392)
!417 = !DILocation(line: 111, column: 11, scope: !392)
!418 = !DILocation(line: 111, column: 14, scope: !392)
!419 = !DILocation(line: 111, column: 20, scope: !392)
!420 = !DILocation(line: 111, column: 23, scope: !392)
!421 = !DILocation(line: 111, column: 17, scope: !392)
!422 = !DILocation(line: 109, column: 9, scope: !392)
!423 = !DILocation(line: 109, column: 2, scope: !392)
!424 = distinct !DISubprogram(name: "imb_thread_cache_init", scope: !3, file: !3, line: 182, type: !357, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!425 = !DILocalVariable(name: "cache", arg: 1, scope: !424, file: !3, line: 182, type: !359)
!426 = !DILocation(line: 182, column: 54, scope: !424)
!427 = !DILocalVariable(name: "ttile", scope: !424, file: !3, line: 184, type: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImThreadTile", file: !3, line: 69, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImThreadTile", file: !3, line: 62, size: 320, elements: !431)
!431 = !{!432, !434, !435, !436, !437, !438}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !430, file: !3, line: 63, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !3, line: 63, baseType: !433, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !430, file: !3, line: 65, baseType: !64, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !430, file: !3, line: 66, baseType: !48, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !430, file: !3, line: 66, baseType: !48, size: 32, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !430, file: !3, line: 68, baseType: !156, size: 64, offset: 256)
!439 = !DILocation(line: 184, column: 16, scope: !424)
!440 = !DILocalVariable(name: "a", scope: !424, file: !3, line: 185, type: !48)
!441 = !DILocation(line: 185, column: 6, scope: !424)
!442 = !DILocation(line: 187, column: 9, scope: !424)
!443 = !DILocation(line: 187, column: 2, scope: !424)
!444 = !DILocation(line: 189, column: 20, scope: !424)
!445 = !DILocation(line: 189, column: 2, scope: !424)
!446 = !DILocation(line: 189, column: 9, scope: !424)
!447 = !DILocation(line: 189, column: 18, scope: !424)
!448 = !DILocation(line: 192, column: 9, scope: !449)
!449 = distinct !DILexicalBlock(scope: !424, file: !3, line: 192, column: 2)
!450 = !DILocation(line: 192, column: 7, scope: !449)
!451 = !DILocation(line: 192, column: 14, scope: !452)
!452 = distinct !DILexicalBlock(scope: !449, file: !3, line: 192, column: 2)
!453 = !DILocation(line: 192, column: 16, scope: !452)
!454 = !DILocation(line: 192, column: 2, scope: !449)
!455 = !DILocation(line: 193, column: 43, scope: !456)
!456 = distinct !DILexicalBlock(scope: !452, file: !3, line: 192, column: 45)
!457 = !DILocation(line: 193, column: 11, scope: !456)
!458 = !DILocation(line: 193, column: 9, scope: !456)
!459 = !DILocation(line: 194, column: 16, scope: !456)
!460 = !DILocation(line: 194, column: 23, scope: !456)
!461 = !DILocation(line: 194, column: 31, scope: !456)
!462 = !DILocation(line: 194, column: 3, scope: !456)
!463 = !DILocation(line: 195, column: 2, scope: !456)
!464 = !DILocation(line: 192, column: 41, scope: !452)
!465 = !DILocation(line: 192, column: 2, scope: !452)
!466 = distinct !{!466, !454, !467}
!467 = !DILocation(line: 195, column: 2, scope: !449)
!468 = !DILocation(line: 196, column: 1, scope: !424)
!469 = distinct !DISubprogram(name: "IMB_gettile", scope: !3, file: !3, line: 403, type: !470, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!470 = !DISubroutineType(types: !471)
!471 = !{!80, !64, !48, !48, !48}
!472 = !DILocalVariable(name: "ibuf", arg: 1, scope: !469, file: !3, line: 403, type: !64)
!473 = !DILocation(line: 403, column: 34, scope: !469)
!474 = !DILocalVariable(name: "tx", arg: 2, scope: !469, file: !3, line: 403, type: !48)
!475 = !DILocation(line: 403, column: 44, scope: !469)
!476 = !DILocalVariable(name: "ty", arg: 3, scope: !469, file: !3, line: 403, type: !48)
!477 = !DILocation(line: 403, column: 52, scope: !469)
!478 = !DILocalVariable(name: "thread", arg: 4, scope: !469, file: !3, line: 403, type: !48)
!479 = !DILocation(line: 403, column: 60, scope: !469)
!480 = !DILocation(line: 405, column: 62, scope: !469)
!481 = !DILocation(line: 405, column: 69, scope: !469)
!482 = !DILocation(line: 405, column: 36, scope: !469)
!483 = !DILocation(line: 405, column: 75, scope: !469)
!484 = !DILocation(line: 405, column: 81, scope: !469)
!485 = !DILocation(line: 405, column: 85, scope: !469)
!486 = !DILocation(line: 405, column: 9, scope: !469)
!487 = !DILocation(line: 405, column: 2, scope: !469)
!488 = distinct !DISubprogram(name: "imb_thread_cache_get_tile", scope: !3, file: !3, line: 352, type: !489, scopeLine: 353, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!489 = !DISubroutineType(types: !490)
!490 = !{!80, !359, !64, !48, !48}
!491 = !DILocalVariable(name: "cache", arg: 1, scope: !488, file: !3, line: 352, type: !359)
!492 = !DILocation(line: 352, column: 67, scope: !488)
!493 = !DILocalVariable(name: "ibuf", arg: 2, scope: !488, file: !3, line: 352, type: !64)
!494 = !DILocation(line: 352, column: 81, scope: !488)
!495 = !DILocalVariable(name: "tx", arg: 3, scope: !488, file: !3, line: 352, type: !48)
!496 = !DILocation(line: 352, column: 91, scope: !488)
!497 = !DILocalVariable(name: "ty", arg: 4, scope: !488, file: !3, line: 352, type: !48)
!498 = !DILocation(line: 352, column: 99, scope: !488)
