; ModuleID = 'blender/source/blender/editors/animation/keyframes_edit.c'
source_filename = "blender/source/blender/editors/animation/keyframes_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.KeyframeEditData = type { %struct.ListBase, %struct.Scene*, i8*, float, float, i32, i32, %struct.FCurve*, i32, i16, i16 }
%struct.ListBase = type { i8*, i8* }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque

!53 = !DIEnumerator(name: "ANIMTYPE_MASKLAYER", value: 29, isUnsigned: true)
!54 = !DIEnumerator(name: "ANIMTYPE_NLATRACK", value: 30, isUnsigned: true)
!55 = !DIEnumerator(name: "ANIMTYPE_NLAACTION", value: 31, isUnsigned: true)
!56 = !DIEnumerator(name: "ANIMTYPE_NUM_TYPES", value: 32, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimCont_Types", file: !4, line: 92, baseType: !22, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!59 = !DIEnumerator(name: "ANIMCONT_NONE", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "ANIMCONT_ACTION", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "ANIMCONT_SHAPEKEY", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "ANIMCONT_GPENCIL", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "ANIMCONT_DOPESHEET", value: 4, isUnsigned: true)
!64 = !DIEnumerator(name: "ANIMCONT_FCURVES", value: 5, isUnsigned: true)
!65 = !DIEnumerator(name: "ANIMCONT_DRIVERS", value: 6, isUnsigned: true)
!66 = !DIEnumerator(name: "ANIMCONT_NLA", value: 7, isUnsigned: true)
!67 = !DIEnumerator(name: "ANIMCONT_CHANNEL", value: 8, isUnsigned: true)
!68 = !DIEnumerator(name: "ANIMCONT_MASK", value: 9, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eKeyframeVertOk", file: !70, line: 143, baseType: !22, size: 32, elements: !71)
!70 = !DIFile(filename: "blender/source/blender/editors/include/ED_keyframes_edit.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "KEYFRAME_OK_KEY", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "KEYFRAME_OK_H1", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "KEYFRAME_OK_H2", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "KEYFRAME_OK_ALL", value: 7, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eKeyframeIterFlags", file: !70, line: 155, baseType: !22, size: 32, elements: !77)
!77 = !{!78}
!78 = !DIEnumerator(name: "KEYFRAME_ITER_INCL_HANDLES", value: 1, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Handle", file: !80, line: 361, baseType: !22, size: 32, elements: !81)
!80 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{!82, !83, !84, !85, !86, !87}
!82 = !DIEnumerator(name: "HD_FREE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "HD_AUTO", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "HD_VECT", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "HD_ALIGN", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "HD_AUTO_ANIM", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "HD_ALIGN_DOUBLESIDE", value: 5, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Interpolation", file: !80, line: 371, baseType: !22, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!90 = !DIEnumerator(name: "BEZT_IPO_CONST", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "BEZT_IPO_LIN", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "BEZT_IPO_BEZ", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "BEZT_IPO_BACK", value: 3, isUnsigned: true)
!94 = !DIEnumerator(name: "BEZT_IPO_BOUNCE", value: 4, isUnsigned: true)
!95 = !DIEnumerator(name: "BEZT_IPO_CIRC", value: 5, isUnsigned: true)
!96 = !DIEnumerator(name: "BEZT_IPO_CUBIC", value: 6, isUnsigned: true)
!97 = !DIEnumerator(name: "BEZT_IPO_ELASTIC", value: 7, isUnsigned: true)
!98 = !DIEnumerator(name: "BEZT_IPO_EXPO", value: 8, isUnsigned: true)
!99 = !DIEnumerator(name: "BEZT_IPO_QUAD", value: 9, isUnsigned: true)
!100 = !DIEnumerator(name: "BEZT_IPO_QUART", value: 10, isUnsigned: true)
!101 = !DIEnumerator(name: "BEZT_IPO_QUINT", value: 11, isUnsigned: true)
!102 = !DIEnumerator(name: "BEZT_IPO_SINE", value: 12, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_KeyframeType", file: !80, line: 400, baseType: !22, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIEnumerator(name: "BEZT_KEYTYPE_KEYFRAME", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "BEZT_KEYTYPE_EXTREME", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "BEZT_KEYTYPE_BREAKDOWN", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "BEZT_KEYTYPE_JITTER", value: 3, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Easing", file: !80, line: 391, baseType: !22, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114}
!111 = !DIEnumerator(name: "BEZT_IPO_EASE_AUTO", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "BEZT_IPO_EASE_IN", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "BEZT_IPO_EASE_OUT", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "BEZT_IPO_EASE_IN_OUT", value: 3, isUnsigned: true)
!115 = !{!116, !117, !153, !224, !1728, !1730, !1775, !1783, !263, !1845}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !119, line: 450, baseType: !120)
!119 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !119, line: 440, size: 960, elements: !121)
!121 = !{!122, !124, !125, !132, !133, !134, !139}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !119, line: 441, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !119, line: 441, baseType: !123, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !120, file: !119, line: 443, baseType: !126, size: 128, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !127, line: 71, baseType: !128)
!127 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !127, line: 69, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !128, file: !127, line: 70, baseType: !116, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !128, file: !127, line: 70, baseType: !116, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !120, file: !119, line: 445, baseType: !5, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !120, file: !119, line: 446, baseType: !5, size: 32, offset: 288)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !119, line: 447, baseType: !135, size: 512, offset: 320)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 512, elements: !137)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !{!138}
!138 = !DISubrange(count: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !120, file: !119, line: 449, baseType: !140, size: 128, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !141, line: 347, baseType: !142)
!141 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !141, line: 340, size: 128, elements: !143)
!143 = !{!144, !148, !149, !150, !152}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !142, file: !141, line: 341, baseType: !145, size: 32)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 4)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !142, file: !141, line: 342, baseType: !145, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !142, file: !141, line: 343, baseType: !145, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !142, file: !141, line: 345, baseType: !151, size: 16, offset: 96)
!151 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !142, file: !141, line: 346, baseType: !151, size: 16, offset: 112)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !119, line: 499, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !119, line: 486, size: 1600, elements: !156)
!156 = !{!157, !216, !217, !218, !219, !220, !221, !222, !223}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !155, file: !119, line: 487, baseType: !158, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !159, line: 130, baseType: !160)
!159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !159, line: 117, size: 960, elements: !161)
!161 = !{!162, !163, !164, !166, !185, !189, !190, !191, !192, !193}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !159, line: 118, baseType: !116, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !159, line: 118, baseType: !116, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !160, file: !159, line: 119, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !160, file: !159, line: 120, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !159, line: 136, size: 17600, elements: !169)
!169 = !{!170, !171, !173, !176, !180, !181, !182}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !159, line: 137, baseType: !158, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !159, line: 138, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !159, line: 139, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !159, line: 43, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !159, line: 140, baseType: !177, size: 8192, offset: 1088)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8192, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !159, line: 141, baseType: !177, size: 8192, offset: 9280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !159, line: 148, baseType: !167, size: 64, offset: 17472)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !159, line: 150, baseType: !183, size: 64, offset: 17536)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !159, line: 45, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !159, line: 121, baseType: !186, size: 528, offset: 256)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 528, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 66)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !159, line: 126, baseType: !151, size: 16, offset: 784)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !160, file: !159, line: 127, baseType: !5, size: 32, offset: 800)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !160, file: !159, line: 128, baseType: !5, size: 32, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !160, file: !159, line: 128, baseType: !5, size: 32, offset: 864)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !160, file: !159, line: 129, baseType: !194, size: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !159, line: 75, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !159, line: 62, size: 1024, elements: !197)
!197 = !{!198, !200, !201, !202, !203, !204, !205, !206, !214, !215}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !159, line: 63, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !196, file: !159, line: 63, baseType: !199, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !159, line: 64, baseType: !136, size: 8, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !196, file: !159, line: 64, baseType: !136, size: 8, offset: 136)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !196, file: !159, line: 65, baseType: !151, size: 16, offset: 144)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !159, line: 66, baseType: !135, size: 512, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !196, file: !159, line: 67, baseType: !5, size: 32, offset: 672)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !159, line: 69, baseType: !207, size: 256, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !159, line: 60, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !159, line: 48, size: 256, elements: !209)
!209 = !{!210, !211, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !208, file: !159, line: 49, baseType: !116, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !208, file: !159, line: 58, baseType: !126, size: 128, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !208, file: !159, line: 59, baseType: !5, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !208, file: !159, line: 59, baseType: !5, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !196, file: !159, line: 70, baseType: !5, size: 32, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !196, file: !159, line: 74, baseType: !5, size: 32, offset: 992)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !155, file: !119, line: 489, baseType: !126, size: 128, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !155, file: !119, line: 490, baseType: !126, size: 128, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !155, file: !119, line: 491, baseType: !126, size: 128, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !155, file: !119, line: 492, baseType: !126, size: 128, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !155, file: !119, line: 494, baseType: !5, size: 32, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !155, file: !119, line: 495, baseType: !5, size: 32, offset: 1504)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !155, file: !119, line: 497, baseType: !5, size: 32, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !155, file: !119, line: 498, baseType: !5, size: 32, offset: 1568)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !226, line: 295, baseType: !227)
!226 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !226, line: 115, size: 11392, elements: !228)
!228 = !{!229, !230, !287, !290, !291, !292, !293, !294, !295, !296, !298, !299, !300, !301, !302, !306, !317, !319, !320, !363, !364, !367, !368, !384, !385, !386, !387, !388, !389, !390, !394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !409, !410, !411, !412, !413, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !473, !474, !475, !476, !477, !478, !479, !480, !481, !484, !487, !490, !491, !492, !493, !494, !497, !500, !503, !504, !510, !511, !512, !513, !514, !515, !517, !520, !523, !527, !1716, !1717}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !227, file: !226, line: 116, baseType: !158, size: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !227, file: !226, line: 117, baseType: !231, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !233, line: 838, size: 768, elements: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !{!235, !236, !237, !247, !248, !280, !281, !282, !283, !284, !285, !286}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !232, file: !233, line: 840, baseType: !153, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !232, file: !233, line: 844, baseType: !153, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !232, file: !233, line: 848, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !233, line: 549, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !233, line: 544, size: 320, elements: !241)
!241 = !{!242, !244, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !233, line: 545, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !240, file: !233, line: 545, baseType: !243, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !240, file: !233, line: 547, baseType: !153, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !240, file: !233, line: 548, baseType: !126, size: 128, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !232, file: !233, line: 851, baseType: !126, size: 128, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !232, file: !233, line: 853, baseType: !249, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !233, line: 594, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !233, line: 561, size: 1664, elements: !252)
!252 = !{!253, !255, !256, !257, !258, !259, !260, !261, !262, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !233, line: 562, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !233, line: 562, baseType: !254, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !251, file: !233, line: 564, baseType: !126, size: 128, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !251, file: !233, line: 565, baseType: !153, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !251, file: !233, line: 566, baseType: !238, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !251, file: !233, line: 568, baseType: !126, size: 128, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !251, file: !233, line: 569, baseType: !126, size: 128, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !233, line: 571, baseType: !135, size: 512, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !251, file: !233, line: 573, baseType: !263, size: 32, offset: 1152)
!263 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !251, file: !233, line: 574, baseType: !263, size: 32, offset: 1184)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !251, file: !233, line: 576, baseType: !263, size: 32, offset: 1216)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !251, file: !233, line: 576, baseType: !263, size: 32, offset: 1248)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !251, file: !233, line: 577, baseType: !263, size: 32, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !251, file: !233, line: 577, baseType: !263, size: 32, offset: 1312)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !251, file: !233, line: 579, baseType: !263, size: 32, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !251, file: !233, line: 580, baseType: !263, size: 32, offset: 1376)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !251, file: !233, line: 582, baseType: !263, size: 32, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !251, file: !233, line: 582, baseType: !263, size: 32, offset: 1440)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !251, file: !233, line: 583, baseType: !151, size: 16, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !251, file: !233, line: 585, baseType: !151, size: 16, offset: 1488)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !251, file: !233, line: 586, baseType: !151, size: 16, offset: 1504)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !233, line: 588, baseType: !151, size: 16, offset: 1520)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !251, file: !233, line: 590, baseType: !116, size: 64, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !233, line: 592, baseType: !5, size: 32, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !251, file: !233, line: 593, baseType: !5, size: 32, offset: 1632)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !232, file: !233, line: 858, baseType: !126, size: 128, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !232, file: !233, line: 859, baseType: !126, size: 128, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !232, file: !233, line: 862, baseType: !5, size: 32, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !232, file: !233, line: 863, baseType: !5, size: 32, offset: 672)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !232, file: !233, line: 866, baseType: !151, size: 16, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !232, file: !233, line: 867, baseType: !151, size: 16, offset: 720)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !232, file: !233, line: 868, baseType: !263, size: 32, offset: 736)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !227, file: !226, line: 119, baseType: !288, size: 64, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !226, line: 57, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !226, line: 121, baseType: !151, size: 16, offset: 1088)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !227, file: !226, line: 121, baseType: !151, size: 16, offset: 1104)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !227, file: !226, line: 122, baseType: !5, size: 32, offset: 1120)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !227, file: !226, line: 122, baseType: !5, size: 32, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !227, file: !226, line: 122, baseType: !5, size: 32, offset: 1184)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !227, file: !226, line: 123, baseType: !135, size: 512, offset: 1216)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !227, file: !226, line: 124, baseType: !297, size: 64, offset: 1728)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !227, file: !226, line: 124, baseType: !297, size: 64, offset: 1792)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !227, file: !226, line: 127, baseType: !297, size: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !227, file: !226, line: 127, baseType: !297, size: 64, offset: 1920)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !227, file: !226, line: 127, baseType: !297, size: 64, offset: 1984)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !227, file: !226, line: 128, baseType: !303, size: 64, offset: 2048)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !305, line: 46, flags: DIFlagFwdDecl)
!305 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !227, file: !226, line: 130, baseType: !307, size: 64, offset: 2112)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !226, line: 97, size: 832, elements: !309)
!309 = !{!310, !315, !316}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !308, file: !226, line: 98, baseType: !311, size: 768)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 768, elements: !312)
!312 = !{!313, !314}
!313 = !DISubrange(count: 8)
!314 = !DISubrange(count: 3)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !308, file: !226, line: 99, baseType: !5, size: 32, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !308, file: !226, line: 99, baseType: !5, size: 32, offset: 800)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !227, file: !226, line: 131, baseType: !318, size: 64, offset: 2176)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !227, file: !226, line: 132, baseType: !318, size: 64, offset: 2240)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !227, file: !226, line: 133, baseType: !321, size: 64, offset: 2304)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !119, line: 334, size: 1728, elements: !323)
!323 = !{!324, !325, !328, !329, !330, !331, !332, !333, !336, !337, !338, !339, !340, !341, !342, !362}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !322, file: !119, line: 335, baseType: !126, size: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !322, file: !119, line: 336, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !119, line: 47, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !119, line: 338, baseType: !151, size: 16, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !322, file: !119, line: 338, baseType: !151, size: 16, offset: 208)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !322, file: !119, line: 339, baseType: !22, size: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !322, file: !119, line: 340, baseType: !5, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !322, file: !119, line: 342, baseType: !263, size: 32, offset: 288)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !322, file: !119, line: 343, baseType: !334, size: 96, offset: 320)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 96, elements: !335)
!335 = !{!314}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !322, file: !119, line: 344, baseType: !334, size: 96, offset: 416)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !322, file: !119, line: 347, baseType: !126, size: 128, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !322, file: !119, line: 349, baseType: !5, size: 32, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !322, file: !119, line: 350, baseType: !5, size: 32, offset: 672)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !322, file: !119, line: 351, baseType: !116, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !322, file: !119, line: 352, baseType: !116, size: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !322, file: !119, line: 354, baseType: !343, size: 384, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !119, line: 116, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !119, line: 94, size: 384, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !344, file: !119, line: 96, baseType: !5, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !344, file: !119, line: 96, baseType: !5, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !344, file: !119, line: 97, baseType: !5, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !344, file: !119, line: 97, baseType: !5, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !344, file: !119, line: 99, baseType: !151, size: 16, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !344, file: !119, line: 100, baseType: !151, size: 16, offset: 144)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !344, file: !119, line: 102, baseType: !151, size: 16, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !344, file: !119, line: 105, baseType: !151, size: 16, offset: 176)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !344, file: !119, line: 108, baseType: !151, size: 16, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !344, file: !119, line: 109, baseType: !151, size: 16, offset: 208)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !344, file: !119, line: 111, baseType: !151, size: 16, offset: 224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !344, file: !119, line: 112, baseType: !151, size: 16, offset: 240)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !344, file: !119, line: 114, baseType: !5, size: 32, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !344, file: !119, line: 114, baseType: !5, size: 32, offset: 288)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !344, file: !119, line: 115, baseType: !5, size: 32, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !344, file: !119, line: 115, baseType: !5, size: 32, offset: 352)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !322, file: !119, line: 355, baseType: !135, size: 512, offset: 1216)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !226, line: 134, baseType: !116, size: 64, offset: 2368)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !227, file: !226, line: 136, baseType: !365, size: 64, offset: 2432)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !226, line: 58, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !227, file: !226, line: 138, baseType: !343, size: 384, offset: 2496)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !227, file: !226, line: 139, baseType: !369, size: 64, offset: 2880)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !119, line: 80, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !119, line: 72, size: 192, elements: !372)
!372 = !{!373, !380, !381, !382, !383}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !371, file: !119, line: 73, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !119, line: 59, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !119, line: 56, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !376, file: !119, line: 57, baseType: !334, size: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !119, line: 58, baseType: !5, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !371, file: !119, line: 74, baseType: !5, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !371, file: !119, line: 76, baseType: !5, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !371, file: !119, line: 77, baseType: !5, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !119, line: 79, baseType: !5, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !227, file: !226, line: 141, baseType: !126, size: 128, offset: 2944)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !227, file: !226, line: 142, baseType: !126, size: 128, offset: 3072)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !227, file: !226, line: 143, baseType: !126, size: 128, offset: 3200)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !227, file: !226, line: 144, baseType: !126, size: 128, offset: 3328)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !227, file: !226, line: 146, baseType: !5, size: 32, offset: 3456)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !227, file: !226, line: 147, baseType: !5, size: 32, offset: 3488)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !227, file: !226, line: 150, baseType: !391, size: 64, offset: 3520)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !80, line: 46, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !227, file: !226, line: 151, baseType: !395, size: 64, offset: 3584)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !227, file: !226, line: 152, baseType: !5, size: 32, offset: 3648)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !227, file: !226, line: 153, baseType: !5, size: 32, offset: 3680)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !227, file: !226, line: 156, baseType: !334, size: 96, offset: 3712)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !227, file: !226, line: 156, baseType: !334, size: 96, offset: 3808)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !227, file: !226, line: 156, baseType: !334, size: 96, offset: 3904)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !227, file: !226, line: 157, baseType: !334, size: 96, offset: 4000)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !227, file: !226, line: 158, baseType: !334, size: 96, offset: 4096)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !227, file: !226, line: 159, baseType: !334, size: 96, offset: 4192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !227, file: !226, line: 160, baseType: !334, size: 96, offset: 4288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !227, file: !226, line: 160, baseType: !334, size: 96, offset: 4384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !227, file: !226, line: 161, baseType: !407, size: 128, offset: 4480)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 128, elements: !146)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !227, file: !226, line: 161, baseType: !407, size: 128, offset: 4608)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !227, file: !226, line: 162, baseType: !334, size: 96, offset: 4736)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !227, file: !226, line: 162, baseType: !334, size: 96, offset: 4832)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !227, file: !226, line: 163, baseType: !263, size: 32, offset: 4928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !227, file: !226, line: 163, baseType: !263, size: 32, offset: 4960)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !227, file: !226, line: 164, baseType: !414, size: 512, offset: 4992)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 512, elements: !415)
!415 = !{!147, !147}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !227, file: !226, line: 165, baseType: !414, size: 512, offset: 5504)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !227, file: !226, line: 166, baseType: !414, size: 512, offset: 6016)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !227, file: !226, line: 167, baseType: !414, size: 512, offset: 6528)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !227, file: !226, line: 176, baseType: !414, size: 512, offset: 7040)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !227, file: !226, line: 178, baseType: !22, size: 32, offset: 7552)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !226, line: 180, baseType: !151, size: 16, offset: 7584)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !227, file: !226, line: 181, baseType: !151, size: 16, offset: 7600)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !227, file: !226, line: 183, baseType: !151, size: 16, offset: 7616)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !227, file: !226, line: 183, baseType: !151, size: 16, offset: 7632)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !227, file: !226, line: 184, baseType: !151, size: 16, offset: 7648)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !227, file: !226, line: 184, baseType: !151, size: 16, offset: 7664)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !227, file: !226, line: 185, baseType: !151, size: 16, offset: 7680)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !227, file: !226, line: 186, baseType: !151, size: 16, offset: 7696)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !227, file: !226, line: 187, baseType: !151, size: 16, offset: 7712)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !227, file: !226, line: 188, baseType: !136, size: 8, offset: 7728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !227, file: !226, line: 189, baseType: !136, size: 8, offset: 7736)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !227, file: !226, line: 192, baseType: !5, size: 32, offset: 7744)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !227, file: !226, line: 192, baseType: !5, size: 32, offset: 7776)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !227, file: !226, line: 192, baseType: !5, size: 32, offset: 7808)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !227, file: !226, line: 192, baseType: !5, size: 32, offset: 7840)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !227, file: !226, line: 194, baseType: !5, size: 32, offset: 7872)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !227, file: !226, line: 202, baseType: !263, size: 32, offset: 7904)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !227, file: !226, line: 202, baseType: !263, size: 32, offset: 7936)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !227, file: !226, line: 202, baseType: !263, size: 32, offset: 7968)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !227, file: !226, line: 211, baseType: !263, size: 32, offset: 8000)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !227, file: !226, line: 212, baseType: !263, size: 32, offset: 8032)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !227, file: !226, line: 213, baseType: !263, size: 32, offset: 8064)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !227, file: !226, line: 214, baseType: !263, size: 32, offset: 8096)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !227, file: !226, line: 215, baseType: !263, size: 32, offset: 8128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !227, file: !226, line: 216, baseType: !263, size: 32, offset: 8160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !227, file: !226, line: 219, baseType: !263, size: 32, offset: 8192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !227, file: !226, line: 220, baseType: !263, size: 32, offset: 8224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !227, file: !226, line: 221, baseType: !263, size: 32, offset: 8256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !227, file: !226, line: 224, baseType: !450, size: 16, offset: 8288)
!450 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !227, file: !226, line: 224, baseType: !450, size: 16, offset: 8304)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !227, file: !226, line: 226, baseType: !151, size: 16, offset: 8320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !227, file: !226, line: 228, baseType: !136, size: 8, offset: 8336)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !227, file: !226, line: 229, baseType: !136, size: 8, offset: 8344)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !227, file: !226, line: 231, baseType: !151, size: 16, offset: 8352)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !227, file: !226, line: 232, baseType: !136, size: 8, offset: 8368)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !227, file: !226, line: 233, baseType: !136, size: 8, offset: 8376)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !227, file: !226, line: 234, baseType: !263, size: 32, offset: 8384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !227, file: !226, line: 235, baseType: !263, size: 32, offset: 8416)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !227, file: !226, line: 237, baseType: !126, size: 128, offset: 8448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !227, file: !226, line: 238, baseType: !126, size: 128, offset: 8576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !227, file: !226, line: 239, baseType: !126, size: 128, offset: 8704)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !227, file: !226, line: 240, baseType: !126, size: 128, offset: 8832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !227, file: !226, line: 242, baseType: !263, size: 32, offset: 8960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !227, file: !226, line: 244, baseType: !151, size: 16, offset: 8992)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !227, file: !226, line: 245, baseType: !450, size: 16, offset: 9008)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !227, file: !226, line: 246, baseType: !407, size: 128, offset: 9024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !227, file: !226, line: 248, baseType: !5, size: 32, offset: 9152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !227, file: !226, line: 249, baseType: !5, size: 32, offset: 9184)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !227, file: !226, line: 251, baseType: !471, size: 64, offset: 9216)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !226, line: 251, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !227, file: !226, line: 253, baseType: !136, size: 8, offset: 9280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !227, file: !226, line: 254, baseType: !136, size: 8, offset: 9288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !227, file: !226, line: 255, baseType: !151, size: 16, offset: 9296)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !227, file: !226, line: 256, baseType: !334, size: 96, offset: 9312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !227, file: !226, line: 258, baseType: !126, size: 128, offset: 9408)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !227, file: !226, line: 259, baseType: !126, size: 128, offset: 9536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !227, file: !226, line: 260, baseType: !126, size: 128, offset: 9664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !227, file: !226, line: 261, baseType: !126, size: 128, offset: 9792)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !227, file: !226, line: 263, baseType: !482, size: 64, offset: 9920)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !226, line: 52, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !227, file: !226, line: 264, baseType: !485, size: 64, offset: 9984)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !226, line: 53, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !227, file: !226, line: 265, baseType: !488, size: 64, offset: 10048)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !119, line: 46, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !227, file: !226, line: 267, baseType: !136, size: 8, offset: 10112)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !227, file: !226, line: 268, baseType: !136, size: 8, offset: 10120)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !227, file: !226, line: 269, baseType: !151, size: 16, offset: 10128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !227, file: !226, line: 270, baseType: !263, size: 32, offset: 10144)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !227, file: !226, line: 272, baseType: !495, size: 64, offset: 10176)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !226, line: 54, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !227, file: !226, line: 275, baseType: !498, size: 64, offset: 10240)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !226, line: 275, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !227, file: !226, line: 277, baseType: !501, size: 64, offset: 10304)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !226, line: 56, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !227, file: !226, line: 277, baseType: !501, size: 64, offset: 10368)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !227, file: !226, line: 278, baseType: !505, size: 64, offset: 10432)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !506, line: 27, baseType: !507)
!506 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !508, line: 45, baseType: !509)
!508 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!509 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !227, file: !226, line: 279, baseType: !505, size: 64, offset: 10496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !227, file: !226, line: 280, baseType: !22, size: 32, offset: 10560)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !227, file: !226, line: 281, baseType: !22, size: 32, offset: 10592)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !227, file: !226, line: 283, baseType: !126, size: 128, offset: 10624)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !227, file: !226, line: 284, baseType: !126, size: 128, offset: 10752)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !227, file: !226, line: 285, baseType: !516, size: 64, offset: 10880)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !227, file: !226, line: 287, baseType: !518, size: 64, offset: 10944)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !226, line: 59, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !227, file: !226, line: 288, baseType: !521, size: 64, offset: 11008)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !226, line: 288, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !227, file: !226, line: 290, baseType: !524, size: 64, offset: 11072)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 2)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !227, file: !226, line: 291, baseType: !528, size: 64, offset: 11136)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !530, line: 65, baseType: !531)
!530 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !530, line: 50, size: 320, elements: !532)
!532 = !{!533, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !531, file: !530, line: 51, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !536, line: 1216, size: 39680, elements: !537)
!536 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !{!538, !539, !540, !541, !544, !545, !546, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !572, !645, !1072, !1287, !1290, !1578, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1600, !1601, !1602, !1603, !1604, !1612, !1679, !1686, !1687, !1694, !1695, !1696, !1697, !1698, !1699, !1700}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !535, file: !536, line: 1217, baseType: !158, size: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !535, file: !536, line: 1218, baseType: !231, size: 64, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !535, file: !536, line: 1220, baseType: !297, size: 64, offset: 1024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !535, file: !536, line: 1221, baseType: !542, size: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !536, line: 52, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !535, file: !536, line: 1223, baseType: !534, size: 64, offset: 1152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !535, file: !536, line: 1225, baseType: !126, size: 128, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !535, file: !536, line: 1226, baseType: !547, size: 64, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !536, line: 69, size: 320, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !536, line: 70, baseType: !547, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !548, file: !536, line: 70, baseType: !547, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !548, file: !536, line: 71, baseType: !22, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !548, file: !536, line: 71, baseType: !22, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !548, file: !536, line: 72, baseType: !5, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !548, file: !536, line: 73, baseType: !151, size: 16, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !548, file: !536, line: 73, baseType: !151, size: 16, offset: 240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !548, file: !536, line: 74, baseType: !297, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !535, file: !536, line: 1227, baseType: !297, size: 64, offset: 1408)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !535, file: !536, line: 1229, baseType: !334, size: 96, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !535, file: !536, line: 1230, baseType: !334, size: 96, offset: 1568)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !535, file: !536, line: 1231, baseType: !334, size: 96, offset: 1664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !535, file: !536, line: 1231, baseType: !334, size: 96, offset: 1760)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !535, file: !536, line: 1233, baseType: !22, size: 32, offset: 1856)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !535, file: !536, line: 1234, baseType: !5, size: 32, offset: 1888)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !535, file: !536, line: 1235, baseType: !22, size: 32, offset: 1920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !535, file: !536, line: 1237, baseType: !151, size: 16, offset: 1952)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !535, file: !536, line: 1239, baseType: !136, size: 8, offset: 1968)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !535, file: !536, line: 1240, baseType: !569, size: 8, offset: 1976)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 1)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !535, file: !536, line: 1242, baseType: !573, size: 64, offset: 1984)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !575, line: 328, size: 3456, elements: !576)
!575 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!576 = !{!577, !578, !579, !582, !583, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !611, !612, !613, !616, !621, !622, !625, !629, !633, !637, !641, !642, !643, !644}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !574, file: !575, line: 329, baseType: !158, size: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !574, file: !575, line: 330, baseType: !231, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !574, file: !575, line: 332, baseType: !580, size: 64, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !575, line: 332, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !574, file: !575, line: 333, baseType: !135, size: 512, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !574, file: !575, line: 335, baseType: !584, size: 64, offset: 1600)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !575, line: 335, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !574, file: !575, line: 337, baseType: !365, size: 64, offset: 1664)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !574, file: !575, line: 338, baseType: !524, size: 64, offset: 1728)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !574, file: !575, line: 340, baseType: !126, size: 128, offset: 1792)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !574, file: !575, line: 340, baseType: !126, size: 128, offset: 1920)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !575, line: 342, baseType: !5, size: 32, offset: 2048)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !574, file: !575, line: 342, baseType: !5, size: 32, offset: 2080)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !574, file: !575, line: 343, baseType: !5, size: 32, offset: 2112)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !575, line: 345, baseType: !5, size: 32, offset: 2144)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !574, file: !575, line: 346, baseType: !5, size: 32, offset: 2176)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !574, file: !575, line: 347, baseType: !151, size: 16, offset: 2208)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !574, file: !575, line: 348, baseType: !151, size: 16, offset: 2224)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !574, file: !575, line: 349, baseType: !5, size: 32, offset: 2240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !574, file: !575, line: 351, baseType: !5, size: 32, offset: 2272)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !574, file: !575, line: 353, baseType: !151, size: 16, offset: 2304)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !574, file: !575, line: 354, baseType: !151, size: 16, offset: 2320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !574, file: !575, line: 355, baseType: !5, size: 32, offset: 2336)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !574, file: !575, line: 357, baseType: !603, size: 128, offset: 2368)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !604, line: 95, baseType: !605)
!604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !604, line: 92, size: 128, elements: !606)
!606 = !{!607, !608, !609, !610}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !605, file: !604, line: 93, baseType: !263, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !605, file: !604, line: 93, baseType: !263, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !605, file: !604, line: 94, baseType: !263, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !605, file: !604, line: 94, baseType: !263, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !574, file: !575, line: 363, baseType: !126, size: 128, offset: 2496)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !574, file: !575, line: 363, baseType: !126, size: 128, offset: 2624)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !574, file: !575, line: 368, baseType: !614, size: 64, offset: 2752)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !575, line: 48, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !574, file: !575, line: 372, baseType: !617, size: 32, offset: 2816)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !575, line: 274, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !575, line: 271, size: 32, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !618, file: !575, line: 273, baseType: !22, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !574, file: !575, line: 373, baseType: !5, size: 32, offset: 2848)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !574, file: !575, line: 382, baseType: !623, size: 64, offset: 2880)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !575, line: 46, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !574, file: !575, line: 385, baseType: !626, size: 64, offset: 2944)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !116, !263}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !574, file: !575, line: 386, baseType: !630, size: 64, offset: 3008)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !116, !395}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !574, file: !575, line: 387, baseType: !634, size: 64, offset: 3072)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!5, !116}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !574, file: !575, line: 388, baseType: !638, size: 64, offset: 3136)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !116}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !574, file: !575, line: 389, baseType: !116, size: 64, offset: 3200)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !574, file: !575, line: 389, baseType: !116, size: 64, offset: 3264)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !574, file: !575, line: 389, baseType: !116, size: 64, offset: 3328)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !574, file: !575, line: 389, baseType: !116, size: 64, offset: 3392)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !535, file: !536, line: 1244, baseType: !646, size: 64, offset: 2048)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !648, line: 200, size: 17024, elements: !649)
!648 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!649 = !{!650, !651, !652, !653, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !647, file: !648, line: 201, baseType: !516, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !647, file: !648, line: 202, baseType: !126, size: 128, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !647, file: !648, line: 203, baseType: !126, size: 128, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !647, file: !648, line: 206, baseType: !654, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !648, line: 190, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !648, line: 126, size: 2816, elements: !657)
!657 = !{!658, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !756, !757, !758, !759, !1037, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1064}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !648, line: 127, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !648, line: 127, baseType: !659, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !656, file: !648, line: 128, baseType: !116, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !656, file: !648, line: 129, baseType: !116, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !656, file: !648, line: 130, baseType: !135, size: 512, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !648, line: 132, baseType: !5, size: 32, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !656, file: !648, line: 132, baseType: !5, size: 32, offset: 800)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !656, file: !648, line: 133, baseType: !5, size: 32, offset: 832)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !656, file: !648, line: 134, baseType: !5, size: 32, offset: 864)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !656, file: !648, line: 134, baseType: !5, size: 32, offset: 896)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !656, file: !648, line: 134, baseType: !5, size: 32, offset: 928)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !656, file: !648, line: 135, baseType: !5, size: 32, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !656, file: !648, line: 135, baseType: !5, size: 32, offset: 992)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !656, file: !648, line: 136, baseType: !5, size: 32, offset: 1024)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !656, file: !648, line: 136, baseType: !5, size: 32, offset: 1056)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !656, file: !648, line: 137, baseType: !5, size: 32, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !656, file: !648, line: 137, baseType: !5, size: 32, offset: 1120)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !656, file: !648, line: 138, baseType: !263, size: 32, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !656, file: !648, line: 139, baseType: !263, size: 32, offset: 1184)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !656, file: !648, line: 139, baseType: !263, size: 32, offset: 1216)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !656, file: !648, line: 141, baseType: !151, size: 16, offset: 1248)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !656, file: !648, line: 142, baseType: !151, size: 16, offset: 1264)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !656, file: !648, line: 143, baseType: !5, size: 32, offset: 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !656, file: !648, line: 144, baseType: !5, size: 32, offset: 1312)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !656, file: !648, line: 146, baseType: !684, size: 64, offset: 1344)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !648, line: 114, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !648, line: 99, size: 7232, elements: !687)
!687 = !{!688, !690, !691, !692, !693, !694, !695, !706, !710, !724, !733, !740, !750}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !686, file: !648, line: 100, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !686, file: !648, line: 100, baseType: !689, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !686, file: !648, line: 101, baseType: !5, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !686, file: !648, line: 101, baseType: !5, size: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !686, file: !648, line: 102, baseType: !5, size: 32, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !686, file: !648, line: 102, baseType: !5, size: 32, offset: 224)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !686, file: !648, line: 103, baseType: !696, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !648, line: 59, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !648, line: 56, size: 2112, elements: !699)
!699 = !{!700, !704, !705}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !698, file: !648, line: 57, baseType: !701, size: 2048)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2048, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !698, file: !648, line: 58, baseType: !5, size: 32, offset: 2048)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !698, file: !648, line: 58, baseType: !5, size: 32, offset: 2080)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !686, file: !648, line: 106, baseType: !707, size: 6144, offset: 320)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 6144, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 768)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !686, file: !648, line: 107, baseType: !711, size: 64, offset: 6464)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !648, line: 97, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !648, line: 83, size: 8320, elements: !714)
!714 = !{!715, !716, !717, !720, !721, !722, !723}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !713, file: !648, line: 84, baseType: !707, size: 6144)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !713, file: !648, line: 87, baseType: !701, size: 2048, offset: 6144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !713, file: !648, line: 88, baseType: !718, size: 64, offset: 8192)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !530, line: 41, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !713, file: !648, line: 90, baseType: !151, size: 16, offset: 8256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !713, file: !648, line: 92, baseType: !151, size: 16, offset: 8272)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !713, file: !648, line: 93, baseType: !151, size: 16, offset: 8288)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !713, file: !648, line: 95, baseType: !151, size: 16, offset: 8304)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !686, file: !648, line: 108, baseType: !725, size: 64, offset: 6528)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !648, line: 66, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !648, line: 61, size: 128, elements: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !727, file: !648, line: 62, baseType: !5, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !727, file: !648, line: 63, baseType: !5, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !727, file: !648, line: 64, baseType: !5, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !727, file: !648, line: 65, baseType: !5, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !686, file: !648, line: 109, baseType: !734, size: 64, offset: 6592)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !648, line: 71, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !648, line: 68, size: 64, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !736, file: !648, line: 69, baseType: !5, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !736, file: !648, line: 70, baseType: !5, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !686, file: !648, line: 110, baseType: !741, size: 64, offset: 6656)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !648, line: 81, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !648, line: 73, size: 352, elements: !744)
!744 = !{!745, !746, !747, !748, !749}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !743, file: !648, line: 74, baseType: !334, size: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !743, file: !648, line: 75, baseType: !334, size: 96, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !743, file: !648, line: 76, baseType: !334, size: 96, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !648, line: 77, baseType: !5, size: 32, offset: 288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !743, file: !648, line: 78, baseType: !5, size: 32, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !686, file: !648, line: 113, baseType: !751, size: 512, offset: 6720)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !752, line: 182, baseType: !753)
!752 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !752, line: 180, size: 512, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !753, file: !752, line: 181, baseType: !135, size: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !656, file: !648, line: 148, baseType: !303, size: 64, offset: 1408)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !656, file: !648, line: 151, baseType: !534, size: 64, offset: 1472)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !656, file: !648, line: 152, baseType: !297, size: 64, offset: 1536)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !656, file: !648, line: 153, baseType: !760, size: 64, offset: 1600)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !762, line: 64, size: 19136, elements: !763)
!762 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!763 = !{!764, !765, !766, !767, !768, !769, !771, !772, !773, !774, !777, !778, !1023, !1024, !1032, !1033, !1034, !1035, !1036}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !761, file: !762, line: 65, baseType: !158, size: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !761, file: !762, line: 66, baseType: !231, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !762, line: 68, baseType: !177, size: 8192, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !761, file: !762, line: 70, baseType: !5, size: 32, offset: 9216)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !761, file: !762, line: 71, baseType: !5, size: 32, offset: 9248)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !761, file: !762, line: 72, baseType: !770, size: 64, offset: 9280)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !525)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !761, file: !762, line: 74, baseType: !263, size: 32, offset: 9344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !761, file: !762, line: 74, baseType: !263, size: 32, offset: 9376)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !761, file: !762, line: 76, baseType: !718, size: 64, offset: 9408)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !761, file: !762, line: 77, baseType: !775, size: 64, offset: 9472)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !762, line: 77, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !761, file: !762, line: 78, baseType: !365, size: 64, offset: 9536)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !761, file: !762, line: 80, baseType: !779, size: 2624, offset: 9600)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !780, line: 340, size: 2624, elements: !781)
!780 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!781 = !{!782, !810, !828, !829, !830, !845, !903, !904, !1003, !1004, !1005, !1006, !1012}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !779, file: !780, line: 341, baseType: !783, size: 576)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !780, line: 251, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !780, line: 207, size: 576, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !780, line: 208, baseType: !5, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !784, file: !780, line: 211, baseType: !151, size: 16, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !784, file: !780, line: 212, baseType: !151, size: 16, offset: 48)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !784, file: !780, line: 213, baseType: !263, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !784, file: !780, line: 214, baseType: !151, size: 16, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !784, file: !780, line: 215, baseType: !151, size: 16, offset: 112)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !784, file: !780, line: 216, baseType: !151, size: 16, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !784, file: !780, line: 217, baseType: !151, size: 16, offset: 144)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !784, file: !780, line: 218, baseType: !151, size: 16, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !784, file: !780, line: 219, baseType: !151, size: 16, offset: 176)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !784, file: !780, line: 220, baseType: !263, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !784, file: !780, line: 222, baseType: !151, size: 16, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !784, file: !780, line: 225, baseType: !151, size: 16, offset: 240)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !784, file: !780, line: 228, baseType: !5, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !784, file: !780, line: 229, baseType: !5, size: 32, offset: 288)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !784, file: !780, line: 233, baseType: !5, size: 32, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !784, file: !780, line: 236, baseType: !151, size: 16, offset: 352)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !784, file: !780, line: 236, baseType: !151, size: 16, offset: 368)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !784, file: !780, line: 241, baseType: !263, size: 32, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !784, file: !780, line: 244, baseType: !5, size: 32, offset: 416)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !784, file: !780, line: 244, baseType: !5, size: 32, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !784, file: !780, line: 245, baseType: !263, size: 32, offset: 480)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !784, file: !780, line: 248, baseType: !263, size: 32, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !784, file: !780, line: 250, baseType: !5, size: 32, offset: 544)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !779, file: !780, line: 342, baseType: !811, size: 448, offset: 576)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !780, line: 79, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !780, line: 61, size: 448, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !812, file: !780, line: 62, baseType: !116, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !812, file: !780, line: 64, baseType: !151, size: 16, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !812, file: !780, line: 65, baseType: !151, size: 16, offset: 80)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !812, file: !780, line: 67, baseType: !263, size: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !812, file: !780, line: 68, baseType: !263, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !812, file: !780, line: 69, baseType: !263, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !812, file: !780, line: 70, baseType: !151, size: 16, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !812, file: !780, line: 71, baseType: !151, size: 16, offset: 208)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !812, file: !780, line: 72, baseType: !524, size: 64, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !812, file: !780, line: 75, baseType: !263, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !812, file: !780, line: 75, baseType: !263, size: 32, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !812, file: !780, line: 75, baseType: !263, size: 32, offset: 352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !812, file: !780, line: 78, baseType: !263, size: 32, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !812, file: !780, line: 78, baseType: !263, size: 32, offset: 416)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !779, file: !780, line: 343, baseType: !126, size: 128, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !779, file: !780, line: 344, baseType: !126, size: 128, offset: 1152)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !779, file: !780, line: 345, baseType: !831, size: 192, offset: 1280)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !780, line: 278, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !780, line: 270, size: 192, elements: !833)
!833 = !{!834, !835, !836, !837, !838}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !832, file: !780, line: 271, baseType: !5, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !832, file: !780, line: 273, baseType: !263, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !832, file: !780, line: 275, baseType: !5, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !832, file: !780, line: 276, baseType: !5, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !832, file: !780, line: 277, baseType: !839, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !780, line: 55, size: 576, elements: !841)
!841 = !{!842, !843, !844}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !840, file: !780, line: 56, baseType: !5, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !840, file: !780, line: 57, baseType: !263, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !840, file: !780, line: 58, baseType: !414, size: 512, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !779, file: !780, line: 346, baseType: !846, size: 384, offset: 1472)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !780, line: 268, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !780, line: 253, size: 384, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !897, !898, !899, !900, !901, !902}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !847, file: !780, line: 254, baseType: !5, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !847, file: !780, line: 255, baseType: !5, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !847, file: !780, line: 255, baseType: !5, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !847, file: !780, line: 258, baseType: !263, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !847, file: !780, line: 259, baseType: !854, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !780, line: 164, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !780, line: 108, size: 1664, elements: !857)
!857 = !{!858, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !780, line: 109, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !856, file: !780, line: 109, baseType: !859, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !856, file: !780, line: 111, baseType: !135, size: 512, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !856, file: !780, line: 119, baseType: !524, size: 64, offset: 640)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !856, file: !780, line: 119, baseType: !524, size: 64, offset: 704)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !856, file: !780, line: 125, baseType: !524, size: 64, offset: 768)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !856, file: !780, line: 125, baseType: !524, size: 64, offset: 832)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !856, file: !780, line: 127, baseType: !524, size: 64, offset: 896)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !856, file: !780, line: 130, baseType: !5, size: 32, offset: 960)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !856, file: !780, line: 131, baseType: !5, size: 32, offset: 992)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !856, file: !780, line: 132, baseType: !870, size: 64, offset: 1024)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !780, line: 106, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !780, line: 81, size: 512, elements: !873)
!873 = !{!874, !875, !878, !879, !880, !881}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !872, file: !780, line: 82, baseType: !524, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !872, file: !780, line: 97, baseType: !876, size: 256, offset: 64)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 256, elements: !877)
!877 = !{!147, !526}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !872, file: !780, line: 102, baseType: !524, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !872, file: !780, line: 102, baseType: !524, size: 64, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !872, file: !780, line: 104, baseType: !5, size: 32, offset: 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !872, file: !780, line: 105, baseType: !5, size: 32, offset: 480)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !856, file: !780, line: 135, baseType: !334, size: 96, offset: 1088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !856, file: !780, line: 136, baseType: !263, size: 32, offset: 1184)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !856, file: !780, line: 139, baseType: !5, size: 32, offset: 1216)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !856, file: !780, line: 139, baseType: !5, size: 32, offset: 1248)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !856, file: !780, line: 139, baseType: !5, size: 32, offset: 1280)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !856, file: !780, line: 140, baseType: !334, size: 96, offset: 1312)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !856, file: !780, line: 143, baseType: !151, size: 16, offset: 1408)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !856, file: !780, line: 144, baseType: !151, size: 16, offset: 1424)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !856, file: !780, line: 145, baseType: !151, size: 16, offset: 1440)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !856, file: !780, line: 148, baseType: !151, size: 16, offset: 1456)
