; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_walkers.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_walkers.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BMWalker = type { i8, void (%struct.BMWalker*, i8*)*, i8* (%struct.BMWalker*)*, i8* (%struct.BMWalker*)*, i32, i32, i32, i32, %struct.BMesh*, %struct.BLI_mempool*, %struct.ListBase, i16, i16, i16, i32, %struct.GSet*, %struct.GSet*, i32 }
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }

!11 = !{!12, !13, !14, !15, !16, !17, !18, !19}
!12 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!13 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!15 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!16 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!17 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !10, line: 116, baseType: !5, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !10, line: 131, baseType: !5, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !10, line: 123, baseType: !5, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!35 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!36 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!37 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 182, baseType: !5, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 39, baseType: !5, size: 32, elements: !48)
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "BMW_FLAG_NOP", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "BMW_FLAG_TEST_HIDDEN", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 109, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!53 = !DIEnumerator(name: "BMW_VERT_SHELL", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "BMW_FACE_SHELL", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "BMW_LOOP", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "BMW_FACELOOP", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "BMW_EDGERING", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "BMW_EDGEBOUNDARY", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "BMW_LOOPDATA_ISLAND", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "BMW_ISLANDBOUND", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "BMW_ISLAND", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "BMW_CONNECTED_VERTEX", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "BMW_CUSTOM", value: 10, isUnsigned: true)
!64 = !DIEnumerator(name: "BMW_MAXWALKERS", value: 11, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 83, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !{i32 7, !"Dwarf Version", i32 4}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{i32 1, !"wchar_size", i32 4}
!75 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!76 = distinct !DISubprogram(name: "BMW_begin", scope: !1, file: !1, line: 61, type: !77, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !326)
!77 = !DISubroutineType(types: !78)
!78 = !{!71, !79, !71}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWalker", file: !4, line: 72, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMWalker", file: !4, line: 45, size: 960, elements: !82)
!82 = !{!83, !85, !90, !94, !95, !97, !99, !100, !101, !312, !315, !316, !317, !318, !319, !321, !324, !325}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "begin_htype", scope: !81, file: !4, line: 46, baseType: !84, size: 8)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !81, file: !4, line: 47, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !71}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !81, file: !4, line: 48, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!71, !89}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !81, file: !4, line: 49, baseType: !91, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "structsize", scope: !81, file: !4, line: 50, baseType: !96, size: 32, offset: 256)
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !81, file: !4, line: 51, baseType: !98, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWOrder", file: !4, line: 37, baseType: !3)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "valid_mask", scope: !81, file: !4, line: 52, baseType: !96, size: 32, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !81, file: !4, line: 55, baseType: !96, size: 32, offset: 352)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !81, file: !4, line: 57, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !104, line: 246, baseType: !105)
!104 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !104, line: 186, size: 8064, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !120, !121, !122, !123, !189, !193, !197, !198, !199, !200, !201, !202, !203, !204, !256, !295, !296, !297, !298, !299, !300, !301, !302, !309, !310, !311}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !105, file: !104, line: 187, baseType: !96, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !105, file: !104, line: 187, baseType: !96, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !105, file: !104, line: 187, baseType: !96, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !105, file: !104, line: 187, baseType: !96, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !105, file: !104, line: 188, baseType: !96, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !105, file: !104, line: 188, baseType: !96, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !105, file: !104, line: 188, baseType: !96, size: 32, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !105, file: !104, line: 193, baseType: !84, size: 8, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !105, file: !104, line: 197, baseType: !84, size: 8, offset: 232)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !105, file: !104, line: 201, baseType: !117, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !119, line: 71, flags: DIFlagFwdDecl)
!119 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !105, file: !104, line: 201, baseType: !117, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !105, file: !104, line: 201, baseType: !117, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !105, file: !104, line: 201, baseType: !117, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !105, file: !104, line: 208, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !104, line: 103, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !104, line: 90, size: 448, elements: !128)
!128 = !{!129, !138, !144, !149, !150}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !127, file: !104, line: 91, baseType: !130, size: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !104, line: 82, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !104, line: 64, size: 128, elements: !132)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !104, line: 65, baseType: !71, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !131, file: !104, line: 66, baseType: !96, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !131, file: !104, line: 73, baseType: !84, size: 8, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !131, file: !104, line: 74, baseType: !84, size: 8, offset: 104)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !131, file: !104, line: 80, baseType: !84, size: 8, offset: 112)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !127, file: !104, line: 92, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !104, line: 180, size: 16, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !140, file: !104, line: 181, baseType: !143, size: 16)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !127, file: !104, line: 94, baseType: !145, size: 96, offset: 192)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 96, elements: !147)
!146 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!147 = !{!148}
!148 = !DISubrange(count: 3)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !127, file: !104, line: 95, baseType: !145, size: 96, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !127, file: !104, line: 102, baseType: !151, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !104, line: 110, size: 640, elements: !153)
!153 = !{!154, !155, !156, !158, !159, !182, !188}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !152, file: !104, line: 111, baseType: !130, size: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !152, file: !104, line: 112, baseType: !139, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !152, file: !104, line: 114, baseType: !157, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !152, file: !104, line: 114, baseType: !157, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !152, file: !104, line: 118, baseType: !160, size: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !104, line: 125, size: 576, elements: !162)
!162 = !{!163, !164, !165, !166, !178, !179, !180, !181}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !161, file: !104, line: 126, baseType: !130, size: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !161, file: !104, line: 129, baseType: !157, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !161, file: !104, line: 130, baseType: !151, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !161, file: !104, line: 131, baseType: !167, size: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !104, line: 164, size: 448, elements: !169)
!169 = !{!170, !171, !172, !175, !176, !177}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !168, file: !104, line: 165, baseType: !130, size: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !168, file: !104, line: 166, baseType: !139, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !168, file: !104, line: 172, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !104, line: 140, baseType: !161)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !168, file: !104, line: 174, baseType: !96, size: 32, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !168, file: !104, line: 175, baseType: !145, size: 96, offset: 288)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !168, file: !104, line: 176, baseType: !143, size: 16, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !161, file: !104, line: 135, baseType: !160, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !161, file: !104, line: 135, baseType: !160, size: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !104, line: 139, baseType: !160, size: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !104, line: 139, baseType: !160, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !152, file: !104, line: 122, baseType: !183, size: 128, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !104, line: 108, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !104, line: 106, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !104, line: 107, baseType: !151, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !104, line: 107, baseType: !151, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !152, file: !104, line: 122, baseType: !183, size: 128, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !105, file: !104, line: 209, baseType: !190, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !104, line: 123, baseType: !152)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !105, file: !104, line: 210, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !104, line: 178, baseType: !168)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !105, file: !104, line: 213, baseType: !96, size: 32, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !105, file: !104, line: 214, baseType: !96, size: 32, offset: 736)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !105, file: !104, line: 215, baseType: !96, size: 32, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !105, file: !104, line: 218, baseType: !117, size: 64, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !105, file: !104, line: 218, baseType: !117, size: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !105, file: !104, line: 218, baseType: !117, size: 64, offset: 960)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !105, file: !104, line: 220, baseType: !96, size: 32, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !105, file: !104, line: 221, baseType: !205, size: 64, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !10, line: 190, size: 10496, elements: !207)
!207 = !{!208, !244, !245, !249, !252, !253, !255}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !206, file: !10, line: 191, baseType: !209, size: 5120)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 5120, elements: !242)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !10, line: 147, size: 320, elements: !211)
!211 = !{!212, !215, !217, !227, !228}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !210, file: !10, line: 148, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !210, file: !10, line: 149, baseType: !216, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !10, line: 112, baseType: !9)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !210, file: !10, line: 150, baseType: !218, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !10, line: 142, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !10, line: 138, size: 32, elements: !220)
!220 = !{!221, !223, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !219, file: !10, line: 139, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !10, line: 122, baseType: !20)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !219, file: !10, line: 140, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !10, line: 136, baseType: !26)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !219, file: !10, line: 141, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !10, line: 130, baseType: !32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !210, file: !10, line: 152, baseType: !96, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !10, line: 162, baseType: !229, size: 128, offset: 192)
!229 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !210, file: !10, line: 155, size: 128, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !229, file: !10, line: 156, baseType: !96, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !229, file: !10, line: 157, baseType: !146, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !229, file: !10, line: 158, baseType: !71, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !229, file: !10, line: 159, baseType: !145, size: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !229, file: !10, line: 160, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !229, file: !10, line: 161, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !240, line: 48, baseType: !241)
!240 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !240, line: 48, flags: DIFlagFwdDecl)
!242 = !{!243}
!243 = !DISubrange(count: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !206, file: !10, line: 192, baseType: !209, size: 5120, offset: 5120)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !206, file: !10, line: 193, baseType: !246, size: 64, offset: 10240)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !102, !205}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !206, file: !10, line: 194, baseType: !250, size: 64, offset: 10304)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !10, line: 194, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !206, file: !10, line: 195, baseType: !96, size: 32, offset: 10368)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !206, file: !10, line: 196, baseType: !254, size: 32, offset: 10400)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !10, line: 188, baseType: !40)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !206, file: !10, line: 197, baseType: !96, size: 32, offset: 10432)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !105, file: !104, line: 223, baseType: !257, size: 1600, offset: 1152)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !119, line: 73, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !119, line: 64, size: 1600, elements: !259)
!259 = !{!260, !278, !282, !283, !284, !285, !286}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !258, file: !119, line: 65, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !119, line: 53, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !119, line: 42, size: 832, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !277}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !119, line: 43, baseType: !96, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !263, file: !119, line: 44, baseType: !96, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !263, file: !119, line: 45, baseType: !96, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !263, file: !119, line: 46, baseType: !96, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !263, file: !119, line: 47, baseType: !96, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !263, file: !119, line: 48, baseType: !96, size: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !263, file: !119, line: 49, baseType: !96, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !263, file: !119, line: 50, baseType: !96, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !119, line: 51, baseType: !274, size: 512, offset: 256)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !119, line: 52, baseType: !71, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !258, file: !119, line: 66, baseType: !279, size: 1312, offset: 64)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1312, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 41)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !258, file: !119, line: 69, baseType: !96, size: 32, offset: 1376)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !258, file: !119, line: 69, baseType: !96, size: 32, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !258, file: !119, line: 70, baseType: !96, size: 32, offset: 1440)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !258, file: !119, line: 71, baseType: !117, size: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !258, file: !119, line: 72, baseType: !287, size: 64, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !119, line: 59, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !119, line: 57, size: 8192, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !289, file: !119, line: 58, baseType: !292, size: 8192)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 1024)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !105, file: !104, line: 223, baseType: !257, size: 1600, offset: 2752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !105, file: !104, line: 223, baseType: !257, size: 1600, offset: 4352)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !105, file: !104, line: 223, baseType: !257, size: 1600, offset: 5952)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !105, file: !104, line: 233, baseType: !143, size: 16, offset: 7552)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !105, file: !104, line: 236, baseType: !96, size: 32, offset: 7584)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !105, file: !104, line: 238, baseType: !96, size: 32, offset: 7616)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !105, file: !104, line: 238, baseType: !96, size: 32, offset: 7648)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !105, file: !104, line: 239, baseType: !303, size: 128, offset: 7680)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !304, line: 71, baseType: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !304, line: 69, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !305, file: !304, line: 70, baseType: !71, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !305, file: !304, line: 70, baseType: !71, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !105, file: !104, line: 241, baseType: !195, size: 64, offset: 7808)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !105, file: !104, line: 243, baseType: !303, size: 128, offset: 7872)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !105, file: !104, line: 245, baseType: !71, size: 64, offset: 8000)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "worklist", scope: !81, file: !4, line: 58, baseType: !313, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !66, line: 47, baseType: !118)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !81, file: !4, line: 59, baseType: !303, size: 128, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mask_vert", scope: !81, file: !4, line: 63, baseType: !143, size: 16, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mask_edge", scope: !81, file: !4, line: 64, baseType: !143, size: 16, offset: 656)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mask_face", scope: !81, file: !4, line: 65, baseType: !143, size: 16, offset: 672)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !4, line: 67, baseType: !320, size: 32, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWFlag", file: !4, line: 42, baseType: !47)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "visit_set", scope: !81, file: !4, line: 69, baseType: !322, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !240, line: 176, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "visit_set_alt", scope: !81, file: !4, line: 70, baseType: !322, size: 64, offset: 832)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !81, file: !4, line: 71, baseType: !96, size: 32, offset: 896)
!326 = !{}
!327 = !DILocalVariable(name: "walker", arg: 1, scope: !76, file: !1, line: 61, type: !79)
!328 = !DILocation(line: 61, column: 27, scope: !76)
!329 = !DILocalVariable(name: "start", arg: 2, scope: !76, file: !1, line: 61, type: !71)
!330 = !DILocation(line: 61, column: 41, scope: !76)
!331 = !DILocation(line: 65, column: 2, scope: !76)
!332 = !DILocation(line: 65, column: 10, scope: !76)
!333 = !DILocation(line: 65, column: 16, scope: !76)
!334 = !DILocation(line: 65, column: 24, scope: !76)
!335 = !DILocation(line: 67, column: 27, scope: !76)
!336 = !DILocation(line: 67, column: 9, scope: !76)
!337 = !DILocation(line: 67, column: 37, scope: !76)
!338 = !DILocation(line: 67, column: 45, scope: !76)
!339 = !DILocation(line: 67, column: 50, scope: !76)
!340 = !DILocation(line: 67, column: 2, scope: !76)
!341 = distinct !DISubprogram(name: "BMW_current_state", scope: !1, file: !1, line: 186, type: !342, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !326)
!342 = !DISubroutineType(types: !343)
!343 = !{!71, !79}
!344 = !DILocalVariable(name: "walker", arg: 1, scope: !341, file: !1, line: 186, type: !79)
!345 = !DILocation(line: 186, column: 35, scope: !341)
!346 = !DILocalVariable(name: "currentstate", scope: !341, file: !1, line: 188, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMwGenericWalker", file: !349, line: 40, baseType: !350)
!349 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_walkers_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMwGenericWalker", file: !349, line: 37, size: 192, elements: !351)
!351 = !{!352, !359}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !350, file: !349, line: 38, baseType: !353, size: 128)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Link", file: !304, line: 59, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Link", file: !304, line: 57, size: 128, elements: !355)
!355 = !{!356, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !304, line: 58, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !304, line: 58, baseType: !357, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !350, file: !349, line: 39, baseType: !96, size: 32, offset: 128)
!360 = !DILocation(line: 188, column: 20, scope: !341)
!361 = !DILocation(line: 188, column: 35, scope: !341)
!362 = !DILocation(line: 188, column: 43, scope: !341)
!363 = !DILocation(line: 188, column: 50, scope: !341)
!364 = !DILocation(line: 189, column: 6, scope: !365)
!365 = distinct !DILexicalBlock(scope: !341, file: !1, line: 189, column: 6)
!366 = !DILocation(line: 189, column: 6, scope: !341)
!367 = !DILocation(line: 200, column: 19, scope: !368)
!368 = distinct !DILexicalBlock(scope: !365, file: !1, line: 189, column: 20)
!369 = !DILocation(line: 200, column: 33, scope: !368)
!370 = !DILocation(line: 200, column: 39, scope: !368)
!371 = !DILocation(line: 200, column: 3, scope: !368)
!372 = !DILocation(line: 200, column: 11, scope: !368)
!373 = !DILocation(line: 200, column: 17, scope: !368)
!374 = !DILocation(line: 201, column: 2, scope: !368)
!375 = !DILocation(line: 202, column: 9, scope: !341)
!376 = !DILocation(line: 202, column: 2, scope: !341)
!377 = distinct !DISubprogram(name: "BMW_init", scope: !1, file: !1, line: 77, type: !378, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !326)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !79, !102, !96, !143, !143, !143, !320, !96}
!380 = !DILocalVariable(name: "walker", arg: 1, scope: !377, file: !1, line: 77, type: !79)
!381 = !DILocation(line: 77, column: 25, scope: !377)
!382 = !DILocalVariable(name: "bm", arg: 2, scope: !377, file: !1, line: 77, type: !102)
!383 = !DILocation(line: 77, column: 40, scope: !377)
!384 = !DILocalVariable(name: "type", arg: 3, scope: !377, file: !1, line: 77, type: !96)
!385 = !DILocation(line: 77, column: 48, scope: !377)
!386 = !DILocalVariable(name: "mask_vert", arg: 4, scope: !377, file: !1, line: 78, type: !143)
!387 = !DILocation(line: 78, column: 21, scope: !377)
!388 = !DILocalVariable(name: "mask_edge", arg: 5, scope: !377, file: !1, line: 78, type: !143)
!389 = !DILocation(line: 78, column: 38, scope: !377)
!390 = !DILocalVariable(name: "mask_face", arg: 6, scope: !377, file: !1, line: 78, type: !143)
!391 = !DILocation(line: 78, column: 55, scope: !377)
!392 = !DILocalVariable(name: "flag", arg: 7, scope: !377, file: !1, line: 79, type: !320)
!393 = !DILocation(line: 79, column: 23, scope: !377)
!394 = !DILocalVariable(name: "layer", arg: 8, scope: !377, file: !1, line: 80, type: !96)
!395 = !DILocation(line: 80, column: 19, scope: !377)
!396 = !DILocation(line: 82, column: 9, scope: !377)
!397 = !DILocation(line: 82, column: 2, scope: !377)
!398 = !DILocation(line: 84, column: 18, scope: !377)
!399 = !DILocation(line: 84, column: 2, scope: !377)
!400 = !DILocation(line: 84, column: 10, scope: !377)
!401 = !DILocation(line: 84, column: 16, scope: !377)
!402 = !DILocation(line: 85, column: 17, scope: !377)
!403 = !DILocation(line: 85, column: 2, scope: !377)
!404 = !DILocation(line: 85, column: 10, scope: !377)
!405 = !DILocation(line: 85, column: 15, scope: !377)
!406 = !DILocation(line: 86, column: 15, scope: !377)
!407 = !DILocation(line: 86, column: 2, scope: !377)
!408 = !DILocation(line: 86, column: 10, scope: !377)
!409 = !DILocation(line: 86, column: 13, scope: !377)
!410 = !DILocation(line: 88, column: 22, scope: !377)
!411 = !DILocation(line: 88, column: 2, scope: !377)
!412 = !DILocation(line: 88, column: 10, scope: !377)
!413 = !DILocation(line: 88, column: 20, scope: !377)
!414 = !DILocation(line: 89, column: 22, scope: !377)
!415 = !DILocation(line: 89, column: 2, scope: !377)
!416 = !DILocation(line: 89, column: 10, scope: !377)
!417 = !DILocation(line: 89, column: 20, scope: !377)
!418 = !DILocation(line: 90, column: 22, scope: !377)
!419 = !DILocation(line: 90, column: 2, scope: !377)
!420 = !DILocation(line: 90, column: 10, scope: !377)
!421 = !DILocation(line: 90, column: 20, scope: !377)
!422 = !DILocation(line: 92, column: 22, scope: !377)
