; ModuleID = 'blender/source/blender/editors/object/object_ops.c'
source_filename = "blender/source/blender/editors/object/object_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!314 = !DILocation(line: 157, column: 2, scope: !220)
!315 = !DILocation(line: 158, column: 2, scope: !220)
!316 = !DILocation(line: 159, column: 2, scope: !220)
!317 = !DILocation(line: 160, column: 2, scope: !220)
!318 = !DILocation(line: 161, column: 2, scope: !220)
!319 = !DILocation(line: 162, column: 2, scope: !220)
!320 = !DILocation(line: 163, column: 2, scope: !220)
!321 = !DILocation(line: 164, column: 2, scope: !220)
!322 = !DILocation(line: 165, column: 2, scope: !220)
!323 = !DILocation(line: 166, column: 2, scope: !220)
!324 = !DILocation(line: 167, column: 2, scope: !220)
!325 = !DILocation(line: 168, column: 2, scope: !220)
!326 = !DILocation(line: 169, column: 2, scope: !220)
!327 = !DILocation(line: 170, column: 2, scope: !220)
!328 = !DILocation(line: 171, column: 2, scope: !220)
!329 = !DILocation(line: 173, column: 2, scope: !220)
!330 = !DILocation(line: 174, column: 2, scope: !220)
!331 = !DILocation(line: 175, column: 2, scope: !220)
!332 = !DILocation(line: 176, column: 2, scope: !220)
!333 = !DILocation(line: 177, column: 2, scope: !220)
!334 = !DILocation(line: 178, column: 2, scope: !220)
!335 = !DILocation(line: 179, column: 2, scope: !220)
!336 = !DILocation(line: 180, column: 2, scope: !220)
!337 = !DILocation(line: 181, column: 2, scope: !220)
!338 = !DILocation(line: 182, column: 2, scope: !220)
!339 = !DILocation(line: 183, column: 2, scope: !220)
!340 = !DILocation(line: 184, column: 2, scope: !220)
!341 = !DILocation(line: 185, column: 2, scope: !220)
!342 = !DILocation(line: 186, column: 2, scope: !220)
!343 = !DILocation(line: 187, column: 2, scope: !220)
!344 = !DILocation(line: 188, column: 2, scope: !220)
!345 = !DILocation(line: 189, column: 2, scope: !220)
!346 = !DILocation(line: 190, column: 2, scope: !220)
!347 = !DILocation(line: 191, column: 2, scope: !220)
!348 = !DILocation(line: 192, column: 2, scope: !220)
!349 = !DILocation(line: 193, column: 2, scope: !220)
!350 = !DILocation(line: 194, column: 2, scope: !220)
!351 = !DILocation(line: 195, column: 2, scope: !220)
!352 = !DILocation(line: 196, column: 2, scope: !220)
!353 = !DILocation(line: 197, column: 2, scope: !220)
!354 = !DILocation(line: 198, column: 2, scope: !220)
!355 = !DILocation(line: 199, column: 2, scope: !220)
!356 = !DILocation(line: 200, column: 2, scope: !220)
!357 = !DILocation(line: 201, column: 2, scope: !220)
!358 = !DILocation(line: 202, column: 2, scope: !220)
!359 = !DILocation(line: 204, column: 2, scope: !220)
!360 = !DILocation(line: 206, column: 2, scope: !220)
!361 = !DILocation(line: 207, column: 2, scope: !220)
!362 = !DILocation(line: 208, column: 2, scope: !220)
!363 = !DILocation(line: 209, column: 2, scope: !220)
!364 = !DILocation(line: 210, column: 2, scope: !220)
!365 = !DILocation(line: 211, column: 2, scope: !220)
!366 = !DILocation(line: 213, column: 2, scope: !220)
!367 = !DILocation(line: 214, column: 2, scope: !220)
!368 = !DILocation(line: 215, column: 2, scope: !220)
!369 = !DILocation(line: 216, column: 2, scope: !220)
!370 = !DILocation(line: 217, column: 2, scope: !220)
!371 = !DILocation(line: 218, column: 2, scope: !220)
!372 = !DILocation(line: 220, column: 2, scope: !220)
!373 = !DILocation(line: 221, column: 2, scope: !220)
!374 = !DILocation(line: 222, column: 2, scope: !220)
!375 = !DILocation(line: 223, column: 2, scope: !220)
!376 = !DILocation(line: 224, column: 2, scope: !220)
!377 = !DILocation(line: 225, column: 2, scope: !220)
!378 = !DILocation(line: 226, column: 2, scope: !220)
!379 = !DILocation(line: 227, column: 2, scope: !220)
!380 = !DILocation(line: 229, column: 2, scope: !220)
!381 = !DILocation(line: 230, column: 2, scope: !220)
!382 = !DILocation(line: 231, column: 2, scope: !220)
!383 = !DILocation(line: 232, column: 2, scope: !220)
!384 = !DILocation(line: 233, column: 2, scope: !220)
!385 = !DILocation(line: 235, column: 2, scope: !220)
!386 = !DILocation(line: 236, column: 2, scope: !220)
!387 = !DILocation(line: 237, column: 2, scope: !220)
!388 = !DILocation(line: 238, column: 2, scope: !220)
!389 = !DILocation(line: 239, column: 2, scope: !220)
!390 = !DILocation(line: 240, column: 2, scope: !220)
!391 = !DILocation(line: 241, column: 2, scope: !220)
!392 = !DILocation(line: 243, column: 2, scope: !220)
!393 = !DILocation(line: 244, column: 2, scope: !220)
!394 = !DILocation(line: 245, column: 2, scope: !220)
!395 = !DILocation(line: 246, column: 2, scope: !220)
!396 = !DILocation(line: 247, column: 2, scope: !220)
!397 = !DILocation(line: 249, column: 2, scope: !220)
!398 = !DILocation(line: 250, column: 2, scope: !220)
!399 = !DILocation(line: 252, column: 2, scope: !220)
!400 = !DILocation(line: 253, column: 1, scope: !220)
!401 = distinct !DISubprogram(name: "ED_operatormacros_object", scope: !1, file: !1, line: 255, type: !221, scopeLine: 256, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !223)
!402 = !DILocalVariable(name: "ot", scope: !401, file: !1, line: 257, type: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !405, line: 568, baseType: !406)
!405 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !405, line: 508, size: 1536, elements: !407)
!407 = !{!408, !412, !413, !414, !415, !2127, !2131, !2137, !2141, !2142, !2146, !2147, !2148, !2149, !2153, !2154, !2169, !2170, !2174, !2200}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !406, file: !405, line: 509, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!411 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !406, file: !405, line: 510, baseType: !409, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !406, file: !405, line: 511, baseType: !409, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !406, file: !405, line: 512, baseType: !409, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !406, file: !405, line: 518, baseType: !416, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !420, !423}
!419 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !422, line: 44, flags: DIFlagFwdDecl)
!422 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !425, line: 328, size: 1344, elements: !426)
!425 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!426 = !{!427, !428, !429, !433, !465, !467, !468, !469, !481, !2120, !2121, !2122, !2125, !2126}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !425, line: 329, baseType: !423, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !425, line: 329, baseType: !423, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !424, file: !425, line: 332, baseType: !430, size: 512, offset: 128)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 512, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !424, file: !425, line: 333, baseType: !434, size: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !436, line: 75, baseType: !437)
!436 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !436, line: 62, size: 1024, elements: !438)
!438 = !{!439, !441, !442, !443, !444, !446, !447, !448, !463, !464}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !436, line: 63, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !436, line: 63, baseType: !440, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !436, line: 64, baseType: !411, size: 8, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !437, file: !436, line: 64, baseType: !411, size: 8, offset: 136)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !437, file: !436, line: 65, baseType: !445, size: 16, offset: 144)
!445 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !437, file: !436, line: 66, baseType: !430, size: 512, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !437, file: !436, line: 67, baseType: !419, size: 32, offset: 672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !436, line: 69, baseType: !449, size: 256, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !436, line: 60, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !436, line: 48, size: 256, elements: !451)
!451 = !{!452, !454, !461, !462}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !450, file: !436, line: 49, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !450, file: !436, line: 58, baseType: !455, size: 128, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !456, line: 71, baseType: !457)
!456 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !456, line: 69, size: 128, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !457, file: !456, line: 70, baseType: !453, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !457, file: !456, line: 70, baseType: !453, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !450, file: !436, line: 59, baseType: !419, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !450, file: !436, line: 59, baseType: !419, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !437, file: !436, line: 70, baseType: !419, size: 32, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !437, file: !436, line: 74, baseType: !419, size: 32, offset: 992)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !425, line: 336, baseType: !466, size: 64, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !424, file: !425, line: 337, baseType: !453, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !424, file: !425, line: 338, baseType: !453, size: 64, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !424, file: !425, line: 340, baseType: !470, size: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !422, line: 55, size: 192, elements: !472)
!472 = !{!473, !477, !480}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !471, file: !422, line: 58, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !471, file: !422, line: 56, size: 64, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !422, line: 57, baseType: !453, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !471, file: !422, line: 60, baseType: !478, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !422, line: 41, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !471, file: !422, line: 61, baseType: !453, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !424, file: !425, line: 341, baseType: !482, size: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !425, line: 106, size: 320, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !483, file: !425, line: 107, baseType: !455, size: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !483, file: !425, line: 108, baseType: !419, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !483, file: !425, line: 109, baseType: !419, size: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !425, line: 110, baseType: !419, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !483, file: !425, line: 110, baseType: !419, size: 32, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !483, file: !425, line: 111, baseType: !491, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !405, line: 490, size: 768, elements: !493)
!493 = !{!494, !495, !496, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !405, line: 491, baseType: !491, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !492, file: !405, line: 491, baseType: !491, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !492, file: !405, line: 493, baseType: !497, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !425, line: 169, size: 2048, elements: !499)
!499 = !{!500, !501, !502, !503, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2086, !2089, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !425, line: 170, baseType: !497, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !498, file: !425, line: 170, baseType: !497, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !498, file: !425, line: 172, baseType: !453, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !498, file: !425, line: 174, baseType: !504, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !506, line: 49, size: 1984, elements: !507)
!506 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!507 = !{!508, !544, !545, !546, !547, !548, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !505, file: !506, line: 50, baseType: !509, size: 960)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !436, line: 130, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !436, line: 117, size: 960, elements: !511)
!511 = !{!512, !513, !514, !516, !535, !539, !540, !541, !542, !543}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !510, file: !436, line: 118, baseType: !453, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !510, file: !436, line: 118, baseType: !453, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !510, file: !436, line: 119, baseType: !515, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !510, file: !436, line: 120, baseType: !517, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !436, line: 136, size: 17600, elements: !519)
!519 = !{!520, !521, !523, !526, !530, !531, !532}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !518, file: !436, line: 137, baseType: !509, size: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !518, file: !436, line: 138, baseType: !522, size: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !518, file: !436, line: 139, baseType: !524, size: 64, offset: 1024)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !436, line: 43, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !436, line: 140, baseType: !527, size: 8192, offset: 1088)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 8192, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !518, file: !436, line: 141, baseType: !527, size: 8192, offset: 9280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !518, file: !436, line: 148, baseType: !517, size: 64, offset: 17472)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !518, file: !436, line: 150, baseType: !533, size: 64, offset: 17536)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !436, line: 45, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !510, file: !436, line: 121, baseType: !536, size: 528, offset: 256)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 528, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 66)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !436, line: 126, baseType: !445, size: 16, offset: 784)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !510, file: !436, line: 127, baseType: !419, size: 32, offset: 800)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !510, file: !436, line: 128, baseType: !419, size: 32, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !510, file: !436, line: 128, baseType: !419, size: 32, offset: 864)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !510, file: !436, line: 129, baseType: !434, size: 64, offset: 896)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !505, file: !506, line: 52, baseType: !455, size: 128, offset: 960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !505, file: !506, line: 53, baseType: !455, size: 128, offset: 1088)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !505, file: !506, line: 54, baseType: !455, size: 128, offset: 1216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !505, file: !506, line: 55, baseType: !455, size: 128, offset: 1344)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !505, file: !506, line: 57, baseType: !549, size: 64, offset: 1472)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !551, line: 1216, size: 39680, elements: !552)
!551 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!552 = !{!553, !554, !558, !849, !852, !853, !854, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !880, !951, !1379, !1594, !1597, !1886, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1908, !1909, !1910, !1911, !1912, !1920, !1987, !1994, !1995, !2002, !2003, !2004, !2005, !2006, !2007, !2008}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !550, file: !551, line: 1217, baseType: !509, size: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !550, file: !551, line: 1218, baseType: !555, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !557, line: 45, flags: DIFlagFwdDecl)
!557 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!558 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !550, file: !551, line: 1220, baseType: !559, size: 64, offset: 1024)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !206, line: 115, size: 11392, elements: !561)
!561 = !{!562, !563, !564, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !581, !593, !607, !608, !651, !652, !655, !656, !672, !673, !674, !675, !676, !677, !678, !682, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !698, !699, !700, !701, !702, !703, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !763, !764, !765, !766, !767, !768, !769, !770, !771, !774, !777, !780, !781, !782, !783, !784, !787, !790, !793, !794, !800, !801, !802, !803, !804, !805, !807, !810, !813, !817, !837, !838}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !560, file: !206, line: 116, baseType: !509, size: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !560, file: !206, line: 117, baseType: !555, size: 64, offset: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !560, file: !206, line: 119, baseType: !565, size: 64, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !206, line: 57, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !560, file: !206, line: 121, baseType: !445, size: 16, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !560, file: !206, line: 121, baseType: !445, size: 16, offset: 1104)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !560, file: !206, line: 122, baseType: !419, size: 32, offset: 1120)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !560, file: !206, line: 122, baseType: !419, size: 32, offset: 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !560, file: !206, line: 122, baseType: !419, size: 32, offset: 1184)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !560, file: !206, line: 123, baseType: !430, size: 512, offset: 1216)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !560, file: !206, line: 124, baseType: !559, size: 64, offset: 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !560, file: !206, line: 124, baseType: !559, size: 64, offset: 1792)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !560, file: !206, line: 127, baseType: !559, size: 64, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !560, file: !206, line: 127, baseType: !559, size: 64, offset: 1920)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !560, file: !206, line: 127, baseType: !559, size: 64, offset: 1984)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !560, file: !206, line: 128, baseType: !579, size: 64, offset: 2048)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !557, line: 46, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !560, file: !206, line: 130, baseType: !582, size: 64, offset: 2112)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !206, line: 97, size: 832, elements: !584)
!584 = !{!585, !591, !592}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !583, file: !206, line: 98, baseType: !586, size: 768)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 768, elements: !588)
!587 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!588 = !{!589, !590}
!589 = !DISubrange(count: 8)
!590 = !DISubrange(count: 3)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !206, line: 99, baseType: !419, size: 32, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !583, file: !206, line: 99, baseType: !419, size: 32, offset: 800)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !560, file: !206, line: 131, baseType: !594, size: 64, offset: 2176)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !596, line: 486, size: 1600, elements: !597)
!596 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !595, file: !596, line: 487, baseType: !509, size: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !595, file: !596, line: 489, baseType: !455, size: 128, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !595, file: !596, line: 490, baseType: !455, size: 128, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !595, file: !596, line: 491, baseType: !455, size: 128, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !595, file: !596, line: 492, baseType: !455, size: 128, offset: 1344)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !596, line: 494, baseType: !419, size: 32, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !595, file: !596, line: 495, baseType: !419, size: 32, offset: 1504)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !595, file: !596, line: 497, baseType: !419, size: 32, offset: 1536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !595, file: !596, line: 498, baseType: !419, size: 32, offset: 1568)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !560, file: !206, line: 132, baseType: !594, size: 64, offset: 2240)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !560, file: !206, line: 133, baseType: !609, size: 64, offset: 2304)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !596, line: 334, size: 1728, elements: !611)
!611 = !{!612, !613, !616, !617, !618, !619, !620, !621, !624, !625, !626, !627, !628, !629, !630, !650}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !610, file: !596, line: 335, baseType: !455, size: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !610, file: !596, line: 336, baseType: !614, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !596, line: 47, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !596, line: 338, baseType: !445, size: 16, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !610, file: !596, line: 338, baseType: !445, size: 16, offset: 208)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !610, file: !596, line: 339, baseType: !5, size: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !610, file: !596, line: 340, baseType: !419, size: 32, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !610, file: !596, line: 342, baseType: !587, size: 32, offset: 288)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !610, file: !596, line: 343, baseType: !622, size: 96, offset: 320)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 96, elements: !623)
!623 = !{!590}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !610, file: !596, line: 344, baseType: !622, size: 96, offset: 416)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !610, file: !596, line: 347, baseType: !455, size: 128, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !610, file: !596, line: 349, baseType: !419, size: 32, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !610, file: !596, line: 350, baseType: !419, size: 32, offset: 672)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !610, file: !596, line: 351, baseType: !453, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !610, file: !596, line: 352, baseType: !453, size: 64, offset: 768)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !610, file: !596, line: 354, baseType: !631, size: 384, offset: 832)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !596, line: 116, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !596, line: 94, size: 384, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !632, file: !596, line: 96, baseType: !419, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !632, file: !596, line: 96, baseType: !419, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !632, file: !596, line: 97, baseType: !419, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !632, file: !596, line: 97, baseType: !419, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !632, file: !596, line: 99, baseType: !445, size: 16, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !632, file: !596, line: 100, baseType: !445, size: 16, offset: 144)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !632, file: !596, line: 102, baseType: !445, size: 16, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !632, file: !596, line: 105, baseType: !445, size: 16, offset: 176)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !632, file: !596, line: 108, baseType: !445, size: 16, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !632, file: !596, line: 109, baseType: !445, size: 16, offset: 208)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !632, file: !596, line: 111, baseType: !445, size: 16, offset: 224)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !632, file: !596, line: 112, baseType: !445, size: 16, offset: 240)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !632, file: !596, line: 114, baseType: !419, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !632, file: !596, line: 114, baseType: !419, size: 32, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !632, file: !596, line: 115, baseType: !419, size: 32, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !632, file: !596, line: 115, baseType: !419, size: 32, offset: 352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !610, file: !596, line: 355, baseType: !430, size: 512, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !206, line: 134, baseType: !453, size: 64, offset: 2368)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !560, file: !206, line: 136, baseType: !653, size: 64, offset: 2432)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !206, line: 58, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !560, file: !206, line: 138, baseType: !631, size: 384, offset: 2496)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !560, file: !206, line: 139, baseType: !657, size: 64, offset: 2880)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !596, line: 80, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !596, line: 72, size: 192, elements: !660)
!660 = !{!661, !668, !669, !670, !671}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !659, file: !596, line: 73, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !596, line: 59, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !596, line: 56, size: 128, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !664, file: !596, line: 57, baseType: !622, size: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !664, file: !596, line: 58, baseType: !419, size: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !659, file: !596, line: 74, baseType: !419, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !659, file: !596, line: 76, baseType: !419, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !659, file: !596, line: 77, baseType: !419, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !659, file: !596, line: 79, baseType: !419, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !560, file: !206, line: 141, baseType: !455, size: 128, offset: 2944)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !560, file: !206, line: 142, baseType: !455, size: 128, offset: 3072)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !560, file: !206, line: 143, baseType: !455, size: 128, offset: 3200)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !560, file: !206, line: 144, baseType: !455, size: 128, offset: 3328)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !560, file: !206, line: 146, baseType: !419, size: 32, offset: 3456)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !560, file: !206, line: 147, baseType: !419, size: 32, offset: 3488)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !560, file: !206, line: 150, baseType: !679, size: 64, offset: 3520)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !206, line: 50, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !560, file: !206, line: 151, baseType: !683, size: 64, offset: 3584)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !560, file: !206, line: 152, baseType: !419, size: 32, offset: 3648)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !560, file: !206, line: 153, baseType: !419, size: 32, offset: 3680)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !560, file: !206, line: 156, baseType: !622, size: 96, offset: 3712)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !560, file: !206, line: 156, baseType: !622, size: 96, offset: 3808)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !560, file: !206, line: 156, baseType: !622, size: 96, offset: 3904)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !560, file: !206, line: 157, baseType: !622, size: 96, offset: 4000)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !560, file: !206, line: 158, baseType: !622, size: 96, offset: 4096)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !560, file: !206, line: 159, baseType: !622, size: 96, offset: 4192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !560, file: !206, line: 160, baseType: !622, size: 96, offset: 4288)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !560, file: !206, line: 160, baseType: !622, size: 96, offset: 4384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !560, file: !206, line: 161, baseType: !695, size: 128, offset: 4480)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 128, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 4)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !560, file: !206, line: 161, baseType: !695, size: 128, offset: 4608)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !560, file: !206, line: 162, baseType: !622, size: 96, offset: 4736)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !560, file: !206, line: 162, baseType: !622, size: 96, offset: 4832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !560, file: !206, line: 163, baseType: !587, size: 32, offset: 4928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !560, file: !206, line: 163, baseType: !587, size: 32, offset: 4960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !560, file: !206, line: 164, baseType: !704, size: 512, offset: 4992)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 512, elements: !705)
!705 = !{!697, !697}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !560, file: !206, line: 165, baseType: !704, size: 512, offset: 5504)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !560, file: !206, line: 166, baseType: !704, size: 512, offset: 6016)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !560, file: !206, line: 167, baseType: !704, size: 512, offset: 6528)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !560, file: !206, line: 176, baseType: !704, size: 512, offset: 7040)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !560, file: !206, line: 178, baseType: !5, size: 32, offset: 7552)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !206, line: 180, baseType: !445, size: 16, offset: 7584)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !560, file: !206, line: 181, baseType: !445, size: 16, offset: 7600)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !560, file: !206, line: 183, baseType: !445, size: 16, offset: 7616)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !560, file: !206, line: 183, baseType: !445, size: 16, offset: 7632)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !560, file: !206, line: 184, baseType: !445, size: 16, offset: 7648)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !560, file: !206, line: 184, baseType: !445, size: 16, offset: 7664)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !560, file: !206, line: 185, baseType: !445, size: 16, offset: 7680)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !560, file: !206, line: 186, baseType: !445, size: 16, offset: 7696)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !560, file: !206, line: 187, baseType: !445, size: 16, offset: 7712)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !560, file: !206, line: 188, baseType: !411, size: 8, offset: 7728)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !560, file: !206, line: 189, baseType: !411, size: 8, offset: 7736)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !560, file: !206, line: 192, baseType: !419, size: 32, offset: 7744)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !560, file: !206, line: 192, baseType: !419, size: 32, offset: 7776)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !560, file: !206, line: 192, baseType: !419, size: 32, offset: 7808)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !560, file: !206, line: 192, baseType: !419, size: 32, offset: 7840)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !560, file: !206, line: 194, baseType: !419, size: 32, offset: 7872)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !560, file: !206, line: 202, baseType: !587, size: 32, offset: 7904)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !560, file: !206, line: 202, baseType: !587, size: 32, offset: 7936)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !560, file: !206, line: 202, baseType: !587, size: 32, offset: 7968)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !560, file: !206, line: 211, baseType: !587, size: 32, offset: 8000)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !560, file: !206, line: 212, baseType: !587, size: 32, offset: 8032)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !560, file: !206, line: 213, baseType: !587, size: 32, offset: 8064)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !560, file: !206, line: 214, baseType: !587, size: 32, offset: 8096)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !560, file: !206, line: 215, baseType: !587, size: 32, offset: 8128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !560, file: !206, line: 216, baseType: !587, size: 32, offset: 8160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !560, file: !206, line: 219, baseType: !587, size: 32, offset: 8192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !560, file: !206, line: 220, baseType: !587, size: 32, offset: 8224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !560, file: !206, line: 221, baseType: !587, size: 32, offset: 8256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !560, file: !206, line: 224, baseType: !740, size: 16, offset: 8288)
!740 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !560, file: !206, line: 224, baseType: !740, size: 16, offset: 8304)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !560, file: !206, line: 226, baseType: !445, size: 16, offset: 8320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !560, file: !206, line: 228, baseType: !411, size: 8, offset: 8336)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !560, file: !206, line: 229, baseType: !411, size: 8, offset: 8344)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !560, file: !206, line: 231, baseType: !445, size: 16, offset: 8352)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !560, file: !206, line: 232, baseType: !411, size: 8, offset: 8368)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !560, file: !206, line: 233, baseType: !411, size: 8, offset: 8376)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !560, file: !206, line: 234, baseType: !587, size: 32, offset: 8384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !560, file: !206, line: 235, baseType: !587, size: 32, offset: 8416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !560, file: !206, line: 237, baseType: !455, size: 128, offset: 8448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !560, file: !206, line: 238, baseType: !455, size: 128, offset: 8576)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !560, file: !206, line: 239, baseType: !455, size: 128, offset: 8704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !560, file: !206, line: 240, baseType: !455, size: 128, offset: 8832)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !560, file: !206, line: 242, baseType: !587, size: 32, offset: 8960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !560, file: !206, line: 244, baseType: !445, size: 16, offset: 8992)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !560, file: !206, line: 245, baseType: !740, size: 16, offset: 9008)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !560, file: !206, line: 246, baseType: !695, size: 128, offset: 9024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !560, file: !206, line: 248, baseType: !419, size: 32, offset: 9152)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !560, file: !206, line: 249, baseType: !419, size: 32, offset: 9184)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !560, file: !206, line: 251, baseType: !761, size: 64, offset: 9216)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !206, line: 251, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !560, file: !206, line: 253, baseType: !411, size: 8, offset: 9280)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !560, file: !206, line: 254, baseType: !411, size: 8, offset: 9288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !560, file: !206, line: 255, baseType: !445, size: 16, offset: 9296)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !560, file: !206, line: 256, baseType: !622, size: 96, offset: 9312)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !560, file: !206, line: 258, baseType: !455, size: 128, offset: 9408)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !560, file: !206, line: 259, baseType: !455, size: 128, offset: 9536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !560, file: !206, line: 260, baseType: !455, size: 128, offset: 9664)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !560, file: !206, line: 261, baseType: !455, size: 128, offset: 9792)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !560, file: !206, line: 263, baseType: !772, size: 64, offset: 9920)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !206, line: 52, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !560, file: !206, line: 264, baseType: !775, size: 64, offset: 9984)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !206, line: 53, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !560, file: !206, line: 265, baseType: !778, size: 64, offset: 10048)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !596, line: 46, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !560, file: !206, line: 267, baseType: !411, size: 8, offset: 10112)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !560, file: !206, line: 268, baseType: !411, size: 8, offset: 10120)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !560, file: !206, line: 269, baseType: !445, size: 16, offset: 10128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !560, file: !206, line: 270, baseType: !587, size: 32, offset: 10144)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !560, file: !206, line: 272, baseType: !785, size: 64, offset: 10176)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !206, line: 54, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !560, file: !206, line: 275, baseType: !788, size: 64, offset: 10240)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !206, line: 275, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !560, file: !206, line: 277, baseType: !791, size: 64, offset: 10304)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !206, line: 56, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !560, file: !206, line: 277, baseType: !791, size: 64, offset: 10368)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !560, file: !206, line: 278, baseType: !795, size: 64, offset: 10432)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !796, line: 27, baseType: !797)
!796 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !798, line: 45, baseType: !799)
!798 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!799 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !560, file: !206, line: 279, baseType: !795, size: 64, offset: 10496)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !560, file: !206, line: 280, baseType: !5, size: 32, offset: 10560)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !560, file: !206, line: 281, baseType: !5, size: 32, offset: 10592)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !560, file: !206, line: 283, baseType: !455, size: 128, offset: 10624)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !560, file: !206, line: 284, baseType: !455, size: 128, offset: 10752)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !560, file: !206, line: 285, baseType: !806, size: 64, offset: 10880)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !560, file: !206, line: 287, baseType: !808, size: 64, offset: 10944)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !206, line: 59, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !560, file: !206, line: 288, baseType: !811, size: 64, offset: 11008)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !206, line: 288, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !560, file: !206, line: 290, baseType: !814, size: 64, offset: 11072)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 64, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 2)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !560, file: !206, line: 291, baseType: !818, size: 64, offset: 11136)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !820, line: 65, baseType: !821)
!820 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !820, line: 50, size: 320, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !821, file: !820, line: 51, baseType: !549, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !821, file: !820, line: 53, baseType: !419, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !821, file: !820, line: 54, baseType: !419, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !821, file: !820, line: 55, baseType: !419, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !821, file: !820, line: 55, baseType: !419, size: 32, offset: 160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !821, file: !820, line: 56, baseType: !411, size: 8, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !821, file: !820, line: 56, baseType: !411, size: 8, offset: 200)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !821, file: !820, line: 57, baseType: !411, size: 8, offset: 208)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !821, file: !820, line: 57, baseType: !411, size: 8, offset: 216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !821, file: !820, line: 59, baseType: !445, size: 16, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !821, file: !820, line: 59, baseType: !445, size: 16, offset: 240)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !821, file: !820, line: 59, baseType: !445, size: 16, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !820, line: 61, baseType: !445, size: 16, offset: 272)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !821, file: !820, line: 63, baseType: !419, size: 32, offset: 288)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !560, file: !206, line: 293, baseType: !455, size: 128, offset: 11200)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !560, file: !206, line: 294, baseType: !839, size: 64, offset: 11328)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !206, line: 113, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !206, line: 108, size: 256, elements: !842)
!842 = !{!843, !845, !846, !847, !848}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !206, line: 109, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !841, file: !206, line: 109, baseType: !844, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !841, file: !206, line: 110, baseType: !559, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !841, file: !206, line: 111, baseType: !419, size: 32, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !841, file: !206, line: 112, baseType: !587, size: 32, offset: 224)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !550, file: !551, line: 1221, baseType: !850, size: 64, offset: 1088)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !551, line: 52, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !550, file: !551, line: 1223, baseType: !549, size: 64, offset: 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !550, file: !551, line: 1225, baseType: !455, size: 128, offset: 1216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !550, file: !551, line: 1226, baseType: !855, size: 64, offset: 1344)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !551, line: 69, size: 320, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !551, line: 70, baseType: !855, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !856, file: !551, line: 70, baseType: !855, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !856, file: !551, line: 71, baseType: !5, size: 32, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !856, file: !551, line: 71, baseType: !5, size: 32, offset: 160)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !856, file: !551, line: 72, baseType: !419, size: 32, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !856, file: !551, line: 73, baseType: !445, size: 16, offset: 224)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !856, file: !551, line: 73, baseType: !445, size: 16, offset: 240)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !856, file: !551, line: 74, baseType: !559, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !550, file: !551, line: 1227, baseType: !559, size: 64, offset: 1408)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !550, file: !551, line: 1229, baseType: !622, size: 96, offset: 1472)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !550, file: !551, line: 1230, baseType: !622, size: 96, offset: 1568)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !550, file: !551, line: 1231, baseType: !622, size: 96, offset: 1664)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !550, file: !551, line: 1231, baseType: !622, size: 96, offset: 1760)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !550, file: !551, line: 1233, baseType: !5, size: 32, offset: 1856)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !550, file: !551, line: 1234, baseType: !419, size: 32, offset: 1888)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !550, file: !551, line: 1235, baseType: !5, size: 32, offset: 1920)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !551, line: 1237, baseType: !445, size: 16, offset: 1952)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !550, file: !551, line: 1239, baseType: !411, size: 8, offset: 1968)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !550, file: !551, line: 1240, baseType: !877, size: 8, offset: 1976)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 8, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 1)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !550, file: !551, line: 1242, baseType: !881, size: 64, offset: 1984)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !883, line: 328, size: 3456, elements: !884)
!883 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!884 = !{!885, !886, !887, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !917, !918, !919, !922, !927, !928, !931, !935, !939, !943, !947, !948, !949, !950}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !882, file: !883, line: 329, baseType: !509, size: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !882, file: !883, line: 330, baseType: !555, size: 64, offset: 960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !882, file: !883, line: 332, baseType: !888, size: 64, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !883, line: 332, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !882, file: !883, line: 333, baseType: !430, size: 512, offset: 1088)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !882, file: !883, line: 335, baseType: !478, size: 64, offset: 1600)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !882, file: !883, line: 337, baseType: !653, size: 64, offset: 1664)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !882, file: !883, line: 338, baseType: !814, size: 64, offset: 1728)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !882, file: !883, line: 340, baseType: !455, size: 128, offset: 1792)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !882, file: !883, line: 340, baseType: !455, size: 128, offset: 1920)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !883, line: 342, baseType: !419, size: 32, offset: 2048)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !882, file: !883, line: 342, baseType: !419, size: 32, offset: 2080)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !882, file: !883, line: 343, baseType: !419, size: 32, offset: 2112)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !882, file: !883, line: 345, baseType: !419, size: 32, offset: 2144)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !882, file: !883, line: 346, baseType: !419, size: 32, offset: 2176)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !882, file: !883, line: 347, baseType: !445, size: 16, offset: 2208)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !882, file: !883, line: 348, baseType: !445, size: 16, offset: 2224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !882, file: !883, line: 349, baseType: !419, size: 32, offset: 2240)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !882, file: !883, line: 351, baseType: !419, size: 32, offset: 2272)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !882, file: !883, line: 353, baseType: !445, size: 16, offset: 2304)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !882, file: !883, line: 354, baseType: !445, size: 16, offset: 2320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !882, file: !883, line: 355, baseType: !419, size: 32, offset: 2336)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !882, file: !883, line: 357, baseType: !909, size: 128, offset: 2368)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !910, line: 95, baseType: !911)
!910 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !910, line: 92, size: 128, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !911, file: !910, line: 93, baseType: !587, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !911, file: !910, line: 93, baseType: !587, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !911, file: !910, line: 94, baseType: !587, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !911, file: !910, line: 94, baseType: !587, size: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !882, file: !883, line: 363, baseType: !455, size: 128, offset: 2496)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !882, file: !883, line: 363, baseType: !455, size: 128, offset: 2624)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !882, file: !883, line: 368, baseType: !920, size: 64, offset: 2752)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !883, line: 48, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !882, file: !883, line: 372, baseType: !923, size: 32, offset: 2816)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !883, line: 274, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !883, line: 271, size: 32, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !924, file: !883, line: 273, baseType: !5, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !882, file: !883, line: 373, baseType: !419, size: 32, offset: 2848)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !882, file: !883, line: 382, baseType: !929, size: 64, offset: 2880)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !883, line: 46, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !882, file: !883, line: 385, baseType: !932, size: 64, offset: 2944)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !453, !587}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !882, file: !883, line: 386, baseType: !936, size: 64, offset: 3008)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !453, !683}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !882, file: !883, line: 387, baseType: !940, size: 64, offset: 3072)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!419, !453}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !882, file: !883, line: 388, baseType: !944, size: 64, offset: 3136)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !453}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !882, file: !883, line: 389, baseType: !453, size: 64, offset: 3200)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !882, file: !883, line: 389, baseType: !453, size: 64, offset: 3264)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !882, file: !883, line: 389, baseType: !453, size: 64, offset: 3328)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !882, file: !883, line: 389, baseType: !453, size: 64, offset: 3392)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !550, file: !551, line: 1244, baseType: !952, size: 64, offset: 2048)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !954, line: 200, size: 17024, elements: !955)
!954 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!955 = !{!956, !957, !958, !959, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !953, file: !954, line: 201, baseType: !806, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !953, file: !954, line: 202, baseType: !455, size: 128, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !953, file: !954, line: 203, baseType: !455, size: 128, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !953, file: !954, line: 206, baseType: !960, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !954, line: 190, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !954, line: 126, size: 2816, elements: !963)
!963 = !{!964, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !1062, !1063, !1064, !1065, !1343, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1371}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !962, file: !954, line: 127, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !962, file: !954, line: 127, baseType: !965, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !962, file: !954, line: 128, baseType: !453, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !962, file: !954, line: 129, baseType: !453, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !962, file: !954, line: 130, baseType: !430, size: 512, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !962, file: !954, line: 132, baseType: !419, size: 32, offset: 768)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !962, file: !954, line: 132, baseType: !419, size: 32, offset: 800)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !962, file: !954, line: 133, baseType: !419, size: 32, offset: 832)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !962, file: !954, line: 134, baseType: !419, size: 32, offset: 864)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !962, file: !954, line: 134, baseType: !419, size: 32, offset: 896)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !962, file: !954, line: 134, baseType: !419, size: 32, offset: 928)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !962, file: !954, line: 135, baseType: !419, size: 32, offset: 960)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !962, file: !954, line: 135, baseType: !419, size: 32, offset: 992)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !962, file: !954, line: 136, baseType: !419, size: 32, offset: 1024)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !962, file: !954, line: 136, baseType: !419, size: 32, offset: 1056)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !962, file: !954, line: 137, baseType: !419, size: 32, offset: 1088)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !962, file: !954, line: 137, baseType: !419, size: 32, offset: 1120)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !962, file: !954, line: 138, baseType: !587, size: 32, offset: 1152)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !962, file: !954, line: 139, baseType: !587, size: 32, offset: 1184)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !962, file: !954, line: 139, baseType: !587, size: 32, offset: 1216)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !962, file: !954, line: 141, baseType: !445, size: 16, offset: 1248)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !962, file: !954, line: 142, baseType: !445, size: 16, offset: 1264)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !962, file: !954, line: 143, baseType: !419, size: 32, offset: 1280)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !962, file: !954, line: 144, baseType: !419, size: 32, offset: 1312)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !962, file: !954, line: 146, baseType: !990, size: 64, offset: 1344)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !954, line: 114, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !954, line: 99, size: 7232, elements: !993)
!993 = !{!994, !996, !997, !998, !999, !1000, !1001, !1012, !1016, !1030, !1039, !1046, !1056}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !992, file: !954, line: 100, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !992, file: !954, line: 100, baseType: !995, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !992, file: !954, line: 101, baseType: !419, size: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !992, file: !954, line: 101, baseType: !419, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !992, file: !954, line: 102, baseType: !419, size: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !992, file: !954, line: 102, baseType: !419, size: 32, offset: 224)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !992, file: !954, line: 103, baseType: !1002, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !954, line: 59, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !954, line: 56, size: 2112, elements: !1005)
!1005 = !{!1006, !1010, !1011}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !954, line: 57, baseType: !1007, size: 2048)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 2048, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1004, file: !954, line: 58, baseType: !419, size: 32, offset: 2048)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1004, file: !954, line: 58, baseType: !419, size: 32, offset: 2080)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !992, file: !954, line: 106, baseType: !1013, size: 6144, offset: 320)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 6144, elements: !1014)
!1014 = !{!1015}
!1015 = !DISubrange(count: 768)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !992, file: !954, line: 107, baseType: !1017, size: 64, offset: 6464)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !954, line: 97, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !954, line: 83, size: 8320, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1026, !1027, !1028, !1029}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1019, file: !954, line: 84, baseType: !1013, size: 6144)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1019, file: !954, line: 87, baseType: !1007, size: 2048, offset: 6144)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1019, file: !954, line: 88, baseType: !1024, size: 64, offset: 8192)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !820, line: 41, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1019, file: !954, line: 90, baseType: !445, size: 16, offset: 8256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1019, file: !954, line: 92, baseType: !445, size: 16, offset: 8272)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1019, file: !954, line: 93, baseType: !445, size: 16, offset: 8288)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1019, file: !954, line: 95, baseType: !445, size: 16, offset: 8304)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !992, file: !954, line: 108, baseType: !1031, size: 64, offset: 6528)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !954, line: 66, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !954, line: 61, size: 128, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1033, file: !954, line: 62, baseType: !419, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1033, file: !954, line: 63, baseType: !419, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1033, file: !954, line: 64, baseType: !419, size: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1033, file: !954, line: 65, baseType: !419, size: 32, offset: 96)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !992, file: !954, line: 109, baseType: !1040, size: 64, offset: 6592)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !954, line: 71, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !954, line: 68, size: 64, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1042, file: !954, line: 69, baseType: !419, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1042, file: !954, line: 70, baseType: !419, size: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !992, file: !954, line: 110, baseType: !1047, size: 64, offset: 6656)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !954, line: 81, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !954, line: 73, size: 352, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1049, file: !954, line: 74, baseType: !622, size: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1049, file: !954, line: 75, baseType: !622, size: 96, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1049, file: !954, line: 76, baseType: !622, size: 96, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1049, file: !954, line: 77, baseType: !419, size: 32, offset: 288)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1049, file: !954, line: 78, baseType: !419, size: 32, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !992, file: !954, line: 113, baseType: !1057, size: 512, offset: 6720)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1058, line: 182, baseType: !1059)
!1058 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1058, line: 180, size: 512, elements: !1060)
!1060 = !{!1061}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !1058, line: 181, baseType: !430, size: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !962, file: !954, line: 148, baseType: !579, size: 64, offset: 1408)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !962, file: !954, line: 151, baseType: !549, size: 64, offset: 1472)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !962, file: !954, line: 152, baseType: !559, size: 64, offset: 1536)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !962, file: !954, line: 153, baseType: !1066, size: 64, offset: 1600)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1068, line: 64, size: 19136, elements: !1069)
!1068 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1077, !1078, !1079, !1080, !1083, !1084, !1329, !1330, !1338, !1339, !1340, !1341, !1342}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1067, file: !1068, line: 65, baseType: !509, size: 960)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1067, file: !1068, line: 66, baseType: !555, size: 64, offset: 960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1067, file: !1068, line: 68, baseType: !527, size: 8192, offset: 1024)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1067, file: !1068, line: 70, baseType: !419, size: 32, offset: 9216)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1067, file: !1068, line: 71, baseType: !419, size: 32, offset: 9248)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1067, file: !1068, line: 72, baseType: !1076, size: 64, offset: 9280)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 64, elements: !815)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1067, file: !1068, line: 74, baseType: !587, size: 32, offset: 9344)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1067, file: !1068, line: 74, baseType: !587, size: 32, offset: 9376)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1067, file: !1068, line: 76, baseType: !1024, size: 64, offset: 9408)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1067, file: !1068, line: 77, baseType: !1081, size: 64, offset: 9472)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1068, line: 77, flags: DIFlagFwdDecl)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1067, file: !1068, line: 78, baseType: !653, size: 64, offset: 9536)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1067, file: !1068, line: 80, baseType: !1085, size: 2624, offset: 9600)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1086, line: 340, size: 2624, elements: !1087)
!1086 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1087 = !{!1088, !1116, !1134, !1135, !1136, !1151, !1209, !1210, !1309, !1310, !1311, !1312, !1318}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1085, file: !1086, line: 341, baseType: !1089, size: 576)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1086, line: 251, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1086, line: 207, size: 576, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1090, file: !1086, line: 208, baseType: !419, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1090, file: !1086, line: 211, baseType: !445, size: 16, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1090, file: !1086, line: 212, baseType: !445, size: 16, offset: 48)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1090, file: !1086, line: 213, baseType: !587, size: 32, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1090, file: !1086, line: 214, baseType: !445, size: 16, offset: 96)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1090, file: !1086, line: 215, baseType: !445, size: 16, offset: 112)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1090, file: !1086, line: 216, baseType: !445, size: 16, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1090, file: !1086, line: 217, baseType: !445, size: 16, offset: 144)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1090, file: !1086, line: 218, baseType: !445, size: 16, offset: 160)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1090, file: !1086, line: 219, baseType: !445, size: 16, offset: 176)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1090, file: !1086, line: 220, baseType: !587, size: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1090, file: !1086, line: 222, baseType: !445, size: 16, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1090, file: !1086, line: 225, baseType: !445, size: 16, offset: 240)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1090, file: !1086, line: 228, baseType: !419, size: 32, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1090, file: !1086, line: 229, baseType: !419, size: 32, offset: 288)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1090, file: !1086, line: 233, baseType: !419, size: 32, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1090, file: !1086, line: 236, baseType: !445, size: 16, offset: 352)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1090, file: !1086, line: 236, baseType: !445, size: 16, offset: 368)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1090, file: !1086, line: 241, baseType: !587, size: 32, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1090, file: !1086, line: 244, baseType: !419, size: 32, offset: 416)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1090, file: !1086, line: 244, baseType: !419, size: 32, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1090, file: !1086, line: 245, baseType: !587, size: 32, offset: 480)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1090, file: !1086, line: 248, baseType: !587, size: 32, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1090, file: !1086, line: 250, baseType: !419, size: 32, offset: 544)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1085, file: !1086, line: 342, baseType: !1117, size: 448, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1086, line: 79, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1086, line: 61, size: 448, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1118, file: !1086, line: 62, baseType: !453, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1118, file: !1086, line: 64, baseType: !445, size: 16, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1118, file: !1086, line: 65, baseType: !445, size: 16, offset: 80)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1118, file: !1086, line: 67, baseType: !587, size: 32, offset: 96)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1118, file: !1086, line: 68, baseType: !587, size: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1118, file: !1086, line: 69, baseType: !587, size: 32, offset: 160)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1118, file: !1086, line: 70, baseType: !445, size: 16, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1118, file: !1086, line: 71, baseType: !445, size: 16, offset: 208)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1118, file: !1086, line: 72, baseType: !814, size: 64, offset: 224)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1118, file: !1086, line: 75, baseType: !587, size: 32, offset: 288)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1118, file: !1086, line: 75, baseType: !587, size: 32, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1118, file: !1086, line: 75, baseType: !587, size: 32, offset: 352)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1118, file: !1086, line: 78, baseType: !587, size: 32, offset: 384)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1118, file: !1086, line: 78, baseType: !587, size: 32, offset: 416)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1085, file: !1086, line: 343, baseType: !455, size: 128, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1085, file: !1086, line: 344, baseType: !455, size: 128, offset: 1152)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1085, file: !1086, line: 345, baseType: !1137, size: 192, offset: 1280)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1086, line: 278, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1086, line: 270, size: 192, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1138, file: !1086, line: 271, baseType: !419, size: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1138, file: !1086, line: 273, baseType: !587, size: 32, offset: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1138, file: !1086, line: 275, baseType: !419, size: 32, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1138, file: !1086, line: 276, baseType: !419, size: 32, offset: 96)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1138, file: !1086, line: 277, baseType: !1145, size: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1086, line: 55, size: 576, elements: !1147)
!1147 = !{!1148, !1149, !1150}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1146, file: !1086, line: 56, baseType: !419, size: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1146, file: !1086, line: 57, baseType: !587, size: 32, offset: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1146, file: !1086, line: 58, baseType: !704, size: 512, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1085, file: !1086, line: 346, baseType: !1152, size: 384, offset: 1472)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1086, line: 268, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1086, line: 253, size: 384, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159, !1203, !1204, !1205, !1206, !1207, !1208}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1153, file: !1086, line: 254, baseType: !419, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1153, file: !1086, line: 255, baseType: !419, size: 32, offset: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1153, file: !1086, line: 255, baseType: !419, size: 32, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1153, file: !1086, line: 258, baseType: !587, size: 32, offset: 96)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1153, file: !1086, line: 259, baseType: !1160, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1086, line: 164, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1086, line: 108, size: 1664, elements: !1163)
!1163 = !{!1164, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1162, file: !1086, line: 109, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1162, file: !1086, line: 109, baseType: !1165, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1162, file: !1086, line: 111, baseType: !430, size: 512, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1162, file: !1086, line: 119, baseType: !814, size: 64, offset: 640)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1162, file: !1086, line: 119, baseType: !814, size: 64, offset: 704)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1162, file: !1086, line: 125, baseType: !814, size: 64, offset: 768)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1162, file: !1086, line: 125, baseType: !814, size: 64, offset: 832)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1162, file: !1086, line: 127, baseType: !814, size: 64, offset: 896)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1162, file: !1086, line: 130, baseType: !419, size: 32, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1162, file: !1086, line: 131, baseType: !419, size: 32, offset: 992)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1162, file: !1086, line: 132, baseType: !1176, size: 64, offset: 1024)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1086, line: 106, baseType: !1178)
