; ModuleID = 'blender/source/blender/blenkernel/intern/sound.c'
source_filename = "blender/source/blender/blenkernel/intern/sound.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/sound.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!9 = distinct !DISubprogram(name: "sound_new_file", scope: !1, file: !1, line: 66, type: !10, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !112, !179}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !14, line: 46, size: 9856, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sound_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !92, !93, !94, !95, !96, !100, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !13, file: !14, line: 47, baseType: !17, size: 960)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !18, line: 130, baseType: !19)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !18, line: 117, size: 960, elements: !20)
!20 = !{!21, !22, !23, !25, !51, !55, !57, !58, !59, !60}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !18, line: 118, baseType: !4, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !19, file: !18, line: 118, baseType: !4, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !19, file: !18, line: 119, baseType: !24, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !19, file: !18, line: 120, baseType: !26, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !18, line: 136, size: 17600, elements: !28)
!28 = !{!29, !30, !32, !35, !40, !41, !42}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !27, file: !18, line: 137, baseType: !17, size: 960)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !27, file: !18, line: 138, baseType: !31, size: 64, offset: 960)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !27, file: !18, line: 139, baseType: !33, size: 64, offset: 1024)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !18, line: 43, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !18, line: 140, baseType: !36, size: 8192, offset: 1088)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !38)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 1024)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !27, file: !18, line: 141, baseType: !36, size: 8192, offset: 9280)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !27, file: !18, line: 148, baseType: !26, size: 64, offset: 17472)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !27, file: !18, line: 150, baseType: !43, size: 64, offset: 17536)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !45, line: 37, size: 128, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/makesdna/DNA_packedFile_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !49, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !44, file: !45, line: 38, baseType: !48, size: 32)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !44, file: !45, line: 39, baseType: !48, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !44, file: !45, line: 40, baseType: !4, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !18, line: 121, baseType: !52, size: 528, offset: 256)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 528, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 66)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !19, file: !18, line: 126, baseType: !56, size: 16, offset: 784)
!56 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !19, file: !18, line: 127, baseType: !48, size: 32, offset: 800)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !19, file: !18, line: 128, baseType: !48, size: 32, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !19, file: !18, line: 128, baseType: !48, size: 32, offset: 864)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !19, file: !18, line: 129, baseType: !61, size: 64, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !18, line: 75, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !18, line: 62, size: 1024, elements: !64)
!64 = !{!65, !67, !68, !69, !70, !71, !75, !76, !90, !91}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !18, line: 63, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !63, file: !18, line: 63, baseType: !66, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !18, line: 64, baseType: !37, size: 8, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !63, file: !18, line: 64, baseType: !37, size: 8, offset: 136)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !63, file: !18, line: 65, baseType: !56, size: 16, offset: 144)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !18, line: 66, baseType: !72, size: 512, offset: 160)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !63, file: !18, line: 67, baseType: !48, size: 32, offset: 672)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !18, line: 69, baseType: !77, size: 256, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !18, line: 60, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !18, line: 48, size: 256, elements: !79)
!79 = !{!80, !81, !88, !89}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !78, file: !18, line: 49, baseType: !4, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !78, file: !18, line: 58, baseType: !82, size: 128, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !83, line: 71, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !83, line: 69, size: 128, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !84, file: !83, line: 70, baseType: !4, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !84, file: !83, line: 70, baseType: !4, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !78, file: !18, line: 59, baseType: !48, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !78, file: !18, line: 59, baseType: !48, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !18, line: 70, baseType: !48, size: 32, offset: 960)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !63, file: !18, line: 74, baseType: !48, size: 32, offset: 992)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !14, line: 52, baseType: !36, size: 8192, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !13, file: !14, line: 57, baseType: !43, size: 64, offset: 9152)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !13, file: !14, line: 62, baseType: !4, size: 64, offset: 9216)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "newpackedfile", scope: !13, file: !14, line: 67, baseType: !43, size: 64, offset: 9280)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !13, file: !14, line: 68, baseType: !97, size: 64, offset: 9344)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !99, line: 46, flags: DIFlagFwdDecl)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !13, file: !14, line: 69, baseType: !101, size: 32, offset: 9408)
!101 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "attenuation", scope: !13, file: !14, line: 70, baseType: !101, size: 32, offset: 9440)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !13, file: !14, line: 71, baseType: !101, size: 32, offset: 9472)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "min_gain", scope: !13, file: !14, line: 72, baseType: !101, size: 32, offset: 9504)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_gain", scope: !13, file: !14, line: 73, baseType: !101, size: 32, offset: 9536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !13, file: !14, line: 74, baseType: !101, size: 32, offset: 9568)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !13, file: !14, line: 75, baseType: !48, size: 32, offset: 9600)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !13, file: !14, line: 76, baseType: !48, size: 32, offset: 9632)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !13, file: !14, line: 85, baseType: !4, size: 64, offset: 9664)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !13, file: !14, line: 90, baseType: !4, size: 64, offset: 9728)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "playback_handle", scope: !13, file: !14, line: 96, baseType: !4, size: 64, offset: 9792)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !114, line: 53, size: 15232, elements: !115)
!114 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !129, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !173, !176}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !114, line: 54, baseType: !112, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !114, line: 54, baseType: !112, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 55, baseType: !36, size: 8192, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !113, file: !114, line: 56, baseType: !56, size: 16, offset: 8320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !113, file: !114, line: 56, baseType: !56, size: 16, offset: 8336)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !113, file: !114, line: 57, baseType: !56, size: 16, offset: 8352)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !113, file: !114, line: 57, baseType: !56, size: 16, offset: 8368)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !113, file: !114, line: 58, baseType: !124, size: 64, offset: 8384)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !125, line: 27, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !127, line: 45, baseType: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !113, file: !114, line: 59, baseType: !130, size: 128, offset: 8448)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !113, file: !114, line: 60, baseType: !56, size: 16, offset: 8576)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !113, file: !114, line: 62, baseType: !26, size: 64, offset: 8640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !113, file: !114, line: 63, baseType: !82, size: 128, offset: 8704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !113, file: !114, line: 64, baseType: !82, size: 128, offset: 8832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !113, file: !114, line: 65, baseType: !82, size: 128, offset: 8960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !113, file: !114, line: 66, baseType: !82, size: 128, offset: 9088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !113, file: !114, line: 67, baseType: !82, size: 128, offset: 9216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !113, file: !114, line: 68, baseType: !82, size: 128, offset: 9344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !113, file: !114, line: 69, baseType: !82, size: 128, offset: 9472)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !113, file: !114, line: 70, baseType: !82, size: 128, offset: 9600)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !113, file: !114, line: 71, baseType: !82, size: 128, offset: 9728)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !113, file: !114, line: 72, baseType: !82, size: 128, offset: 9856)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !113, file: !114, line: 73, baseType: !82, size: 128, offset: 9984)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !113, file: !114, line: 74, baseType: !82, size: 128, offset: 10112)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !113, file: !114, line: 75, baseType: !82, size: 128, offset: 10240)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !113, file: !114, line: 76, baseType: !82, size: 128, offset: 10368)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !113, file: !114, line: 77, baseType: !82, size: 128, offset: 10496)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !113, file: !114, line: 78, baseType: !82, size: 128, offset: 10624)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !113, file: !114, line: 79, baseType: !82, size: 128, offset: 10752)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !113, file: !114, line: 80, baseType: !82, size: 128, offset: 10880)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !113, file: !114, line: 81, baseType: !82, size: 128, offset: 11008)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !113, file: !114, line: 82, baseType: !82, size: 128, offset: 11136)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !113, file: !114, line: 83, baseType: !82, size: 128, offset: 11264)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !113, file: !114, line: 84, baseType: !82, size: 128, offset: 11392)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !113, file: !114, line: 85, baseType: !82, size: 128, offset: 11520)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !113, file: !114, line: 86, baseType: !82, size: 128, offset: 11648)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !113, file: !114, line: 87, baseType: !82, size: 128, offset: 11776)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !113, file: !114, line: 88, baseType: !82, size: 128, offset: 11904)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !113, file: !114, line: 89, baseType: !82, size: 128, offset: 12032)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !113, file: !114, line: 90, baseType: !82, size: 128, offset: 12160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !113, file: !114, line: 91, baseType: !82, size: 128, offset: 12288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !113, file: !114, line: 92, baseType: !82, size: 128, offset: 12416)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !113, file: !114, line: 93, baseType: !82, size: 128, offset: 12544)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !113, file: !114, line: 94, baseType: !82, size: 128, offset: 12672)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !113, file: !114, line: 95, baseType: !82, size: 128, offset: 12800)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !113, file: !114, line: 96, baseType: !82, size: 128, offset: 12928)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !113, file: !114, line: 98, baseType: !170, size: 2048, offset: 13056)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !113, file: !114, line: 101, baseType: !174, size: 64, offset: 15104)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !114, line: 49, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !113, file: !114, line: 103, baseType: !177, size: 64, offset: 15168)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !114, line: 51, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!181 = !DILocalVariable(name: "bmain", arg: 1, scope: !9, file: !1, line: 66, type: !112)
!182 = !DILocation(line: 66, column: 37, scope: !9)
!183 = !DILocalVariable(name: "filename", arg: 2, scope: !9, file: !1, line: 66, type: !179)
!184 = !DILocation(line: 66, column: 56, scope: !9)
!185 = !DILocalVariable(name: "sound", scope: !9, file: !1, line: 68, type: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "bSound", file: !14, line: 100, baseType: !13)
!188 = !DILocation(line: 68, column: 10, scope: !9)
!189 = !DILocalVariable(name: "str", scope: !9, file: !1, line: 70, type: !36)
!190 = !DILocation(line: 70, column: 7, scope: !9)
!191 = !DILocalVariable(name: "path", scope: !9, file: !1, line: 71, type: !179)
!192 = !DILocation(line: 71, column: 14, scope: !9)
!193 = !DILocalVariable(name: "len", scope: !9, file: !1, line: 73, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 46, baseType: !128)
!195 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!196 = !DILocation(line: 73, column: 9, scope: !9)
!197 = !DILocation(line: 75, column: 14, scope: !9)
!198 = !DILocation(line: 75, column: 19, scope: !9)
!199 = !DILocation(line: 75, column: 2, scope: !9)
!200 = !DILocation(line: 77, column: 37, scope: !9)
!201 = !DILocation(line: 77, column: 43, scope: !9)
!202 = !DILocation(line: 77, column: 35, scope: !9)
!203 = !DILocation(line: 77, column: 7, scope: !9)
!204 = !DILocation(line: 79, column: 15, scope: !9)
!205 = !DILocation(line: 79, column: 20, scope: !9)
!206 = !DILocation(line: 79, column: 2, scope: !9)
!207 = !DILocation(line: 81, column: 15, scope: !9)
!208 = !DILocation(line: 81, column: 8, scope: !9)
!209 = !DILocation(line: 81, column: 6, scope: !9)
!210 = !DILocation(line: 82, column: 2, scope: !9)
!211 = !DILocation(line: 82, column: 9, scope: !9)
!212 = !DILocation(line: 82, column: 13, scope: !9)
!213 = !DILocation(line: 82, column: 17, scope: !9)
!214 = !DILocation(line: 82, column: 20, scope: !9)
!215 = !DILocation(line: 82, column: 29, scope: !9)
!216 = !DILocation(line: 82, column: 33, scope: !9)
!217 = !DILocation(line: 82, column: 38, scope: !9)
!218 = !DILocation(line: 82, column: 45, scope: !9)
!219 = !DILocation(line: 82, column: 48, scope: !9)
!220 = !DILocation(line: 82, column: 57, scope: !9)
!221 = !DILocation(line: 82, column: 61, scope: !9)
!222 = !DILocation(line: 82, column: 66, scope: !9)
!223 = !DILocation(line: 0, scope: !9)
!224 = !DILocation(line: 83, column: 6, scope: !9)
!225 = distinct !{!225, !210, !224}
!226 = !DILocation(line: 85, column: 29, scope: !9)
!227 = !DILocation(line: 85, column: 43, scope: !9)
!228 = !DILocation(line: 85, column: 54, scope: !9)
!229 = !DILocation(line: 85, column: 52, scope: !9)
!230 = !DILocation(line: 85, column: 10, scope: !9)
!231 = !DILocation(line: 85, column: 8, scope: !9)
!232 = !DILocation(line: 86, column: 14, scope: !9)
!233 = !DILocation(line: 86, column: 21, scope: !9)
!234 = !DILocation(line: 86, column: 27, scope: !9)
!235 = !DILocation(line: 86, column: 2, scope: !9)
!236 = !DILocation(line: 89, column: 13, scope: !9)
!237 = !DILocation(line: 89, column: 20, scope: !9)
!238 = !DILocation(line: 89, column: 2, scope: !9)
!239 = !DILocation(line: 91, column: 7, scope: !240)
!240 = distinct !DILexicalBlock(scope: !9, file: !1, line: 91, column: 6)
!241 = !DILocation(line: 91, column: 14, scope: !240)
!242 = !DILocation(line: 91, column: 6, scope: !9)
!243 = !DILocation(line: 92, column: 21, scope: !244)
!244 = distinct !DILexicalBlock(scope: !240, file: !1, line: 91, column: 31)
!245 = !DILocation(line: 92, column: 28, scope: !244)
!246 = !DILocation(line: 92, column: 3, scope: !244)
!247 = !DILocation(line: 93, column: 9, scope: !244)
!248 = !DILocation(line: 94, column: 2, scope: !244)
!249 = !DILocation(line: 96, column: 9, scope: !9)
!250 = !DILocation(line: 96, column: 2, scope: !9)
!251 = distinct !DISubprogram(name: "sound_load", scope: !1, file: !1, line: 813, type: !252, scopeLine: 813, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !112, !12}
!254 = !DILocalVariable(name: "UNUSED_bmain", arg: 1, scope: !251, file: !1, line: 813, type: !112)
!255 = !DILocation(line: 813, column: 30, scope: !251)
!256 = !DILocalVariable(name: "UNUSED_sound", arg: 2, scope: !251, file: !1, line: 813, type: !12)
!257 = !DILocation(line: 813, column: 60, scope: !251)
!258 = !DILocation(line: 813, column: 76, scope: !251)
!259 = distinct !DISubprogram(name: "BKE_sound_free", scope: !1, file: !1, line: 99, type: !260, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !186}
!262 = !DILocalVariable(name: "sound", arg: 1, scope: !259, file: !1, line: 99, type: !186)
!263 = !DILocation(line: 99, column: 29, scope: !259)
!264 = !DILocation(line: 101, column: 6, scope: !265)
!265 = distinct !DILexicalBlock(scope: !259, file: !1, line: 101, column: 6)
!266 = !DILocation(line: 101, column: 13, scope: !265)
!267 = !DILocation(line: 101, column: 6, scope: !259)
!268 = !DILocation(line: 102, column: 18, scope: !269)
!269 = distinct !DILexicalBlock(scope: !265, file: !1, line: 101, column: 25)
!270 = !DILocation(line: 102, column: 25, scope: !269)
!271 = !DILocation(line: 102, column: 3, scope: !269)
!272 = !DILocation(line: 103, column: 3, scope: !269)
!273 = !DILocation(line: 103, column: 10, scope: !269)
!274 = !DILocation(line: 103, column: 21, scope: !269)
!275 = !DILocation(line: 104, column: 2, scope: !269)
!276 = !DILocation(line: 120, column: 1, scope: !259)
!277 = distinct !DISubprogram(name: "sound_define_from_str", scope: !1, file: !1, line: 805, type: !278, scopeLine: 805, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!278 = !DISubroutineType(types: !279)
!279 = !{!48, !179}
!280 = !DILocalVariable(name: "UNUSED_str", arg: 1, scope: !277, file: !1, line: 805, type: !179)
!281 = !DILocation(line: 805, column: 39, scope: !277)
!282 = !DILocation(line: 805, column: 54, scope: !277)
!283 = distinct !DISubprogram(name: "sound_force_device", scope: !1, file: !1, line: 806, type: !284, scopeLine: 806, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !48}
!286 = !DILocalVariable(name: "UNUSED_device", arg: 1, scope: !283, file: !1, line: 806, type: !48)
!287 = !DILocation(line: 806, column: 29, scope: !283)
!288 = !DILocation(line: 806, column: 46, scope: !283)
!289 = distinct !DISubprogram(name: "sound_init_once", scope: !1, file: !1, line: 807, type: !290, scopeLine: 807, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!290 = !DISubroutineType(types: !291)
!291 = !{null}
!292 = !DILocation(line: 807, column: 29, scope: !289)
!293 = distinct !DISubprogram(name: "sound_init", scope: !1, file: !1, line: 808, type: !294, scopeLine: 808, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !112}
!296 = !DILocalVariable(name: "UNUSED_bmain", arg: 1, scope: !293, file: !1, line: 808, type: !112)
!297 = !DILocation(line: 808, column: 30, scope: !293)
!298 = !DILocation(line: 808, column: 46, scope: !293)
!299 = distinct !DISubprogram(name: "sound_exit", scope: !1, file: !1, line: 809, type: !290, scopeLine: 809, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!300 = !DILocation(line: 809, column: 24, scope: !299)
!301 = distinct !DISubprogram(name: "sound_exit_once", scope: !1, file: !1, line: 810, type: !290, scopeLine: 810, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!302 = !DILocation(line: 810, column: 29, scope: !301)
!303 = distinct !DISubprogram(name: "sound_cache", scope: !1, file: !1, line: 811, type: !304, scopeLine: 811, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !12}
!306 = !DILocalVariable(name: "UNUSED_sound", arg: 1, scope: !303, file: !1, line: 811, type: !12)
!307 = !DILocation(line: 811, column: 33, scope: !303)
!308 = !DILocation(line: 811, column: 49, scope: !303)
!309 = distinct !DISubprogram(name: "sound_delete_cache", scope: !1, file: !1, line: 812, type: !304, scopeLine: 812, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!310 = !DILocalVariable(name: "UNUSED_sound", arg: 1, scope: !309, file: !1, line: 812, type: !12)
!311 = !DILocation(line: 812, column: 40, scope: !309)
!312 = !DILocation(line: 812, column: 56, scope: !309)
!313 = distinct !DISubprogram(name: "sound_create_scene", scope: !1, file: !1, line: 814, type: !314, scopeLine: 814, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !318, line: 1216, size: 39680, elements: !319)
!318 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!319 = !{!320, !321, !391, !665, !668, !669, !670, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !696, !699, !854, !1142, !1145, !1433, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1455, !1456, !1457, !1458, !1459, !1467, !1534, !1541, !1542, !1549, !1550, !1551, !1552, !1553, !1554, !1555}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !317, file: !318, line: 1217, baseType: !17, size: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !317, file: !318, line: 1218, baseType: !322, size: 64, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !324, line: 838, size: 768, elements: !325)
!324 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!325 = !{!326, !341, !342, !352, !353, !384, !385, !386, !387, !388, !389, !390}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !323, file: !324, line: 840, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !329, line: 499, baseType: !330)
!329 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !329, line: 486, size: 1600, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !329, line: 487, baseType: !17, size: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !330, file: !329, line: 489, baseType: !82, size: 128, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !330, file: !329, line: 490, baseType: !82, size: 128, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !330, file: !329, line: 491, baseType: !82, size: 128, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !330, file: !329, line: 492, baseType: !82, size: 128, offset: 1344)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !329, line: 494, baseType: !48, size: 32, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !330, file: !329, line: 495, baseType: !48, size: 32, offset: 1504)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !330, file: !329, line: 497, baseType: !48, size: 32, offset: 1536)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !329, line: 498, baseType: !48, size: 32, offset: 1568)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !323, file: !324, line: 844, baseType: !327, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !323, file: !324, line: 848, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !324, line: 549, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !324, line: 544, size: 320, elements: !346)
!346 = !{!347, !349, !350, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !324, line: 545, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !345, file: !324, line: 545, baseType: !348, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !345, file: !324, line: 547, baseType: !327, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !345, file: !324, line: 548, baseType: !82, size: 128, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !323, file: !324, line: 851, baseType: !82, size: 128, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !323, file: !324, line: 853, baseType: !354, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !324, line: 594, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !324, line: 561, size: 1664, elements: !357)
!357 = !{!358, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !324, line: 562, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !324, line: 562, baseType: !359, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !356, file: !324, line: 564, baseType: !82, size: 128, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !356, file: !324, line: 565, baseType: !327, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !356, file: !324, line: 566, baseType: !343, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !356, file: !324, line: 568, baseType: !82, size: 128, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !356, file: !324, line: 569, baseType: !82, size: 128, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !324, line: 571, baseType: !72, size: 512, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !356, file: !324, line: 573, baseType: !101, size: 32, offset: 1152)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !356, file: !324, line: 574, baseType: !101, size: 32, offset: 1184)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !356, file: !324, line: 576, baseType: !101, size: 32, offset: 1216)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !356, file: !324, line: 576, baseType: !101, size: 32, offset: 1248)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !356, file: !324, line: 577, baseType: !101, size: 32, offset: 1280)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !356, file: !324, line: 577, baseType: !101, size: 32, offset: 1312)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !356, file: !324, line: 579, baseType: !101, size: 32, offset: 1344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !356, file: !324, line: 580, baseType: !101, size: 32, offset: 1376)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !356, file: !324, line: 582, baseType: !101, size: 32, offset: 1408)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !356, file: !324, line: 582, baseType: !101, size: 32, offset: 1440)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !356, file: !324, line: 583, baseType: !56, size: 16, offset: 1472)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !356, file: !324, line: 585, baseType: !56, size: 16, offset: 1488)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !356, file: !324, line: 586, baseType: !56, size: 16, offset: 1504)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !356, file: !324, line: 588, baseType: !56, size: 16, offset: 1520)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !356, file: !324, line: 590, baseType: !4, size: 64, offset: 1536)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !356, file: !324, line: 592, baseType: !48, size: 32, offset: 1600)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !356, file: !324, line: 593, baseType: !48, size: 32, offset: 1632)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !323, file: !324, line: 858, baseType: !82, size: 128, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !323, file: !324, line: 859, baseType: !82, size: 128, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !324, line: 862, baseType: !48, size: 32, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !323, file: !324, line: 863, baseType: !48, size: 32, offset: 672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !323, file: !324, line: 866, baseType: !56, size: 16, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !323, file: !324, line: 867, baseType: !56, size: 16, offset: 720)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !323, file: !324, line: 868, baseType: !101, size: 32, offset: 736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !317, file: !318, line: 1220, baseType: !392, size: 64, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !394, line: 115, size: 11392, elements: !395)
!394 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!395 = !{!396, !397, !398, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !424, !426, !427, !471, !472, !475, !476, !492, !493, !494, !495, !496, !497, !498, !503, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !519, !520, !521, !522, !523, !524, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !584, !585, !586, !587, !588, !589, !590, !591, !592, !595, !598, !601, !602, !603, !604, !605, !608, !611, !614, !615, !616, !617, !618, !619, !620, !621, !623, !626, !629, !633, !653, !654}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !393, file: !394, line: 116, baseType: !17, size: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !393, file: !394, line: 117, baseType: !322, size: 64, offset: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !393, file: !394, line: 119, baseType: !399, size: 64, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !394, line: 57, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !393, file: !394, line: 121, baseType: !56, size: 16, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !393, file: !394, line: 121, baseType: !56, size: 16, offset: 1104)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !393, file: !394, line: 122, baseType: !48, size: 32, offset: 1120)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !393, file: !394, line: 122, baseType: !48, size: 32, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !393, file: !394, line: 122, baseType: !48, size: 32, offset: 1184)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !393, file: !394, line: 123, baseType: !72, size: 512, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !393, file: !394, line: 124, baseType: !392, size: 64, offset: 1728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !393, file: !394, line: 124, baseType: !392, size: 64, offset: 1792)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !393, file: !394, line: 127, baseType: !392, size: 64, offset: 1856)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !393, file: !394, line: 127, baseType: !392, size: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !393, file: !394, line: 127, baseType: !392, size: 64, offset: 1984)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !393, file: !394, line: 128, baseType: !97, size: 64, offset: 2048)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !393, file: !394, line: 130, baseType: !414, size: 64, offset: 2112)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !394, line: 97, size: 832, elements: !416)
!416 = !{!417, !422, !423}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !415, file: !394, line: 98, baseType: !418, size: 768)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 768, elements: !419)
!419 = !{!420, !421}
!420 = !DISubrange(count: 8)
!421 = !DISubrange(count: 3)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !394, line: 99, baseType: !48, size: 32, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !394, line: 99, baseType: !48, size: 32, offset: 800)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !393, file: !394, line: 131, baseType: !425, size: 64, offset: 2176)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !393, file: !394, line: 132, baseType: !425, size: 64, offset: 2240)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !393, file: !394, line: 133, baseType: !428, size: 64, offset: 2304)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !329, line: 334, size: 1728, elements: !430)
!430 = !{!431, !432, !435, !436, !437, !439, !440, !441, !444, !445, !446, !447, !448, !449, !450, !470}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !429, file: !329, line: 335, baseType: !82, size: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !429, file: !329, line: 336, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !329, line: 47, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !329, line: 338, baseType: !56, size: 16, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !429, file: !329, line: 338, baseType: !56, size: 16, offset: 208)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !429, file: !329, line: 339, baseType: !438, size: 32, offset: 224)
!438 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !429, file: !329, line: 340, baseType: !48, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !429, file: !329, line: 342, baseType: !101, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !429, file: !329, line: 343, baseType: !442, size: 96, offset: 320)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 96, elements: !443)
!443 = !{!421}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !429, file: !329, line: 344, baseType: !442, size: 96, offset: 416)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !429, file: !329, line: 347, baseType: !82, size: 128, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !429, file: !329, line: 349, baseType: !48, size: 32, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !429, file: !329, line: 350, baseType: !48, size: 32, offset: 672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !429, file: !329, line: 351, baseType: !4, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !429, file: !329, line: 352, baseType: !4, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !429, file: !329, line: 354, baseType: !451, size: 384, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !329, line: 116, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !329, line: 94, size: 384, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !452, file: !329, line: 96, baseType: !48, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !452, file: !329, line: 96, baseType: !48, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !452, file: !329, line: 97, baseType: !48, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !452, file: !329, line: 97, baseType: !48, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !452, file: !329, line: 99, baseType: !56, size: 16, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !452, file: !329, line: 100, baseType: !56, size: 16, offset: 144)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !452, file: !329, line: 102, baseType: !56, size: 16, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !452, file: !329, line: 105, baseType: !56, size: 16, offset: 176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !452, file: !329, line: 108, baseType: !56, size: 16, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !452, file: !329, line: 109, baseType: !56, size: 16, offset: 208)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !452, file: !329, line: 111, baseType: !56, size: 16, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !452, file: !329, line: 112, baseType: !56, size: 16, offset: 240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !452, file: !329, line: 114, baseType: !48, size: 32, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !452, file: !329, line: 114, baseType: !48, size: 32, offset: 288)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !452, file: !329, line: 115, baseType: !48, size: 32, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !452, file: !329, line: 115, baseType: !48, size: 32, offset: 352)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !429, file: !329, line: 355, baseType: !72, size: 512, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !393, file: !394, line: 134, baseType: !4, size: 64, offset: 2368)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !393, file: !394, line: 136, baseType: !473, size: 64, offset: 2432)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !394, line: 58, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !393, file: !394, line: 138, baseType: !451, size: 384, offset: 2496)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !393, file: !394, line: 139, baseType: !477, size: 64, offset: 2880)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !329, line: 80, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !329, line: 72, size: 192, elements: !480)
!480 = !{!481, !488, !489, !490, !491}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !479, file: !329, line: 73, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !329, line: 59, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !329, line: 56, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !484, file: !329, line: 57, baseType: !442, size: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !484, file: !329, line: 58, baseType: !48, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !479, file: !329, line: 74, baseType: !48, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !479, file: !329, line: 76, baseType: !48, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !479, file: !329, line: 77, baseType: !48, size: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !329, line: 79, baseType: !48, size: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !393, file: !394, line: 141, baseType: !82, size: 128, offset: 2944)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !393, file: !394, line: 142, baseType: !82, size: 128, offset: 3072)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !393, file: !394, line: 143, baseType: !82, size: 128, offset: 3200)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !393, file: !394, line: 144, baseType: !82, size: 128, offset: 3328)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !393, file: !394, line: 146, baseType: !48, size: 32, offset: 3456)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !393, file: !394, line: 147, baseType: !48, size: 32, offset: 3488)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !393, file: !394, line: 150, baseType: !499, size: 64, offset: 3520)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !502, line: 46, flags: DIFlagFwdDecl)
!502 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !393, file: !394, line: 151, baseType: !504, size: 64, offset: 3584)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !393, file: !394, line: 152, baseType: !48, size: 32, offset: 3648)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !393, file: !394, line: 153, baseType: !48, size: 32, offset: 3680)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !393, file: !394, line: 156, baseType: !442, size: 96, offset: 3712)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !393, file: !394, line: 156, baseType: !442, size: 96, offset: 3808)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !393, file: !394, line: 156, baseType: !442, size: 96, offset: 3904)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !393, file: !394, line: 157, baseType: !442, size: 96, offset: 4000)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !393, file: !394, line: 158, baseType: !442, size: 96, offset: 4096)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !393, file: !394, line: 159, baseType: !442, size: 96, offset: 4192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !393, file: !394, line: 160, baseType: !442, size: 96, offset: 4288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !393, file: !394, line: 160, baseType: !442, size: 96, offset: 4384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !393, file: !394, line: 161, baseType: !516, size: 128, offset: 4480)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 128, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 4)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !393, file: !394, line: 161, baseType: !516, size: 128, offset: 4608)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !393, file: !394, line: 162, baseType: !442, size: 96, offset: 4736)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !393, file: !394, line: 162, baseType: !442, size: 96, offset: 4832)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !393, file: !394, line: 163, baseType: !101, size: 32, offset: 4928)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !393, file: !394, line: 163, baseType: !101, size: 32, offset: 4960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !393, file: !394, line: 164, baseType: !525, size: 512, offset: 4992)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 512, elements: !526)
!526 = !{!518, !518}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !393, file: !394, line: 165, baseType: !525, size: 512, offset: 5504)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !393, file: !394, line: 166, baseType: !525, size: 512, offset: 6016)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !393, file: !394, line: 167, baseType: !525, size: 512, offset: 6528)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !393, file: !394, line: 176, baseType: !525, size: 512, offset: 7040)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !393, file: !394, line: 178, baseType: !438, size: 32, offset: 7552)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !394, line: 180, baseType: !56, size: 16, offset: 7584)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !393, file: !394, line: 181, baseType: !56, size: 16, offset: 7600)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !393, file: !394, line: 183, baseType: !56, size: 16, offset: 7616)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !393, file: !394, line: 183, baseType: !56, size: 16, offset: 7632)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !393, file: !394, line: 184, baseType: !56, size: 16, offset: 7648)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !393, file: !394, line: 184, baseType: !56, size: 16, offset: 7664)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !393, file: !394, line: 185, baseType: !56, size: 16, offset: 7680)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !393, file: !394, line: 186, baseType: !56, size: 16, offset: 7696)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !393, file: !394, line: 187, baseType: !56, size: 16, offset: 7712)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !393, file: !394, line: 188, baseType: !37, size: 8, offset: 7728)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !393, file: !394, line: 189, baseType: !37, size: 8, offset: 7736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !393, file: !394, line: 192, baseType: !48, size: 32, offset: 7744)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !393, file: !394, line: 192, baseType: !48, size: 32, offset: 7776)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !393, file: !394, line: 192, baseType: !48, size: 32, offset: 7808)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !393, file: !394, line: 192, baseType: !48, size: 32, offset: 7840)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !393, file: !394, line: 194, baseType: !48, size: 32, offset: 7872)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !393, file: !394, line: 202, baseType: !101, size: 32, offset: 7904)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !393, file: !394, line: 202, baseType: !101, size: 32, offset: 7936)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !393, file: !394, line: 202, baseType: !101, size: 32, offset: 7968)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !393, file: !394, line: 211, baseType: !101, size: 32, offset: 8000)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !393, file: !394, line: 212, baseType: !101, size: 32, offset: 8032)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !393, file: !394, line: 213, baseType: !101, size: 32, offset: 8064)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !393, file: !394, line: 214, baseType: !101, size: 32, offset: 8096)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !393, file: !394, line: 215, baseType: !101, size: 32, offset: 8128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !393, file: !394, line: 216, baseType: !101, size: 32, offset: 8160)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !393, file: !394, line: 219, baseType: !101, size: 32, offset: 8192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !393, file: !394, line: 220, baseType: !101, size: 32, offset: 8224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !393, file: !394, line: 221, baseType: !101, size: 32, offset: 8256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !393, file: !394, line: 224, baseType: !561, size: 16, offset: 8288)
!561 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !393, file: !394, line: 224, baseType: !561, size: 16, offset: 8304)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !393, file: !394, line: 226, baseType: !56, size: 16, offset: 8320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !393, file: !394, line: 228, baseType: !37, size: 8, offset: 8336)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !393, file: !394, line: 229, baseType: !37, size: 8, offset: 8344)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !393, file: !394, line: 231, baseType: !56, size: 16, offset: 8352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !393, file: !394, line: 232, baseType: !37, size: 8, offset: 8368)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !393, file: !394, line: 233, baseType: !37, size: 8, offset: 8376)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !393, file: !394, line: 234, baseType: !101, size: 32, offset: 8384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !393, file: !394, line: 235, baseType: !101, size: 32, offset: 8416)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !393, file: !394, line: 237, baseType: !82, size: 128, offset: 8448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !393, file: !394, line: 238, baseType: !82, size: 128, offset: 8576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !393, file: !394, line: 239, baseType: !82, size: 128, offset: 8704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !393, file: !394, line: 240, baseType: !82, size: 128, offset: 8832)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !393, file: !394, line: 242, baseType: !101, size: 32, offset: 8960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !393, file: !394, line: 244, baseType: !56, size: 16, offset: 8992)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !393, file: !394, line: 245, baseType: !561, size: 16, offset: 9008)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !393, file: !394, line: 246, baseType: !516, size: 128, offset: 9024)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !393, file: !394, line: 248, baseType: !48, size: 32, offset: 9152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !393, file: !394, line: 249, baseType: !48, size: 32, offset: 9184)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !393, file: !394, line: 251, baseType: !582, size: 64, offset: 9216)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !394, line: 251, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !393, file: !394, line: 253, baseType: !37, size: 8, offset: 9280)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !393, file: !394, line: 254, baseType: !37, size: 8, offset: 9288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !393, file: !394, line: 255, baseType: !56, size: 16, offset: 9296)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !393, file: !394, line: 256, baseType: !442, size: 96, offset: 9312)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !393, file: !394, line: 258, baseType: !82, size: 128, offset: 9408)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !393, file: !394, line: 259, baseType: !82, size: 128, offset: 9536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !393, file: !394, line: 260, baseType: !82, size: 128, offset: 9664)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !393, file: !394, line: 261, baseType: !82, size: 128, offset: 9792)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !393, file: !394, line: 263, baseType: !593, size: 64, offset: 9920)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !394, line: 52, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !393, file: !394, line: 264, baseType: !596, size: 64, offset: 9984)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !394, line: 53, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !393, file: !394, line: 265, baseType: !599, size: 64, offset: 10048)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !329, line: 46, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !393, file: !394, line: 267, baseType: !37, size: 8, offset: 10112)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !393, file: !394, line: 268, baseType: !37, size: 8, offset: 10120)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !393, file: !394, line: 269, baseType: !56, size: 16, offset: 10128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !393, file: !394, line: 270, baseType: !101, size: 32, offset: 10144)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !393, file: !394, line: 272, baseType: !606, size: 64, offset: 10176)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !394, line: 54, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !393, file: !394, line: 275, baseType: !609, size: 64, offset: 10240)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !394, line: 275, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !393, file: !394, line: 277, baseType: !612, size: 64, offset: 10304)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !394, line: 56, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !393, file: !394, line: 277, baseType: !612, size: 64, offset: 10368)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !393, file: !394, line: 278, baseType: !124, size: 64, offset: 10432)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !393, file: !394, line: 279, baseType: !124, size: 64, offset: 10496)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !393, file: !394, line: 280, baseType: !438, size: 32, offset: 10560)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !393, file: !394, line: 281, baseType: !438, size: 32, offset: 10592)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !393, file: !394, line: 283, baseType: !82, size: 128, offset: 10624)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !393, file: !394, line: 284, baseType: !82, size: 128, offset: 10752)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !393, file: !394, line: 285, baseType: !622, size: 64, offset: 10880)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !393, file: !394, line: 287, baseType: !624, size: 64, offset: 10944)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !394, line: 59, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !393, file: !394, line: 288, baseType: !627, size: 64, offset: 11008)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !394, line: 288, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !393, file: !394, line: 290, baseType: !630, size: 64, offset: 11072)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 2)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !393, file: !394, line: 291, baseType: !634, size: 64, offset: 11136)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !636, line: 65, baseType: !637)
!636 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !636, line: 50, size: 320, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !637, file: !636, line: 51, baseType: !316, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !637, file: !636, line: 53, baseType: !48, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !637, file: !636, line: 54, baseType: !48, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !637, file: !636, line: 55, baseType: !48, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !637, file: !636, line: 55, baseType: !48, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !637, file: !636, line: 56, baseType: !37, size: 8, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !637, file: !636, line: 56, baseType: !37, size: 8, offset: 200)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !637, file: !636, line: 57, baseType: !37, size: 8, offset: 208)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !637, file: !636, line: 57, baseType: !37, size: 8, offset: 216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !637, file: !636, line: 59, baseType: !56, size: 16, offset: 224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !637, file: !636, line: 59, baseType: !56, size: 16, offset: 240)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !637, file: !636, line: 59, baseType: !56, size: 16, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !637, file: !636, line: 61, baseType: !56, size: 16, offset: 272)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !637, file: !636, line: 63, baseType: !48, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !393, file: !394, line: 293, baseType: !82, size: 128, offset: 11200)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !393, file: !394, line: 294, baseType: !655, size: 64, offset: 11328)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !394, line: 113, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !394, line: 108, size: 256, elements: !658)
!658 = !{!659, !661, !662, !663, !664}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !657, file: !394, line: 109, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !657, file: !394, line: 109, baseType: !660, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !657, file: !394, line: 110, baseType: !392, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !657, file: !394, line: 111, baseType: !48, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !657, file: !394, line: 112, baseType: !101, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !317, file: !318, line: 1221, baseType: !666, size: 64, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !318, line: 52, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !317, file: !318, line: 1223, baseType: !316, size: 64, offset: 1152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !317, file: !318, line: 1225, baseType: !82, size: 128, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !317, file: !318, line: 1226, baseType: !671, size: 64, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !318, line: 69, size: 320, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !672, file: !318, line: 70, baseType: !671, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !672, file: !318, line: 70, baseType: !671, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !672, file: !318, line: 71, baseType: !438, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !672, file: !318, line: 71, baseType: !438, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !318, line: 72, baseType: !48, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !672, file: !318, line: 73, baseType: !56, size: 16, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !672, file: !318, line: 73, baseType: !56, size: 16, offset: 240)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !672, file: !318, line: 74, baseType: !392, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !317, file: !318, line: 1227, baseType: !392, size: 64, offset: 1408)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !317, file: !318, line: 1229, baseType: !442, size: 96, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !317, file: !318, line: 1230, baseType: !442, size: 96, offset: 1568)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !317, file: !318, line: 1231, baseType: !442, size: 96, offset: 1664)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !317, file: !318, line: 1231, baseType: !442, size: 96, offset: 1760)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !317, file: !318, line: 1233, baseType: !438, size: 32, offset: 1856)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !317, file: !318, line: 1234, baseType: !48, size: 32, offset: 1888)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !317, file: !318, line: 1235, baseType: !438, size: 32, offset: 1920)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !318, line: 1237, baseType: !56, size: 16, offset: 1952)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !317, file: !318, line: 1239, baseType: !37, size: 8, offset: 1968)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !317, file: !318, line: 1240, baseType: !693, size: 8, offset: 1976)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 1)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !317, file: !318, line: 1242, baseType: !697, size: 64, offset: 1984)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !99, line: 248, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !317, file: !318, line: 1244, baseType: !700, size: 64, offset: 2048)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !702, line: 200, size: 17024, elements: !703)
!702 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!703 = !{!704, !705, !706, !707, !839, !840, !841, !842, !843, !844, !845}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !701, file: !702, line: 201, baseType: !622, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !701, file: !702, line: 202, baseType: !82, size: 128, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !701, file: !702, line: 203, baseType: !82, size: 128, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !701, file: !702, line: 206, baseType: !708, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !702, line: 190, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !702, line: 126, size: 2816, elements: !711)
!711 = !{!712, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !807, !808, !809, !810, !813, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !838}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !710, file: !702, line: 127, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !710, file: !702, line: 127, baseType: !713, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !710, file: !702, line: 128, baseType: !4, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !710, file: !702, line: 129, baseType: !4, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !702, line: 130, baseType: !72, size: 512, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !710, file: !702, line: 132, baseType: !48, size: 32, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !710, file: !702, line: 132, baseType: !48, size: 32, offset: 800)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !710, file: !702, line: 133, baseType: !48, size: 32, offset: 832)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !710, file: !702, line: 134, baseType: !48, size: 32, offset: 864)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !710, file: !702, line: 134, baseType: !48, size: 32, offset: 896)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !710, file: !702, line: 134, baseType: !48, size: 32, offset: 928)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !710, file: !702, line: 135, baseType: !48, size: 32, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !710, file: !702, line: 135, baseType: !48, size: 32, offset: 992)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !710, file: !702, line: 136, baseType: !48, size: 32, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !710, file: !702, line: 136, baseType: !48, size: 32, offset: 1056)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !710, file: !702, line: 137, baseType: !48, size: 32, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !710, file: !702, line: 137, baseType: !48, size: 32, offset: 1120)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !710, file: !702, line: 138, baseType: !101, size: 32, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !710, file: !702, line: 139, baseType: !101, size: 32, offset: 1184)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !710, file: !702, line: 139, baseType: !101, size: 32, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !710, file: !702, line: 141, baseType: !56, size: 16, offset: 1248)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !710, file: !702, line: 142, baseType: !56, size: 16, offset: 1264)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !710, file: !702, line: 143, baseType: !48, size: 32, offset: 1280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !710, file: !702, line: 144, baseType: !48, size: 32, offset: 1312)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !710, file: !702, line: 146, baseType: !738, size: 64, offset: 1344)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !702, line: 114, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !702, line: 99, size: 7232, elements: !741)
!741 = !{!742, !744, !745, !746, !747, !748, !749, !757, !761, !775, !784, !791, !801}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !740, file: !702, line: 100, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !740, file: !702, line: 100, baseType: !743, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !740, file: !702, line: 101, baseType: !48, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !740, file: !702, line: 101, baseType: !48, size: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !740, file: !702, line: 102, baseType: !48, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !740, file: !702, line: 102, baseType: !48, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !740, file: !702, line: 103, baseType: !750, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !702, line: 59, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !702, line: 56, size: 2112, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !702, line: 57, baseType: !170, size: 2048)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !752, file: !702, line: 58, baseType: !48, size: 32, offset: 2048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !752, file: !702, line: 58, baseType: !48, size: 32, offset: 2080)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !740, file: !702, line: 106, baseType: !758, size: 6144, offset: 320)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 6144, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !740, file: !702, line: 107, baseType: !762, size: 64, offset: 6464)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !702, line: 97, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !702, line: 83, size: 8320, elements: !765)
!765 = !{!766, !767, !768, !771, !772, !773, !774}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !764, file: !702, line: 84, baseType: !758, size: 6144)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !764, file: !702, line: 87, baseType: !170, size: 2048, offset: 6144)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !764, file: !702, line: 88, baseType: !769, size: 64, offset: 8192)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !636, line: 41, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !764, file: !702, line: 90, baseType: !56, size: 16, offset: 8256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !764, file: !702, line: 92, baseType: !56, size: 16, offset: 8272)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !764, file: !702, line: 93, baseType: !56, size: 16, offset: 8288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !764, file: !702, line: 95, baseType: !56, size: 16, offset: 8304)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !740, file: !702, line: 108, baseType: !776, size: 64, offset: 6528)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !702, line: 66, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !702, line: 61, size: 128, elements: !779)
!779 = !{!780, !781, !782, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !778, file: !702, line: 62, baseType: !48, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !778, file: !702, line: 63, baseType: !48, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !778, file: !702, line: 64, baseType: !48, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !778, file: !702, line: 65, baseType: !48, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !740, file: !702, line: 109, baseType: !785, size: 64, offset: 6592)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !702, line: 71, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !702, line: 68, size: 64, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !787, file: !702, line: 69, baseType: !48, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !787, file: !702, line: 70, baseType: !48, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !740, file: !702, line: 110, baseType: !792, size: 64, offset: 6656)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !702, line: 81, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !702, line: 73, size: 352, elements: !795)
!795 = !{!796, !797, !798, !799, !800}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !794, file: !702, line: 74, baseType: !442, size: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !794, file: !702, line: 75, baseType: !442, size: 96, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !794, file: !702, line: 76, baseType: !442, size: 96, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !702, line: 77, baseType: !48, size: 32, offset: 288)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !794, file: !702, line: 78, baseType: !48, size: 32, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !740, file: !702, line: 113, baseType: !802, size: 512, offset: 6720)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !803, line: 182, baseType: !804)
!803 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !803, line: 180, size: 512, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !803, line: 181, baseType: !72, size: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !710, file: !702, line: 148, baseType: !97, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !710, file: !702, line: 151, baseType: !316, size: 64, offset: 1472)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !710, file: !702, line: 152, baseType: !392, size: 64, offset: 1536)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !710, file: !702, line: 153, baseType: !811, size: 64, offset: 1600)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !318, line: 62, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !710, file: !702, line: 154, baseType: !814, size: 64, offset: 1664)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !702, line: 154, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !710, file: !702, line: 156, baseType: !769, size: 64, offset: 1728)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !710, file: !702, line: 158, baseType: !101, size: 32, offset: 1792)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !710, file: !702, line: 159, baseType: !101, size: 32, offset: 1824)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !710, file: !702, line: 162, baseType: !713, size: 64, offset: 1856)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !710, file: !702, line: 162, baseType: !713, size: 64, offset: 1920)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !710, file: !702, line: 162, baseType: !713, size: 64, offset: 1984)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !710, file: !702, line: 164, baseType: !82, size: 128, offset: 2048)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !710, file: !702, line: 166, baseType: !12, size: 64, offset: 2176)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !710, file: !702, line: 167, baseType: !4, size: 64, offset: 2240)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !710, file: !702, line: 168, baseType: !101, size: 32, offset: 2304)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !710, file: !702, line: 170, baseType: !101, size: 32, offset: 2336)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !710, file: !702, line: 170, baseType: !101, size: 32, offset: 2368)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !710, file: !702, line: 171, baseType: !101, size: 32, offset: 2400)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !710, file: !702, line: 173, baseType: !4, size: 64, offset: 2432)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !710, file: !702, line: 175, baseType: !48, size: 32, offset: 2496)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !710, file: !702, line: 176, baseType: !48, size: 32, offset: 2528)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !710, file: !702, line: 179, baseType: !48, size: 32, offset: 2560)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !710, file: !702, line: 180, baseType: !101, size: 32, offset: 2592)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !710, file: !702, line: 183, baseType: !48, size: 32, offset: 2624)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !710, file: !702, line: 185, baseType: !37, size: 8, offset: 2656)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !710, file: !702, line: 186, baseType: !837, size: 24, offset: 2664)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, elements: !443)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !710, file: !702, line: 189, baseType: !82, size: 128, offset: 2688)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !701, file: !702, line: 207, baseType: !36, size: 8192, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !701, file: !702, line: 208, baseType: !36, size: 8192, offset: 8576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !701, file: !702, line: 210, baseType: !48, size: 32, offset: 16768)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !701, file: !702, line: 210, baseType: !48, size: 32, offset: 16800)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !701, file: !702, line: 211, baseType: !48, size: 32, offset: 16832)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !702, line: 211, baseType: !48, size: 32, offset: 16864)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !701, file: !702, line: 212, baseType: !846, size: 128, offset: 16896)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !847, line: 95, baseType: !848)
!847 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !847, line: 92, size: 128, elements: !849)
!849 = !{!850, !851, !852, !853}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !848, file: !847, line: 93, baseType: !101, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !848, file: !847, line: 93, baseType: !101, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !848, file: !847, line: 94, baseType: !101, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !848, file: !847, line: 94, baseType: !101, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !317, file: !318, line: 1246, baseType: !855, size: 64, offset: 2112)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !318, line: 1067, size: 5184, elements: !857)
!857 = !{!858, !889, !890, !905, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !927, !1015, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1125}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !856, file: !318, line: 1068, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !318, line: 934, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !318, line: 925, size: 576, elements: !862)
!862 = !{!863, !880, !881, !882, !883, !885, !888}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !861, file: !318, line: 926, baseType: !864, size: 320)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !318, line: 830, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !318, line: 813, size: 320, elements: !866)
!866 = !{!867, !870, !873, !874, !877, !878, !879}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !865, file: !318, line: 814, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !318, line: 51, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !865, file: !318, line: 815, baseType: !871, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !318, line: 815, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !865, file: !318, line: 818, baseType: !4, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !865, file: !318, line: 819, baseType: !875, size: 32, offset: 192)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 32, elements: !517)
!876 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
