; ModuleID = 'blender/source/blender/editors/interface/interface_panel.c'
source_filename = "blender/source/blender/editors/interface/interface_panel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!1316 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!1317 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!1318 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!1319 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!1320 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!1321 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!1322 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!1323 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!1324 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!1325 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!1326 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!1327 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!1328 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!1329 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!1330 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!1331 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!1332 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!1333 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!1334 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!1335 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!1336 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!1337 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!1338 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!1339 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!1340 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!1341 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!1342 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!1343 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!1344 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !15, line: 1163, baseType: !5, size: 32, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1346 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!1347 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!1348 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!1349 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!1350 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!1351 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!1352 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!1353 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!1354 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!1355 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!1356 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!1357 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!1358 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!1359 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!1360 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!1361 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!1362 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!1363 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!1364 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!1365 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!1366 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!1367 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!1368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 361, baseType: !5, size: 32, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377}
!1370 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!1371 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!1372 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!1373 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!1374 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!1375 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!1376 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!1377 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!1378 = !{!1379, !1380, !1381, !3367, !1420}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1380 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlock", file: !4, line: 83, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !1384, line: 320, size: 5440, elements: !1385)
!1384 = !DIFile(filename: "blender/source/blender/editors/interface/interface_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1385 = !{!1386, !1387, !1388, !1395, !1497, !1498, !1499, !1500, !1501, !1502, !1506, !1510, !1519, !1520, !1521, !1526, !1527, !1528, !1530, !1531, !1536, !1537, !1539, !1540, !1596, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1616, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !3349, !3350, !3351, !3353, !3354, !3355, !3356}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1383, file: !1384, line: 321, baseType: !1381, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1383, file: !1384, line: 321, baseType: !1381, size: 64, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "buttons", scope: !1383, file: !1384, line: 323, baseType: !1389, size: 128, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1390, line: 71, baseType: !1391)
!1390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1390, line: 69, size: 128, elements: !1392)
!1392 = !{!1393, !1394}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1391, file: !1390, line: 70, baseType: !1379, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1391, file: !1390, line: 70, baseType: !1379, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !1383, file: !1384, line: 324, baseType: !1396, size: 64, offset: 256)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "Panel", file: !22, line: 113, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Panel", file: !22, line: 97, size: 2176, elements: !1399)
!1399 = !{!1400, !1402, !1403, !1477, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1398, file: !22, line: 98, baseType: !1401, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1398, file: !22, line: 98, baseType: !1401, size: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1398, file: !22, line: 100, baseType: !1404, size: 64, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PanelType", file: !1406, line: 169, size: 3264, elements: !1407)
!1406 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1407 = !{!1408, !1409, !1410, !1415, !1416, !1417, !1418, !1419, !1421, !1422, !1423, !1431, !1435, !1436}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1405, file: !1406, line: 170, baseType: !1404, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1405, file: !1406, line: 170, baseType: !1404, size: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1405, file: !1406, line: 172, baseType: !1411, size: 512, offset: 128)
!1411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 512, elements: !1413)
!1412 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1413 = !{!1414}
!1414 = !DISubrange(count: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1405, file: !1406, line: 173, baseType: !1411, size: 512, offset: 640)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1405, file: !1406, line: 174, baseType: !1411, size: 512, offset: 1152)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1405, file: !1406, line: 175, baseType: !1411, size: 512, offset: 1664)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1405, file: !1406, line: 176, baseType: !1411, size: 512, offset: 2176)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "space_type", scope: !1405, file: !1406, line: 177, baseType: !1420, size: 32, offset: 2688)
!1420 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !1405, file: !1406, line: 178, baseType: !1420, size: 32, offset: 2720)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1405, file: !1406, line: 180, baseType: !1420, size: 32, offset: 2752)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !1405, file: !1406, line: 183, baseType: !1424, size: 64, offset: 2816)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!1420, !1427, !1404}
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1429)
!1429 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1430, line: 44, flags: DIFlagFwdDecl)
!1430 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "draw_header", scope: !1405, file: !1406, line: 185, baseType: !1432, size: 64, offset: 2880)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{null, !1427, !1401}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1405, file: !1406, line: 187, baseType: !1432, size: 64, offset: 2944)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1405, file: !1406, line: 190, baseType: !1437, size: 256, offset: 3008)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !1430, line: 436, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !1430, line: 430, size: 256, elements: !1439)
!1439 = !{!1440, !1441, !1445, !1472}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1438, file: !1430, line: 431, baseType: !1379, size: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1438, file: !1430, line: 432, baseType: !1442, size: 64, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !1430, line: 417, baseType: !1444)
!1444 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1430, line: 41, flags: DIFlagFwdDecl)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1438, file: !1430, line: 433, baseType: !1446, size: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !1430, line: 408, baseType: !1447)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!1420, !1450, !1451, !1461, !1463}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1430, line: 55, size: 192, elements: !1453)
!1453 = !{!1454, !1458, !1460}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1452, file: !1430, line: 58, baseType: !1455, size: 64)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1452, file: !1430, line: 56, size: 64, elements: !1456)
!1456 = !{!1457}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1455, file: !1430, line: 57, baseType: !1379, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1452, file: !1430, line: 60, baseType: !1459, size: 64, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1452, file: !1430, line: 61, baseType: !1379, size: 64, offset: 128)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1430, line: 38, flags: DIFlagFwdDecl)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !1430, line: 348, baseType: !1465)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !1430, line: 337, size: 256, elements: !1466)
!1466 = !{!1467, !1468, !1469, !1470, !1471}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1465, file: !1430, line: 339, baseType: !1379, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1465, file: !1430, line: 342, baseType: !1461, size: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1465, file: !1430, line: 345, baseType: !1420, size: 32, offset: 128)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1465, file: !1430, line: 347, baseType: !1420, size: 32, offset: 160)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1465, file: !1430, line: 347, baseType: !1420, size: 32, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1438, file: !1430, line: 434, baseType: !1473, size: 64, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !1430, line: 409, baseType: !1474)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{null, !1379}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1398, file: !22, line: 101, baseType: !1478, size: 64, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1406, line: 48, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "panelname", scope: !1398, file: !22, line: 103, baseType: !1411, size: 512, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "tabname", scope: !1398, file: !22, line: 103, baseType: !1411, size: 512, offset: 768)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "drawname", scope: !1398, file: !22, line: 104, baseType: !1411, size: 512, offset: 1280)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "ofsx", scope: !1398, file: !22, line: 105, baseType: !1420, size: 32, offset: 1792)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "ofsy", scope: !1398, file: !22, line: 105, baseType: !1420, size: 32, offset: 1824)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1398, file: !22, line: 105, baseType: !1420, size: 32, offset: 1856)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1398, file: !22, line: 105, baseType: !1420, size: 32, offset: 1888)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "labelofs", scope: !1398, file: !22, line: 106, baseType: !1488, size: 16, offset: 1920)
!1488 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1398, file: !22, line: 106, baseType: !1488, size: 16, offset: 1936)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1398, file: !22, line: 107, baseType: !1488, size: 16, offset: 1952)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_flag", scope: !1398, file: !22, line: 107, baseType: !1488, size: 16, offset: 1968)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1398, file: !22, line: 108, baseType: !1488, size: 16, offset: 1984)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !1398, file: !22, line: 109, baseType: !1488, size: 16, offset: 2000)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "sortorder", scope: !1398, file: !22, line: 110, baseType: !1420, size: 32, offset: 2016)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "paneltab", scope: !1398, file: !22, line: 111, baseType: !1401, size: 64, offset: 2048)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "activedata", scope: !1398, file: !22, line: 112, baseType: !1379, size: 64, offset: 2112)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "oldblock", scope: !1383, file: !1384, line: 325, baseType: !1381, size: 64, offset: 320)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "butstore", scope: !1383, file: !1384, line: 327, baseType: !1389, size: 128, offset: 384)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "layouts", scope: !1383, file: !1384, line: 329, baseType: !1389, size: 128, offset: 512)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "curlayout", scope: !1383, file: !1384, line: 330, baseType: !1478, size: 64, offset: 640)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !1383, file: !1384, line: 332, baseType: !1389, size: 128, offset: 704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1383, file: !1384, line: 334, baseType: !1503, size: 1024, offset: 832)
!1503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 1024, elements: !1504)
!1504 = !{!1505}
!1505 = !DISubrange(count: 128)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !1383, file: !1384, line: 336, baseType: !1507, size: 512, offset: 1856)
!1507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 512, elements: !1508)
!1508 = !{!1509, !1509}
!1509 = !DISubrange(count: 4)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1383, file: !1384, line: 338, baseType: !1511, size: 128, offset: 2368)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1512, line: 95, baseType: !1513)
!1512 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1512, line: 92, size: 128, elements: !1514)
!1514 = !{!1515, !1516, !1517, !1518}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1513, file: !1512, line: 93, baseType: !1380, size: 32)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1513, file: !1512, line: 93, baseType: !1380, size: 32, offset: 32)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1513, file: !1512, line: 94, baseType: !1380, size: 32, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1513, file: !1512, line: 94, baseType: !1380, size: 32, offset: 96)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !1383, file: !1384, line: 339, baseType: !1380, size: 32, offset: 2496)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "puphash", scope: !1383, file: !1384, line: 341, baseType: !5, size: 32, offset: 2528)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1383, file: !1384, line: 343, baseType: !1522, size: 64, offset: 2560)
!1522 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleFunc", file: !4, line: 336, baseType: !1523)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{null, !1450, !1379, !1379}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1383, file: !1384, line: 344, baseType: !1379, size: 64, offset: 2624)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1383, file: !1384, line: 345, baseType: !1379, size: 64, offset: 2688)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1383, file: !1384, line: 347, baseType: !1529, size: 64, offset: 2752)
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleNFunc", file: !4, line: 338, baseType: !1523)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1383, file: !1384, line: 348, baseType: !1379, size: 64, offset: 2816)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func", scope: !1383, file: !1384, line: 350, baseType: !1532, size: 64, offset: 2880)
!1532 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiMenuHandleFunc", file: !4, line: 346, baseType: !1533)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{null, !1450, !1379, !1420}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func_arg", scope: !1383, file: !1384, line: 351, baseType: !1379, size: 64, offset: 2944)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func", scope: !1383, file: !1384, line: 353, baseType: !1538, size: 64, offset: 3008)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleFunc", file: !4, line: 341, baseType: !1533)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func_arg", scope: !1383, file: !1384, line: 354, baseType: !1379, size: 64, offset: 3072)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "block_event_func", scope: !1383, file: !1384, line: 357, baseType: !1541, size: 64, offset: 3136)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!1420, !1427, !1544, !1545}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64)
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1547)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1548, line: 421, size: 960, elements: !1549)
!1548 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1549 = !{!1550, !1552, !1553, !1554, !1555, !1556, !1557, !1561, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1584, !1592, !1593, !1594, !1595}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1547, file: !1548, line: 422, baseType: !1551, size: 64)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1547, file: !1548, line: 422, baseType: !1551, size: 64, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1547, file: !1548, line: 424, baseType: !1488, size: 16, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1547, file: !1548, line: 425, baseType: !1488, size: 16, offset: 144)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1547, file: !1548, line: 426, baseType: !1420, size: 32, offset: 160)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1547, file: !1548, line: 426, baseType: !1420, size: 32, offset: 192)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1547, file: !1548, line: 427, baseType: !1558, size: 64, offset: 224)
!1558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1420, size: 64, elements: !1559)
!1559 = !{!1560}
!1560 = !DISubrange(count: 2)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1547, file: !1548, line: 428, baseType: !1562, size: 48, offset: 288)
!1562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 48, elements: !1563)
!1563 = !{!1564}
!1564 = !DISubrange(count: 6)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1547, file: !1548, line: 431, baseType: !1412, size: 8, offset: 336)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1547, file: !1548, line: 432, baseType: !1412, size: 8, offset: 344)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1547, file: !1548, line: 435, baseType: !1488, size: 16, offset: 352)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1547, file: !1548, line: 436, baseType: !1488, size: 16, offset: 368)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1547, file: !1548, line: 437, baseType: !1420, size: 32, offset: 384)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1547, file: !1548, line: 437, baseType: !1420, size: 32, offset: 416)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1547, file: !1548, line: 438, baseType: !1572, size: 64, offset: 448)
!1572 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1547, file: !1548, line: 439, baseType: !1420, size: 32, offset: 512)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1547, file: !1548, line: 439, baseType: !1420, size: 32, offset: 544)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1547, file: !1548, line: 442, baseType: !1488, size: 16, offset: 576)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1547, file: !1548, line: 442, baseType: !1488, size: 16, offset: 592)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1547, file: !1548, line: 442, baseType: !1488, size: 16, offset: 608)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1547, file: !1548, line: 442, baseType: !1488, size: 16, offset: 624)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1547, file: !1548, line: 443, baseType: !1488, size: 16, offset: 640)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1547, file: !1548, line: 446, baseType: !1488, size: 16, offset: 656)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1547, file: !1548, line: 449, baseType: !1582, size: 64, offset: 704)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1412)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1547, file: !1548, line: 452, baseType: !1585, size: 64, offset: 768)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !1548, line: 463, size: 128, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1586, file: !1548, line: 464, baseType: !1420, size: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1586, file: !1548, line: 465, baseType: !1380, size: 32, offset: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1586, file: !1548, line: 466, baseType: !1380, size: 32, offset: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1586, file: !1548, line: 467, baseType: !1380, size: 32, offset: 96)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1547, file: !1548, line: 455, baseType: !1488, size: 16, offset: 832)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1547, file: !1548, line: 456, baseType: !1488, size: 16, offset: 848)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1547, file: !1548, line: 457, baseType: !1420, size: 32, offset: 864)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1547, file: !1548, line: 458, baseType: !1379, size: 64, offset: 896)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra", scope: !1383, file: !1384, line: 360, baseType: !1597, size: 64, offset: 3200)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{null, !1427, !1379, !1379, !1379, !1600}
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1512, line: 89, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1512, line: 86, size: 128, elements: !1603)
!1603 = !{!1604, !1605, !1606, !1607}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1602, file: !1512, line: 87, baseType: !1420, size: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1602, file: !1512, line: 87, baseType: !1420, size: 32, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1602, file: !1512, line: 88, baseType: !1420, size: 32, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1602, file: !1512, line: 88, baseType: !1420, size: 32, offset: 96)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg1", scope: !1383, file: !1384, line: 361, baseType: !1379, size: 64, offset: 3264)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg2", scope: !1383, file: !1384, line: 362, baseType: !1379, size: 64, offset: 3328)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1383, file: !1384, line: 364, baseType: !1420, size: 32, offset: 3392)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1383, file: !1384, line: 365, baseType: !1488, size: 16, offset: 3424)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1383, file: !1384, line: 367, baseType: !1412, size: 8, offset: 3440)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1383, file: !1384, line: 368, baseType: !1412, size: 8, offset: 3448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open", scope: !1383, file: !1384, line: 369, baseType: !1615, size: 8, offset: 3456)
!1615 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1383, file: !1384, line: 370, baseType: !1617, size: 56, offset: 3464)
!1617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 56, elements: !1618)
!1618 = !{!1619}
!1619 = !DISubrange(count: 7)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open_last", scope: !1383, file: !1384, line: 371, baseType: !1572, size: 64, offset: 3520)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1383, file: !1384, line: 373, baseType: !1582, size: 64, offset: 3584)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1383, file: !1384, line: 375, baseType: !1412, size: 8, offset: 3648)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1383, file: !1384, line: 376, baseType: !1412, size: 8, offset: 3656)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "tooltipdisabled", scope: !1383, file: !1384, line: 377, baseType: !1412, size: 8, offset: 3664)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "endblock", scope: !1383, file: !1384, line: 378, baseType: !1412, size: 8, offset: 3672)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "bounds_type", scope: !1383, file: !1384, line: 380, baseType: !1627, size: 32, offset: 3680)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBlockBoundsCalc", file: !4, line: 434, baseType: !3)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !1383, file: !1384, line: 381, baseType: !1420, size: 32, offset: 3712)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "my", scope: !1383, file: !1384, line: 381, baseType: !1420, size: 32, offset: 3744)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1383, file: !1384, line: 382, baseType: !1420, size: 32, offset: 3776)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !1383, file: !1384, line: 382, baseType: !1420, size: 32, offset: 3808)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !1383, file: !1384, line: 384, baseType: !1511, size: 128, offset: 3840)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "saferct", scope: !1383, file: !1384, line: 385, baseType: !1389, size: 128, offset: 3968)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1383, file: !1384, line: 387, baseType: !1635, size: 64, offset: 4096)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiPopupBlockHandle", file: !4, line: 84, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockHandle", file: !1384, line: 491, size: 1536, elements: !1638)
!1638 = !{!1639, !3225, !3226, !3227, !3228, !3229, !3230, !3234, !3235, !3254, !3255, !3260, !3337, !3340, !3341, !3342, !3343, !3344, !3345, !3346, !3347, !3348}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1637, file: !1384, line: 493, baseType: !1640, size: 64)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64)
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !22, line: 230, size: 3072, elements: !1642)
!1642 = !{!1643, !1644, !1645, !2992, !2993, !2994, !2995, !2996, !2997, !2998, !2999, !3000, !3001, !3002, !3003, !3004, !3005, !3006, !3007, !3008, !3009, !3215, !3216, !3217, !3218, !3219, !3220, !3221, !3222, !3223, !3224}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1641, file: !22, line: 231, baseType: !1640, size: 64)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1641, file: !22, line: 231, baseType: !1640, size: 64, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1641, file: !22, line: 233, baseType: !1646, size: 1280, offset: 128)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1647, line: 71, baseType: !1648)
!1647 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1647, line: 40, size: 1280, elements: !1649)
!1649 = !{!1650, !1651, !1652, !1653, !1654, !1655, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1674, !1675, !1676, !1679}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1648, file: !1647, line: 41, baseType: !1511, size: 128)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1648, file: !1647, line: 41, baseType: !1511, size: 128, offset: 128)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1648, file: !1647, line: 42, baseType: !1601, size: 128, offset: 256)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1648, file: !1647, line: 42, baseType: !1601, size: 128, offset: 384)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1648, file: !1647, line: 43, baseType: !1601, size: 128, offset: 512)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1648, file: !1647, line: 45, baseType: !1656, size: 64, offset: 640)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 64, elements: !1559)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1648, file: !1647, line: 45, baseType: !1656, size: 64, offset: 704)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1648, file: !1647, line: 46, baseType: !1380, size: 32, offset: 768)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1648, file: !1647, line: 46, baseType: !1380, size: 32, offset: 800)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1648, file: !1647, line: 48, baseType: !1488, size: 16, offset: 832)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1648, file: !1647, line: 49, baseType: !1488, size: 16, offset: 848)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1648, file: !1647, line: 51, baseType: !1488, size: 16, offset: 864)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1648, file: !1647, line: 52, baseType: !1488, size: 16, offset: 880)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1648, file: !1647, line: 53, baseType: !1488, size: 16, offset: 896)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1648, file: !1647, line: 55, baseType: !1488, size: 16, offset: 912)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1648, file: !1647, line: 56, baseType: !1488, size: 16, offset: 928)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1648, file: !1647, line: 58, baseType: !1488, size: 16, offset: 944)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1648, file: !1647, line: 58, baseType: !1488, size: 16, offset: 960)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1648, file: !1647, line: 59, baseType: !1488, size: 16, offset: 976)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1648, file: !1647, line: 59, baseType: !1488, size: 16, offset: 992)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1648, file: !1647, line: 61, baseType: !1488, size: 16, offset: 1008)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1648, file: !1647, line: 63, baseType: !1673, size: 64, offset: 1024)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1648, file: !1647, line: 64, baseType: !1420, size: 32, offset: 1088)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1648, file: !1647, line: 65, baseType: !1420, size: 32, offset: 1120)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1648, file: !1647, line: 68, baseType: !1677, size: 64, offset: 1152)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64)
!1678 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1647, line: 68, flags: DIFlagFwdDecl)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1648, file: !1647, line: 69, baseType: !1680, size: 64, offset: 1216)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1548, line: 490, size: 768, elements: !1682)
!1682 = !{!1683, !1684, !1685, !2983, !2984, !2985, !2986, !2987, !2988, !2989, !2990, !2991}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1681, file: !1548, line: 491, baseType: !1680, size: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1681, file: !1548, line: 491, baseType: !1680, size: 64, offset: 64)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1681, file: !1548, line: 493, baseType: !1686, size: 64, offset: 128)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1688, line: 169, size: 2048, elements: !1689)
!1688 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1689 = !{!1690, !1691, !1692, !1693, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2961, !2975, !2976, !2977, !2978, !2979, !2980, !2981, !2982}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1687, file: !1688, line: 170, baseType: !1686, size: 64)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1687, file: !1688, line: 170, baseType: !1686, size: 64, offset: 64)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1687, file: !1688, line: 172, baseType: !1379, size: 64, offset: 128)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1687, file: !1688, line: 174, baseType: !1694, size: 64, offset: 192)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !22, line: 49, size: 1984, elements: !1696)
!1696 = !{!1697, !1756, !1757, !1758, !1759, !1760, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1695, file: !22, line: 50, baseType: !1698, size: 960)
!1698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1699, line: 130, baseType: !1700)
!1699 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1699, line: 117, size: 960, elements: !1701)
!1701 = !{!1702, !1703, !1704, !1706, !1725, !1729, !1730, !1731, !1732, !1733}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1700, file: !1699, line: 118, baseType: !1379, size: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1700, file: !1699, line: 118, baseType: !1379, size: 64, offset: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1700, file: !1699, line: 119, baseType: !1705, size: 64, offset: 128)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1700, file: !1699, line: 120, baseType: !1707, size: 64, offset: 192)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1699, line: 136, size: 17600, elements: !1709)
!1709 = !{!1710, !1711, !1713, !1716, !1720, !1721, !1722}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1708, file: !1699, line: 137, baseType: !1698, size: 960)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1708, file: !1699, line: 138, baseType: !1712, size: 64, offset: 960)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1708, file: !1699, line: 139, baseType: !1714, size: 64, offset: 1024)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64)
!1715 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1699, line: 43, flags: DIFlagFwdDecl)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1708, file: !1699, line: 140, baseType: !1717, size: 8192, offset: 1088)
!1717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 8192, elements: !1718)
!1718 = !{!1719}
!1719 = !DISubrange(count: 1024)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1708, file: !1699, line: 141, baseType: !1717, size: 8192, offset: 9280)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1708, file: !1699, line: 148, baseType: !1707, size: 64, offset: 17472)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1708, file: !1699, line: 150, baseType: !1723, size: 64, offset: 17536)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64)
!1724 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1699, line: 45, flags: DIFlagFwdDecl)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1700, file: !1699, line: 121, baseType: !1726, size: 528, offset: 256)
!1726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 528, elements: !1727)
!1727 = !{!1728}
!1728 = !DISubrange(count: 66)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1700, file: !1699, line: 126, baseType: !1488, size: 16, offset: 784)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1700, file: !1699, line: 127, baseType: !1420, size: 32, offset: 800)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1700, file: !1699, line: 128, baseType: !1420, size: 32, offset: 832)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1700, file: !1699, line: 128, baseType: !1420, size: 32, offset: 864)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1700, file: !1699, line: 129, baseType: !1734, size: 64, offset: 896)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64)
!1735 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1699, line: 75, baseType: !1736)
!1736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1699, line: 62, size: 1024, elements: !1737)
!1737 = !{!1738, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1754, !1755}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1736, file: !1699, line: 63, baseType: !1739, size: 64)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1736, file: !1699, line: 63, baseType: !1739, size: 64, offset: 64)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1736, file: !1699, line: 64, baseType: !1412, size: 8, offset: 128)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1736, file: !1699, line: 64, baseType: !1412, size: 8, offset: 136)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1736, file: !1699, line: 65, baseType: !1488, size: 16, offset: 144)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1736, file: !1699, line: 66, baseType: !1411, size: 512, offset: 160)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1736, file: !1699, line: 67, baseType: !1420, size: 32, offset: 672)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1736, file: !1699, line: 69, baseType: !1747, size: 256, offset: 704)
!1747 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1699, line: 60, baseType: !1748)
!1748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1699, line: 48, size: 256, elements: !1749)
!1749 = !{!1750, !1751, !1752, !1753}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1748, file: !1699, line: 49, baseType: !1379, size: 64)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1748, file: !1699, line: 58, baseType: !1389, size: 128, offset: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1748, file: !1699, line: 59, baseType: !1420, size: 32, offset: 192)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1748, file: !1699, line: 59, baseType: !1420, size: 32, offset: 224)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1736, file: !1699, line: 70, baseType: !1420, size: 32, offset: 960)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1736, file: !1699, line: 74, baseType: !1420, size: 32, offset: 992)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1695, file: !22, line: 52, baseType: !1389, size: 128, offset: 960)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1695, file: !22, line: 53, baseType: !1389, size: 128, offset: 1088)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1695, file: !22, line: 54, baseType: !1389, size: 128, offset: 1216)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1695, file: !22, line: 55, baseType: !1389, size: 128, offset: 1344)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1695, file: !22, line: 57, baseType: !1761, size: 64, offset: 1472)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1763, line: 1216, size: 39680, elements: !1764)
!1763 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1764 = !{!1765, !1766, !1770, !1773, !1776, !1777, !1778, !1790, !1791, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1807, !1871, !2301, !2515, !2518, !2793, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2815, !2816, !2817, !2818, !2819, !2827, !2894, !2901, !2902, !2909, !2910, !2916, !2917, !2918, !2919, !2920}
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1762, file: !1763, line: 1217, baseType: !1698, size: 960)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1762, file: !1763, line: 1218, baseType: !1767, size: 64, offset: 960)
!1767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1768, size: 64)
!1768 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1769, line: 45, flags: DIFlagFwdDecl)
!1769 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1762, file: !1763, line: 1220, baseType: !1771, size: 64, offset: 1024)
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64)
!1772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1769, line: 49, flags: DIFlagFwdDecl)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1762, file: !1763, line: 1221, baseType: !1774, size: 64, offset: 1088)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64)
!1775 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1763, line: 52, flags: DIFlagFwdDecl)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1762, file: !1763, line: 1223, baseType: !1761, size: 64, offset: 1152)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1762, file: !1763, line: 1225, baseType: !1389, size: 128, offset: 1216)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1762, file: !1763, line: 1226, baseType: !1779, size: 64, offset: 1344)
!1779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1780, size: 64)
!1780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1763, line: 69, size: 320, elements: !1781)
!1781 = !{!1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789}
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1780, file: !1763, line: 70, baseType: !1779, size: 64)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1780, file: !1763, line: 70, baseType: !1779, size: 64, offset: 64)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1780, file: !1763, line: 71, baseType: !5, size: 32, offset: 128)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1780, file: !1763, line: 71, baseType: !5, size: 32, offset: 160)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1780, file: !1763, line: 72, baseType: !1420, size: 32, offset: 192)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1780, file: !1763, line: 73, baseType: !1488, size: 16, offset: 224)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1780, file: !1763, line: 73, baseType: !1488, size: 16, offset: 240)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1780, file: !1763, line: 74, baseType: !1771, size: 64, offset: 256)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1762, file: !1763, line: 1227, baseType: !1771, size: 64, offset: 1408)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1762, file: !1763, line: 1229, baseType: !1792, size: 96, offset: 1472)
!1792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 96, elements: !1793)
!1793 = !{!1794}
!1794 = !DISubrange(count: 3)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1762, file: !1763, line: 1230, baseType: !1792, size: 96, offset: 1568)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1762, file: !1763, line: 1231, baseType: !1792, size: 96, offset: 1664)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1762, file: !1763, line: 1231, baseType: !1792, size: 96, offset: 1760)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1762, file: !1763, line: 1233, baseType: !5, size: 32, offset: 1856)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1762, file: !1763, line: 1234, baseType: !1420, size: 32, offset: 1888)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1762, file: !1763, line: 1235, baseType: !5, size: 32, offset: 1920)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1762, file: !1763, line: 1237, baseType: !1488, size: 16, offset: 1952)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1762, file: !1763, line: 1239, baseType: !1412, size: 8, offset: 1968)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1762, file: !1763, line: 1240, baseType: !1804, size: 8, offset: 1976)
!1804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 8, elements: !1805)
!1805 = !{!1806}
!1806 = !DISubrange(count: 1)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1762, file: !1763, line: 1242, baseType: !1808, size: 64, offset: 1984)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64)
!1809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1810, line: 328, size: 3456, elements: !1811)
!1810 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1811 = !{!1812, !1813, !1814, !1817, !1818, !1819, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1844, !1849, !1850, !1853, !1857, !1862, !1866, !1867, !1868, !1869, !1870}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1809, file: !1810, line: 329, baseType: !1698, size: 960)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1809, file: !1810, line: 330, baseType: !1767, size: 64, offset: 960)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1809, file: !1810, line: 332, baseType: !1815, size: 64, offset: 1024)
!1815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1816, size: 64)
!1816 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1810, line: 332, flags: DIFlagFwdDecl)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1809, file: !1810, line: 333, baseType: !1411, size: 512, offset: 1088)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1809, file: !1810, line: 335, baseType: !1459, size: 64, offset: 1600)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1809, file: !1810, line: 337, baseType: !1820, size: 64, offset: 1664)
!1820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1821, size: 64)
!1821 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1822, line: 45, flags: DIFlagFwdDecl)
!1822 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1809, file: !1810, line: 338, baseType: !1656, size: 64, offset: 1728)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1809, file: !1810, line: 340, baseType: !1389, size: 128, offset: 1792)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1809, file: !1810, line: 340, baseType: !1389, size: 128, offset: 1920)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1809, file: !1810, line: 342, baseType: !1420, size: 32, offset: 2048)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1809, file: !1810, line: 342, baseType: !1420, size: 32, offset: 2080)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1809, file: !1810, line: 343, baseType: !1420, size: 32, offset: 2112)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1809, file: !1810, line: 345, baseType: !1420, size: 32, offset: 2144)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1809, file: !1810, line: 346, baseType: !1420, size: 32, offset: 2176)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1809, file: !1810, line: 347, baseType: !1488, size: 16, offset: 2208)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1809, file: !1810, line: 348, baseType: !1488, size: 16, offset: 2224)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1809, file: !1810, line: 349, baseType: !1420, size: 32, offset: 2240)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1809, file: !1810, line: 351, baseType: !1420, size: 32, offset: 2272)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1809, file: !1810, line: 353, baseType: !1488, size: 16, offset: 2304)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1809, file: !1810, line: 354, baseType: !1488, size: 16, offset: 2320)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1809, file: !1810, line: 355, baseType: !1420, size: 32, offset: 2336)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1809, file: !1810, line: 357, baseType: !1511, size: 128, offset: 2368)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1809, file: !1810, line: 363, baseType: !1389, size: 128, offset: 2496)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1809, file: !1810, line: 363, baseType: !1389, size: 128, offset: 2624)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1809, file: !1810, line: 368, baseType: !1842, size: 64, offset: 2752)
!1842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1843, size: 64)
!1843 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1810, line: 48, flags: DIFlagFwdDecl)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1809, file: !1810, line: 372, baseType: !1845, size: 32, offset: 2816)
!1845 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1810, line: 274, baseType: !1846)
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1810, line: 271, size: 32, elements: !1847)
!1847 = !{!1848}
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1846, file: !1810, line: 273, baseType: !5, size: 32)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1809, file: !1810, line: 373, baseType: !1420, size: 32, offset: 2848)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1809, file: !1810, line: 382, baseType: !1851, size: 64, offset: 2880)
!1851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1852, size: 64)
!1852 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1810, line: 46, flags: DIFlagFwdDecl)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1809, file: !1810, line: 385, baseType: !1854, size: 64, offset: 2944)
!1854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1855, size: 64)
!1855 = !DISubroutineType(types: !1856)
!1856 = !{null, !1379, !1380}
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1809, file: !1810, line: 386, baseType: !1858, size: 64, offset: 3008)
!1858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1859, size: 64)
!1859 = !DISubroutineType(types: !1860)
!1860 = !{null, !1379, !1861}
!1861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1809, file: !1810, line: 387, baseType: !1863, size: 64, offset: 3072)
!1863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1864, size: 64)
!1864 = !DISubroutineType(types: !1865)
!1865 = !{!1420, !1379}
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1809, file: !1810, line: 388, baseType: !1474, size: 64, offset: 3136)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1809, file: !1810, line: 389, baseType: !1379, size: 64, offset: 3200)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1809, file: !1810, line: 389, baseType: !1379, size: 64, offset: 3264)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1809, file: !1810, line: 389, baseType: !1379, size: 64, offset: 3328)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1809, file: !1810, line: 389, baseType: !1379, size: 64, offset: 3392)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1762, file: !1763, line: 1244, baseType: !1872, size: 64, offset: 2048)
!1872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1873, size: 64)
!1873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1874, line: 200, size: 17024, elements: !1875)
!1874 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1875 = !{!1876, !1878, !1879, !1880, !2294, !2295, !2296, !2297, !2298, !2299, !2300}
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1873, file: !1874, line: 201, baseType: !1877, size: 64)
!1877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1873, file: !1874, line: 202, baseType: !1389, size: 128, offset: 64)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1873, file: !1874, line: 203, baseType: !1389, size: 128, offset: 192)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1873, file: !1874, line: 206, baseType: !1881, size: 64, offset: 320)
!1881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1882, size: 64)
!1882 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1874, line: 190, baseType: !1883)
!1883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1874, line: 126, size: 2816, elements: !1884)
!1884 = !{!1885, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1984, !1987, !1988, !1989, !2265, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2293}
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1883, file: !1874, line: 127, baseType: !1886, size: 64)
!1886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1883, size: 64)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1883, file: !1874, line: 127, baseType: !1886, size: 64, offset: 64)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1883, file: !1874, line: 128, baseType: !1379, size: 64, offset: 128)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1883, file: !1874, line: 129, baseType: !1379, size: 64, offset: 192)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1883, file: !1874, line: 130, baseType: !1411, size: 512, offset: 256)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1883, file: !1874, line: 132, baseType: !1420, size: 32, offset: 768)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1883, file: !1874, line: 132, baseType: !1420, size: 32, offset: 800)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1883, file: !1874, line: 133, baseType: !1420, size: 32, offset: 832)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1883, file: !1874, line: 134, baseType: !1420, size: 32, offset: 864)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1883, file: !1874, line: 134, baseType: !1420, size: 32, offset: 896)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1883, file: !1874, line: 134, baseType: !1420, size: 32, offset: 928)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1883, file: !1874, line: 135, baseType: !1420, size: 32, offset: 960)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1883, file: !1874, line: 135, baseType: !1420, size: 32, offset: 992)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1883, file: !1874, line: 136, baseType: !1420, size: 32, offset: 1024)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1883, file: !1874, line: 136, baseType: !1420, size: 32, offset: 1056)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1883, file: !1874, line: 137, baseType: !1420, size: 32, offset: 1088)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1883, file: !1874, line: 137, baseType: !1420, size: 32, offset: 1120)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1883, file: !1874, line: 138, baseType: !1380, size: 32, offset: 1152)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1883, file: !1874, line: 139, baseType: !1380, size: 32, offset: 1184)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1883, file: !1874, line: 139, baseType: !1380, size: 32, offset: 1216)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1883, file: !1874, line: 141, baseType: !1488, size: 16, offset: 1248)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1883, file: !1874, line: 142, baseType: !1488, size: 16, offset: 1264)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1883, file: !1874, line: 143, baseType: !1420, size: 32, offset: 1280)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1883, file: !1874, line: 144, baseType: !1420, size: 32, offset: 1312)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1883, file: !1874, line: 146, baseType: !1911, size: 64, offset: 1344)
!1911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1912, size: 64)
!1912 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1874, line: 114, baseType: !1913)
!1913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1874, line: 99, size: 7232, elements: !1914)
!1914 = !{!1915, !1917, !1918, !1919, !1920, !1921, !1922, !1933, !1937, !1952, !1961, !1968, !1978}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1913, file: !1874, line: 100, baseType: !1916, size: 64)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1913, size: 64)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1913, file: !1874, line: 100, baseType: !1916, size: 64, offset: 64)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1913, file: !1874, line: 101, baseType: !1420, size: 32, offset: 128)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1913, file: !1874, line: 101, baseType: !1420, size: 32, offset: 160)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1913, file: !1874, line: 102, baseType: !1420, size: 32, offset: 192)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1913, file: !1874, line: 102, baseType: !1420, size: 32, offset: 224)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1913, file: !1874, line: 103, baseType: !1923, size: 64, offset: 256)
!1923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1924, size: 64)
!1924 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1874, line: 59, baseType: !1925)
!1925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1874, line: 56, size: 2112, elements: !1926)
!1926 = !{!1927, !1931, !1932}
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1925, file: !1874, line: 57, baseType: !1928, size: 2048)
!1928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 2048, elements: !1929)
!1929 = !{!1930}
!1930 = !DISubrange(count: 256)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1925, file: !1874, line: 58, baseType: !1420, size: 32, offset: 2048)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1925, file: !1874, line: 58, baseType: !1420, size: 32, offset: 2080)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1913, file: !1874, line: 106, baseType: !1934, size: 6144, offset: 320)
!1934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1412, size: 6144, elements: !1935)
!1935 = !{!1936}
!1936 = !DISubrange(count: 768)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1913, file: !1874, line: 107, baseType: !1938, size: 64, offset: 6464)
!1938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1939, size: 64)
!1939 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1874, line: 97, baseType: !1940)
!1940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1874, line: 83, size: 8320, elements: !1941)
!1941 = !{!1942, !1943, !1944, !1948, !1949, !1950, !1951}
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1940, file: !1874, line: 84, baseType: !1934, size: 6144)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1940, file: !1874, line: 87, baseType: !1928, size: 2048, offset: 6144)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1940, file: !1874, line: 88, baseType: !1945, size: 64, offset: 8192)
!1945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1946, size: 64)
!1946 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1947, line: 41, flags: DIFlagFwdDecl)
!1947 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1940, file: !1874, line: 90, baseType: !1488, size: 16, offset: 8256)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1940, file: !1874, line: 92, baseType: !1488, size: 16, offset: 8272)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1940, file: !1874, line: 93, baseType: !1488, size: 16, offset: 8288)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1940, file: !1874, line: 95, baseType: !1488, size: 16, offset: 8304)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1913, file: !1874, line: 108, baseType: !1953, size: 64, offset: 6528)
!1953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1954, size: 64)
!1954 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1874, line: 66, baseType: !1955)
!1955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1874, line: 61, size: 128, elements: !1956)
!1956 = !{!1957, !1958, !1959, !1960}
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1955, file: !1874, line: 62, baseType: !1420, size: 32)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1955, file: !1874, line: 63, baseType: !1420, size: 32, offset: 32)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1955, file: !1874, line: 64, baseType: !1420, size: 32, offset: 64)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1955, file: !1874, line: 65, baseType: !1420, size: 32, offset: 96)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1913, file: !1874, line: 109, baseType: !1962, size: 64, offset: 6592)
!1962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1963, size: 64)
!1963 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1874, line: 71, baseType: !1964)
!1964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1874, line: 68, size: 64, elements: !1965)
!1965 = !{!1966, !1967}
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1964, file: !1874, line: 69, baseType: !1420, size: 32)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1964, file: !1874, line: 70, baseType: !1420, size: 32, offset: 32)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1913, file: !1874, line: 110, baseType: !1969, size: 64, offset: 6656)
!1969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1970, size: 64)
!1970 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1874, line: 81, baseType: !1971)
!1971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1874, line: 73, size: 352, elements: !1972)
!1972 = !{!1973, !1974, !1975, !1976, !1977}
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1971, file: !1874, line: 74, baseType: !1792, size: 96)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1971, file: !1874, line: 75, baseType: !1792, size: 96, offset: 96)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1971, file: !1874, line: 76, baseType: !1792, size: 96, offset: 192)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1971, file: !1874, line: 77, baseType: !1420, size: 32, offset: 288)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1971, file: !1874, line: 78, baseType: !1420, size: 32, offset: 320)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1913, file: !1874, line: 113, baseType: !1979, size: 512, offset: 6720)
!1979 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1980, line: 182, baseType: !1981)
!1980 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1980, line: 180, size: 512, elements: !1982)
!1982 = !{!1983}
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1981, file: !1980, line: 181, baseType: !1411, size: 512)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1883, file: !1874, line: 148, baseType: !1985, size: 64, offset: 1408)
!1985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1986, size: 64)
!1986 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1769, line: 46, flags: DIFlagFwdDecl)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1883, file: !1874, line: 151, baseType: !1761, size: 64, offset: 1472)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1883, file: !1874, line: 152, baseType: !1771, size: 64, offset: 1536)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1883, file: !1874, line: 153, baseType: !1990, size: 64, offset: 1600)
!1990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1991, size: 64)
!1991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1992, line: 64, size: 19136, elements: !1993)
!1992 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1993 = !{!1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2006, !2007, !2251, !2252, !2260, !2261, !2262, !2263, !2264}
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1991, file: !1992, line: 65, baseType: !1698, size: 960)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1991, file: !1992, line: 66, baseType: !1767, size: 64, offset: 960)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1991, file: !1992, line: 68, baseType: !1717, size: 8192, offset: 1024)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1991, file: !1992, line: 70, baseType: !1420, size: 32, offset: 9216)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1991, file: !1992, line: 71, baseType: !1420, size: 32, offset: 9248)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1991, file: !1992, line: 72, baseType: !1558, size: 64, offset: 9280)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1991, file: !1992, line: 74, baseType: !1380, size: 32, offset: 9344)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1991, file: !1992, line: 74, baseType: !1380, size: 32, offset: 9376)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1991, file: !1992, line: 76, baseType: !1945, size: 64, offset: 9408)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1991, file: !1992, line: 77, baseType: !2004, size: 64, offset: 9472)
!2004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2005, size: 64)
!2005 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1992, line: 77, flags: DIFlagFwdDecl)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1991, file: !1992, line: 78, baseType: !1820, size: 64, offset: 9536)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1991, file: !1992, line: 80, baseType: !2008, size: 2624, offset: 9600)
!2008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1822, line: 340, size: 2624, elements: !2009)
!2009 = !{!2010, !2038, !2056, !2057, !2058, !2073, !2131, !2132, !2231, !2232, !2233, !2234, !2240}
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !2008, file: !1822, line: 341, baseType: !2011, size: 576)
!2011 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1822, line: 251, baseType: !2012)
!2012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1822, line: 207, size: 576, elements: !2013)
!2013 = !{!2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037}
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2012, file: !1822, line: 208, baseType: !1420, size: 32)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !2012, file: !1822, line: 211, baseType: !1488, size: 16, offset: 32)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !2012, file: !1822, line: 212, baseType: !1488, size: 16, offset: 48)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !2012, file: !1822, line: 213, baseType: !1380, size: 32, offset: 64)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !2012, file: !1822, line: 214, baseType: !1488, size: 16, offset: 96)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !2012, file: !1822, line: 215, baseType: !1488, size: 16, offset: 112)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !2012, file: !1822, line: 216, baseType: !1488, size: 16, offset: 128)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !2012, file: !1822, line: 217, baseType: !1488, size: 16, offset: 144)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !2012, file: !1822, line: 218, baseType: !1488, size: 16, offset: 160)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !2012, file: !1822, line: 219, baseType: !1488, size: 16, offset: 176)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !2012, file: !1822, line: 220, baseType: !1380, size: 32, offset: 192)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !2012, file: !1822, line: 222, baseType: !1488, size: 16, offset: 224)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !2012, file: !1822, line: 225, baseType: !1488, size: 16, offset: 240)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !2012, file: !1822, line: 228, baseType: !1420, size: 32, offset: 256)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !2012, file: !1822, line: 229, baseType: !1420, size: 32, offset: 288)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !2012, file: !1822, line: 233, baseType: !1420, size: 32, offset: 320)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !2012, file: !1822, line: 236, baseType: !1488, size: 16, offset: 352)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2012, file: !1822, line: 236, baseType: !1488, size: 16, offset: 368)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !2012, file: !1822, line: 241, baseType: !1380, size: 32, offset: 384)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !2012, file: !1822, line: 244, baseType: !1420, size: 32, offset: 416)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !2012, file: !1822, line: 244, baseType: !1420, size: 32, offset: 448)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !2012, file: !1822, line: 245, baseType: !1380, size: 32, offset: 480)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !2012, file: !1822, line: 248, baseType: !1380, size: 32, offset: 512)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !2012, file: !1822, line: 250, baseType: !1420, size: 32, offset: 544)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !2008, file: !1822, line: 342, baseType: !2039, size: 448, offset: 576)
!2039 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1822, line: 79, baseType: !2040)
!2040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1822, line: 61, size: 448, elements: !2041)
!2041 = !{!2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055}
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !2040, file: !1822, line: 62, baseType: !1379, size: 64)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !2040, file: !1822, line: 64, baseType: !1488, size: 16, offset: 64)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2040, file: !1822, line: 65, baseType: !1488, size: 16, offset: 80)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !2040, file: !1822, line: 67, baseType: !1380, size: 32, offset: 96)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !2040, file: !1822, line: 68, baseType: !1380, size: 32, offset: 128)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !2040, file: !1822, line: 69, baseType: !1380, size: 32, offset: 160)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !2040, file: !1822, line: 70, baseType: !1488, size: 16, offset: 192)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !2040, file: !1822, line: 71, baseType: !1488, size: 16, offset: 208)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !2040, file: !1822, line: 72, baseType: !1656, size: 64, offset: 224)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !2040, file: !1822, line: 75, baseType: !1380, size: 32, offset: 288)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !2040, file: !1822, line: 75, baseType: !1380, size: 32, offset: 320)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !2040, file: !1822, line: 75, baseType: !1380, size: 32, offset: 352)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !2040, file: !1822, line: 78, baseType: !1380, size: 32, offset: 384)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !2040, file: !1822, line: 78, baseType: !1380, size: 32, offset: 416)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !2008, file: !1822, line: 343, baseType: !1389, size: 128, offset: 1024)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !2008, file: !1822, line: 344, baseType: !1389, size: 128, offset: 1152)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !2008, file: !1822, line: 345, baseType: !2059, size: 192, offset: 1280)
!2059 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1822, line: 278, baseType: !2060)
!2060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1822, line: 270, size: 192, elements: !2061)
!2061 = !{!2062, !2063, !2064, !2065, !2066}
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2060, file: !1822, line: 271, baseType: !1420, size: 32)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2060, file: !1822, line: 273, baseType: !1380, size: 32, offset: 32)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !2060, file: !1822, line: 275, baseType: !1420, size: 32, offset: 64)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !2060, file: !1822, line: 276, baseType: !1420, size: 32, offset: 96)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !2060, file: !1822, line: 277, baseType: !2067, size: 64, offset: 128)
!2067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2068, size: 64)
!2068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1822, line: 55, size: 576, elements: !2069)
!2069 = !{!2070, !2071, !2072}
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !2068, file: !1822, line: 56, baseType: !1420, size: 32)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2068, file: !1822, line: 57, baseType: !1380, size: 32, offset: 32)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !2068, file: !1822, line: 58, baseType: !1507, size: 512, offset: 64)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !2008, file: !1822, line: 346, baseType: !2074, size: 384, offset: 1472)
!2074 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1822, line: 268, baseType: !2075)
!2075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1822, line: 253, size: 384, elements: !2076)
!2076 = !{!2077, !2078, !2079, !2080, !2081, !2125, !2126, !2127, !2128, !2129, !2130}
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2075, file: !1822, line: 254, baseType: !1420, size: 32)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !2075, file: !1822, line: 255, baseType: !1420, size: 32, offset: 32)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !2075, file: !1822, line: 255, baseType: !1420, size: 32, offset: 64)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !2075, file: !1822, line: 258, baseType: !1380, size: 32, offset: 96)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !2075, file: !1822, line: 259, baseType: !2082, size: 64, offset: 128)
!2082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2083, size: 64)
!2083 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1822, line: 164, baseType: !2084)
!2084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1822, line: 108, size: 1664, elements: !2085)
!2085 = !{!2086, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124}
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2084, file: !1822, line: 109, baseType: !2087, size: 64)
!2087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2084, size: 64)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2084, file: !1822, line: 109, baseType: !2087, size: 64, offset: 64)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2084, file: !1822, line: 111, baseType: !1411, size: 512, offset: 128)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !2084, file: !1822, line: 119, baseType: !1656, size: 64, offset: 640)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !2084, file: !1822, line: 119, baseType: !1656, size: 64, offset: 704)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !2084, file: !1822, line: 125, baseType: !1656, size: 64, offset: 768)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !2084, file: !1822, line: 125, baseType: !1656, size: 64, offset: 832)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2084, file: !1822, line: 127, baseType: !1656, size: 64, offset: 896)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !2084, file: !1822, line: 130, baseType: !1420, size: 32, offset: 960)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !2084, file: !1822, line: 131, baseType: !1420, size: 32, offset: 992)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !2084, file: !1822, line: 132, baseType: !2098, size: 64, offset: 1024)
!2098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2099, size: 64)
!2099 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1822, line: 106, baseType: !2100)
!2100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1822, line: 81, size: 512, elements: !2101)
!2101 = !{!2102, !2103, !2106, !2107, !2108, !2109}
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !2100, file: !1822, line: 82, baseType: !1656, size: 64)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !2100, file: !1822, line: 97, baseType: !2104, size: 256, offset: 64)
!2104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 256, elements: !2105)
!2105 = !{!1509, !1560}
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !2100, file: !1822, line: 102, baseType: !1656, size: 64, offset: 320)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !2100, file: !1822, line: 102, baseType: !1656, size: 64, offset: 384)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !2100, file: !1822, line: 104, baseType: !1420, size: 32, offset: 448)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2100, file: !1822, line: 105, baseType: !1420, size: 32, offset: 480)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !2084, file: !1822, line: 135, baseType: !1792, size: 96, offset: 1088)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2084, file: !1822, line: 136, baseType: !1380, size: 32, offset: 1184)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2084, file: !1822, line: 139, baseType: !1420, size: 32, offset: 1216)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !2084, file: !1822, line: 139, baseType: !1420, size: 32, offset: 1248)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !2084, file: !1822, line: 139, baseType: !1420, size: 32, offset: 1280)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !2084, file: !1822, line: 140, baseType: !1792, size: 96, offset: 1312)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !2084, file: !1822, line: 143, baseType: !1488, size: 16, offset: 1408)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !2084, file: !1822, line: 144, baseType: !1488, size: 16, offset: 1424)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !2084, file: !1822, line: 145, baseType: !1488, size: 16, offset: 1440)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !2084, file: !1822, line: 148, baseType: !1488, size: 16, offset: 1456)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !2084, file: !1822, line: 149, baseType: !1420, size: 32, offset: 1472)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !2084, file: !1822, line: 150, baseType: !1380, size: 32, offset: 1504)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !2084, file: !1822, line: 152, baseType: !1820, size: 64, offset: 1536)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !2084, file: !1822, line: 163, baseType: !1380, size: 32, offset: 1600)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2084, file: !1822, line: 163, baseType: !1380, size: 32, offset: 1632)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !2075, file: !1822, line: 261, baseType: !1380, size: 32, offset: 192)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !2075, file: !1822, line: 261, baseType: !1380, size: 32, offset: 224)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !2075, file: !1822, line: 261, baseType: !1380, size: 32, offset: 256)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !2075, file: !1822, line: 263, baseType: !1420, size: 32, offset: 288)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !2075, file: !1822, line: 266, baseType: !1420, size: 32, offset: 320)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2075, file: !1822, line: 267, baseType: !1380, size: 32, offset: 352)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !2008, file: !1822, line: 347, baseType: !2082, size: 64, offset: 1856)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !2008, file: !1822, line: 348, baseType: !2133, size: 64, offset: 1920)
!2133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2134, size: 64)
!2134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1822, line: 205, baseType: !2135)
!2135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1822, line: 186, size: 1024, elements: !2136)
!2136 = !{!2137, !2139, !2140, !2141, !2143, !2144, !2145, !2153, !2154, !2155, !2229, !2230}
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2135, file: !1822, line: 187, baseType: !2138, size: 64)
!2138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2135, size: 64)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2135, file: !1822, line: 187, baseType: !2138, size: 64, offset: 64)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2135, file: !1822, line: 189, baseType: !1411, size: 512, offset: 128)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !2135, file: !1822, line: 191, baseType: !2142, size: 64, offset: 640)
!2142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2082, size: 64)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !2135, file: !1822, line: 193, baseType: !1420, size: 32, offset: 704)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2135, file: !1822, line: 193, baseType: !1420, size: 32, offset: 736)
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !2135, file: !1822, line: 195, baseType: !2146, size: 64, offset: 768)
!2146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2147, size: 64)
!2147 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1822, line: 184, baseType: !2148)
!2148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1822, line: 166, size: 320, elements: !2149)
!2149 = !{!2150, !2151, !2152}
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !2148, file: !1822, line: 180, baseType: !2104, size: 256)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !2148, file: !1822, line: 182, baseType: !1420, size: 32, offset: 256)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2148, file: !1822, line: 183, baseType: !1420, size: 32, offset: 288)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !2135, file: !1822, line: 196, baseType: !1420, size: 32, offset: 832)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2135, file: !1822, line: 198, baseType: !1420, size: 32, offset: 864)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !2135, file: !1822, line: 200, baseType: !2156, size: 64, offset: 896)
!2156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2157, size: 64)
