; ModuleID = 'blender/source/blender/editors/object/object_shapekey.c'
source_filename = "blender/source/blender/editors/object/object_shapekey.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "slot_move", scope: !2, file: !3, line: 539, type: !1860, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "OBJECT_OT_shape_key_move", scope: !3, file: !3, line: 537, type: !4, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !297, retainedNodes: !1859)
!3 = !DIFile(filename: "blender/source/blender/editors/object/object_shapekey.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !219, !224, !230, !234, !235, !239, !240, !241, !242, !246, !247, !262, !263, !267, !296}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !209, !210, !211, !214, !215}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !175, !178, !192, !193, !194, !195, !196, !197, !198, !199}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 41, flags: DIFlagFwdDecl)
!109 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !101, file: !28, line: 175, baseType: !107, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !101, file: !28, line: 176, baseType: !33, size: 512, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !101, file: !28, line: 178, baseType: !48, size: 16, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !101, file: !28, line: 178, baseType: !48, size: 16, offset: 848)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !101, file: !28, line: 178, baseType: !48, size: 16, offset: 864)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !101, file: !28, line: 178, baseType: !48, size: 16, offset: 880)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !101, file: !28, line: 179, baseType: !48, size: 16, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !101, file: !28, line: 180, baseType: !48, size: 16, offset: 912)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !101, file: !28, line: 181, baseType: !48, size: 16, offset: 928)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !101, file: !28, line: 182, baseType: !48, size: 16, offset: 944)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !101, file: !28, line: 183, baseType: !48, size: 16, offset: 960)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !101, file: !28, line: 184, baseType: !48, size: 16, offset: 976)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !101, file: !28, line: 185, baseType: !48, size: 16, offset: 992)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !101, file: !28, line: 186, baseType: !48, size: 16, offset: 1008)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !101, file: !28, line: 188, baseType: !22, size: 32, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !101, file: !28, line: 190, baseType: !48, size: 16, offset: 1056)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !101, file: !28, line: 191, baseType: !48, size: 16, offset: 1072)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !101, file: !28, line: 194, baseType: !128, size: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !8, line: 421, size: 960, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !141, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !171, !172, !173, !174}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !8, line: 422, baseType: !128, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !8, line: 422, baseType: !128, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !8, line: 424, baseType: !48, size: 16, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !129, file: !8, line: 425, baseType: !48, size: 16, offset: 144)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !129, file: !8, line: 426, baseType: !22, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !129, file: !8, line: 426, baseType: !22, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !129, file: !8, line: 427, baseType: !138, size: 64, offset: 224)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 2)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !129, file: !8, line: 428, baseType: !142, size: 48, offset: 288)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 48, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 6)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !129, file: !8, line: 431, baseType: !14, size: 8, offset: 336)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !129, file: !8, line: 432, baseType: !14, size: 8, offset: 344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !129, file: !8, line: 435, baseType: !48, size: 16, offset: 352)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !129, file: !8, line: 436, baseType: !48, size: 16, offset: 368)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !129, file: !8, line: 437, baseType: !22, size: 32, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !129, file: !8, line: 437, baseType: !22, size: 32, offset: 416)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !129, file: !8, line: 438, baseType: !152, size: 64, offset: 448)
!152 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !129, file: !8, line: 439, baseType: !22, size: 32, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !129, file: !8, line: 439, baseType: !22, size: 32, offset: 544)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !129, file: !8, line: 442, baseType: !48, size: 16, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !129, file: !8, line: 442, baseType: !48, size: 16, offset: 592)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !129, file: !8, line: 442, baseType: !48, size: 16, offset: 608)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !129, file: !8, line: 442, baseType: !48, size: 16, offset: 624)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !129, file: !8, line: 443, baseType: !48, size: 16, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !129, file: !8, line: 446, baseType: !48, size: 16, offset: 656)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !129, file: !8, line: 449, baseType: !12, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !129, file: !8, line: 452, baseType: !163, size: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !8, line: 463, size: 128, elements: !165)
!165 = !{!166, !167, !169, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !164, file: !8, line: 464, baseType: !22, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !164, file: !8, line: 465, baseType: !168, size: 32, offset: 32)
!168 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !164, file: !8, line: 466, baseType: !168, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !164, file: !8, line: 467, baseType: !168, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !129, file: !8, line: 455, baseType: !48, size: 16, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !129, file: !8, line: 456, baseType: !48, size: 16, offset: 848)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !129, file: !8, line: 457, baseType: !22, size: 32, offset: 864)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !129, file: !8, line: 458, baseType: !56, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !101, file: !28, line: 196, baseType: !176, size: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !28, line: 55, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !101, file: !28, line: 198, baseType: !179, size: 64, offset: 1216)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !8, line: 398, size: 448, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !8, line: 399, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !180, file: !8, line: 399, baseType: !179, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !180, file: !8, line: 400, baseType: !22, size: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !180, file: !8, line: 401, baseType: !22, size: 32, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !8, line: 402, baseType: !22, size: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !180, file: !8, line: 403, baseType: !22, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !180, file: !8, line: 404, baseType: !22, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !180, file: !8, line: 405, baseType: !22, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !180, file: !8, line: 407, baseType: !56, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !180, file: !8, line: 414, baseType: !56, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !101, file: !28, line: 200, baseType: !22, size: 32, offset: 1280)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !101, file: !28, line: 200, baseType: !22, size: 32, offset: 1312)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !101, file: !28, line: 201, baseType: !56, size: 64, offset: 1344)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !101, file: !28, line: 203, baseType: !58, size: 128, offset: 1408)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !101, file: !28, line: 204, baseType: !58, size: 128, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !101, file: !28, line: 205, baseType: !58, size: 128, offset: 1664)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !101, file: !28, line: 207, baseType: !58, size: 128, offset: 1792)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !101, file: !28, line: 208, baseType: !58, size: 128, offset: 1920)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !95, file: !8, line: 495, baseType: !152, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !95, file: !8, line: 496, baseType: !22, size: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !95, file: !8, line: 497, baseType: !56, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !95, file: !8, line: 499, baseType: !152, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !95, file: !8, line: 500, baseType: !152, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !95, file: !8, line: 502, baseType: !152, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !95, file: !8, line: 503, baseType: !152, size: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !95, file: !8, line: 504, baseType: !152, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !95, file: !8, line: 505, baseType: !22, size: 32, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !27, file: !28, line: 343, baseType: !58, size: 128, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "opm", scope: !27, file: !28, line: 344, baseType: !26, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !27, file: !28, line: 345, baseType: !212, size: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !28, line: 61, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !27, file: !28, line: 346, baseType: !48, size: 16, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !27, file: !28, line: 346, baseType: !216, size: 48, offset: 1296)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 3)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !9, file: !8, line: 524, baseType: !220, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !23, !26}
!223 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !9, file: !8, line: 530, baseType: !225, size: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!22, !23, !26, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !9, file: !8, line: 531, baseType: !231, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !23, !26}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !9, file: !8, line: 532, baseType: !225, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !9, file: !8, line: 536, baseType: !236, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!22, !23}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !9, file: !8, line: 539, baseType: !231, size: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !9, file: !8, line: 542, baseType: !81, size: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !9, file: !8, line: 545, baseType: !43, size: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !9, file: !8, line: 549, baseType: !243, size: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !25, line: 333, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !25, line: 39, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !9, file: !8, line: 552, baseType: !58, size: 128, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !9, file: !8, line: 555, baseType: !248, size: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !28, line: 281, size: 1088, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !28, line: 282, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !249, file: !28, line: 282, baseType: !248, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !249, file: !28, line: 284, baseType: !58, size: 128, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !249, file: !28, line: 285, baseType: !58, size: 128, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !249, file: !28, line: 287, baseType: !33, size: 512, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !249, file: !28, line: 288, baseType: !48, size: 16, offset: 896)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !249, file: !28, line: 289, baseType: !48, size: 16, offset: 912)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !249, file: !28, line: 291, baseType: !48, size: 16, offset: 928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !249, file: !28, line: 292, baseType: !48, size: 16, offset: 944)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !249, file: !28, line: 295, baseType: !236, size: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !249, file: !28, line: 296, baseType: !56, size: 64, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !9, file: !8, line: 559, baseType: !56, size: 64, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !9, file: !8, line: 560, baseType: !264, size: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!22, !23, !69}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !9, file: !8, line: 563, baseType: !268, size: 256, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !25, line: 436, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !25, line: 430, size: 256, elements: !270)
!270 = !{!271, !272, !275, !291}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !25, line: 431, baseType: !56, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !269, file: !25, line: 432, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !25, line: 417, baseType: !82)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !269, file: !25, line: 433, baseType: !276, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !25, line: 408, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!22, !23, !73, !280, !282}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !25, line: 38, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !25, line: 348, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !25, line: 337, size: 256, elements: !285)
!285 = !{!286, !287, !288, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !25, line: 339, baseType: !56, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !284, file: !25, line: 342, baseType: !280, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !284, file: !25, line: 345, baseType: !22, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !284, file: !25, line: 347, baseType: !22, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !284, file: !25, line: 347, baseType: !22, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !269, file: !25, line: 434, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !25, line: 409, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !56}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !9, file: !8, line: 566, baseType: !48, size: 16, offset: 1472)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !343, globals: !1858, splitDebugInlining: false, nameTableKind: None)
!298 = !{!299, !311, !319, !325, !338}
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !300, line: 666, baseType: !301, size: 32, elements: !302)
!300 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310}
!303 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!306 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!308 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!309 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!310 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 351, baseType: !301, size: 32, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318}
!313 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!315 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!316 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!317 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!318 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 519, baseType: !301, size: 32, elements: !320)
!320 = !{!321, !322, !323, !324}
!321 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!322 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!323 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!324 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 339, baseType: !301, size: 32, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!327 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!331 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!332 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!333 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!334 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!335 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!336 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!337 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !339, line: 110, baseType: !301, size: 32, elements: !340)
!339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!340 = !{!341, !342}
!341 = !DIEnumerator(name: "KEY_NORMAL", value: 0, isUnsigned: true)
!342 = !DIEnumerator(name: "KEY_RELATIVE", value: 1, isUnsigned: true)
!343 = !{!56, !344, !345, !346, !743, !1808, !1857}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !348, line: 133, baseType: !349)
!348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !348, line: 58, size: 11008, elements: !350)
!350 = !{!351, !387, !391, !401, !404, !446, !450, !457, !466, !560, !566, !573, !581, !592, !605, !618, !627, !636, !648, !656, !658, !661, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !349, file: !348, line: 59, baseType: !352, size: 960)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !354)
!354 = !{!355, !356, !357, !359, !378, !382, !383, !384, !385, !386}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !39, line: 118, baseType: !56, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !353, file: !39, line: 119, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !353, file: !39, line: 120, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !362)
!362 = !{!363, !364, !366, !369, !373, !374, !375}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !39, line: 137, baseType: !352, size: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !361, file: !39, line: 138, baseType: !365, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !361, file: !39, line: 139, baseType: !367, size: 64, offset: 1024)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !39, line: 140, baseType: !370, size: 8192, offset: 1088)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 1024)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !361, file: !39, line: 141, baseType: !370, size: 8192, offset: 9280)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !361, file: !39, line: 148, baseType: !360, size: 64, offset: 17472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !361, file: !39, line: 150, baseType: !376, size: 64, offset: 17536)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !39, line: 121, baseType: !379, size: 528, offset: 256)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 66)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !353, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !353, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !353, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !353, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !353, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !349, file: !348, line: 60, baseType: !388, size: 64, offset: 960)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !390, line: 48, flags: DIFlagFwdDecl)
!390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !349, file: !348, line: 62, baseType: !392, size: 64, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !300, line: 97, size: 832, elements: !394)
!394 = !{!395, !399, !400}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !393, file: !300, line: 98, baseType: !396, size: 768)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 768, elements: !397)
!397 = !{!398, !218}
!398 = !DISubrange(count: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !300, line: 99, baseType: !22, size: 32, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !393, file: !300, line: 99, baseType: !22, size: 32, offset: 800)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !349, file: !348, line: 64, baseType: !402, size: 64, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !390, line: 44, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !349, file: !348, line: 65, baseType: !405, size: 64, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !339, line: 73, size: 1792, elements: !407)
!407 = !{!408, !409, !410, !431, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !406, file: !339, line: 74, baseType: !352, size: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !406, file: !339, line: 75, baseType: !388, size: 64, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "refkey", scope: !406, file: !339, line: 80, baseType: !411, size: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyBlock", file: !339, line: 70, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !339, line: 45, size: 1472, elements: !414)
!414 = !{!415, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !413, file: !339, line: 46, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !413, file: !339, line: 46, baseType: !416, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !413, file: !339, line: 48, baseType: !168, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !413, file: !339, line: 51, baseType: !168, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !339, line: 53, baseType: !48, size: 16, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !413, file: !339, line: 54, baseType: !48, size: 16, offset: 208)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !413, file: !339, line: 56, baseType: !48, size: 16, offset: 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !339, line: 57, baseType: !48, size: 16, offset: 240)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !413, file: !339, line: 59, baseType: !22, size: 32, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !413, file: !339, line: 60, baseType: !22, size: 32, offset: 288)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !413, file: !339, line: 62, baseType: !56, size: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !413, file: !339, line: 63, baseType: !33, size: 512, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !413, file: !339, line: 64, baseType: !33, size: 512, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !413, file: !339, line: 67, baseType: !168, size: 32, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !413, file: !339, line: 68, baseType: !168, size: 32, offset: 1440)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "elemstr", scope: !406, file: !339, line: 85, baseType: !432, size: 256, offset: 1088)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !406, file: !339, line: 86, baseType: !22, size: 32, offset: 1344)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !406, file: !339, line: 87, baseType: !22, size: 32, offset: 1376)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !406, file: !339, line: 89, baseType: !58, size: 128, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !406, file: !339, line: 90, baseType: !402, size: 64, offset: 1536)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !406, file: !339, line: 92, baseType: !365, size: 64, offset: 1600)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !406, file: !339, line: 94, baseType: !48, size: 16, offset: 1664)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !406, file: !339, line: 95, baseType: !48, size: 16, offset: 1680)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "slurph", scope: !406, file: !339, line: 96, baseType: !48, size: 16, offset: 1696)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !339, line: 97, baseType: !48, size: 16, offset: 1712)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !406, file: !339, line: 101, baseType: !168, size: 32, offset: 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "uidgen", scope: !406, file: !339, line: 104, baseType: !22, size: 32, offset: 1760)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !349, file: !348, line: 66, baseType: !447, size: 64, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !390, line: 46, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !349, file: !348, line: 67, baseType: !451, size: 64, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !453, line: 154, size: 64, elements: !454)
!453 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !452, file: !453, line: 155, baseType: !22, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !453, line: 156, baseType: !22, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !349, file: !348, line: 71, baseType: !458, size: 64, offset: 1344)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !453, line: 79, size: 96, elements: !460)
!460 = !{!461, !462, !463, !464, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !459, file: !453, line: 81, baseType: !22, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !459, file: !453, line: 82, baseType: !22, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !459, file: !453, line: 83, baseType: !48, size: 16, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !459, file: !453, line: 84, baseType: !14, size: 8, offset: 80)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !459, file: !453, line: 84, baseType: !14, size: 8, offset: 88)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !349, file: !348, line: 72, baseType: !467, size: 64, offset: 1408)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !453, line: 93, size: 128, elements: !469)
!469 = !{!470, !555, !556, !557, !558, !559}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !468, file: !453, line: 94, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !473, line: 77, size: 15424, elements: !474)
!473 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!474 = !{!475, !476, !477, !480, !483, !486, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !508, !509, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !536, !537, !538, !544, !545, !549}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !472, file: !473, line: 78, baseType: !352, size: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !473, line: 80, baseType: !370, size: 8192, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !472, file: !473, line: 82, baseType: !478, size: 64, offset: 9152)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !473, line: 43, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !472, file: !473, line: 83, baseType: !481, size: 64, offset: 9216)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !39, line: 46, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !472, file: !473, line: 86, baseType: !484, size: 64, offset: 9280)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !473, line: 41, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !472, file: !473, line: 87, baseType: !487, size: 64, offset: 9344)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !473, line: 44, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !472, file: !473, line: 89, baseType: !490, size: 512, offset: 9408)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 512, elements: !491)
!491 = !{!398}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !472, file: !473, line: 90, baseType: !48, size: 16, offset: 9920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !472, file: !473, line: 90, baseType: !48, size: 16, offset: 9936)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !472, file: !473, line: 92, baseType: !48, size: 16, offset: 9952)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !472, file: !473, line: 92, baseType: !48, size: 16, offset: 9968)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !472, file: !473, line: 93, baseType: !48, size: 16, offset: 9984)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !473, line: 93, baseType: !48, size: 16, offset: 10000)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !472, file: !473, line: 94, baseType: !22, size: 32, offset: 10016)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !472, file: !473, line: 97, baseType: !48, size: 16, offset: 10048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !472, file: !473, line: 97, baseType: !48, size: 16, offset: 10064)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !472, file: !473, line: 98, baseType: !48, size: 16, offset: 10080)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !472, file: !473, line: 98, baseType: !48, size: 16, offset: 10096)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !472, file: !473, line: 99, baseType: !48, size: 16, offset: 10112)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !472, file: !473, line: 99, baseType: !48, size: 16, offset: 10128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !472, file: !473, line: 100, baseType: !301, size: 32, offset: 10144)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !472, file: !473, line: 101, baseType: !507, size: 64, offset: 10176)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !472, file: !473, line: 103, baseType: !376, size: 64, offset: 10240)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !472, file: !473, line: 104, baseType: !510, size: 64, offset: 10304)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !39, line: 159, size: 448, elements: !512)
!512 = !{!513, !515, !516, !518, !519, !521}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !511, file: !39, line: 161, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 64, elements: !139)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !511, file: !39, line: 162, baseType: !514, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !511, file: !39, line: 163, baseType: !517, size: 32, offset: 128)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !139)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !511, file: !39, line: 164, baseType: !517, size: 32, offset: 160)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !511, file: !39, line: 165, baseType: !520, size: 128, offset: 192)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 128, elements: !139)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !511, file: !39, line: 166, baseType: !522, size: 128, offset: 320)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 128, elements: !139)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !472, file: !473, line: 107, baseType: !168, size: 32, offset: 10368)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !472, file: !473, line: 108, baseType: !22, size: 32, offset: 10400)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !472, file: !473, line: 109, baseType: !48, size: 16, offset: 10432)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !472, file: !473, line: 110, baseType: !48, size: 16, offset: 10448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !472, file: !473, line: 113, baseType: !22, size: 32, offset: 10464)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !472, file: !473, line: 113, baseType: !22, size: 32, offset: 10496)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !472, file: !473, line: 114, baseType: !14, size: 8, offset: 10528)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !472, file: !473, line: 114, baseType: !14, size: 8, offset: 10536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !472, file: !473, line: 115, baseType: !48, size: 16, offset: 10544)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !472, file: !473, line: 116, baseType: !533, size: 128, offset: 10560)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 4)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !472, file: !473, line: 119, baseType: !168, size: 32, offset: 10688)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !472, file: !473, line: 119, baseType: !168, size: 32, offset: 10720)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !472, file: !473, line: 122, baseType: !539, size: 512, offset: 10752)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !540, line: 182, baseType: !541)
!540 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !540, line: 180, size: 512, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !541, file: !540, line: 181, baseType: !33, size: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !472, file: !473, line: 123, baseType: !14, size: 8, offset: 11264)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !472, file: !473, line: 125, baseType: !546, size: 56, offset: 11272)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 56, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 7)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !472, file: !473, line: 126, baseType: !550, size: 4096, offset: 11328)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 4096, elements: !491)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !473, line: 69, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !473, line: 67, size: 512, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !552, file: !473, line: 68, baseType: !33, size: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !453, line: 95, baseType: !14, size: 8, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !468, file: !453, line: 95, baseType: !14, size: 8, offset: 72)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !468, file: !453, line: 96, baseType: !48, size: 16, offset: 80)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !468, file: !453, line: 96, baseType: !48, size: 16, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !468, file: !453, line: 96, baseType: !48, size: 16, offset: 112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !349, file: !348, line: 73, baseType: !561, size: 64, offset: 1472)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !453, line: 88, size: 64, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !562, file: !453, line: 89, baseType: !301, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !562, file: !453, line: 90, baseType: !301, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !349, file: !348, line: 74, baseType: !567, size: 64, offset: 1536)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !453, line: 109, size: 96, elements: !569)
!569 = !{!570, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !568, file: !453, line: 110, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !139)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !453, line: 111, baseType: !22, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !349, file: !348, line: 75, baseType: !574, size: 64, offset: 1600)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !453, line: 129, size: 32, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !575, file: !453, line: 130, baseType: !14, size: 8)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !575, file: !453, line: 130, baseType: !14, size: 8, offset: 8)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !575, file: !453, line: 130, baseType: !14, size: 8, offset: 16)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !575, file: !453, line: 130, baseType: !14, size: 8, offset: 24)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !349, file: !348, line: 80, baseType: !582, size: 64, offset: 1664)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !453, line: 42, size: 160, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !583, file: !453, line: 43, baseType: !301, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !583, file: !453, line: 43, baseType: !301, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !583, file: !453, line: 43, baseType: !301, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !583, file: !453, line: 43, baseType: !301, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !583, file: !453, line: 44, baseType: !48, size: 16, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !583, file: !453, line: 45, baseType: !14, size: 8, offset: 144)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !453, line: 45, baseType: !14, size: 8, offset: 152)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !349, file: !348, line: 81, baseType: !593, size: 64, offset: 1728)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !453, line: 160, size: 384, elements: !595)
!595 = !{!596, !599, !600, !601, !602, !603, !604}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !594, file: !453, line: 161, baseType: !597, size: 256)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 256, elements: !598)
!598 = !{!535, !140}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !594, file: !453, line: 162, baseType: !471, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !453, line: 163, baseType: !14, size: 8, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !594, file: !453, line: 163, baseType: !14, size: 8, offset: 328)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !594, file: !453, line: 164, baseType: !48, size: 16, offset: 336)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !594, file: !453, line: 164, baseType: !48, size: 16, offset: 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !594, file: !453, line: 164, baseType: !48, size: 16, offset: 368)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !349, file: !348, line: 82, baseType: !606, size: 64, offset: 1792)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !348, line: 136, size: 512, elements: !608)
!608 = !{!609, !610, !611, !613, !614, !615, !616, !617}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !607, file: !348, line: 137, baseType: !56, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !607, file: !348, line: 138, baseType: !597, size: 256, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !607, file: !348, line: 139, baseType: !612, size: 128, offset: 320)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 128, elements: !534)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !607, file: !348, line: 140, baseType: !14, size: 8, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !607, file: !348, line: 140, baseType: !14, size: 8, offset: 456)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !607, file: !348, line: 141, baseType: !48, size: 16, offset: 464)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !607, file: !348, line: 141, baseType: !48, size: 16, offset: 480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !607, file: !348, line: 141, baseType: !48, size: 16, offset: 496)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !349, file: !348, line: 83, baseType: !619, size: 64, offset: 1856)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !453, line: 65, size: 160, elements: !621)
!621 = !{!622, !624, !625, !626}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !620, file: !453, line: 66, baseType: !623, size: 96)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 96, elements: !217)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !620, file: !453, line: 67, baseType: !216, size: 48, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !620, file: !453, line: 68, baseType: !14, size: 8, offset: 144)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !620, file: !453, line: 68, baseType: !14, size: 8, offset: 152)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !349, file: !348, line: 84, baseType: !628, size: 64, offset: 1920)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !453, line: 48, size: 96, elements: !630)
!630 = !{!631, !632, !633, !634, !635}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !629, file: !453, line: 49, baseType: !301, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !629, file: !453, line: 49, baseType: !301, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !629, file: !453, line: 50, baseType: !14, size: 8, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !629, file: !453, line: 50, baseType: !14, size: 8, offset: 72)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !453, line: 51, baseType: !48, size: 16, offset: 80)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !349, file: !348, line: 85, baseType: !637, size: 64, offset: 1984)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !453, line: 59, size: 128, elements: !639)
!639 = !{!640, !646, !647}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !638, file: !453, line: 60, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !453, line: 54, size: 64, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !642, file: !453, line: 55, baseType: !22, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !642, file: !453, line: 56, baseType: !168, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !638, file: !453, line: 61, baseType: !22, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !638, file: !453, line: 62, baseType: !22, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !349, file: !348, line: 89, baseType: !649, size: 64, offset: 2048)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !453, line: 74, size: 32, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !650, file: !453, line: 75, baseType: !14, size: 8)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !650, file: !453, line: 75, baseType: !14, size: 8, offset: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !650, file: !453, line: 75, baseType: !14, size: 8, offset: 16)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !650, file: !453, line: 75, baseType: !14, size: 8, offset: 24)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !349, file: !348, line: 90, baseType: !657, size: 64, offset: 2112)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !349, file: !348, line: 93, baseType: !659, size: 64, offset: 2176)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !348, line: 93, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !349, file: !348, line: 95, baseType: !662, size: 1600, offset: 2240)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !663, line: 64, size: 1600, elements: !664)
!663 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!664 = !{!665, !680, !684, !685, !686, !687, !690}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !662, file: !663, line: 65, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !663, line: 53, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !663, line: 42, size: 832, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !663, line: 43, baseType: !22, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !668, file: !663, line: 44, baseType: !22, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !663, line: 45, baseType: !22, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !668, file: !663, line: 46, baseType: !22, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !668, file: !663, line: 47, baseType: !22, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !668, file: !663, line: 48, baseType: !22, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !668, file: !663, line: 49, baseType: !22, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !668, file: !663, line: 50, baseType: !22, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !663, line: 51, baseType: !33, size: 512, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !668, file: !663, line: 52, baseType: !56, size: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !662, file: !663, line: 66, baseType: !681, size: 1312, offset: 64)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1312, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 41)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !662, file: !663, line: 69, baseType: !22, size: 32, offset: 1376)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !662, file: !663, line: 69, baseType: !22, size: 32, offset: 1408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !662, file: !663, line: 70, baseType: !22, size: 32, offset: 1440)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !662, file: !663, line: 71, baseType: !688, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !663, line: 71, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !662, file: !663, line: 72, baseType: !691, size: 64, offset: 1536)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !663, line: 59, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !663, line: 57, size: 8192, elements: !694)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !693, file: !663, line: 58, baseType: !370, size: 8192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !349, file: !348, line: 95, baseType: !662, size: 1600, offset: 3840)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !349, file: !348, line: 95, baseType: !662, size: 1600, offset: 5440)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !349, file: !348, line: 98, baseType: !662, size: 1600, offset: 7040)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !349, file: !348, line: 98, baseType: !662, size: 1600, offset: 8640)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !349, file: !348, line: 101, baseType: !22, size: 32, offset: 10240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !349, file: !348, line: 101, baseType: !22, size: 32, offset: 10272)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !349, file: !348, line: 101, baseType: !22, size: 32, offset: 10304)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !349, file: !348, line: 101, baseType: !22, size: 32, offset: 10336)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !349, file: !348, line: 104, baseType: !22, size: 32, offset: 10368)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !349, file: !348, line: 104, baseType: !22, size: 32, offset: 10400)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !349, file: !348, line: 111, baseType: !22, size: 32, offset: 10432)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !349, file: !348, line: 114, baseType: !623, size: 96, offset: 10464)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !348, line: 115, baseType: !623, size: 96, offset: 10560)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !349, file: !348, line: 116, baseType: !623, size: 96, offset: 10656)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !349, file: !348, line: 118, baseType: !22, size: 32, offset: 10752)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !349, file: !348, line: 119, baseType: !48, size: 16, offset: 10784)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !348, line: 119, baseType: !48, size: 16, offset: 10800)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !349, file: !348, line: 120, baseType: !168, size: 32, offset: 10816)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !349, file: !348, line: 121, baseType: !22, size: 32, offset: 10848)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !349, file: !348, line: 124, baseType: !14, size: 8, offset: 10880)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !349, file: !348, line: 124, baseType: !14, size: 8, offset: 10888)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !349, file: !348, line: 126, baseType: !14, size: 8, offset: 10896)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !349, file: !348, line: 126, baseType: !14, size: 8, offset: 10904)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !349, file: !348, line: 127, baseType: !14, size: 8, offset: 10912)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !349, file: !348, line: 128, baseType: !14, size: 8, offset: 10920)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !349, file: !348, line: 130, baseType: !48, size: 16, offset: 10928)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !349, file: !348, line: 132, baseType: !723, size: 64, offset: 10944)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !453, line: 233, size: 3584, elements: !725)
!725 = !{!726, !727, !730, !731, !732, !733, !734, !735, !736, !737, !738, !740, !741, !742}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !724, file: !453, line: 234, baseType: !58, size: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !724, file: !453, line: 235, baseType: !728, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !453, line: 69, baseType: !620)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !724, file: !453, line: 237, baseType: !223, size: 8, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !724, file: !453, line: 237, baseType: !223, size: 8, offset: 200)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !724, file: !453, line: 237, baseType: !223, size: 8, offset: 208)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !724, file: !453, line: 237, baseType: !223, size: 8, offset: 216)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !724, file: !453, line: 237, baseType: !223, size: 8, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !724, file: !453, line: 237, baseType: !223, size: 8, offset: 232)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !724, file: !453, line: 238, baseType: !223, size: 8, offset: 240)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !724, file: !453, line: 238, baseType: !223, size: 8, offset: 248)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !724, file: !453, line: 241, baseType: !739, size: 1600, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !663, line: 73, baseType: !662)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !724, file: !453, line: 242, baseType: !739, size: 1600, offset: 1856)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !724, file: !453, line: 243, baseType: !345, size: 64, offset: 3456)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !724, file: !453, line: 244, baseType: !344, size: 64, offset: 3520)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curve", file: !390, line: 273, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Curve", file: !390, line: 193, size: 4224, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !763, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1775, !1776, !1779, !1780, !1781, !1782, !1790, !1791, !1792, !1801, !1802, !1803, !1804, !1805, !1806, !1807}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !745, file: !390, line: 194, baseType: !352, size: 960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !745, file: !390, line: 195, baseType: !388, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !745, file: !390, line: 197, baseType: !392, size: 64, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nurb", scope: !745, file: !390, line: 199, baseType: !58, size: 128, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "editnurb", scope: !745, file: !390, line: 201, baseType: !752, size: 64, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditNurb", file: !390, line: 191, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditNurb", file: !390, line: 180, size: 256, elements: !755)
!755 = !{!756, !757, !760, !761}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "nurbs", scope: !754, file: !390, line: 182, baseType: !58, size: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "keyindex", scope: !754, file: !390, line: 185, baseType: !758, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !390, line: 51, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !754, file: !390, line: 188, baseType: !22, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !754, file: !390, line: 190, baseType: !762, size: 32, offset: 224)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32, elements: !534)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bevobj", scope: !745, file: !390, line: 203, baseType: !764, size: 64, offset: 1280)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !300, line: 115, size: 11392, elements: !766)
!766 = !{!767, !768, !769, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !799, !800, !839, !840, !844, !845, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !945, !946, !947, !948, !949, !950, !951, !952, !953, !956, !959, !963, !964, !965, !966, !967, !970, !992, !995, !996, !1002, !1003, !1004, !1005, !1006, !1007, !1009, !1012, !1015, !1016, !1713, !1714}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !765, file: !300, line: 116, baseType: !352, size: 960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !765, file: !300, line: 117, baseType: !388, size: 64, offset: 960)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !765, file: !300, line: 119, baseType: !770, size: 64, offset: 1024)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !300, line: 57, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !765, file: !300, line: 121, baseType: !48, size: 16, offset: 1088)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !765, file: !300, line: 121, baseType: !48, size: 16, offset: 1104)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !765, file: !300, line: 122, baseType: !22, size: 32, offset: 1120)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !765, file: !300, line: 122, baseType: !22, size: 32, offset: 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !765, file: !300, line: 122, baseType: !22, size: 32, offset: 1184)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !765, file: !300, line: 123, baseType: !33, size: 512, offset: 1216)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !765, file: !300, line: 124, baseType: !764, size: 64, offset: 1728)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !765, file: !300, line: 124, baseType: !764, size: 64, offset: 1792)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !765, file: !300, line: 127, baseType: !764, size: 64, offset: 1856)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !765, file: !300, line: 127, baseType: !764, size: 64, offset: 1920)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !765, file: !300, line: 127, baseType: !764, size: 64, offset: 1984)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !765, file: !300, line: 128, baseType: !402, size: 64, offset: 2048)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !765, file: !300, line: 130, baseType: !392, size: 64, offset: 2112)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !765, file: !300, line: 131, baseType: !786, size: 64, offset: 2176)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !788, line: 486, size: 1600, elements: !789)
!788 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !787, file: !788, line: 487, baseType: !352, size: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !787, file: !788, line: 489, baseType: !58, size: 128, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !787, file: !788, line: 490, baseType: !58, size: 128, offset: 1088)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !787, file: !788, line: 491, baseType: !58, size: 128, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !787, file: !788, line: 492, baseType: !58, size: 128, offset: 1344)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !787, file: !788, line: 494, baseType: !22, size: 32, offset: 1472)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !787, file: !788, line: 495, baseType: !22, size: 32, offset: 1504)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !787, file: !788, line: 497, baseType: !22, size: 32, offset: 1536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !787, file: !788, line: 498, baseType: !22, size: 32, offset: 1568)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !765, file: !300, line: 132, baseType: !786, size: 64, offset: 2240)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !765, file: !300, line: 133, baseType: !801, size: 64, offset: 2304)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !788, line: 334, size: 1728, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !838}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !802, file: !788, line: 335, baseType: !58, size: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !802, file: !788, line: 336, baseType: !758, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !802, file: !788, line: 338, baseType: !48, size: 16, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !802, file: !788, line: 338, baseType: !48, size: 16, offset: 208)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !802, file: !788, line: 339, baseType: !301, size: 32, offset: 224)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !802, file: !788, line: 340, baseType: !22, size: 32, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !802, file: !788, line: 342, baseType: !168, size: 32, offset: 288)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !802, file: !788, line: 343, baseType: !623, size: 96, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !802, file: !788, line: 344, baseType: !623, size: 96, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !802, file: !788, line: 347, baseType: !58, size: 128, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !802, file: !788, line: 349, baseType: !22, size: 32, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !802, file: !788, line: 350, baseType: !22, size: 32, offset: 672)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !802, file: !788, line: 351, baseType: !56, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !802, file: !788, line: 352, baseType: !56, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !802, file: !788, line: 354, baseType: !819, size: 384, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !788, line: 116, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !788, line: 94, size: 384, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !820, file: !788, line: 96, baseType: !22, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !820, file: !788, line: 96, baseType: !22, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !820, file: !788, line: 97, baseType: !22, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !820, file: !788, line: 97, baseType: !22, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !820, file: !788, line: 99, baseType: !48, size: 16, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !820, file: !788, line: 100, baseType: !48, size: 16, offset: 144)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !820, file: !788, line: 102, baseType: !48, size: 16, offset: 160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !820, file: !788, line: 105, baseType: !48, size: 16, offset: 176)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !820, file: !788, line: 108, baseType: !48, size: 16, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !820, file: !788, line: 109, baseType: !48, size: 16, offset: 208)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !820, file: !788, line: 111, baseType: !48, size: 16, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !820, file: !788, line: 112, baseType: !48, size: 16, offset: 240)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !820, file: !788, line: 114, baseType: !22, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !820, file: !788, line: 114, baseType: !22, size: 32, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !820, file: !788, line: 115, baseType: !22, size: 32, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !820, file: !788, line: 115, baseType: !22, size: 32, offset: 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !802, file: !788, line: 355, baseType: !33, size: 512, offset: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !765, file: !300, line: 134, baseType: !56, size: 64, offset: 2368)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !765, file: !300, line: 136, baseType: !841, size: 64, offset: 2432)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !843, line: 61, flags: DIFlagFwdDecl)
!843 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!844 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !765, file: !300, line: 138, baseType: !819, size: 384, offset: 2496)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !765, file: !300, line: 139, baseType: !846, size: 64, offset: 2880)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !788, line: 80, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !788, line: 72, size: 192, elements: !849)
!849 = !{!850, !857, !858, !859, !860}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !848, file: !788, line: 73, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !788, line: 59, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !788, line: 56, size: 128, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !853, file: !788, line: 57, baseType: !623, size: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !853, file: !788, line: 58, baseType: !22, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !848, file: !788, line: 74, baseType: !22, size: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !848, file: !788, line: 76, baseType: !22, size: 32, offset: 96)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !848, file: !788, line: 77, baseType: !22, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !848, file: !788, line: 79, baseType: !22, size: 32, offset: 160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !765, file: !300, line: 141, baseType: !58, size: 128, offset: 2944)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !765, file: !300, line: 142, baseType: !58, size: 128, offset: 3072)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !765, file: !300, line: 143, baseType: !58, size: 128, offset: 3200)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !765, file: !300, line: 144, baseType: !58, size: 128, offset: 3328)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !765, file: !300, line: 146, baseType: !22, size: 32, offset: 3456)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !765, file: !300, line: 147, baseType: !22, size: 32, offset: 3488)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !765, file: !300, line: 150, baseType: !447, size: 64, offset: 3520)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !765, file: !300, line: 151, baseType: !344, size: 64, offset: 3584)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !765, file: !300, line: 152, baseType: !22, size: 32, offset: 3648)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !765, file: !300, line: 153, baseType: !22, size: 32, offset: 3680)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !765, file: !300, line: 156, baseType: !623, size: 96, offset: 3712)
