; ModuleID = 'blender/source/blender/blenkernel/intern/node.c'
source_filename = "blender/source/blender/blenkernel/intern/node.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GHash = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!13 = !DIEnumerator(name: "NTREE_UPDATE", value: 65535, isUnsigned: true)
!14 = !DIEnumerator(name: "NTREE_UPDATE_LINKS", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "NTREE_UPDATE_NODES", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "NTREE_UPDATE_GROUP_IN", value: 16, isUnsigned: true)
!17 = !DIEnumerator(name: "NTREE_UPDATE_GROUP_OUT", value: 32, isUnsigned: true)
!18 = !DIEnumerator(name: "NTREE_UPDATE_GROUP", value: 48, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketFlag", file: !6, line: 154, baseType: !7, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27}
!21 = !DIEnumerator(name: "SOCK_HIDDEN", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "SOCK_IN_USE", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "SOCK_UNAVAIL", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "SOCK_COLLAPSED", value: 64, isUnsigned: true)
!25 = !DIEnumerator(name: "SOCK_HIDE_VALUE", value: 128, isUnsigned: true)
!26 = !DIEnumerator(name: "SOCK_AUTO_HIDDEN__DEPRECATED", value: 256, isUnsigned: true)
!27 = !DIEnumerator(name: "SOCK_NO_INTERNAL_LINK", value: 512, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSizePreset", file: !29, line: 273, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "NODE_SIZE_DEFAULT", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "NODE_SIZE_SMALL", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "NODE_SIZE_MIDDLE", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "NODE_SIZE_LARGE", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !6, line: 135, baseType: !36, size: 32, elements: !37)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!39 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!40 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!41 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!42 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!43 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!44 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!45 = !DIEnumerator(name: "SOCK_INT", value: 6)
!46 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !48, line: 107, baseType: !7, size: 32, elements: !49)
!48 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!50 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!54 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!56 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!59 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!60 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!61 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!62 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!63 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!64 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!65 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!66 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!67 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!68 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!69 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!70 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!71 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!72 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!73 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!74 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!75 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!76 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!77 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!78 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!79 = !{!80, !81, !150, !151, !155, !156, !1963, !2044, !2046, !2048, !2050, !2101, !2103, !2104, !2109, !2117, !2123, !209, !101, !2124}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !83, line: 130, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !83, line: 117, size: 960, elements: !85)
!85 = !{!86, !87, !88, !90, !109, !113, !115, !116, !117, !118}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !83, line: 118, baseType: !80, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !83, line: 118, baseType: !80, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !84, file: !83, line: 119, baseType: !89, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !84, file: !83, line: 120, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !83, line: 136, size: 17600, elements: !93)
!93 = !{!94, !95, !96, !99, !104, !105, !106}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !83, line: 137, baseType: !82, size: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !92, file: !83, line: 138, baseType: !81, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !92, file: !83, line: 139, baseType: !97, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !83, line: 43, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !83, line: 140, baseType: !100, size: 8192, offset: 1088)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 8192, elements: !102)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!102 = !{!103}
!103 = !DISubrange(count: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !92, file: !83, line: 141, baseType: !100, size: 8192, offset: 9280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !92, file: !83, line: 148, baseType: !91, size: 64, offset: 17472)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !92, file: !83, line: 150, baseType: !107, size: 64, offset: 17536)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !83, line: 45, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !83, line: 121, baseType: !110, size: 528, offset: 256)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 528, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 66)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !84, file: !83, line: 126, baseType: !114, size: 16, offset: 784)
!114 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !84, file: !83, line: 127, baseType: !36, size: 32, offset: 800)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !84, file: !83, line: 128, baseType: !36, size: 32, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !84, file: !83, line: 128, baseType: !36, size: 32, offset: 864)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !84, file: !83, line: 129, baseType: !119, size: 64, offset: 896)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !83, line: 75, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !83, line: 62, size: 1024, elements: !122)
!122 = !{!123, !125, !126, !127, !128, !129, !133, !134, !148, !149}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !83, line: 63, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !83, line: 63, baseType: !124, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !83, line: 64, baseType: !101, size: 8, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !121, file: !83, line: 64, baseType: !101, size: 8, offset: 136)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !83, line: 65, baseType: !114, size: 16, offset: 144)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !83, line: 66, baseType: !130, size: 512, offset: 160)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 512, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !121, file: !83, line: 67, baseType: !36, size: 32, offset: 672)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !83, line: 69, baseType: !135, size: 256, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !83, line: 60, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !83, line: 48, size: 256, elements: !137)
!137 = !{!138, !139, !146, !147}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !136, file: !83, line: 49, baseType: !80, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !136, file: !83, line: 58, baseType: !140, size: 128, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !141, line: 71, baseType: !142)
!141 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !141, line: 69, size: 128, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !142, file: !141, line: 70, baseType: !80, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !142, file: !141, line: 70, baseType: !80, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !136, file: !83, line: 59, baseType: !36, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !136, file: !83, line: 59, baseType: !36, size: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !121, file: !83, line: 70, baseType: !36, size: 32, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !121, file: !83, line: 74, baseType: !36, size: 32, offset: 992)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceValueFP", file: !29, line: 505, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !80}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "Material", file: !158, line: 203, baseType: !159)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !158, line: 93, size: 7552, elements: !160)
!160 = !{!161, !162, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !282, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !351, !352, !353, !354, !355, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !1920, !1921, !1922, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1962}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !159, file: !158, line: 94, baseType: !82, size: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !159, file: !158, line: 95, baseType: !163, size: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !165, line: 838, size: 768, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !182, !183, !193, !194, !226, !227, !228, !229, !230, !231, !232}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !164, file: !165, line: 840, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !170, line: 499, baseType: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !170, line: 486, size: 1600, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !170, line: 487, baseType: !82, size: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !171, file: !170, line: 489, baseType: !140, size: 128, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !171, file: !170, line: 490, baseType: !140, size: 128, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !171, file: !170, line: 491, baseType: !140, size: 128, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !171, file: !170, line: 492, baseType: !140, size: 128, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !170, line: 494, baseType: !36, size: 32, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !171, file: !170, line: 495, baseType: !36, size: 32, offset: 1504)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !171, file: !170, line: 497, baseType: !36, size: 32, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !171, file: !170, line: 498, baseType: !36, size: 32, offset: 1568)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !164, file: !165, line: 844, baseType: !168, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !164, file: !165, line: 848, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !165, line: 549, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !165, line: 544, size: 320, elements: !187)
!187 = !{!188, !190, !191, !192}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !165, line: 545, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !165, line: 545, baseType: !189, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !186, file: !165, line: 547, baseType: !168, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !186, file: !165, line: 548, baseType: !140, size: 128, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !164, file: !165, line: 851, baseType: !140, size: 128, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !164, file: !165, line: 853, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !165, line: 594, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !165, line: 561, size: 1664, elements: !198)
!198 = !{!199, !201, !202, !203, !204, !205, !206, !207, !208, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !165, line: 562, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !197, file: !165, line: 562, baseType: !200, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !197, file: !165, line: 564, baseType: !140, size: 128, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !197, file: !165, line: 565, baseType: !168, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !197, file: !165, line: 566, baseType: !184, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !197, file: !165, line: 568, baseType: !140, size: 128, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !197, file: !165, line: 569, baseType: !140, size: 128, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !165, line: 571, baseType: !130, size: 512, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !197, file: !165, line: 573, baseType: !209, size: 32, offset: 1152)
!209 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !197, file: !165, line: 574, baseType: !209, size: 32, offset: 1184)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !197, file: !165, line: 576, baseType: !209, size: 32, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !197, file: !165, line: 576, baseType: !209, size: 32, offset: 1248)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !197, file: !165, line: 577, baseType: !209, size: 32, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !197, file: !165, line: 577, baseType: !209, size: 32, offset: 1312)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !197, file: !165, line: 579, baseType: !209, size: 32, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !197, file: !165, line: 580, baseType: !209, size: 32, offset: 1376)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !197, file: !165, line: 582, baseType: !209, size: 32, offset: 1408)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !197, file: !165, line: 582, baseType: !209, size: 32, offset: 1440)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !197, file: !165, line: 583, baseType: !114, size: 16, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !197, file: !165, line: 585, baseType: !114, size: 16, offset: 1488)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !197, file: !165, line: 586, baseType: !114, size: 16, offset: 1504)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !165, line: 588, baseType: !114, size: 16, offset: 1520)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !197, file: !165, line: 590, baseType: !80, size: 64, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !165, line: 592, baseType: !36, size: 32, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !197, file: !165, line: 593, baseType: !36, size: 32, offset: 1632)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !164, file: !165, line: 858, baseType: !140, size: 128, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !164, file: !165, line: 859, baseType: !140, size: 128, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 862, baseType: !36, size: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !164, file: !165, line: 863, baseType: !36, size: 32, offset: 672)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !164, file: !165, line: 866, baseType: !114, size: 16, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !164, file: !165, line: 867, baseType: !114, size: 16, offset: 720)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !164, file: !165, line: 868, baseType: !209, size: 32, offset: 736)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !159, file: !158, line: 97, baseType: !114, size: 16, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !158, line: 97, baseType: !114, size: 16, offset: 1040)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !159, file: !158, line: 99, baseType: !209, size: 32, offset: 1056)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !159, file: !158, line: 99, baseType: !209, size: 32, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !159, file: !158, line: 99, baseType: !209, size: 32, offset: 1120)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !159, file: !158, line: 100, baseType: !209, size: 32, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !159, file: !158, line: 100, baseType: !209, size: 32, offset: 1184)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !159, file: !158, line: 100, baseType: !209, size: 32, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !159, file: !158, line: 101, baseType: !209, size: 32, offset: 1248)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !159, file: !158, line: 101, baseType: !209, size: 32, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !159, file: !158, line: 101, baseType: !209, size: 32, offset: 1312)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !159, file: !158, line: 102, baseType: !209, size: 32, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !159, file: !158, line: 102, baseType: !209, size: 32, offset: 1376)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !159, file: !158, line: 102, baseType: !209, size: 32, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !159, file: !158, line: 103, baseType: !209, size: 32, offset: 1440)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !159, file: !158, line: 103, baseType: !209, size: 32, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !159, file: !158, line: 103, baseType: !209, size: 32, offset: 1504)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !159, file: !158, line: 103, baseType: !209, size: 32, offset: 1536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !159, file: !158, line: 103, baseType: !209, size: 32, offset: 1568)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !159, file: !158, line: 104, baseType: !209, size: 32, offset: 1600)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !159, file: !158, line: 104, baseType: !209, size: 32, offset: 1632)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !159, file: !158, line: 104, baseType: !209, size: 32, offset: 1664)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !159, file: !158, line: 104, baseType: !209, size: 32, offset: 1696)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !159, file: !158, line: 104, baseType: !209, size: 32, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !159, file: !158, line: 105, baseType: !209, size: 32, offset: 1760)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !159, file: !158, line: 108, baseType: !259, size: 704, offset: 1792)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !158, line: 53, size: 704, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !259, file: !158, line: 54, baseType: !209, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !259, file: !158, line: 55, baseType: !209, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !259, file: !158, line: 56, baseType: !209, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !259, file: !158, line: 57, baseType: !209, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !259, file: !158, line: 59, baseType: !266, size: 96, offset: 128)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 3)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !259, file: !158, line: 60, baseType: !266, size: 96, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !259, file: !158, line: 61, baseType: !266, size: 96, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !259, file: !158, line: 63, baseType: !209, size: 32, offset: 416)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !259, file: !158, line: 64, baseType: !209, size: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !259, file: !158, line: 65, baseType: !209, size: 32, offset: 480)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !259, file: !158, line: 67, baseType: !114, size: 16, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !259, file: !158, line: 68, baseType: !114, size: 16, offset: 528)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !259, file: !158, line: 69, baseType: !114, size: 16, offset: 544)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !259, file: !158, line: 70, baseType: !114, size: 16, offset: 560)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !259, file: !158, line: 72, baseType: !209, size: 32, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !259, file: !158, line: 73, baseType: !209, size: 32, offset: 608)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !259, file: !158, line: 74, baseType: !209, size: 32, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !259, file: !158, line: 75, baseType: !209, size: 32, offset: 672)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !159, file: !158, line: 109, baseType: !283, size: 128, offset: 2496)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !158, line: 79, size: 128, elements: !284)
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !158, line: 80, baseType: !36, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !283, file: !158, line: 81, baseType: !36, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !283, file: !158, line: 82, baseType: !36, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !283, file: !158, line: 83, baseType: !36, size: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !159, file: !158, line: 111, baseType: !209, size: 32, offset: 2624)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !159, file: !158, line: 111, baseType: !209, size: 32, offset: 2656)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !159, file: !158, line: 112, baseType: !209, size: 32, offset: 2688)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !159, file: !158, line: 112, baseType: !209, size: 32, offset: 2720)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !159, file: !158, line: 113, baseType: !209, size: 32, offset: 2752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !159, file: !158, line: 114, baseType: !209, size: 32, offset: 2784)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !159, file: !158, line: 114, baseType: !209, size: 32, offset: 2816)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !159, file: !158, line: 115, baseType: !114, size: 16, offset: 2848)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !159, file: !158, line: 115, baseType: !114, size: 16, offset: 2864)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !159, file: !158, line: 116, baseType: !114, size: 16, offset: 2880)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !159, file: !158, line: 117, baseType: !101, size: 8, offset: 2896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !159, file: !158, line: 117, baseType: !101, size: 8, offset: 2904)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !159, file: !158, line: 119, baseType: !209, size: 32, offset: 2912)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !159, file: !158, line: 119, baseType: !209, size: 32, offset: 2944)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !159, file: !158, line: 120, baseType: !114, size: 16, offset: 2976)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !159, file: !158, line: 120, baseType: !114, size: 16, offset: 2992)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !159, file: !158, line: 121, baseType: !209, size: 32, offset: 3008)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !159, file: !158, line: 121, baseType: !209, size: 32, offset: 3040)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !159, file: !158, line: 122, baseType: !209, size: 32, offset: 3072)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !159, file: !158, line: 123, baseType: !209, size: 32, offset: 3104)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !159, file: !158, line: 124, baseType: !114, size: 16, offset: 3136)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !159, file: !158, line: 125, baseType: !114, size: 16, offset: 3152)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !159, file: !158, line: 127, baseType: !36, size: 32, offset: 3168)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !159, file: !158, line: 127, baseType: !36, size: 32, offset: 3200)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !159, file: !158, line: 128, baseType: !36, size: 32, offset: 3232)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !159, file: !158, line: 128, baseType: !36, size: 32, offset: 3264)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !159, file: !158, line: 129, baseType: !114, size: 16, offset: 3296)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !159, file: !158, line: 129, baseType: !114, size: 16, offset: 3312)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !159, file: !158, line: 129, baseType: !114, size: 16, offset: 3328)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !159, file: !158, line: 129, baseType: !114, size: 16, offset: 3344)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !159, file: !158, line: 130, baseType: !209, size: 32, offset: 3360)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !159, file: !158, line: 130, baseType: !209, size: 32, offset: 3392)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !159, file: !158, line: 130, baseType: !209, size: 32, offset: 3424)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !159, file: !158, line: 130, baseType: !209, size: 32, offset: 3456)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !159, file: !158, line: 131, baseType: !209, size: 32, offset: 3488)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !159, file: !158, line: 131, baseType: !209, size: 32, offset: 3520)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !159, file: !158, line: 131, baseType: !209, size: 32, offset: 3552)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !159, file: !158, line: 131, baseType: !209, size: 32, offset: 3584)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !159, file: !158, line: 132, baseType: !209, size: 32, offset: 3616)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !159, file: !158, line: 132, baseType: !209, size: 32, offset: 3648)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !159, file: !158, line: 133, baseType: !130, size: 512, offset: 3680)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !159, file: !158, line: 135, baseType: !209, size: 32, offset: 4192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !159, file: !158, line: 136, baseType: !209, size: 32, offset: 4224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !159, file: !158, line: 137, baseType: !209, size: 32, offset: 4256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !159, file: !158, line: 138, baseType: !36, size: 32, offset: 4288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !159, file: !158, line: 141, baseType: !101, size: 8, offset: 4320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !159, file: !158, line: 141, baseType: !101, size: 8, offset: 4328)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !159, file: !158, line: 141, baseType: !101, size: 8, offset: 4336)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !159, file: !158, line: 141, baseType: !101, size: 8, offset: 4344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !159, file: !158, line: 142, baseType: !114, size: 16, offset: 4352)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !159, file: !158, line: 142, baseType: !114, size: 16, offset: 4368)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !159, file: !158, line: 142, baseType: !114, size: 16, offset: 4384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !159, file: !158, line: 145, baseType: !101, size: 8, offset: 4400)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !159, file: !158, line: 145, baseType: !101, size: 8, offset: 4408)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !159, file: !158, line: 148, baseType: !114, size: 16, offset: 4416)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !159, file: !158, line: 148, baseType: !114, size: 16, offset: 4432)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !159, file: !158, line: 149, baseType: !209, size: 32, offset: 4448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !159, file: !158, line: 149, baseType: !209, size: 32, offset: 4480)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !159, file: !158, line: 152, baseType: !348, size: 128, offset: 4512)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 128, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 4)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !159, file: !158, line: 153, baseType: !209, size: 32, offset: 4640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !159, file: !158, line: 154, baseType: !209, size: 32, offset: 4672)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !159, file: !158, line: 157, baseType: !114, size: 16, offset: 4704)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !159, file: !158, line: 157, baseType: !114, size: 16, offset: 4720)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !159, file: !158, line: 160, baseType: !356, size: 64, offset: 4736)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !358, line: 113, size: 6208, elements: !359)
!358 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!359 = !{!360, !361, !362, !363, !364, !365, !369}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !357, file: !358, line: 114, baseType: !114, size: 16)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !357, file: !358, line: 114, baseType: !114, size: 16, offset: 16)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !357, file: !358, line: 115, baseType: !101, size: 8, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !357, file: !358, line: 115, baseType: !101, size: 8, offset: 40)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !357, file: !358, line: 116, baseType: !101, size: 8, offset: 48)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !357, file: !358, line: 117, baseType: !366, size: 8, offset: 56)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 8, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 1)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !357, file: !358, line: 119, baseType: !370, size: 6144, offset: 64)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 6144, elements: !380)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !358, line: 109, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !358, line: 106, size: 192, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !372, file: !358, line: 107, baseType: !209, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !372, file: !358, line: 107, baseType: !209, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !372, file: !358, line: 107, baseType: !209, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !372, file: !358, line: 107, baseType: !209, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !372, file: !358, line: 107, baseType: !209, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !372, file: !358, line: 108, baseType: !36, size: 32, offset: 160)
!380 = !{!381}
!381 = !DISubrange(count: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !159, file: !158, line: 161, baseType: !356, size: 64, offset: 4800)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !159, file: !158, line: 162, baseType: !101, size: 8, offset: 4864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !159, file: !158, line: 162, baseType: !101, size: 8, offset: 4872)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !159, file: !158, line: 163, baseType: !101, size: 8, offset: 4880)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !159, file: !158, line: 163, baseType: !101, size: 8, offset: 4888)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !159, file: !158, line: 164, baseType: !114, size: 16, offset: 4896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !159, file: !158, line: 164, baseType: !114, size: 16, offset: 4912)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !159, file: !158, line: 165, baseType: !209, size: 32, offset: 4928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !159, file: !158, line: 165, baseType: !209, size: 32, offset: 4960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !159, file: !158, line: 167, baseType: !392, size: 1152, offset: 4992)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 1152, elements: !1918)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !358, line: 57, size: 2496, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !403, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !394, file: !358, line: 59, baseType: !114, size: 16)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !394, file: !358, line: 59, baseType: !114, size: 16, offset: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !394, file: !358, line: 59, baseType: !114, size: 16, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !394, file: !358, line: 59, baseType: !114, size: 16, offset: 48)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !394, file: !358, line: 60, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !358, line: 49, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !394, file: !358, line: 61, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !358, line: 202, size: 3328, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !1769, !1770, !1771, !1772, !1773, !1799, !1800, !1829, !1849, !1857, !1858}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !405, file: !358, line: 203, baseType: !82, size: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !405, file: !358, line: 204, baseType: !163, size: 64, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !405, file: !358, line: 206, baseType: !209, size: 32, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !405, file: !358, line: 206, baseType: !209, size: 32, offset: 1056)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !405, file: !358, line: 207, baseType: !209, size: 32, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !405, file: !358, line: 207, baseType: !209, size: 32, offset: 1120)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !405, file: !358, line: 207, baseType: !209, size: 32, offset: 1152)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !405, file: !358, line: 207, baseType: !209, size: 32, offset: 1184)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !405, file: !358, line: 207, baseType: !209, size: 32, offset: 1216)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !405, file: !358, line: 207, baseType: !209, size: 32, offset: 1248)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !405, file: !358, line: 208, baseType: !209, size: 32, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !405, file: !358, line: 208, baseType: !209, size: 32, offset: 1312)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !405, file: !358, line: 211, baseType: !209, size: 32, offset: 1344)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !405, file: !358, line: 211, baseType: !209, size: 32, offset: 1376)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !405, file: !358, line: 211, baseType: !209, size: 32, offset: 1408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !405, file: !358, line: 211, baseType: !209, size: 32, offset: 1440)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !405, file: !358, line: 211, baseType: !209, size: 32, offset: 1472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !405, file: !358, line: 214, baseType: !209, size: 32, offset: 1504)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !405, file: !358, line: 214, baseType: !209, size: 32, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !405, file: !358, line: 217, baseType: !209, size: 32, offset: 1568)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !405, file: !358, line: 218, baseType: !209, size: 32, offset: 1600)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !405, file: !358, line: 219, baseType: !209, size: 32, offset: 1632)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !405, file: !358, line: 220, baseType: !209, size: 32, offset: 1664)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !405, file: !358, line: 221, baseType: !209, size: 32, offset: 1696)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !405, file: !358, line: 222, baseType: !114, size: 16, offset: 1728)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !405, file: !358, line: 222, baseType: !114, size: 16, offset: 1744)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !405, file: !358, line: 224, baseType: !114, size: 16, offset: 1760)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !405, file: !358, line: 224, baseType: !114, size: 16, offset: 1776)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !405, file: !358, line: 227, baseType: !114, size: 16, offset: 1792)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !405, file: !358, line: 227, baseType: !114, size: 16, offset: 1808)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !405, file: !358, line: 229, baseType: !114, size: 16, offset: 1824)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !358, line: 229, baseType: !114, size: 16, offset: 1840)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !358, line: 230, baseType: !114, size: 16, offset: 1856)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !405, file: !358, line: 230, baseType: !114, size: 16, offset: 1872)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !405, file: !358, line: 232, baseType: !209, size: 32, offset: 1888)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !405, file: !358, line: 232, baseType: !209, size: 32, offset: 1920)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !405, file: !358, line: 232, baseType: !209, size: 32, offset: 1952)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !405, file: !358, line: 232, baseType: !209, size: 32, offset: 1984)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !405, file: !358, line: 233, baseType: !36, size: 32, offset: 2016)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !405, file: !358, line: 234, baseType: !36, size: 32, offset: 2048)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !405, file: !358, line: 235, baseType: !114, size: 16, offset: 2080)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !405, file: !358, line: 235, baseType: !114, size: 16, offset: 2096)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !405, file: !358, line: 236, baseType: !114, size: 16, offset: 2112)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !405, file: !358, line: 239, baseType: !114, size: 16, offset: 2128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !405, file: !358, line: 240, baseType: !36, size: 32, offset: 2144)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !405, file: !358, line: 241, baseType: !36, size: 32, offset: 2176)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !405, file: !358, line: 241, baseType: !36, size: 32, offset: 2208)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !405, file: !358, line: 241, baseType: !36, size: 32, offset: 2240)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !405, file: !358, line: 243, baseType: !209, size: 32, offset: 2272)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !405, file: !358, line: 243, baseType: !209, size: 32, offset: 2304)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !405, file: !358, line: 244, baseType: !209, size: 32, offset: 2336)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !405, file: !358, line: 246, baseType: !459, size: 320, offset: 2368)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !460, line: 50, size: 320, elements: !461)
!460 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!461 = !{!462, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !459, file: !460, line: 51, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !465, line: 1216, size: 39680, elements: !466)
!465 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!466 = !{!467, !468, !469, !470, !1023, !1024, !1025, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1052, !1332, !1335, !1624, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1646, !1647, !1648, !1649, !1650, !1658, !1725, !1732, !1733, !1740, !1743, !1749, !1750, !1751, !1752, !1753}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !464, file: !465, line: 1217, baseType: !82, size: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !464, file: !465, line: 1218, baseType: !163, size: 64, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !464, file: !465, line: 1220, baseType: !401, size: 64, offset: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !464, file: !465, line: 1221, baseType: !471, size: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !473, line: 52, size: 4224, elements: !474)
!473 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !544, !545, !548, !549, !550, !551, !555, !571}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !472, file: !473, line: 53, baseType: !82, size: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !472, file: !473, line: 54, baseType: !163, size: 64, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !472, file: !473, line: 56, baseType: !114, size: 16, offset: 1024)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !472, file: !473, line: 56, baseType: !114, size: 16, offset: 1040)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !472, file: !473, line: 57, baseType: !114, size: 16, offset: 1056)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !472, file: !473, line: 57, baseType: !114, size: 16, offset: 1072)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !472, file: !473, line: 59, baseType: !209, size: 32, offset: 1088)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !472, file: !473, line: 59, baseType: !209, size: 32, offset: 1120)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !472, file: !473, line: 59, baseType: !209, size: 32, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !472, file: !473, line: 60, baseType: !209, size: 32, offset: 1184)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !472, file: !473, line: 60, baseType: !209, size: 32, offset: 1216)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !472, file: !473, line: 60, baseType: !209, size: 32, offset: 1248)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !472, file: !473, line: 61, baseType: !209, size: 32, offset: 1280)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !472, file: !473, line: 61, baseType: !209, size: 32, offset: 1312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !472, file: !473, line: 61, baseType: !209, size: 32, offset: 1344)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !472, file: !473, line: 68, baseType: !209, size: 32, offset: 1376)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !472, file: !473, line: 68, baseType: !209, size: 32, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !472, file: !473, line: 68, baseType: !209, size: 32, offset: 1440)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !472, file: !473, line: 69, baseType: !209, size: 32, offset: 1472)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !472, file: !473, line: 69, baseType: !209, size: 32, offset: 1504)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !472, file: !473, line: 74, baseType: !209, size: 32, offset: 1536)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !472, file: !473, line: 79, baseType: !209, size: 32, offset: 1568)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !472, file: !473, line: 81, baseType: !114, size: 16, offset: 1600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !472, file: !473, line: 91, baseType: !114, size: 16, offset: 1616)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !472, file: !473, line: 92, baseType: !114, size: 16, offset: 1632)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !472, file: !473, line: 93, baseType: !114, size: 16, offset: 1648)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !472, file: !473, line: 94, baseType: !114, size: 16, offset: 1664)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !472, file: !473, line: 94, baseType: !114, size: 16, offset: 1680)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !472, file: !473, line: 94, baseType: !114, size: 16, offset: 1696)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !472, file: !473, line: 94, baseType: !114, size: 16, offset: 1712)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !472, file: !473, line: 96, baseType: !209, size: 32, offset: 1728)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !472, file: !473, line: 96, baseType: !209, size: 32, offset: 1760)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !472, file: !473, line: 96, baseType: !209, size: 32, offset: 1792)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !472, file: !473, line: 96, baseType: !209, size: 32, offset: 1824)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !472, file: !473, line: 98, baseType: !209, size: 32, offset: 1856)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !472, file: !473, line: 98, baseType: !209, size: 32, offset: 1888)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !472, file: !473, line: 98, baseType: !209, size: 32, offset: 1920)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !472, file: !473, line: 98, baseType: !209, size: 32, offset: 1952)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !472, file: !473, line: 99, baseType: !209, size: 32, offset: 1984)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !472, file: !473, line: 99, baseType: !209, size: 32, offset: 2016)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !472, file: !473, line: 100, baseType: !209, size: 32, offset: 2048)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !472, file: !473, line: 100, baseType: !209, size: 32, offset: 2080)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !472, file: !473, line: 103, baseType: !114, size: 16, offset: 2112)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !472, file: !473, line: 103, baseType: !114, size: 16, offset: 2128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !472, file: !473, line: 103, baseType: !114, size: 16, offset: 2144)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !472, file: !473, line: 103, baseType: !114, size: 16, offset: 2160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !472, file: !473, line: 106, baseType: !209, size: 32, offset: 2176)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !472, file: !473, line: 106, baseType: !209, size: 32, offset: 2208)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !472, file: !473, line: 106, baseType: !209, size: 32, offset: 2240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !472, file: !473, line: 106, baseType: !209, size: 32, offset: 2272)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !472, file: !473, line: 107, baseType: !114, size: 16, offset: 2304)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !472, file: !473, line: 107, baseType: !114, size: 16, offset: 2320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !472, file: !473, line: 107, baseType: !114, size: 16, offset: 2336)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !472, file: !473, line: 107, baseType: !114, size: 16, offset: 2352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !472, file: !473, line: 108, baseType: !209, size: 32, offset: 2368)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !472, file: !473, line: 108, baseType: !209, size: 32, offset: 2400)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !472, file: !473, line: 109, baseType: !209, size: 32, offset: 2432)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !472, file: !473, line: 109, baseType: !209, size: 32, offset: 2464)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !472, file: !473, line: 110, baseType: !209, size: 32, offset: 2496)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !472, file: !473, line: 110, baseType: !209, size: 32, offset: 2528)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !472, file: !473, line: 110, baseType: !209, size: 32, offset: 2560)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !472, file: !473, line: 111, baseType: !114, size: 16, offset: 2592)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !472, file: !473, line: 111, baseType: !114, size: 16, offset: 2608)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !472, file: !473, line: 112, baseType: !114, size: 16, offset: 2624)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !472, file: !473, line: 112, baseType: !114, size: 16, offset: 2640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !472, file: !473, line: 112, baseType: !114, size: 16, offset: 2656)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !472, file: !473, line: 115, baseType: !114, size: 16, offset: 2672)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !472, file: !473, line: 118, baseType: !543, size: 64, offset: 2688)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !472, file: !473, line: 118, baseType: !543, size: 64, offset: 2752)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !472, file: !473, line: 121, baseType: !546, size: 64, offset: 2816)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !358, line: 46, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !472, file: !473, line: 122, baseType: !392, size: 1152, offset: 2880)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !472, file: !473, line: 123, baseType: !114, size: 16, offset: 4032)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !472, file: !473, line: 123, baseType: !114, size: 16, offset: 4048)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !472, file: !473, line: 123, baseType: !552, size: 32, offset: 4064)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 32, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 2)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !472, file: !473, line: 126, baseType: !556, size: 64, offset: 4096)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !83, line: 159, size: 448, elements: !558)
!558 = !{!559, !561, !562, !563, !564, !567}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !557, file: !83, line: 161, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !553)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !557, file: !83, line: 162, baseType: !560, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !557, file: !83, line: 163, baseType: !552, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !557, file: !83, line: 164, baseType: !552, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !557, file: !83, line: 165, baseType: !565, size: 128, offset: 192)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !553)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !557, file: !83, line: 166, baseType: !568, size: 128, offset: 320)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 128, elements: !553)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !83, line: 46, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !472, file: !473, line: 129, baseType: !572, size: 64, offset: 4160)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !6, line: 328, size: 3456, elements: !574)
!574 = !{!575, !576, !577, !968, !969, !970, !973, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !1001, !1002, !1003, !1006, !1010, !1014, !1018, !1019, !1020, !1021, !1022}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !573, file: !6, line: 329, baseType: !82, size: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !573, file: !6, line: 330, baseType: !163, size: 64, offset: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !573, file: !6, line: 332, baseType: !578, size: 64, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !29, line: 283, size: 4096, elements: !580)
!580 = !{!581, !582, !583, !584, !588, !589, !593, !937, !945, !949, !955, !959, !960, !961, !962, !966, !967}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !29, line: 284, baseType: !36, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !579, file: !29, line: 285, baseType: !130, size: 512, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !579, file: !29, line: 287, baseType: !130, size: 512, offset: 544)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !579, file: !29, line: 288, baseType: !585, size: 2048, offset: 1056)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 2048, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !579, file: !29, line: 289, baseType: !36, size: 32, offset: 3104)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !579, file: !29, line: 292, baseType: !590, size: 64, offset: 3136)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !572}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !579, file: !29, line: 293, baseType: !594, size: 64, offset: 3200)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !572, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !6, line: 167, size: 3712, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !929, !930, !931, !932, !933, !934}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !6, line: 168, baseType: !597, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !598, file: !6, line: 168, baseType: !597, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !598, file: !6, line: 168, baseType: !597, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !598, file: !6, line: 170, baseType: !119, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !598, file: !6, line: 172, baseType: !605, size: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !29, line: 144, size: 6016, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !780, !781, !782, !796, !800, !804, !805, !812, !816, !820, !821, !822, !823, !827, !828, !832, !836, !840, !844, !848, !852, !856, !857, !864, !866, !875, !884}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !606, file: !29, line: 145, baseType: !80, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !606, file: !29, line: 145, baseType: !80, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !606, file: !29, line: 146, baseType: !114, size: 16, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !606, file: !29, line: 148, baseType: !130, size: 512, offset: 144)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !606, file: !29, line: 149, baseType: !36, size: 32, offset: 672)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !606, file: !29, line: 151, baseType: !130, size: 512, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !606, file: !29, line: 152, baseType: !585, size: 2048, offset: 1216)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !606, file: !29, line: 153, baseType: !36, size: 32, offset: 3264)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !606, file: !29, line: 155, baseType: !209, size: 32, offset: 3296)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !606, file: !29, line: 155, baseType: !209, size: 32, offset: 3328)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !606, file: !29, line: 155, baseType: !209, size: 32, offset: 3360)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !606, file: !29, line: 156, baseType: !209, size: 32, offset: 3392)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !606, file: !29, line: 156, baseType: !209, size: 32, offset: 3424)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !606, file: !29, line: 156, baseType: !209, size: 32, offset: 3456)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !606, file: !29, line: 157, baseType: !114, size: 16, offset: 3488)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !29, line: 157, baseType: !114, size: 16, offset: 3504)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !606, file: !29, line: 157, baseType: !114, size: 16, offset: 3520)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !606, file: !29, line: 160, baseType: !626, size: 64, offset: 3584)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !29, line: 109, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !29, line: 98, size: 1408, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !779}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !628, file: !29, line: 99, baseType: !36, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !628, file: !29, line: 99, baseType: !36, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !29, line: 100, baseType: !130, size: 512, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !628, file: !29, line: 101, baseType: !209, size: 32, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !628, file: !29, line: 101, baseType: !209, size: 32, offset: 608)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !628, file: !29, line: 101, baseType: !209, size: 32, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !628, file: !29, line: 101, baseType: !209, size: 32, offset: 672)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !628, file: !29, line: 102, baseType: !209, size: 32, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !628, file: !29, line: 102, baseType: !209, size: 32, offset: 736)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !628, file: !29, line: 103, baseType: !36, size: 32, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !29, line: 104, baseType: !36, size: 32, offset: 800)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !628, file: !29, line: 107, baseType: !642, size: 64, offset: 832)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !6, line: 87, size: 2816, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !764}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !6, line: 88, baseType: !642, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !643, file: !6, line: 88, baseType: !642, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !643, file: !6, line: 88, baseType: !642, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !643, file: !6, line: 90, baseType: !119, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !643, file: !6, line: 92, baseType: !130, size: 512, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !6, line: 94, baseType: !130, size: 512, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !643, file: !6, line: 99, baseType: !80, size: 64, offset: 1280)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !6, line: 101, baseType: !114, size: 16, offset: 1344)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !643, file: !6, line: 101, baseType: !114, size: 16, offset: 1360)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !643, file: !6, line: 102, baseType: !114, size: 16, offset: 1376)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !643, file: !6, line: 103, baseType: !114, size: 16, offset: 1392)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !643, file: !6, line: 104, baseType: !657, size: 64, offset: 1408)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !29, line: 114, size: 1600, elements: !659)
!659 = !{!660, !661, !683, !687, !691, !695, !699, !703, !704, !708, !734, !735, !736}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !658, file: !29, line: 115, baseType: !130, size: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !658, file: !29, line: 117, baseType: !662, size: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !665, !668, !670, !670, !681}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !667, line: 40, flags: DIFlagFwdDecl)
!667 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_animsys.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !29, line: 73, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !48, line: 55, size: 192, elements: !672)
!672 = !{!673, !677, !680}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !671, file: !48, line: 58, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !48, line: 56, size: 64, elements: !675)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !674, file: !48, line: 57, baseType: !80, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !48, line: 60, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !6, line: 335, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !671, file: !48, line: 61, baseType: !80, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !658, file: !29, line: 118, baseType: !684, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !665, !670, !670, !543}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !658, file: !29, line: 120, baseType: !688, size: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !665, !668, !670}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !658, file: !29, line: 121, baseType: !692, size: 64, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !665, !670, !543}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !658, file: !29, line: 122, baseType: !696, size: 64, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !572, !642, !678}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !658, file: !29, line: 123, baseType: !700, size: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !572, !642, !597, !642, !681}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !658, file: !29, line: 124, baseType: !700, size: 64, offset: 896)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !658, file: !29, line: 125, baseType: !705, size: 64, offset: 960)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !572, !642, !597, !642}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !658, file: !29, line: 128, baseType: !709, size: 256, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !48, line: 436, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !48, line: 430, size: 256, elements: !711)
!711 = !{!712, !713, !716, !732}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !710, file: !48, line: 431, baseType: !80, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !710, file: !48, line: 432, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !48, line: 417, baseType: !679)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !710, file: !48, line: 433, baseType: !717, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !48, line: 408, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!36, !665, !670, !721, !723}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !48, line: 38, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !48, line: 348, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !48, line: 337, size: 256, elements: !726)
!726 = !{!727, !728, !729, !730, !731}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !725, file: !48, line: 339, baseType: !80, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !725, file: !48, line: 342, baseType: !721, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !725, file: !48, line: 345, baseType: !36, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !725, file: !48, line: 347, baseType: !36, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !725, file: !48, line: 347, baseType: !36, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !710, file: !48, line: 434, baseType: !733, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !48, line: 409, baseType: !152)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !658, file: !29, line: 129, baseType: !709, size: 256, offset: 1280)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !29, line: 132, baseType: !36, size: 32, offset: 1536)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !658, file: !29, line: 132, baseType: !36, size: 32, offset: 1568)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !643, file: !6, line: 105, baseType: !130, size: 512, offset: 1472)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !643, file: !6, line: 107, baseType: !209, size: 32, offset: 1984)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !643, file: !6, line: 107, baseType: !209, size: 32, offset: 2016)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !643, file: !6, line: 109, baseType: !80, size: 64, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !643, file: !6, line: 112, baseType: !114, size: 16, offset: 2112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !643, file: !6, line: 114, baseType: !114, size: 16, offset: 2128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !643, file: !6, line: 115, baseType: !36, size: 32, offset: 2144)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !643, file: !6, line: 117, baseType: !80, size: 64, offset: 2176)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !643, file: !6, line: 122, baseType: !36, size: 32, offset: 2240)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !643, file: !6, line: 124, baseType: !36, size: 32, offset: 2272)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !643, file: !6, line: 126, baseType: !642, size: 64, offset: 2304)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !643, file: !6, line: 128, baseType: !749, size: 64, offset: 2368)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !6, line: 298, size: 448, elements: !751)
!751 = !{!752, !753, !754, !757, !758, !761, !762, !763}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !6, line: 299, baseType: !749, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !750, file: !6, line: 299, baseType: !749, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !750, file: !6, line: 301, baseType: !755, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !6, line: 218, baseType: !598)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !750, file: !6, line: 301, baseType: !755, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !750, file: !6, line: 302, baseType: !759, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !6, line: 132, baseType: !643)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !750, file: !6, line: 302, baseType: !759, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !750, file: !6, line: 304, baseType: !36, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !750, file: !6, line: 305, baseType: !36, size: 32, offset: 416)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !643, file: !6, line: 131, baseType: !765, size: 384, offset: 2432)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !6, line: 73, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !6, line: 62, size: 384, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !766, file: !6, line: 63, baseType: !348, size: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !766, file: !6, line: 64, baseType: !209, size: 32, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !766, file: !6, line: 64, baseType: !209, size: 32, offset: 160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !766, file: !6, line: 65, baseType: !80, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !766, file: !6, line: 66, baseType: !114, size: 16, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !766, file: !6, line: 67, baseType: !114, size: 16, offset: 272)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !766, file: !6, line: 68, baseType: !114, size: 16, offset: 288)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !766, file: !6, line: 69, baseType: !114, size: 16, offset: 304)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !766, file: !6, line: 70, baseType: !114, size: 16, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !766, file: !6, line: 71, baseType: !114, size: 16, offset: 336)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !766, file: !6, line: 72, baseType: !552, size: 32, offset: 352)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !628, file: !29, line: 108, baseType: !130, size: 512, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !606, file: !29, line: 160, baseType: !626, size: 64, offset: 3648)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !606, file: !29, line: 162, baseType: !130, size: 512, offset: 3712)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !606, file: !29, line: 165, baseType: !783, size: 64, offset: 4224)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !786, !788, !790, !572, !597, !792}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !29, line: 81, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !6, line: 43, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !6, line: 274, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !6, line: 271, size: 32, elements: !794)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !793, file: !6, line: 273, baseType: !7, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !606, file: !29, line: 168, baseType: !797, size: 64, offset: 4288)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !786, !572, !597}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !606, file: !29, line: 171, baseType: !801, size: 64, offset: 4352)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !668, !665, !670}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !606, file: !29, line: 173, baseType: !801, size: 64, offset: 4416)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !606, file: !29, line: 176, baseType: !806, size: 64, offset: 4480)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !790, !809, !597, !36, !36}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !811, line: 136, flags: DIFlagFwdDecl)
!811 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!812 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !606, file: !29, line: 179, baseType: !813, size: 64, offset: 4544)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !572, !597, !155, !36}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !606, file: !29, line: 181, baseType: !817, size: 64, offset: 4608)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!36, !597, !36, !36}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !606, file: !29, line: 183, baseType: !817, size: 64, offset: 4672)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !606, file: !29, line: 185, baseType: !817, size: 64, offset: 4736)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !606, file: !29, line: 188, baseType: !594, size: 64, offset: 4800)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !606, file: !29, line: 190, baseType: !824, size: 64, offset: 4864)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !572, !597, !89}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !606, file: !29, line: 193, baseType: !594, size: 64, offset: 4928)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !606, file: !29, line: 195, baseType: !829, size: 64, offset: 4992)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !597}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !606, file: !29, line: 197, baseType: !833, size: 64, offset: 5056)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !572, !597, !597}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !606, file: !29, line: 200, baseType: !837, size: 64, offset: 5120)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !786, !670}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !606, file: !29, line: 201, baseType: !841, size: 64, offset: 5184)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !670}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !606, file: !29, line: 202, baseType: !845, size: 64, offset: 5248)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !670, !597}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !606, file: !29, line: 205, baseType: !849, size: 64, offset: 5312)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!36, !605, !572}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !606, file: !29, line: 207, baseType: !853, size: 64, offset: 5376)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!36, !597, !572}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !606, file: !29, line: 210, baseType: !594, size: 64, offset: 5440)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !606, file: !29, line: 213, baseType: !858, size: 64, offset: 5504)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !29, line: 135, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!80, !862, !597, !792}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !29, line: 62, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !606, file: !29, line: 214, baseType: !865, size: 64, offset: 5568)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !29, line: 136, baseType: !152)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !606, file: !29, line: 215, baseType: !867, size: 64, offset: 5632)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !29, line: 137, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !80, !36, !597, !871, !873, !873}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !29, line: 63, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !606, file: !29, line: 217, baseType: !876, size: 64, offset: 5696)
