; ModuleID = 'blender/source/blender/blenkernel/intern/fmodifier.c'
source_filename = "blender/source/blender/blenkernel/intern/fmodifier.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FModifierTypeInfo = type { i16, i16, i16, i16, [64 x i8], [64 x i8], void (%struct.FModifier*)*, void (%struct.FModifier*, %struct.FModifier*)*, void (i8*)*, void (%struct.FModifier*)*, float (%struct.FCurve*, %struct.FModifier*, float, float)*, void (%struct.FCurve*, %struct.FModifier*, float*, float)*, float (%struct.GHash*, %struct.FCurve*, %struct.FModifier*, float, float)*, void (%struct.GHash*, %struct.FCurve*, %struct.FModifier*, float*, float)* }
%struct.FModifier = type { %struct.FModifier*, %struct.FModifier*, i8*, [64 x i8], i16, i16, float, float, float, float, float }
%struct.FCurve = type { %struct.FCurve*, %struct.FCurve*, %struct.bActionGroup*, %struct.ChannelDriver*, %struct.ListBase, %struct.BezTriple*, %struct.FPoint*, i32, float, i16, i16, i32, i8*, i32, [3 x float], float, float }
%struct.bActionGroup = type { %struct.bActionGroup*, %struct.bActionGroup*, %struct.ListBase, i32, i32, [64 x i8], %struct.ThemeWireColor }
%struct.ThemeWireColor = type { [4 x i8], [4 x i8], [4 x i8], i16, i16 }
%struct.ChannelDriver = type { %struct.ListBase, [256 x i8], i8*, float, float, i32, i32 }
%struct.ListBase = type { i8*, i8* }

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "FMODIFIER_TYPE_NULL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "FMODIFIER_TYPE_GENERATOR", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "FMODIFIER_TYPE_FN_GENERATOR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "FMODIFIER_TYPE_ENVELOPE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "FMODIFIER_TYPE_CYCLES", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "FMODIFIER_TYPE_NOISE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "FMODIFIER_TYPE_FILTER", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "FMODIFIER_TYPE_PYTHON", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "FMODIFIER_TYPE_LIMITS", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "FMODIFIER_TYPE_STEPPED", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "FMODIFIER_NUM_TYPES", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFModifier_Flags", file: !6, line: 89, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FMODIFIER_FLAG_DISABLED", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "FMODIFIER_FLAG_EXPANDED", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "FMODIFIER_FLAG_ACTIVE", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "FMODIFIER_FLAG_MUTED", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "FMODIFIER_FLAG_RANGERESTRICT", value: 16, isUnsigned: true)
!27 = !DIEnumerator(name: "FMODIFIER_FLAG_USEINFLUENCE", value: 32, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMI_Requirement_Flags", file: !29, line: 159, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_fcurve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "FMI_REQUIRES_ORIGINAL_DATA", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "FMI_REQUIRES_NOTHING", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "FMI_REQUIRES_RUNTIME_CHECK", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "FMI_REQUIRES_STORAGE", value: 8, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMod_Generator_Flags", file: !6, line: 129, baseType: !7, size: 32, elements: !36)
!36 = !{!37}
!37 = !DIEnumerator(name: "FCM_GENERATOR_ADDITIVE", value: 1, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMod_Cycling_Modes", file: !6, line: 195, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "FCM_EXTRAPOLATE_NONE", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "FCM_EXTRAPOLATE_CYCLIC", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "FCM_EXTRAPOLATE_CYCLIC_OFFSET", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "FCM_EXTRAPOLATE_MIRROR", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMod_Noise_Modifications", file: !6, line: 238, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "FCM_NOISE_MODIF_REPLACE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "FCM_NOISE_MODIF_ADD", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "FCM_NOISE_MODIF_SUBTRACT", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "FCM_NOISE_MODIF_MULTIPLY", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMod_Limit_Flags", file: !6, line: 218, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "FCM_LIMIT_XMIN", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "FCM_LIMIT_XMAX", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "FCM_LIMIT_YMIN", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "FCM_LIMIT_YMAX", value: 8, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMod_Stepped_Flags", file: !6, line: 258, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59}
!58 = !DIEnumerator(name: "FCM_STEPPED_NO_BEFORE", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "FCM_STEPPED_NO_AFTER", value: 2, isUnsigned: true)
!60 = !{!61, !62, !66, !69, !7, !81, !91, !75, !92, !111, !78, !119, !129, !170, !185}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FModifierStackStorage", file: !29, line: 103, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !65, line: 47, flags: DIFlagFwdDecl)
!65 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !68, line: 48, baseType: !64)
!68 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Generator", file: !6, line: 117, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Generator", file: !6, line: 107, size: 192, elements: !72)
!72 = !{!73, !76, !77, !79, !80}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "coefficients", scope: !71, file: !6, line: 109, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "arraysize", scope: !71, file: !6, line: 110, baseType: !7, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "poly_order", scope: !71, file: !6, line: 112, baseType: !78, size: 32, offset: 96)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !71, file: !6, line: 113, baseType: !78, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !6, line: 116, baseType: !78, size: 32, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_FunctionGenerator", file: !6, line: 153, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_FunctionGenerator", file: !6, line: 143, size: 192, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !83, file: !6, line: 145, baseType: !75, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "phase_multiplier", scope: !83, file: !6, line: 146, baseType: !75, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "phase_offset", scope: !83, file: !6, line: 147, baseType: !75, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "value_offset", scope: !83, file: !6, line: 148, baseType: !75, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !6, line: 151, baseType: !78, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !83, file: !6, line: 152, baseType: !78, size: 32, offset: 160)
!91 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Envelope", file: !6, line: 182, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Envelope", file: !6, line: 176, size: 192, elements: !95)
!95 = !{!96, !107, !108, !109, !110}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !6, line: 177, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCM_EnvelopeData", file: !6, line: 173, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCM_EnvelopeData", file: !6, line: 167, size: 128, elements: !100)
!100 = !{!101, !102, !103, !104, !106}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !99, file: !6, line: 168, baseType: !75, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !99, file: !6, line: 168, baseType: !75, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !99, file: !6, line: 169, baseType: !75, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !99, file: !6, line: 171, baseType: !105, size: 16, offset: 96)
!105 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !99, file: !6, line: 172, baseType: !105, size: 16, offset: 112)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !94, file: !6, line: 178, baseType: !78, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "midval", scope: !94, file: !6, line: 180, baseType: !75, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !94, file: !6, line: 181, baseType: !75, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !94, file: !6, line: 181, baseType: !75, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Cycles", file: !6, line: 192, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Cycles", file: !6, line: 187, size: 64, elements: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "before_mode", scope: !113, file: !6, line: 188, baseType: !105, size: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "after_mode", scope: !113, file: !6, line: 189, baseType: !105, size: 16, offset: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "before_cycles", scope: !113, file: !6, line: 190, baseType: !105, size: 16, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "after_cycles", scope: !113, file: !6, line: 191, baseType: !105, size: 16, offset: 48)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Noise", file: !6, line: 235, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Noise", file: !6, line: 227, size: 160, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !121, file: !6, line: 228, baseType: !75, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !121, file: !6, line: 229, baseType: !75, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !121, file: !6, line: 230, baseType: !75, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !121, file: !6, line: 231, baseType: !75, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !121, file: !6, line: 233, baseType: !105, size: 16, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "modification", scope: !121, file: !6, line: 234, baseType: !105, size: 16, offset: 144)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Python", file: !6, line: 207, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Python", file: !6, line: 204, size: 128, elements: !132)
!132 = !{!133, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !131, file: !6, line: 205, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !6, line: 205, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !131, file: !6, line: 206, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !139, line: 75, baseType: !140)
!139 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !139, line: 62, size: 1024, elements: !141)
!141 = !{!142, !144, !145, !147, !148, !149, !153, !154, !168, !169}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !139, line: 63, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !139, line: 63, baseType: !143, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !139, line: 64, baseType: !146, size: 8, offset: 128)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !140, file: !139, line: 64, baseType: !146, size: 8, offset: 136)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !139, line: 65, baseType: !105, size: 16, offset: 144)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !139, line: 66, baseType: !150, size: 512, offset: 160)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 512, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !140, file: !139, line: 67, baseType: !78, size: 32, offset: 672)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !139, line: 69, baseType: !155, size: 256, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !139, line: 60, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !139, line: 48, size: 256, elements: !157)
!157 = !{!158, !159, !166, !167}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !156, file: !139, line: 49, baseType: !61, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !156, file: !139, line: 58, baseType: !160, size: 128, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !161, line: 71, baseType: !162)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !161, line: 69, size: 128, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !162, file: !161, line: 70, baseType: !61, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !162, file: !161, line: 70, baseType: !61, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !156, file: !139, line: 59, baseType: !78, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !156, file: !139, line: 59, baseType: !78, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !139, line: 70, baseType: !78, size: 32, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !140, file: !139, line: 74, baseType: !78, size: 32, offset: 992)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Limits", file: !6, line: 215, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Limits", file: !6, line: 211, size: 192, elements: !173)
!173 = !{!174, !183, !184}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !172, file: !6, line: 212, baseType: !175, size: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !176, line: 95, baseType: !177)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !176, line: 92, size: 128, elements: !178)
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !177, file: !176, line: 93, baseType: !75, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !177, file: !176, line: 93, baseType: !75, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !177, file: !176, line: 94, baseType: !75, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !177, file: !176, line: 94, baseType: !75, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !172, file: !6, line: 213, baseType: !78, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !172, file: !6, line: 214, baseType: !78, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Stepped", file: !6, line: 255, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Stepped", file: !6, line: 247, size: 160, elements: !188)
!188 = !{!189, !190, !191, !192, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !187, file: !6, line: 248, baseType: !75, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !187, file: !6, line: 249, baseType: !75, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !187, file: !6, line: 251, baseType: !75, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !187, file: !6, line: 252, baseType: !75, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !6, line: 254, baseType: !78, size: 32, offset: 128)
!194 = !{!195, !0, !348, !350, !352, !354, !356, !358, !360, !362}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "fmodifiersTypeInfo", scope: !2, file: !3, line: 1024, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 640, elements: !346)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "FModifierTypeInfo", file: !29, line: 144, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FModifierTypeInfo", file: !29, line: 116, size: 1600, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !226, !230, !234, !235, !334, !338, !342}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !29, line: 118, baseType: !105, size: 16)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !29, line: 119, baseType: !105, size: 16, offset: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "acttype", scope: !200, file: !29, line: 120, baseType: !105, size: 16, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "requires", scope: !200, file: !29, line: 121, baseType: !105, size: 16, offset: 48)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !29, line: 122, baseType: !150, size: 512, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !200, file: !29, line: 123, baseType: !150, size: 512, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "free_data", scope: !200, file: !29, line: 127, baseType: !209, size: 64, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FModifier", file: !6, line: 52, size: 896, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !6, line: 53, baseType: !212, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !213, file: !6, line: 53, baseType: !212, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !6, line: 55, baseType: !61, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !6, line: 57, baseType: !150, size: 512, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !6, line: 58, baseType: !105, size: 16, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !213, file: !6, line: 59, baseType: !105, size: 16, offset: 720)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !213, file: !6, line: 61, baseType: !75, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !213, file: !6, line: 63, baseType: !75, size: 32, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !213, file: !6, line: 64, baseType: !75, size: 32, offset: 800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !213, file: !6, line: 65, baseType: !75, size: 32, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !213, file: !6, line: 66, baseType: !75, size: 32, offset: 864)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "copy_data", scope: !200, file: !29, line: 129, baseType: !227, size: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !212, !212}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "new_data", scope: !200, file: !29, line: 131, baseType: !231, size: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !61}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "verify_data", scope: !200, file: !29, line: 133, baseType: !209, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_modifier_time", scope: !200, file: !29, line: 137, baseType: !236, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!75, !239, !212, !75, !75}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !6, line: 433, size: 896, elements: !241)
!241 = !{!242, !243, !244, !269, !284, !285, !310, !321, !322, !323, !324, !325, !326, !328, !329, !332, !333}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !6, line: 434, baseType: !239, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !240, file: !6, line: 434, baseType: !239, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !240, file: !6, line: 437, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !65, line: 450, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !65, line: 440, size: 960, elements: !248)
!248 = !{!249, !251, !252, !253, !254, !255, !256}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !65, line: 441, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !247, file: !65, line: 441, baseType: !250, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !247, file: !65, line: 443, baseType: !160, size: 128, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !65, line: 445, baseType: !78, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !247, file: !65, line: 446, baseType: !78, size: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !65, line: 447, baseType: !150, size: 512, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !247, file: !65, line: 449, baseType: !257, size: 128, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !258, line: 347, baseType: !259)
!258 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !258, line: 340, size: 128, elements: !260)
!260 = !{!261, !265, !266, !267, !268}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !259, file: !258, line: 341, baseType: !262, size: 32)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 32, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 4)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !259, file: !258, line: 342, baseType: !262, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !259, file: !258, line: 343, baseType: !262, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !259, file: !258, line: 345, baseType: !105, size: 16, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !259, file: !258, line: 346, baseType: !105, size: 16, offset: 112)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !240, file: !6, line: 440, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !6, line: 386, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !6, line: 371, size: 2368, elements: !273)
!273 = !{!274, !275, !279, !280, !281, !282, !283}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !272, file: !6, line: 372, baseType: !160, size: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !272, file: !6, line: 377, baseType: !276, size: 2048, offset: 128)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !272, file: !6, line: 378, baseType: !61, size: 64, offset: 2176)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !272, file: !6, line: 380, baseType: !75, size: 32, offset: 2240)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !272, file: !6, line: 381, baseType: !75, size: 32, offset: 2272)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !6, line: 384, baseType: !78, size: 32, offset: 2304)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !6, line: 385, baseType: !78, size: 32, offset: 2336)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !240, file: !6, line: 442, baseType: !160, size: 128, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !240, file: !6, line: 445, baseType: !286, size: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !288, line: 133, baseType: !289)
!288 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !288, line: 117, size: 576, elements: !290)
!290 = !{!291, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !289, file: !288, line: 118, baseType: !292, size: 288)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 288, elements: !293)
!293 = !{!294, !294}
!294 = !DISubrange(count: 3)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !289, file: !288, line: 119, baseType: !75, size: 32, offset: 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !289, file: !288, line: 119, baseType: !75, size: 32, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !289, file: !288, line: 119, baseType: !75, size: 32, offset: 352)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !289, file: !288, line: 121, baseType: !146, size: 8, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !289, file: !288, line: 123, baseType: !146, size: 8, offset: 392)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !289, file: !288, line: 123, baseType: !146, size: 8, offset: 400)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !289, file: !288, line: 124, baseType: !146, size: 8, offset: 408)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !289, file: !288, line: 124, baseType: !146, size: 8, offset: 416)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !289, file: !288, line: 124, baseType: !146, size: 8, offset: 424)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !289, file: !288, line: 126, baseType: !146, size: 8, offset: 432)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !289, file: !288, line: 128, baseType: !146, size: 8, offset: 440)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !289, file: !288, line: 129, baseType: !75, size: 32, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !289, file: !288, line: 130, baseType: !75, size: 32, offset: 480)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !289, file: !288, line: 130, baseType: !75, size: 32, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !289, file: !288, line: 132, baseType: !262, size: 32, offset: 544)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !240, file: !6, line: 446, baseType: !311, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !6, line: 430, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !6, line: 426, size: 128, elements: !314)
!314 = !{!315, !319, !320}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !313, file: !6, line: 427, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 2)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !6, line: 428, baseType: !78, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !313, file: !6, line: 429, baseType: !78, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !240, file: !6, line: 447, baseType: !7, size: 32, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !240, file: !6, line: 450, baseType: !75, size: 32, offset: 544)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !240, file: !6, line: 451, baseType: !105, size: 16, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !240, file: !6, line: 452, baseType: !105, size: 16, offset: 592)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !240, file: !6, line: 455, baseType: !78, size: 32, offset: 608)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !240, file: !6, line: 456, baseType: !327, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !240, file: !6, line: 459, baseType: !78, size: 32, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !240, file: !6, line: 460, baseType: !330, size: 96, offset: 736)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 96, elements: !331)
!331 = !{!294}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !240, file: !6, line: 462, baseType: !75, size: 32, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !240, file: !6, line: 462, baseType: !75, size: 32, offset: 864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_modifier", scope: !200, file: !29, line: 139, baseType: !335, size: 64, offset: 1408)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !239, !212, !74, !75}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_modifier_time_storage", scope: !200, file: !29, line: 142, baseType: !339, size: 64, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!75, !62, !239, !212, !75, !75}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_modifier_storage", scope: !200, file: !29, line: 143, baseType: !343, size: 64, offset: 1536)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !62, !239, !212, !74, !75}
!346 = !{!347}
!347 = !DISubrange(count: 10)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "FMI_GENERATOR", scope: !2, file: !3, line: 239, type: !199, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "FMI_FN_GENERATOR", scope: !2, file: !3, line: 363, type: !199, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "FMI_ENVELOPE", scope: !2, file: !3, line: 472, type: !199, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "FMI_CYCLES", scope: !2, file: !3, line: 762, type: !199, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "FMI_NOISE", scope: !2, file: !3, line: 823, type: !199, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "FMI_PYTHON", scope: !2, file: !3, line: 901, type: !199, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "FMI_LIMITS", scope: !2, file: !3, line: 946, type: !199, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "FMI_STEPPED", scope: !2, file: !3, line: 1001, type: !199, isLocal: true, isDefinition: true)
!364 = !{i32 7, !"Dwarf Version", i32 4}
!365 = !{i32 2, !"Debug Info Version", i32 3}
!366 = !{i32 1, !"wchar_size", i32 4}
!367 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!368 = distinct !DISubprogram(name: "BKE_fcm_envelope_find_index", scope: !3, file: !3, line: 496, type: !369, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !373)
!369 = !DISubroutineType(types: !370)
!370 = !{!78, !97, !75, !78, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!373 = !{}
!374 = !DILocalVariable(name: "array", arg: 1, scope: !368, file: !3, line: 496, type: !97)
!375 = !DILocation(line: 496, column: 50, scope: !368)
!376 = !DILocalVariable(name: "frame", arg: 2, scope: !368, file: !3, line: 496, type: !75)
!377 = !DILocation(line: 496, column: 65, scope: !368)
!378 = !DILocalVariable(name: "arraylen", arg: 3, scope: !368, file: !3, line: 496, type: !78)
!379 = !DILocation(line: 496, column: 76, scope: !368)
!380 = !DILocalVariable(name: "r_exists", arg: 4, scope: !368, file: !3, line: 496, type: !371)
!381 = !DILocation(line: 496, column: 92, scope: !368)
!382 = !DILocalVariable(name: "start", scope: !368, file: !3, line: 498, type: !78)
!383 = !DILocation(line: 498, column: 6, scope: !368)
!384 = !DILocalVariable(name: "end", scope: !368, file: !3, line: 498, type: !78)
!385 = !DILocation(line: 498, column: 17, scope: !368)
!386 = !DILocation(line: 498, column: 23, scope: !368)
!387 = !DILocalVariable(name: "loopbreaker", scope: !368, file: !3, line: 499, type: !78)
!388 = !DILocation(line: 499, column: 6, scope: !368)
!389 = !DILocalVariable(name: "maxloop", scope: !368, file: !3, line: 499, type: !78)
!390 = !DILocation(line: 499, column: 23, scope: !368)
!391 = !DILocation(line: 499, column: 33, scope: !368)
!392 = !DILocation(line: 499, column: 42, scope: !368)
