; ModuleID = 'blender/source/blender/bmesh/operators/bmo_mirror.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_mirror.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!52 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 76, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!69 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!110 = !{!111, !112, !113, !117, !121, !187, !189, !171}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !50, line: 79, baseType: !49)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !50, line: 158, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !111}
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !50, line: 159, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!111, !111}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !124)
!124 = !{!125, !136, !142, !147, !148}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !123, file: !43, line: 91, baseType: !126, size: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !128)
!128 = !{!129, !130, !132, !134, !135}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !43, line: 65, baseType: !111, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !127, file: !43, line: 66, baseType: !131, size: 32, offset: 64)
!131 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !127, file: !43, line: 73, baseType: !133, size: 8, offset: 96)
!133 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !127, file: !43, line: 74, baseType: !133, size: 8, offset: 104)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !127, file: !43, line: 80, baseType: !133, size: 8, offset: 112)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !123, file: !43, line: 92, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !138, file: !43, line: 181, baseType: !141, size: 16)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !123, file: !43, line: 94, baseType: !143, size: 96, offset: 192)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, elements: !145)
!144 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!145 = !{!146}
!146 = !DISubrange(count: 3)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !123, file: !43, line: 95, baseType: !143, size: 96, offset: 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !123, file: !43, line: 102, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !151)
!151 = !{!152, !153, !154, !156, !157, !180, !186}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !43, line: 111, baseType: !126, size: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !150, file: !43, line: 112, baseType: !137, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !150, file: !43, line: 114, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !150, file: !43, line: 114, baseType: !155, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !150, file: !43, line: 118, baseType: !158, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !160)
!160 = !{!161, !162, !163, !164, !176, !177, !178, !179}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !159, file: !43, line: 126, baseType: !126, size: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !159, file: !43, line: 129, baseType: !155, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !159, file: !43, line: 130, baseType: !149, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !159, file: !43, line: 131, baseType: !165, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !167)
!167 = !{!168, !169, !170, !173, !174, !175}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !166, file: !43, line: 165, baseType: !126, size: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !166, file: !43, line: 166, baseType: !137, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !166, file: !43, line: 172, baseType: !171, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !159)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !43, line: 174, baseType: !131, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !166, file: !43, line: 175, baseType: !143, size: 96, offset: 288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !166, file: !43, line: 176, baseType: !141, size: 16, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !159, file: !43, line: 135, baseType: !158, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !159, file: !43, line: 135, baseType: !158, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !43, line: 139, baseType: !158, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !159, file: !43, line: 139, baseType: !158, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !150, file: !43, line: 122, baseType: !181, size: 128, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !43, line: 107, baseType: !149, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !43, line: 107, baseType: !149, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !150, file: !43, line: 122, baseType: !181, size: 128, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !150)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !166)
!191 = !{i32 7, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{i32 1, !"wchar_size", i32 4}
!194 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!195 = distinct !DISubprogram(name: "bmo_mirror_exec", scope: !1, file: !1, line: 42, type: !196, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !340)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !338}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !214, !215, !216, !217, !219, !221, !223, !224, !225, !226, !227, !228, !229, !230, !282, !321, !322, !323, !324, !325, !326, !327, !328, !335, !336, !337}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !200, file: !43, line: 187, baseType: !131, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !200, file: !43, line: 187, baseType: !131, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !200, file: !43, line: 187, baseType: !131, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !200, file: !43, line: 187, baseType: !131, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !200, file: !43, line: 188, baseType: !131, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !200, file: !43, line: 188, baseType: !131, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !200, file: !43, line: 188, baseType: !131, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !200, file: !43, line: 193, baseType: !133, size: 8, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !200, file: !43, line: 197, baseType: !133, size: 8, offset: 232)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !200, file: !43, line: 201, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !67, line: 71, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !200, file: !43, line: 201, baseType: !212, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !200, file: !43, line: 201, baseType: !212, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !200, file: !43, line: 201, baseType: !212, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !200, file: !43, line: 208, baseType: !218, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !200, file: !43, line: 209, baseType: !220, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !200, file: !43, line: 210, baseType: !222, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !200, file: !43, line: 213, baseType: !131, size: 32, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !200, file: !43, line: 214, baseType: !131, size: 32, offset: 736)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !200, file: !43, line: 215, baseType: !131, size: 32, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !200, file: !43, line: 218, baseType: !212, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !200, file: !43, line: 218, baseType: !212, size: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !200, file: !43, line: 218, baseType: !212, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !200, file: !43, line: 220, baseType: !131, size: 32, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !200, file: !43, line: 221, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !233)
!233 = !{!234, !270, !271, !275, !278, !279, !281}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !232, file: !4, line: 191, baseType: !235, size: 5120)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 5120, elements: !268)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !237)
!237 = !{!238, !241, !243, !253, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !236, file: !4, line: 148, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !236, file: !4, line: 149, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !236, file: !4, line: 150, baseType: !244, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !246)
!246 = !{!247, !249, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !245, file: !4, line: 139, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !245, file: !4, line: 140, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !245, file: !4, line: 141, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !4, line: 152, baseType: !131, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !4, line: 162, baseType: !255, size: 128, offset: 192)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !4, line: 155, size: 128, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !263}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !255, file: !4, line: 156, baseType: !131, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !255, file: !4, line: 157, baseType: !144, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !255, file: !4, line: 158, baseType: !111, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !255, file: !4, line: 159, baseType: !143, size: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !255, file: !4, line: 160, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !255, file: !4, line: 161, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !266, line: 48, baseType: !267)
!266 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !266, line: 48, flags: DIFlagFwdDecl)
!268 = !{!269}
!269 = !DISubrange(count: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !232, file: !4, line: 192, baseType: !235, size: 5120, offset: 5120)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !232, file: !4, line: 193, baseType: !272, size: 64, offset: 10240)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !198, !231}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !232, file: !4, line: 194, baseType: !276, size: 64, offset: 10304)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !4, line: 195, baseType: !131, size: 32, offset: 10368)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !232, file: !4, line: 196, baseType: !280, size: 32, offset: 10400)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !232, file: !4, line: 197, baseType: !131, size: 32, offset: 10432)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !200, file: !43, line: 223, baseType: !283, size: 1600, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !67, line: 73, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !67, line: 64, size: 1600, elements: !285)
!285 = !{!286, !304, !308, !309, !310, !311, !312}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !284, file: !67, line: 65, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !67, line: 53, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !67, line: 42, size: 832, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !303}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !67, line: 43, baseType: !131, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !289, file: !67, line: 44, baseType: !131, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !289, file: !67, line: 45, baseType: !131, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !289, file: !67, line: 46, baseType: !131, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !289, file: !67, line: 47, baseType: !131, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !289, file: !67, line: 48, baseType: !131, size: 32, offset: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !289, file: !67, line: 49, baseType: !131, size: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !289, file: !67, line: 50, baseType: !131, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !67, line: 51, baseType: !300, size: 512, offset: 256)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 512, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !67, line: 52, baseType: !111, size: 64, offset: 768)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !284, file: !67, line: 66, baseType: !305, size: 1312, offset: 64)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 1312, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 41)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !284, file: !67, line: 69, baseType: !131, size: 32, offset: 1376)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !284, file: !67, line: 69, baseType: !131, size: 32, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !284, file: !67, line: 70, baseType: !131, size: 32, offset: 1440)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !284, file: !67, line: 71, baseType: !212, size: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !284, file: !67, line: 72, baseType: !313, size: 64, offset: 1536)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !67, line: 59, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !67, line: 57, size: 8192, elements: !316)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !315, file: !67, line: 58, baseType: !318, size: 8192)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 1024)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !200, file: !43, line: 223, baseType: !283, size: 1600, offset: 2752)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !200, file: !43, line: 223, baseType: !283, size: 1600, offset: 4352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !200, file: !43, line: 223, baseType: !283, size: 1600, offset: 5952)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !200, file: !43, line: 233, baseType: !141, size: 16, offset: 7552)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !200, file: !43, line: 236, baseType: !131, size: 32, offset: 7584)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !200, file: !43, line: 238, baseType: !131, size: 32, offset: 7616)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !200, file: !43, line: 238, baseType: !131, size: 32, offset: 7648)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !200, file: !43, line: 239, baseType: !329, size: 128, offset: 7680)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !330, line: 71, baseType: !331)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !330, line: 69, size: 128, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !331, file: !330, line: 70, baseType: !111, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !331, file: !330, line: 70, baseType: !111, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !200, file: !43, line: 241, baseType: !189, size: 64, offset: 7808)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !200, file: !43, line: 243, baseType: !329, size: 128, offset: 7872)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !200, file: !43, line: 245, baseType: !111, size: 64, offset: 8000)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !232)
!340 = !{}
!341 = !DILocalVariable(name: "bm", arg: 1, scope: !195, file: !1, line: 42, type: !198)
!342 = !DILocation(line: 42, column: 29, scope: !195)
!343 = !DILocalVariable(name: "op", arg: 2, scope: !195, file: !1, line: 42, type: !338)
!344 = !DILocation(line: 42, column: 45, scope: !195)
!345 = !DILocalVariable(name: "dupeop", scope: !195, file: !1, line: 44, type: !339)
!346 = !DILocation(line: 44, column: 13, scope: !195)
!347 = !DILocalVariable(name: "weldop", scope: !195, file: !1, line: 44, type: !339)
!348 = !DILocation(line: 44, column: 21, scope: !195)
!349 = !DILocalVariable(name: "siter", scope: !195, file: !1, line: 45, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !352)
!352 = !{!353, !356, !357, !366, !367}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !351, file: !4, line: 458, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !236)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !351, file: !4, line: 459, baseType: !131, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !351, file: !4, line: 460, baseType: !358, size: 192, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !266, line: 54, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !266, line: 50, size: 192, elements: !360)
!360 = !{!361, !362, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !359, file: !266, line: 51, baseType: !264, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !359, file: !266, line: 52, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !266, line: 52, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !359, file: !266, line: 53, baseType: !5, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !351, file: !4, line: 461, baseType: !262, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !351, file: !4, line: 462, baseType: !133, size: 8, offset: 384)
!368 = !DILocation(line: 45, column: 10, scope: !195)
!369 = !DILocalVariable(name: "iter", scope: !195, file: !1, line: 46, type: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !50, line: 186, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !50, line: 164, size: 512, elements: !372)
!372 = !{!373, !453, !454, !455, !456}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !50, line: 179, baseType: !374, size: 320)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !50, line: 166, size: 320, elements: !375)
!375 = !{!376, !391, !397, !405, !413, !419, !425, !431, !435, !441, !447}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !374, file: !50, line: 167, baseType: !377, size: 192)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !50, line: 113, size: 192, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !377, file: !50, line: 114, baseType: !380, size: 192)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !381, line: 80, baseType: !382)
!381 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !381, line: 76, size: 192, elements: !383)
!383 = !{!384, !387, !390}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !382, file: !381, line: 77, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !381, line: 47, baseType: !213)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !382, file: !381, line: 78, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !381, line: 45, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !382, file: !381, line: 79, baseType: !5, size: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !374, file: !50, line: 169, baseType: !392, size: 192)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !50, line: 116, size: 192, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !392, file: !50, line: 117, baseType: !121, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !392, file: !50, line: 118, baseType: !187, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !392, file: !50, line: 118, baseType: !187, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !374, file: !50, line: 170, baseType: !398, size: 320)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !50, line: 120, size: 320, elements: !399)
!399 = !{!400, !401, !402, !403, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !398, file: !50, line: 121, baseType: !121, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !398, file: !50, line: 122, baseType: !171, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !398, file: !50, line: 122, baseType: !171, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !398, file: !50, line: 123, baseType: !187, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !398, file: !50, line: 123, baseType: !187, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !374, file: !50, line: 171, baseType: !406, size: 320)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !50, line: 125, size: 320, elements: !407)
!407 = !{!408, !409, !410, !411, !412}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !406, file: !50, line: 126, baseType: !121, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !406, file: !50, line: 127, baseType: !171, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !406, file: !50, line: 127, baseType: !171, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !406, file: !50, line: 128, baseType: !187, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !406, file: !50, line: 128, baseType: !187, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !374, file: !50, line: 172, baseType: !414, size: 192)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !50, line: 130, size: 192, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !414, file: !50, line: 131, baseType: !187, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !414, file: !50, line: 132, baseType: !171, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !414, file: !50, line: 132, baseType: !171, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !374, file: !50, line: 173, baseType: !420, size: 192)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !50, line: 134, size: 192, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !420, file: !50, line: 135, baseType: !171, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !420, file: !50, line: 136, baseType: !171, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !420, file: !50, line: 136, baseType: !171, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !374, file: !50, line: 174, baseType: !426, size: 192)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !50, line: 138, size: 192, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !426, file: !50, line: 139, baseType: !187, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !426, file: !50, line: 140, baseType: !171, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !426, file: !50, line: 140, baseType: !171, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !374, file: !50, line: 175, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !50, line: 142, size: 64, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !432, file: !50, line: 143, baseType: !187, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !374, file: !50, line: 176, baseType: !436, size: 192)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !50, line: 145, size: 192, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !436, file: !50, line: 146, baseType: !189, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !436, file: !50, line: 147, baseType: !171, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !436, file: !50, line: 147, baseType: !171, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !374, file: !50, line: 177, baseType: !442, size: 192)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !50, line: 149, size: 192, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !442, file: !50, line: 150, baseType: !189, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !442, file: !50, line: 151, baseType: !171, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !442, file: !50, line: 151, baseType: !171, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !374, file: !50, line: 178, baseType: !448, size: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !50, line: 153, size: 192, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !448, file: !50, line: 154, baseType: !189, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !448, file: !50, line: 155, baseType: !171, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !448, file: !50, line: 155, baseType: !171, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !371, file: !50, line: 181, baseType: !113, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !371, file: !50, line: 182, baseType: !117, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !371, file: !50, line: 184, baseType: !131, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !371, file: !50, line: 185, baseType: !133, size: 8, offset: 480)
!457 = !DILocation(line: 46, column: 9, scope: !195)
!458 = !DILocalVariable(name: "v", scope: !195, file: !1, line: 47, type: !121)
!459 = !DILocation(line: 47, column: 10, scope: !195)
!460 = !DILocalVariable(name: "vmap", scope: !195, file: !1, line: 47, type: !218)
!461 = !DILocation(line: 47, column: 15, scope: !195)
!462 = !DILocalVariable(name: "vmap_size", scope: !195, file: !1, line: 48, type: !131)
!463 = !DILocation(line: 48, column: 6, scope: !195)
!464 = !DILocalVariable(name: "mtx", scope: !195, file: !1, line: 49, type: !465)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 512, elements: !466)
!466 = !{!467, !467}
!467 = !DISubrange(count: 4)
!468 = !DILocation(line: 49, column: 8, scope: !195)
!469 = !DILocalVariable(name: "imtx", scope: !195, file: !1, line: 50, type: !465)
!470 = !DILocation(line: 50, column: 8, scope: !195)
!471 = !DILocalVariable(name: "scale", scope: !195, file: !1, line: 51, type: !143)
!472 = !DILocation(line: 51, column: 8, scope: !195)
!473 = !DILocalVariable(name: "dist", scope: !195, file: !1, line: 52, type: !144)
!474 = !DILocation(line: 52, column: 8, scope: !195)
!475 = !DILocation(line: 52, column: 34, scope: !195)
!476 = !DILocation(line: 52, column: 38, scope: !195)
!477 = !DILocation(line: 52, column: 15, scope: !195)
!478 = !DILocalVariable(name: "i", scope: !195, file: !1, line: 53, type: !131)
!479 = !DILocation(line: 53, column: 6, scope: !195)
!480 = !DILocalVariable(name: "ototvert", scope: !195, file: !1, line: 53, type: !131)
!481 = !DILocation(line: 53, column: 9, scope: !195)
!482 = !DILocalVariable(name: "axis", scope: !195, file: !1, line: 54, type: !131)
!483 = !DILocation(line: 54, column: 6, scope: !195)
!484 = !DILocation(line: 54, column: 30, scope: !195)
!485 = !DILocation(line: 54, column: 34, scope: !195)
!486 = !DILocation(line: 54, column: 13, scope: !195)
!487 = !DILocalVariable(name: "mirror_u", scope: !195, file: !1, line: 55, type: !488)
!488 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!489 = !DILocation(line: 55, column: 7, scope: !195)
!490 = !DILocation(line: 55, column: 36, scope: !195)
!491 = !DILocation(line: 55, column: 40, scope: !195)
!492 = !DILocation(line: 55, column: 18, scope: !195)
!493 = !DILocalVariable(name: "mirror_v", scope: !195, file: !1, line: 56, type: !488)
!494 = !DILocation(line: 56, column: 7, scope: !195)
!495 = !DILocation(line: 56, column: 36, scope: !195)
!496 = !DILocation(line: 56, column: 40, scope: !195)
!497 = !DILocation(line: 56, column: 18, scope: !195)
!498 = !DILocalVariable(name: "slot_targetmap", scope: !195, file: !1, line: 57, type: !354)
!499 = !DILocation(line: 57, column: 12, scope: !195)
!500 = !DILocation(line: 59, column: 13, scope: !195)
!501 = !DILocation(line: 59, column: 17, scope: !195)
!502 = !DILocation(line: 59, column: 11, scope: !195)
!503 = !DILocation(line: 61, column: 20, scope: !195)
!504 = !DILocation(line: 61, column: 24, scope: !195)
!505 = !DILocation(line: 61, column: 44, scope: !195)
!506 = !DILocation(line: 61, column: 2, scope: !195)
!507 = !DILocation(line: 62, column: 15, scope: !195)
!508 = !DILocation(line: 62, column: 21, scope: !195)
!509 = !DILocation(line: 62, column: 2, scope: !195)
!510 = !DILocation(line: 64, column: 15, scope: !195)
!511 = !DILocation(line: 64, column: 28, scope: !195)
!512 = !DILocation(line: 64, column: 32, scope: !195)
!513 = !DILocation(line: 64, column: 59, scope: !195)
!514 = !DILocation(line: 64, column: 2, scope: !195)
!515 = !DILocation(line: 65, column: 14, scope: !195)
!516 = !DILocation(line: 65, column: 2, scope: !195)
!517 = !DILocation(line: 67, column: 30, scope: !195)
!518 = !DILocation(line: 67, column: 41, scope: !195)
!519 = !DILocation(line: 67, column: 34, scope: !195)
!520 = !DILocation(line: 67, column: 2, scope: !195)
!521 = !DILocation(line: 70, column: 35, scope: !195)
!522 = !DILocation(line: 70, column: 28, scope: !195)
!523 = !DILocation(line: 70, column: 9, scope: !195)
!524 = !DILocation(line: 70, column: 7, scope: !195)
!525 = !DILocation(line: 73, column: 8, scope: !195)
!526 = !DILocation(line: 73, column: 2, scope: !195)
!527 = !DILocation(line: 73, column: 14, scope: !195)
!528 = !DILocation(line: 74, column: 15, scope: !195)
!529 = !DILocation(line: 74, column: 19, scope: !195)
!530 = !DILocation(line: 74, column: 23, scope: !195)
!531 = !DILocation(line: 74, column: 72, scope: !195)
!532 = !DILocation(line: 74, column: 2, scope: !195)
!533 = !DILocation(line: 75, column: 15, scope: !195)
!534 = !DILocation(line: 75, column: 19, scope: !195)
!535 = !DILocation(line: 75, column: 23, scope: !195)
!536 = !DILocation(line: 75, column: 64, scope: !195)
!537 = !DILocation(line: 75, column: 2, scope: !195)
!538 = !DILocation(line: 76, column: 15, scope: !195)
!539 = !DILocation(line: 76, column: 19, scope: !195)
!540 = !DILocation(line: 76, column: 23, scope: !195)
!541 = !DILocation(line: 76, column: 72, scope: !195)
!542 = !DILocation(line: 76, column: 2, scope: !195)
!543 = !DILocation(line: 78, column: 14, scope: !195)
!544 = !DILocation(line: 78, column: 27, scope: !195)
!545 = !DILocation(line: 78, column: 31, scope: !195)
!546 = !DILocation(line: 78, column: 2, scope: !195)
!547 = !DILocation(line: 80, column: 39, scope: !195)
!548 = !DILocation(line: 80, column: 32, scope: !195)
!549 = !DILocation(line: 80, column: 19, scope: !195)
!550 = !DILocation(line: 80, column: 17, scope: !195)
!551 = !DILocation(line: 82, column: 25, scope: !195)
!552 = !DILocation(line: 82, column: 6, scope: !195)
!553 = !DILocation(line: 82, column: 4, scope: !195)
!554 = !DILocation(line: 83, column: 9, scope: !555)
!555 = distinct !DILexicalBlock(scope: !195, file: !1, line: 83, column: 2)
!556 = !DILocation(line: 83, column: 7, scope: !555)
!557 = !DILocation(line: 83, column: 14, scope: !558)
!558 = distinct !DILexicalBlock(scope: !555, file: !1, line: 83, column: 2)
!559 = !DILocation(line: 83, column: 18, scope: !558)
!560 = !DILocation(line: 83, column: 16, scope: !558)
!561 = !DILocation(line: 83, column: 2, scope: !555)
!562 = !DILocation(line: 84, column: 13, scope: !563)
!563 = distinct !DILexicalBlock(scope: !564, file: !1, line: 84, column: 7)
!564 = distinct !DILexicalBlock(scope: !558, file: !1, line: 83, column: 33)
!565 = !DILocation(line: 84, column: 16, scope: !563)
!566 = !DILocation(line: 84, column: 19, scope: !563)
!567 = !DILocation(line: 84, column: 7, scope: !563)
!568 = !DILocation(line: 84, column: 29, scope: !563)
!569 = !DILocation(line: 84, column: 26, scope: !563)
!570 = !DILocation(line: 84, column: 7, scope: !564)
!571 = !DILocation(line: 86, column: 38, scope: !572)
!572 = distinct !DILexicalBlock(scope: !563, file: !1, line: 84, column: 35)
!573 = !DILocation(line: 86, column: 54, scope: !572)
!574 = !DILocation(line: 86, column: 59, scope: !572)
!575 = !DILocation(line: 86, column: 63, scope: !572)
!576 = !DILocation(line: 86, column: 4, scope: !572)
!577 = !DILocation(line: 87, column: 3, scope: !572)
!578 = !DILocation(line: 88, column: 7, scope: !564)
!579 = !DILocation(line: 88, column: 5, scope: !564)
!580 = !DILocation(line: 89, column: 2, scope: !564)
!581 = !DILocation(line: 83, column: 29, scope: !558)
!582 = !DILocation(line: 83, column: 2, scope: !558)
!583 = distinct !{!583, !561, !584}
!584 = !DILocation(line: 89, column: 2, scope: !555)
!585 = !DILocation(line: 91, column: 6, scope: !586)
!586 = distinct !DILexicalBlock(scope: !195, file: !1, line: 91, column: 6)
!587 = !DILocation(line: 91, column: 15, scope: !586)
!588 = !DILocation(line: 91, column: 18, scope: !586)
!589 = !DILocation(line: 91, column: 6, scope: !195)
!590 = !DILocalVariable(name: "f", scope: !591, file: !1, line: 92, type: !189)
!591 = distinct !DILexicalBlock(scope: !586, file: !1, line: 91, column: 28)
!592 = !DILocation(line: 92, column: 11, scope: !591)
!593 = !DILocalVariable(name: "l", scope: !591, file: !1, line: 93, type: !171)
!594 = !DILocation(line: 93, column: 11, scope: !591)
!595 = !DILocalVariable(name: "luv", scope: !591, file: !1, line: 94, type: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLoopUV", file: !598, line: 112, baseType: !599)
!598 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !598, line: 109, size: 96, elements: !600)
!600 = !{!601, !605}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !599, file: !598, line: 110, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 2)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !599, file: !598, line: 111, baseType: !131, size: 32, offset: 64)
!606 = !DILocation(line: 94, column: 12, scope: !591)
!607 = !DILocalVariable(name: "totlayer", scope: !591, file: !1, line: 95, type: !608)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!609 = !DILocation(line: 95, column: 13, scope: !591)
!610 = !DILocation(line: 95, column: 53, scope: !591)
!611 = !DILocation(line: 95, column: 57, scope: !591)
!612 = !DILocation(line: 95, column: 24, scope: !591)
!613 = !DILocalVariable(name: "liter", scope: !591, file: !1, line: 96, type: !370)
!614 = !DILocation(line: 96, column: 10, scope: !591)
!615 = !DILocation(line: 98, column: 3, scope: !616)
!616 = distinct !DILexicalBlock(scope: !591, file: !1, line: 98, column: 3)
!617 = !DILocation(line: 98, column: 3, scope: !618)
!618 = distinct !DILexicalBlock(scope: !616, file: !1, line: 98, column: 3)
!619 = !DILocation(line: 99, column: 4, scope: !620)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 99, column: 4)
!621 = distinct !DILexicalBlock(scope: !618, file: !1, line: 98, column: 63)
!622 = !DILocation(line: 99, column: 4, scope: !623)
!623 = distinct !DILexicalBlock(scope: !620, file: !1, line: 99, column: 4)
!624 = !DILocation(line: 100, column: 12, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !1, line: 100, column: 5)
!626 = distinct !DILexicalBlock(scope: !623, file: !1, line: 99, column: 50)
!627 = !DILocation(line: 100, column: 10, scope: !625)
!628 = !DILocation(line: 100, column: 17, scope: !629)
!629 = distinct !DILexicalBlock(scope: !625, file: !1, line: 100, column: 5)
!630 = !DILocation(line: 100, column: 21, scope: !629)
!631 = !DILocation(line: 100, column: 19, scope: !629)
!632 = !DILocation(line: 100, column: 5, scope: !625)
!633 = !DILocation(line: 101, column: 36, scope: !634)
!634 = distinct !DILexicalBlock(scope: !629, file: !1, line: 100, column: 36)
!635 = !DILocation(line: 101, column: 40, scope: !634)
!636 = !DILocation(line: 101, column: 47, scope: !634)
!637 = !DILocation(line: 101, column: 50, scope: !634)
!638 = !DILocation(line: 101, column: 55, scope: !634)
!639 = !DILocation(line: 101, column: 73, scope: !634)
!640 = !DILocation(line: 101, column: 12, scope: !634)
!641 = !DILocation(line: 101, column: 10, scope: !634)
!642 = !DILocation(line: 102, column: 10, scope: !643)
!643 = distinct !DILexicalBlock(scope: !634, file: !1, line: 102, column: 10)
!644 = !DILocation(line: 102, column: 10, scope: !634)
!645 = !DILocation(line: 103, column: 27, scope: !643)
!646 = !DILocation(line: 103, column: 32, scope: !643)
!647 = !DILocation(line: 103, column: 25, scope: !643)
!648 = !DILocation(line: 103, column: 7, scope: !643)
!649 = !DILocation(line: 103, column: 12, scope: !643)
!650 = !DILocation(line: 103, column: 18, scope: !643)
!651 = !DILocation(line: 104, column: 10, scope: !652)
!652 = distinct !DILexicalBlock(scope: !634, file: !1, line: 104, column: 10)
!653 = !DILocation(line: 104, column: 10, scope: !634)
!654 = !DILocation(line: 105, column: 27, scope: !652)
!655 = !DILocation(line: 105, column: 32, scope: !652)
!656 = !DILocation(line: 105, column: 25, scope: !652)
!657 = !DILocation(line: 105, column: 7, scope: !652)
!658 = !DILocation(line: 105, column: 12, scope: !652)
!659 = !DILocation(line: 105, column: 18, scope: !652)
!660 = !DILocation(line: 106, column: 5, scope: !634)
!661 = !DILocation(line: 100, column: 32, scope: !629)
!662 = !DILocation(line: 100, column: 5, scope: !629)
!663 = distinct !{!663, !632, !664}
!664 = !DILocation(line: 106, column: 5, scope: !625)
!665 = !DILocation(line: 107, column: 4, scope: !626)
!666 = distinct !{!666, !619, !667}
!667 = !DILocation(line: 107, column: 4, scope: !620)
!668 = !DILocation(line: 108, column: 3, scope: !621)
!669 = distinct !{!669, !615, !670}
!670 = !DILocation(line: 108, column: 3, scope: !616)
!671 = !DILocation(line: 109, column: 2, scope: !591)
