; ModuleID = 'blender/source/blender/editors/space_console/console_ops.c'
source_filename = "blender/source/blender/editors/space_console/console_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!38 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!47 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!48 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 71, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58}
!51 = !DIEnumerator(name: "DEL_ALL", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "DEL_NEXT_CHAR", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "DEL_PREV_CHAR", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "DEL_NEXT_WORD", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "DEL_PREV_WORD", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "DEL_SELECTION", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "DEL_NEXT_SEL", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "DEL_PREV_SEL", value: 7, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eConsoleLine_Type", file: !60, line: 1029, baseType: !7, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "CONSOLE_LINE_OUTPUT", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "CONSOLE_LINE_INPUT", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "CONSOLE_LINE_INFO", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "CONSOLE_LINE_ERROR", value: 3, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strCursorJumpDirection", file: !67, line: 39, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/blenlib/BLI_string_cursor_utf8.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "STRCUR_DIR_PREV", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "STRCUR_DIR_NEXT", value: 1, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strCursorJumpType", file: !67, line: 33, baseType: !7, size: 32, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIEnumerator(name: "STRCUR_JUMP_NONE", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "STRCUR_JUMP_DELIM", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "STRCUR_JUMP_ALL", value: 2, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 351, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!84 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 141, baseType: !7, size: 32, elements: !87)
!86 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!88 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!92 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!94 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!95 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!96 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!97 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!98 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!99 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!100 = !{!101, !102, !103}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConsoleLine", file: !60, line: 1026, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ConsoleLine", file: !60, line: 1016, size: 320, elements: !106)
!106 = !{!107, !109, !110, !112, !113, !116, !117}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !60, line: 1017, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !105, file: !60, line: 1017, baseType: !108, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "len_alloc", scope: !105, file: !60, line: 1020, baseType: !111, size: 32, offset: 128)
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !105, file: !60, line: 1021, baseType: !111, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !105, file: !60, line: 1022, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !105, file: !60, line: 1024, baseType: !111, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !60, line: 1025, baseType: !111, size: 32, offset: 288)
!118 = !{!119, !0, !1660}
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "console_line_type_items", scope: !121, file: !3, line: 864, type: !1651, isLocal: true, isDefinition: true)
!121 = distinct !DISubprogram(name: "CONSOLE_OT_scrollback_append", scope: !3, file: !3, line: 861, type: !122, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1650)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !86, line: 568, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !86, line: 508, size: 1536, elements: !127)
!127 = !{!128, !131, !132, !133, !134, !1576, !1580, !1586, !1590, !1591, !1595, !1596, !1597, !1598, !1602, !1603, !1618, !1619, !1623, !1649}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !86, line: 509, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !126, file: !86, line: 510, baseType: !129, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !126, file: !86, line: 511, baseType: !129, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !126, file: !86, line: 512, baseType: !129, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !126, file: !86, line: 518, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!111, !138, !140}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !16, line: 44, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !77, line: 328, size: 1344, elements: !142)
!142 = !{!143, !144, !145, !149, !180, !182, !183, !184, !196, !1569, !1570, !1571, !1574, !1575}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !77, line: 329, baseType: !140, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !77, line: 329, baseType: !140, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !141, file: !77, line: 332, baseType: !146, size: 512, offset: 128)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !141, file: !77, line: 333, baseType: !150, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !152, line: 75, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !152, line: 62, size: 1024, elements: !154)
!154 = !{!155, !157, !158, !159, !160, !162, !163, !164, !178, !179}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !152, line: 63, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !152, line: 63, baseType: !156, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !152, line: 64, baseType: !115, size: 8, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !153, file: !152, line: 64, baseType: !115, size: 8, offset: 136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !152, line: 65, baseType: !161, size: 16, offset: 144)
!161 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !152, line: 66, baseType: !146, size: 512, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !153, file: !152, line: 67, baseType: !111, size: 32, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !152, line: 69, baseType: !165, size: 256, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !152, line: 60, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !152, line: 48, size: 256, elements: !167)
!167 = !{!168, !169, !176, !177}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !166, file: !152, line: 49, baseType: !101, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !166, file: !152, line: 58, baseType: !170, size: 128, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !171, line: 71, baseType: !172)
!171 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !171, line: 69, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !172, file: !171, line: 70, baseType: !101, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !172, file: !171, line: 70, baseType: !101, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !166, file: !152, line: 59, baseType: !111, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !166, file: !152, line: 59, baseType: !111, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !153, file: !152, line: 70, baseType: !111, size: 32, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !153, file: !152, line: 74, baseType: !111, size: 32, offset: 992)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !77, line: 336, baseType: !181, size: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !141, file: !77, line: 337, baseType: !101, size: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !141, file: !77, line: 338, baseType: !101, size: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !141, file: !77, line: 340, baseType: !185, size: 64, offset: 896)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !16, line: 55, size: 192, elements: !187)
!187 = !{!188, !192, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !16, line: 58, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !16, line: 56, size: 64, elements: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !189, file: !16, line: 57, baseType: !101, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !16, line: 60, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !16, line: 41, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !16, line: 61, baseType: !101, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !141, file: !77, line: 341, baseType: !197, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !77, line: 106, size: 320, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !198, file: !77, line: 107, baseType: !170, size: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !198, file: !77, line: 108, baseType: !111, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !198, file: !77, line: 109, baseType: !111, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !77, line: 110, baseType: !111, size: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !198, file: !77, line: 110, baseType: !111, size: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !198, file: !77, line: 111, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !86, line: 490, size: 768, elements: !208)
!208 = !{!209, !210, !211, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !86, line: 491, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !207, file: !86, line: 491, baseType: !206, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !207, file: !86, line: 493, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !77, line: 169, size: 2048, elements: !214)
!214 = !{!215, !216, !217, !218, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1535, !1538, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !77, line: 170, baseType: !212, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !213, file: !77, line: 170, baseType: !212, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !213, file: !77, line: 172, baseType: !101, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !213, file: !77, line: 174, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !221, line: 49, size: 1984, elements: !222)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !{!223, !259, !260, !261, !262, !263, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !220, file: !221, line: 50, baseType: !224, size: 960)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !152, line: 130, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !152, line: 117, size: 960, elements: !226)
!226 = !{!227, !228, !229, !231, !250, !254, !255, !256, !257, !258}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !152, line: 118, baseType: !101, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !152, line: 118, baseType: !101, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !225, file: !152, line: 119, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !225, file: !152, line: 120, baseType: !232, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !152, line: 136, size: 17600, elements: !234)
!234 = !{!235, !236, !238, !241, !245, !246, !247}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !233, file: !152, line: 137, baseType: !224, size: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !233, file: !152, line: 138, baseType: !237, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !233, file: !152, line: 139, baseType: !239, size: 64, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !152, line: 43, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !152, line: 140, baseType: !242, size: 8192, offset: 1088)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8192, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !233, file: !152, line: 141, baseType: !242, size: 8192, offset: 9280)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !233, file: !152, line: 148, baseType: !232, size: 64, offset: 17472)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !233, file: !152, line: 150, baseType: !248, size: 64, offset: 17536)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !152, line: 45, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !152, line: 121, baseType: !251, size: 528, offset: 256)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 528, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 66)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !152, line: 126, baseType: !161, size: 16, offset: 784)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !225, file: !152, line: 127, baseType: !111, size: 32, offset: 800)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !225, file: !152, line: 128, baseType: !111, size: 32, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !225, file: !152, line: 128, baseType: !111, size: 32, offset: 864)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !225, file: !152, line: 129, baseType: !150, size: 64, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !220, file: !221, line: 52, baseType: !170, size: 128, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !220, file: !221, line: 53, baseType: !170, size: 128, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !220, file: !221, line: 54, baseType: !170, size: 128, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !220, file: !221, line: 55, baseType: !170, size: 128, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !220, file: !221, line: 57, baseType: !264, size: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !266, line: 1216, size: 39680, elements: !267)
!266 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!267 = !{!268, !269, !273, !276, !279, !280, !281, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !310, !387, !824, !1039, !1042, !1330, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1352, !1353, !1354, !1355, !1356, !1364, !1431, !1438, !1439, !1446, !1447, !1453, !1454, !1455, !1456, !1457}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !265, file: !266, line: 1217, baseType: !224, size: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !265, file: !266, line: 1218, baseType: !270, size: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !272, line: 45, flags: DIFlagFwdDecl)
!272 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !265, file: !266, line: 1220, baseType: !274, size: 64, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !272, line: 49, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !265, file: !266, line: 1221, baseType: !277, size: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !266, line: 52, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !265, file: !266, line: 1223, baseType: !264, size: 64, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !265, file: !266, line: 1225, baseType: !170, size: 128, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !265, file: !266, line: 1226, baseType: !282, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !266, line: 69, size: 320, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !266, line: 70, baseType: !282, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !266, line: 70, baseType: !282, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !283, file: !266, line: 71, baseType: !7, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !283, file: !266, line: 71, baseType: !7, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !266, line: 72, baseType: !111, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !283, file: !266, line: 73, baseType: !161, size: 16, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !283, file: !266, line: 73, baseType: !161, size: 16, offset: 240)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !283, file: !266, line: 74, baseType: !274, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !265, file: !266, line: 1227, baseType: !274, size: 64, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !265, file: !266, line: 1229, baseType: !295, size: 96, offset: 1472)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 96, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 3)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !265, file: !266, line: 1230, baseType: !295, size: 96, offset: 1568)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !265, file: !266, line: 1231, baseType: !295, size: 96, offset: 1664)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !265, file: !266, line: 1231, baseType: !295, size: 96, offset: 1760)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !265, file: !266, line: 1233, baseType: !7, size: 32, offset: 1856)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !265, file: !266, line: 1234, baseType: !111, size: 32, offset: 1888)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !265, file: !266, line: 1235, baseType: !7, size: 32, offset: 1920)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !266, line: 1237, baseType: !161, size: 16, offset: 1952)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !265, file: !266, line: 1239, baseType: !115, size: 8, offset: 1968)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !265, file: !266, line: 1240, baseType: !307, size: 8, offset: 1976)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 1)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !265, file: !266, line: 1242, baseType: !311, size: 64, offset: 1984)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !313, line: 328, size: 3456, elements: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !{!315, !316, !317, !320, !321, !322, !326, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !353, !354, !355, !358, !363, !364, !367, !371, !375, !379, !383, !384, !385, !386}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !312, file: !313, line: 329, baseType: !224, size: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !312, file: !313, line: 330, baseType: !270, size: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !312, file: !313, line: 332, baseType: !318, size: 64, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !313, line: 332, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !312, file: !313, line: 333, baseType: !146, size: 512, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !312, file: !313, line: 335, baseType: !193, size: 64, offset: 1600)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !312, file: !313, line: 337, baseType: !323, size: 64, offset: 1664)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !325, line: 45, flags: DIFlagFwdDecl)
!325 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !312, file: !313, line: 338, baseType: !327, size: 64, offset: 1728)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 64, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 2)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !312, file: !313, line: 340, baseType: !170, size: 128, offset: 1792)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !312, file: !313, line: 340, baseType: !170, size: 128, offset: 1920)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !313, line: 342, baseType: !111, size: 32, offset: 2048)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !312, file: !313, line: 342, baseType: !111, size: 32, offset: 2080)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !312, file: !313, line: 343, baseType: !111, size: 32, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !313, line: 345, baseType: !111, size: 32, offset: 2144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !312, file: !313, line: 346, baseType: !111, size: 32, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !312, file: !313, line: 347, baseType: !161, size: 16, offset: 2208)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !312, file: !313, line: 348, baseType: !161, size: 16, offset: 2224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !312, file: !313, line: 349, baseType: !111, size: 32, offset: 2240)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !312, file: !313, line: 351, baseType: !111, size: 32, offset: 2272)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !312, file: !313, line: 353, baseType: !161, size: 16, offset: 2304)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !312, file: !313, line: 354, baseType: !161, size: 16, offset: 2320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !312, file: !313, line: 355, baseType: !111, size: 32, offset: 2336)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !312, file: !313, line: 357, baseType: !345, size: 128, offset: 2368)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !346, line: 95, baseType: !347)
!346 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !346, line: 92, size: 128, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !347, file: !346, line: 93, baseType: !102, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !347, file: !346, line: 93, baseType: !102, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !347, file: !346, line: 94, baseType: !102, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !347, file: !346, line: 94, baseType: !102, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !312, file: !313, line: 363, baseType: !170, size: 128, offset: 2496)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !312, file: !313, line: 363, baseType: !170, size: 128, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !312, file: !313, line: 368, baseType: !356, size: 64, offset: 2752)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !313, line: 48, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !312, file: !313, line: 372, baseType: !359, size: 32, offset: 2816)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !313, line: 274, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !313, line: 271, size: 32, elements: !361)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !360, file: !313, line: 273, baseType: !7, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !312, file: !313, line: 373, baseType: !111, size: 32, offset: 2848)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !312, file: !313, line: 382, baseType: !365, size: 64, offset: 2880)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !313, line: 46, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !312, file: !313, line: 385, baseType: !368, size: 64, offset: 2944)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !101, !102}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !312, file: !313, line: 386, baseType: !372, size: 64, offset: 3008)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !101, !114}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !312, file: !313, line: 387, baseType: !376, size: 64, offset: 3072)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!111, !101}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !312, file: !313, line: 388, baseType: !380, size: 64, offset: 3136)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !101}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !312, file: !313, line: 389, baseType: !101, size: 64, offset: 3200)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !312, file: !313, line: 389, baseType: !101, size: 64, offset: 3264)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !312, file: !313, line: 389, baseType: !101, size: 64, offset: 3328)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !312, file: !313, line: 389, baseType: !101, size: 64, offset: 3392)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !265, file: !266, line: 1244, baseType: !388, size: 64, offset: 2048)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !390, line: 200, size: 17024, elements: !391)
!390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!391 = !{!392, !394, !395, !396, !817, !818, !819, !820, !821, !822, !823}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !389, file: !390, line: 201, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !389, file: !390, line: 202, baseType: !170, size: 128, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !389, file: !390, line: 203, baseType: !170, size: 128, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !389, file: !390, line: 206, baseType: !397, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !390, line: 190, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !390, line: 126, size: 2816, elements: !400)
!400 = !{!401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !500, !503, !504, !505, !788, !792, !793, !794, !795, !796, !797, !798, !799, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !816}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !390, line: 127, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !390, line: 127, baseType: !402, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !399, file: !390, line: 128, baseType: !101, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !399, file: !390, line: 129, baseType: !101, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !390, line: 130, baseType: !146, size: 512, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !390, line: 132, baseType: !111, size: 32, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !399, file: !390, line: 132, baseType: !111, size: 32, offset: 800)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !399, file: !390, line: 133, baseType: !111, size: 32, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !399, file: !390, line: 134, baseType: !111, size: 32, offset: 864)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !399, file: !390, line: 134, baseType: !111, size: 32, offset: 896)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !399, file: !390, line: 134, baseType: !111, size: 32, offset: 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !399, file: !390, line: 135, baseType: !111, size: 32, offset: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !399, file: !390, line: 135, baseType: !111, size: 32, offset: 992)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !399, file: !390, line: 136, baseType: !111, size: 32, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !399, file: !390, line: 136, baseType: !111, size: 32, offset: 1056)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !399, file: !390, line: 137, baseType: !111, size: 32, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !399, file: !390, line: 137, baseType: !111, size: 32, offset: 1120)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !399, file: !390, line: 138, baseType: !102, size: 32, offset: 1152)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !399, file: !390, line: 139, baseType: !102, size: 32, offset: 1184)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !399, file: !390, line: 139, baseType: !102, size: 32, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !399, file: !390, line: 141, baseType: !161, size: 16, offset: 1248)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !399, file: !390, line: 142, baseType: !161, size: 16, offset: 1264)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !399, file: !390, line: 143, baseType: !111, size: 32, offset: 1280)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !399, file: !390, line: 144, baseType: !111, size: 32, offset: 1312)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !399, file: !390, line: 146, baseType: !427, size: 64, offset: 1344)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !390, line: 114, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !390, line: 99, size: 7232, elements: !430)
!430 = !{!431, !433, !434, !435, !436, !437, !438, !449, !453, !468, !477, !484, !494}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !390, line: 100, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !390, line: 100, baseType: !432, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !429, file: !390, line: 101, baseType: !111, size: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !429, file: !390, line: 101, baseType: !111, size: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !429, file: !390, line: 102, baseType: !111, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !429, file: !390, line: 102, baseType: !111, size: 32, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !429, file: !390, line: 103, baseType: !439, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !390, line: 59, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !390, line: 56, size: 2112, elements: !442)
!442 = !{!443, !447, !448}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !390, line: 57, baseType: !444, size: 2048)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !441, file: !390, line: 58, baseType: !111, size: 32, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !441, file: !390, line: 58, baseType: !111, size: 32, offset: 2080)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !429, file: !390, line: 106, baseType: !450, size: 6144, offset: 320)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 6144, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 768)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !429, file: !390, line: 107, baseType: !454, size: 64, offset: 6464)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !390, line: 97, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !390, line: 83, size: 8320, elements: !457)
!457 = !{!458, !459, !460, !464, !465, !466, !467}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !456, file: !390, line: 84, baseType: !450, size: 6144)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !456, file: !390, line: 87, baseType: !444, size: 2048, offset: 6144)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !456, file: !390, line: 88, baseType: !461, size: 64, offset: 8192)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !463, line: 41, flags: DIFlagFwdDecl)
!463 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !456, file: !390, line: 90, baseType: !161, size: 16, offset: 8256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !456, file: !390, line: 92, baseType: !161, size: 16, offset: 8272)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !456, file: !390, line: 93, baseType: !161, size: 16, offset: 8288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !456, file: !390, line: 95, baseType: !161, size: 16, offset: 8304)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !429, file: !390, line: 108, baseType: !469, size: 64, offset: 6528)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !390, line: 66, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !390, line: 61, size: 128, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !471, file: !390, line: 62, baseType: !111, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !471, file: !390, line: 63, baseType: !111, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !471, file: !390, line: 64, baseType: !111, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !471, file: !390, line: 65, baseType: !111, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !429, file: !390, line: 109, baseType: !478, size: 64, offset: 6592)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !390, line: 71, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !390, line: 68, size: 64, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !480, file: !390, line: 69, baseType: !111, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !480, file: !390, line: 70, baseType: !111, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !429, file: !390, line: 110, baseType: !485, size: 64, offset: 6656)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !390, line: 81, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !390, line: 73, size: 352, elements: !488)
!488 = !{!489, !490, !491, !492, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !487, file: !390, line: 74, baseType: !295, size: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !487, file: !390, line: 75, baseType: !295, size: 96, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !487, file: !390, line: 76, baseType: !295, size: 96, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !390, line: 77, baseType: !111, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !487, file: !390, line: 78, baseType: !111, size: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !429, file: !390, line: 113, baseType: !495, size: 512, offset: 6720)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !496, line: 182, baseType: !497)
!496 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !496, line: 180, size: 512, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !497, file: !496, line: 181, baseType: !146, size: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !399, file: !390, line: 148, baseType: !501, size: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !272, line: 46, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !399, file: !390, line: 151, baseType: !264, size: 64, offset: 1472)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !399, file: !390, line: 152, baseType: !274, size: 64, offset: 1536)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !399, file: !390, line: 153, baseType: !506, size: 64, offset: 1600)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !508, line: 64, size: 19136, elements: !509)
!508 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!509 = !{!510, !511, !512, !513, !514, !515, !517, !518, !519, !520, !523, !524, !774, !775, !783, !784, !785, !786, !787}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !507, file: !508, line: 65, baseType: !224, size: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !507, file: !508, line: 66, baseType: !270, size: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !507, file: !508, line: 68, baseType: !242, size: 8192, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !507, file: !508, line: 70, baseType: !111, size: 32, offset: 9216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !507, file: !508, line: 71, baseType: !111, size: 32, offset: 9248)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !507, file: !508, line: 72, baseType: !516, size: 64, offset: 9280)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 64, elements: !328)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !507, file: !508, line: 74, baseType: !102, size: 32, offset: 9344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !507, file: !508, line: 74, baseType: !102, size: 32, offset: 9376)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !507, file: !508, line: 76, baseType: !461, size: 64, offset: 9408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !507, file: !508, line: 77, baseType: !521, size: 64, offset: 9472)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !508, line: 77, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !507, file: !508, line: 78, baseType: !323, size: 64, offset: 9536)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !507, file: !508, line: 80, baseType: !525, size: 2624, offset: 9600)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !325, line: 340, size: 2624, elements: !526)
!526 = !{!527, !555, !573, !574, !575, !593, !651, !652, !754, !755, !756, !757, !763}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !525, file: !325, line: 341, baseType: !528, size: 576)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !325, line: 251, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !325, line: 207, size: 576, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !529, file: !325, line: 208, baseType: !111, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !529, file: !325, line: 211, baseType: !161, size: 16, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !529, file: !325, line: 212, baseType: !161, size: 16, offset: 48)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !529, file: !325, line: 213, baseType: !102, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !529, file: !325, line: 214, baseType: !161, size: 16, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !529, file: !325, line: 215, baseType: !161, size: 16, offset: 112)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !529, file: !325, line: 216, baseType: !161, size: 16, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !529, file: !325, line: 217, baseType: !161, size: 16, offset: 144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !529, file: !325, line: 218, baseType: !161, size: 16, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !529, file: !325, line: 219, baseType: !161, size: 16, offset: 176)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !529, file: !325, line: 220, baseType: !102, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !529, file: !325, line: 222, baseType: !161, size: 16, offset: 224)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !529, file: !325, line: 225, baseType: !161, size: 16, offset: 240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !529, file: !325, line: 228, baseType: !111, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !529, file: !325, line: 229, baseType: !111, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !529, file: !325, line: 233, baseType: !111, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !529, file: !325, line: 236, baseType: !161, size: 16, offset: 352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !529, file: !325, line: 236, baseType: !161, size: 16, offset: 368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !529, file: !325, line: 241, baseType: !102, size: 32, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !529, file: !325, line: 244, baseType: !111, size: 32, offset: 416)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !529, file: !325, line: 244, baseType: !111, size: 32, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !529, file: !325, line: 245, baseType: !102, size: 32, offset: 480)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !529, file: !325, line: 248, baseType: !102, size: 32, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !529, file: !325, line: 250, baseType: !111, size: 32, offset: 544)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !525, file: !325, line: 342, baseType: !556, size: 448, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !325, line: 79, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !325, line: 61, size: 448, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !557, file: !325, line: 62, baseType: !101, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !557, file: !325, line: 64, baseType: !161, size: 16, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !557, file: !325, line: 65, baseType: !161, size: 16, offset: 80)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !557, file: !325, line: 67, baseType: !102, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !557, file: !325, line: 68, baseType: !102, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !557, file: !325, line: 69, baseType: !102, size: 32, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !557, file: !325, line: 70, baseType: !161, size: 16, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !557, file: !325, line: 71, baseType: !161, size: 16, offset: 208)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !557, file: !325, line: 72, baseType: !327, size: 64, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !557, file: !325, line: 75, baseType: !102, size: 32, offset: 288)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !557, file: !325, line: 75, baseType: !102, size: 32, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !557, file: !325, line: 75, baseType: !102, size: 32, offset: 352)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !557, file: !325, line: 78, baseType: !102, size: 32, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !557, file: !325, line: 78, baseType: !102, size: 32, offset: 416)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !525, file: !325, line: 343, baseType: !170, size: 128, offset: 1024)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !525, file: !325, line: 344, baseType: !170, size: 128, offset: 1152)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !525, file: !325, line: 345, baseType: !576, size: 192, offset: 1280)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !325, line: 278, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !325, line: 270, size: 192, elements: !578)
!578 = !{!579, !580, !581, !582, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !577, file: !325, line: 271, baseType: !111, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !577, file: !325, line: 273, baseType: !102, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !577, file: !325, line: 275, baseType: !111, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !577, file: !325, line: 276, baseType: !111, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !577, file: !325, line: 277, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !325, line: 55, size: 576, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !585, file: !325, line: 56, baseType: !111, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !585, file: !325, line: 57, baseType: !102, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !585, file: !325, line: 58, baseType: !590, size: 512, offset: 64)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !591)
!591 = !{!592, !592}
!592 = !DISubrange(count: 4)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !525, file: !325, line: 346, baseType: !594, size: 384, offset: 1472)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !325, line: 268, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !325, line: 253, size: 384, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !645, !646, !647, !648, !649, !650}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !325, line: 254, baseType: !111, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !595, file: !325, line: 255, baseType: !111, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !595, file: !325, line: 255, baseType: !111, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !595, file: !325, line: 258, baseType: !102, size: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !595, file: !325, line: 259, baseType: !602, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !325, line: 164, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !325, line: 108, size: 1664, elements: !605)
!605 = !{!606, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !604, file: !325, line: 109, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !604, file: !325, line: 109, baseType: !607, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !604, file: !325, line: 111, baseType: !146, size: 512, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !604, file: !325, line: 119, baseType: !327, size: 64, offset: 640)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !604, file: !325, line: 119, baseType: !327, size: 64, offset: 704)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !604, file: !325, line: 125, baseType: !327, size: 64, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !604, file: !325, line: 125, baseType: !327, size: 64, offset: 832)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !604, file: !325, line: 127, baseType: !327, size: 64, offset: 896)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !604, file: !325, line: 130, baseType: !111, size: 32, offset: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !604, file: !325, line: 131, baseType: !111, size: 32, offset: 992)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !604, file: !325, line: 132, baseType: !618, size: 64, offset: 1024)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !325, line: 106, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !325, line: 81, size: 512, elements: !621)
!621 = !{!622, !623, !626, !627, !628, !629}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !620, file: !325, line: 82, baseType: !327, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !620, file: !325, line: 97, baseType: !624, size: 256, offset: 64)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 256, elements: !625)
!625 = !{!592, !329}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !620, file: !325, line: 102, baseType: !327, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !620, file: !325, line: 102, baseType: !327, size: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !620, file: !325, line: 104, baseType: !111, size: 32, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !620, file: !325, line: 105, baseType: !111, size: 32, offset: 480)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !604, file: !325, line: 135, baseType: !295, size: 96, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !604, file: !325, line: 136, baseType: !102, size: 32, offset: 1184)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !604, file: !325, line: 139, baseType: !111, size: 32, offset: 1216)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !604, file: !325, line: 139, baseType: !111, size: 32, offset: 1248)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !604, file: !325, line: 139, baseType: !111, size: 32, offset: 1280)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !604, file: !325, line: 140, baseType: !295, size: 96, offset: 1312)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !604, file: !325, line: 143, baseType: !161, size: 16, offset: 1408)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !604, file: !325, line: 144, baseType: !161, size: 16, offset: 1424)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !604, file: !325, line: 145, baseType: !161, size: 16, offset: 1440)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !604, file: !325, line: 148, baseType: !161, size: 16, offset: 1456)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !604, file: !325, line: 149, baseType: !111, size: 32, offset: 1472)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !604, file: !325, line: 150, baseType: !102, size: 32, offset: 1504)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !604, file: !325, line: 152, baseType: !323, size: 64, offset: 1536)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !604, file: !325, line: 163, baseType: !102, size: 32, offset: 1600)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !604, file: !325, line: 163, baseType: !102, size: 32, offset: 1632)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !595, file: !325, line: 261, baseType: !102, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !595, file: !325, line: 261, baseType: !102, size: 32, offset: 224)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !595, file: !325, line: 261, baseType: !102, size: 32, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !595, file: !325, line: 263, baseType: !111, size: 32, offset: 288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !595, file: !325, line: 266, baseType: !111, size: 32, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !595, file: !325, line: 267, baseType: !102, size: 32, offset: 352)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !525, file: !325, line: 347, baseType: !602, size: 64, offset: 1856)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !525, file: !325, line: 348, baseType: !653, size: 64, offset: 1920)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !325, line: 205, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !325, line: 186, size: 1024, elements: !656)
!656 = !{!657, !659, !660, !661, !663, !664, !665, !673, !674, !675, !752, !753}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !325, line: 187, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !655, file: !325, line: 187, baseType: !658, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !655, file: !325, line: 189, baseType: !146, size: 512, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !655, file: !325, line: 191, baseType: !662, size: 64, offset: 640)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !655, file: !325, line: 193, baseType: !111, size: 32, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !655, file: !325, line: 193, baseType: !111, size: 32, offset: 736)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !655, file: !325, line: 195, baseType: !666, size: 64, offset: 768)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !325, line: 184, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !325, line: 166, size: 320, elements: !669)
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !668, file: !325, line: 180, baseType: !624, size: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !668, file: !325, line: 182, baseType: !111, size: 32, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !325, line: 183, baseType: !111, size: 32, offset: 288)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !655, file: !325, line: 196, baseType: !111, size: 32, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !655, file: !325, line: 198, baseType: !111, size: 32, offset: 864)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !655, file: !325, line: 200, baseType: !676, size: 64, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !463, line: 77, size: 15424, elements: !678)
!678 = !{!679, !680, !681, !684, !687, !688, !691, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !711, !712, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !738, !739, !740, !741, !742, !746}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !677, file: !463, line: 78, baseType: !224, size: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !677, file: !463, line: 80, baseType: !242, size: 8192, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !677, file: !463, line: 82, baseType: !682, size: 64, offset: 9152)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !463, line: 43, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !677, file: !463, line: 83, baseType: !685, size: 64, offset: 9216)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !152, line: 46, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !677, file: !463, line: 86, baseType: !461, size: 64, offset: 9280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !677, file: !463, line: 87, baseType: !689, size: 64, offset: 9344)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !463, line: 44, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !677, file: !463, line: 89, baseType: !692, size: 512, offset: 9408)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 512, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !677, file: !463, line: 90, baseType: !161, size: 16, offset: 9920)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !677, file: !463, line: 90, baseType: !161, size: 16, offset: 9936)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !677, file: !463, line: 92, baseType: !161, size: 16, offset: 9952)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !677, file: !463, line: 92, baseType: !161, size: 16, offset: 9968)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !677, file: !463, line: 93, baseType: !161, size: 16, offset: 9984)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !463, line: 93, baseType: !161, size: 16, offset: 10000)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !677, file: !463, line: 94, baseType: !111, size: 32, offset: 10016)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !677, file: !463, line: 97, baseType: !161, size: 16, offset: 10048)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !677, file: !463, line: 97, baseType: !161, size: 16, offset: 10064)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !677, file: !463, line: 98, baseType: !161, size: 16, offset: 10080)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !677, file: !463, line: 98, baseType: !161, size: 16, offset: 10096)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !677, file: !463, line: 99, baseType: !161, size: 16, offset: 10112)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !677, file: !463, line: 99, baseType: !161, size: 16, offset: 10128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !677, file: !463, line: 100, baseType: !7, size: 32, offset: 10144)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !677, file: !463, line: 101, baseType: !710, size: 64, offset: 10176)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !677, file: !463, line: 103, baseType: !248, size: 64, offset: 10240)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !677, file: !463, line: 104, baseType: !713, size: 64, offset: 10304)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !152, line: 159, size: 448, elements: !715)
!715 = !{!716, !718, !719, !721, !722, !724}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !714, file: !152, line: 161, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !328)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !714, file: !152, line: 162, baseType: !717, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !714, file: !152, line: 163, baseType: !720, size: 32, offset: 128)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 32, elements: !328)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !714, file: !152, line: 164, baseType: !720, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !714, file: !152, line: 165, baseType: !723, size: 128, offset: 192)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 128, elements: !328)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !714, file: !152, line: 166, baseType: !725, size: 128, offset: 320)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 128, elements: !328)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !677, file: !463, line: 107, baseType: !102, size: 32, offset: 10368)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !677, file: !463, line: 108, baseType: !111, size: 32, offset: 10400)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !677, file: !463, line: 109, baseType: !161, size: 16, offset: 10432)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !677, file: !463, line: 110, baseType: !161, size: 16, offset: 10448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !677, file: !463, line: 113, baseType: !111, size: 32, offset: 10464)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !677, file: !463, line: 113, baseType: !111, size: 32, offset: 10496)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !677, file: !463, line: 114, baseType: !115, size: 8, offset: 10528)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !677, file: !463, line: 114, baseType: !115, size: 8, offset: 10536)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !677, file: !463, line: 115, baseType: !161, size: 16, offset: 10544)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !677, file: !463, line: 116, baseType: !736, size: 128, offset: 10560)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !737)
!737 = !{!592}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !677, file: !463, line: 119, baseType: !102, size: 32, offset: 10688)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !677, file: !463, line: 119, baseType: !102, size: 32, offset: 10720)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !677, file: !463, line: 122, baseType: !495, size: 512, offset: 10752)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !677, file: !463, line: 123, baseType: !115, size: 8, offset: 11264)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !677, file: !463, line: 125, baseType: !743, size: 56, offset: 11272)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 56, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 7)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !677, file: !463, line: 126, baseType: !747, size: 4096, offset: 11328)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 4096, elements: !693)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !463, line: 69, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !463, line: 67, size: 512, elements: !750)
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !463, line: 68, baseType: !146, size: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !655, file: !325, line: 201, baseType: !102, size: 32, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !655, file: !325, line: 204, baseType: !111, size: 32, offset: 992)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !525, file: !325, line: 350, baseType: !170, size: 128, offset: 1984)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !525, file: !325, line: 351, baseType: !111, size: 32, offset: 2112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !525, file: !325, line: 351, baseType: !111, size: 32, offset: 2144)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !525, file: !325, line: 353, baseType: !758, size: 64, offset: 2176)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !325, line: 297, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !325, line: 295, size: 2048, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !760, file: !325, line: 296, baseType: !444, size: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !525, file: !325, line: 355, baseType: !764, size: 384, offset: 2240)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !325, line: 338, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !325, line: 322, size: 384, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !765, file: !325, line: 323, baseType: !111, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !765, file: !325, line: 325, baseType: !161, size: 16, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !765, file: !325, line: 326, baseType: !161, size: 16, offset: 48)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !765, file: !325, line: 331, baseType: !170, size: 128, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !765, file: !325, line: 334, baseType: !170, size: 128, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !765, file: !325, line: 335, baseType: !111, size: 32, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !765, file: !325, line: 337, baseType: !111, size: 32, offset: 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !507, file: !508, line: 81, baseType: !101, size: 64, offset: 12224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !507, file: !508, line: 85, baseType: !776, size: 6208, offset: 12288)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !508, line: 55, size: 6208, elements: !777)
!777 = !{!778, !779, !780, !781, !782}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !776, file: !508, line: 56, baseType: !450, size: 6144)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !776, file: !508, line: 58, baseType: !161, size: 16, offset: 6144)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !776, file: !508, line: 59, baseType: !161, size: 16, offset: 6160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !776, file: !508, line: 60, baseType: !161, size: 16, offset: 6176)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !776, file: !508, line: 61, baseType: !161, size: 16, offset: 6192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !508, line: 86, baseType: !111, size: 32, offset: 18496)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !507, file: !508, line: 88, baseType: !111, size: 32, offset: 18528)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !507, file: !508, line: 90, baseType: !111, size: 32, offset: 18560)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !507, file: !508, line: 94, baseType: !111, size: 32, offset: 18592)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !507, file: !508, line: 100, baseType: !495, size: 512, offset: 18624)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !399, file: !390, line: 154, baseType: !789, size: 64, offset: 1664)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !791, line: 264, flags: DIFlagFwdDecl)
!791 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!792 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !399, file: !390, line: 156, baseType: !461, size: 64, offset: 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !399, file: !390, line: 158, baseType: !102, size: 32, offset: 1792)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !399, file: !390, line: 159, baseType: !102, size: 32, offset: 1824)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !399, file: !390, line: 162, baseType: !402, size: 64, offset: 1856)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !399, file: !390, line: 162, baseType: !402, size: 64, offset: 1920)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !399, file: !390, line: 162, baseType: !402, size: 64, offset: 1984)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !399, file: !390, line: 164, baseType: !170, size: 128, offset: 2048)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !399, file: !390, line: 166, baseType: !800, size: 64, offset: 2176)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !390, line: 51, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !399, file: !390, line: 167, baseType: !101, size: 64, offset: 2240)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !399, file: !390, line: 168, baseType: !102, size: 32, offset: 2304)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !399, file: !390, line: 170, baseType: !102, size: 32, offset: 2336)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !399, file: !390, line: 170, baseType: !102, size: 32, offset: 2368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !399, file: !390, line: 171, baseType: !102, size: 32, offset: 2400)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !399, file: !390, line: 173, baseType: !101, size: 64, offset: 2432)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !399, file: !390, line: 175, baseType: !111, size: 32, offset: 2496)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !399, file: !390, line: 176, baseType: !111, size: 32, offset: 2528)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !399, file: !390, line: 179, baseType: !111, size: 32, offset: 2560)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !399, file: !390, line: 180, baseType: !102, size: 32, offset: 2592)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !399, file: !390, line: 183, baseType: !111, size: 32, offset: 2624)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !399, file: !390, line: 185, baseType: !115, size: 8, offset: 2656)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !399, file: !390, line: 186, baseType: !815, size: 24, offset: 2664)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 24, elements: !296)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !399, file: !390, line: 189, baseType: !170, size: 128, offset: 2688)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !389, file: !390, line: 207, baseType: !242, size: 8192, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !389, file: !390, line: 208, baseType: !242, size: 8192, offset: 8576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !389, file: !390, line: 210, baseType: !111, size: 32, offset: 16768)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !389, file: !390, line: 210, baseType: !111, size: 32, offset: 16800)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !389, file: !390, line: 211, baseType: !111, size: 32, offset: 16832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !389, file: !390, line: 211, baseType: !111, size: 32, offset: 16864)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !389, file: !390, line: 212, baseType: !345, size: 128, offset: 16896)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !265, file: !266, line: 1246, baseType: !825, size: 64, offset: 2112)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !266, line: 1067, size: 5184, elements: !827)
!827 = !{!828, !858, !859, !874, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !896, !912, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !1022}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !826, file: !266, line: 1068, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !266, line: 934, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !266, line: 925, size: 576, elements: !832)
!832 = !{!833, !850, !851, !852, !853, !854, !857}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !831, file: !266, line: 926, baseType: !834, size: 320)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !266, line: 830, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !266, line: 813, size: 320, elements: !836)
!836 = !{!837, !840, !843, !844, !847, !848, !849}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !835, file: !266, line: 814, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !266, line: 51, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !835, file: !266, line: 815, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !266, line: 815, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !835, file: !266, line: 818, baseType: !101, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !835, file: !266, line: 819, baseType: !845, size: 32, offset: 192)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 32, elements: !737)
!846 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !835, file: !266, line: 822, baseType: !111, size: 32, offset: 224)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !835, file: !266, line: 826, baseType: !111, size: 32, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !835, file: !266, line: 829, baseType: !111, size: 32, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !831, file: !266, line: 928, baseType: !161, size: 16, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !831, file: !266, line: 928, baseType: !161, size: 16, offset: 336)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !831, file: !266, line: 929, baseType: !111, size: 32, offset: 352)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !831, file: !266, line: 930, baseType: !710, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !831, file: !266, line: 931, baseType: !855, size: 64, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !266, line: 931, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !831, file: !266, line: 933, baseType: !101, size: 64, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !826, file: !266, line: 1069, baseType: !829, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !826, file: !266, line: 1070, baseType: !860, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !266, line: 916, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !266, line: 891, size: 704, elements: !863)
!863 = !{!864, !865, !866, !868, !869, !870, !871, !872, !873}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !862, file: !266, line: 892, baseType: !834, size: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !862, file: !266, line: 896, baseType: !111, size: 32, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !862, file: !266, line: 900, baseType: !867, size: 96, offset: 352)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 96, elements: !296)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !862, file: !266, line: 903, baseType: !102, size: 32, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !862, file: !266, line: 906, baseType: !111, size: 32, offset: 480)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !862, file: !266, line: 909, baseType: !102, size: 32, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !862, file: !266, line: 912, baseType: !102, size: 32, offset: 544)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !862, file: !266, line: 914, baseType: !274, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !862, file: !266, line: 915, baseType: !101, size: 64, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !826, file: !266, line: 1071, baseType: !875, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !266, line: 920, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !266, line: 918, size: 320, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !877, file: !266, line: 919, baseType: !834, size: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !826, file: !266, line: 1075, baseType: !102, size: 32, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !826, file: !266, line: 1077, baseType: !102, size: 32, offset: 288)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !826, file: !266, line: 1078, baseType: !102, size: 32, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !826, file: !266, line: 1079, baseType: !161, size: 16, offset: 352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !826, file: !266, line: 1082, baseType: !161, size: 16, offset: 368)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !826, file: !266, line: 1085, baseType: !115, size: 8, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !826, file: !266, line: 1086, baseType: !115, size: 8, offset: 392)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !826, file: !266, line: 1087, baseType: !115, size: 8, offset: 400)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !826, file: !266, line: 1088, baseType: !115, size: 8, offset: 408)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !826, file: !266, line: 1090, baseType: !102, size: 32, offset: 416)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !826, file: !266, line: 1093, baseType: !161, size: 16, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !826, file: !266, line: 1096, baseType: !115, size: 8, offset: 464)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !826, file: !266, line: 1098, baseType: !893, size: 40, offset: 472)
