; ModuleID = 'blender/source/blender/nodes/texture/nodes/node_texture_viewer.c'
source_filename = "blender/source/blender/nodes/texture/nodes/node_texture_viewer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 61, type: !2429, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_tex_viewer", scope: !3, file: !3, line: 59, type: !4, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2428)
!3 = !DIFile(filename: "blender/source/blender/nodes/texture/nodes/node_texture_viewer.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !22, globals: !2421, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TexCallData", file: !25, line: 95, baseType: !26)
!25 = !DIFile(filename: "blender/source/blender/nodes/texture/node_texture_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TexCallData", file: !25, line: 80, size: 512, elements: !27)
!27 = !{!28, !44, !45, !46, !47, !48, !50, !51, !53, !54, !55, !2418}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !26, file: !25, line: 81, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "TexResult", file: !31, line: 45, baseType: !32)
!31 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_shader_ext.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TexResult", file: !31, line: 41, size: 256, elements: !33)
!33 = !{!34, !36, !37, !38, !39, !40, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tin", scope: !32, file: !31, line: 42, baseType: !35, size: 32)
!35 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tr", scope: !32, file: !31, line: 42, baseType: !35, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tg", scope: !32, file: !31, line: 42, baseType: !35, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tb", scope: !32, file: !31, line: 42, baseType: !35, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ta", scope: !32, file: !31, line: 42, baseType: !35, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "talpha", scope: !32, file: !31, line: 43, baseType: !41, size: 32, offset: 160)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nor", scope: !32, file: !31, line: 44, baseType: !43, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !26, file: !25, line: 83, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dxt", scope: !26, file: !25, line: 84, baseType: !43, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "dyt", scope: !26, file: !25, line: 84, baseType: !43, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "osatex", scope: !26, file: !25, line: 86, baseType: !41, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "do_preview", scope: !26, file: !25, line: 87, baseType: !49, size: 8, offset: 288)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "do_manage", scope: !26, file: !25, line: 88, baseType: !49, size: 8, offset: 296)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !26, file: !25, line: 89, baseType: !52, size: 16, offset: 304)
!52 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !26, file: !25, line: 90, baseType: !52, size: 16, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !26, file: !25, line: 91, baseType: !41, size: 32, offset: 352)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "shi", scope: !26, file: !25, line: 93, baseType: !56, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShadeInput", file: !31, line: 186, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShadeInput", file: !31, line: 98, size: 11776, elements: !59)
!59 = !{!60, !2272, !2275, !2278, !2281, !2284, !2285, !2286, !2287, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2362, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !58, file: !31, line: 102, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !63, line: 93, size: 7552, elements: !64)
!63 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = !{!65, !135, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !188, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !257, !258, !259, !260, !261, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2271}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !62, file: !63, line: 94, baseType: !66, size: 960)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !67, line: 130, baseType: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !67, line: 117, size: 960, elements: !69)
!69 = !{!70, !72, !73, !75, !95, !99, !100, !101, !102, !103}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 118, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !67, line: 118, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !68, file: !67, line: 119, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !68, file: !67, line: 120, baseType: !76, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !67, line: 136, size: 17600, elements: !78)
!78 = !{!79, !80, !82, !85, !90, !91, !92}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !77, file: !67, line: 137, baseType: !66, size: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !77, file: !67, line: 138, baseType: !81, size: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !77, file: !67, line: 139, baseType: !83, size: 64, offset: 1024)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !67, line: 43, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !67, line: 140, baseType: !86, size: 8192, offset: 1088)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8192, elements: !88)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !{!89}
!89 = !DISubrange(count: 1024)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !77, file: !67, line: 141, baseType: !86, size: 8192, offset: 9280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !77, file: !67, line: 148, baseType: !76, size: 64, offset: 17472)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !77, file: !67, line: 150, baseType: !93, size: 64, offset: 17536)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !67, line: 45, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !67, line: 121, baseType: !96, size: 528, offset: 256)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 528, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 66)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !68, file: !67, line: 126, baseType: !52, size: 16, offset: 784)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !68, file: !67, line: 127, baseType: !41, size: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !68, file: !67, line: 128, baseType: !41, size: 32, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !68, file: !67, line: 128, baseType: !41, size: 32, offset: 864)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !68, file: !67, line: 129, baseType: !104, size: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !67, line: 75, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !67, line: 62, size: 1024, elements: !107)
!107 = !{!108, !110, !111, !112, !113, !114, !118, !119, !133, !134}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !67, line: 63, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !106, file: !67, line: 63, baseType: !109, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !67, line: 64, baseType: !87, size: 8, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !106, file: !67, line: 64, baseType: !87, size: 8, offset: 136)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !67, line: 65, baseType: !52, size: 16, offset: 144)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !67, line: 66, baseType: !115, size: 512, offset: 160)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 512, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !106, file: !67, line: 67, baseType: !41, size: 32, offset: 672)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !67, line: 69, baseType: !120, size: 256, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !67, line: 60, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !67, line: 48, size: 256, elements: !122)
!122 = !{!123, !124, !131, !132}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !121, file: !67, line: 49, baseType: !71, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !121, file: !67, line: 58, baseType: !125, size: 128, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !126, line: 71, baseType: !127)
!126 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !126, line: 69, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !127, file: !126, line: 70, baseType: !71, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !127, file: !126, line: 70, baseType: !71, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !67, line: 59, baseType: !41, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !121, file: !67, line: 59, baseType: !41, size: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !67, line: 70, baseType: !41, size: 32, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !106, file: !67, line: 74, baseType: !41, size: 32, offset: 992)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !62, file: !63, line: 95, baseType: !136, size: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !138, line: 48, flags: DIFlagFwdDecl)
!138 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !62, file: !63, line: 97, baseType: !52, size: 16, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !62, file: !63, line: 97, baseType: !52, size: 16, offset: 1040)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !62, file: !63, line: 99, baseType: !35, size: 32, offset: 1056)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !62, file: !63, line: 99, baseType: !35, size: 32, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !62, file: !63, line: 99, baseType: !35, size: 32, offset: 1120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !62, file: !63, line: 100, baseType: !35, size: 32, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !62, file: !63, line: 100, baseType: !35, size: 32, offset: 1184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !62, file: !63, line: 100, baseType: !35, size: 32, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !62, file: !63, line: 101, baseType: !35, size: 32, offset: 1248)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !62, file: !63, line: 101, baseType: !35, size: 32, offset: 1280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !62, file: !63, line: 101, baseType: !35, size: 32, offset: 1312)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !62, file: !63, line: 102, baseType: !35, size: 32, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !62, file: !63, line: 102, baseType: !35, size: 32, offset: 1376)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !62, file: !63, line: 102, baseType: !35, size: 32, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !62, file: !63, line: 103, baseType: !35, size: 32, offset: 1440)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !62, file: !63, line: 103, baseType: !35, size: 32, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !62, file: !63, line: 103, baseType: !35, size: 32, offset: 1504)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !62, file: !63, line: 103, baseType: !35, size: 32, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !62, file: !63, line: 103, baseType: !35, size: 32, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !62, file: !63, line: 104, baseType: !35, size: 32, offset: 1600)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !62, file: !63, line: 104, baseType: !35, size: 32, offset: 1632)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !62, file: !63, line: 104, baseType: !35, size: 32, offset: 1664)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !62, file: !63, line: 104, baseType: !35, size: 32, offset: 1696)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !62, file: !63, line: 104, baseType: !35, size: 32, offset: 1728)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !62, file: !63, line: 105, baseType: !35, size: 32, offset: 1760)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !62, file: !63, line: 108, baseType: !165, size: 704, offset: 1792)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !63, line: 53, size: 704, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !165, file: !63, line: 54, baseType: !35, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !165, file: !63, line: 55, baseType: !35, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !165, file: !63, line: 56, baseType: !35, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !165, file: !63, line: 57, baseType: !35, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !165, file: !63, line: 59, baseType: !172, size: 96, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 96, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 3)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !165, file: !63, line: 60, baseType: !172, size: 96, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !165, file: !63, line: 61, baseType: !172, size: 96, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !165, file: !63, line: 63, baseType: !35, size: 32, offset: 416)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !165, file: !63, line: 64, baseType: !35, size: 32, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !165, file: !63, line: 65, baseType: !35, size: 32, offset: 480)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !165, file: !63, line: 67, baseType: !52, size: 16, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !165, file: !63, line: 68, baseType: !52, size: 16, offset: 528)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !165, file: !63, line: 69, baseType: !52, size: 16, offset: 544)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !165, file: !63, line: 70, baseType: !52, size: 16, offset: 560)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !165, file: !63, line: 72, baseType: !35, size: 32, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !165, file: !63, line: 73, baseType: !35, size: 32, offset: 608)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !165, file: !63, line: 74, baseType: !35, size: 32, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !165, file: !63, line: 75, baseType: !35, size: 32, offset: 672)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !62, file: !63, line: 109, baseType: !189, size: 128, offset: 2496)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !63, line: 79, size: 128, elements: !190)
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !63, line: 80, baseType: !41, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !189, file: !63, line: 81, baseType: !41, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !189, file: !63, line: 82, baseType: !41, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !189, file: !63, line: 83, baseType: !41, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !62, file: !63, line: 111, baseType: !35, size: 32, offset: 2624)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !62, file: !63, line: 111, baseType: !35, size: 32, offset: 2656)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !62, file: !63, line: 112, baseType: !35, size: 32, offset: 2688)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !62, file: !63, line: 112, baseType: !35, size: 32, offset: 2720)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !62, file: !63, line: 113, baseType: !35, size: 32, offset: 2752)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !62, file: !63, line: 114, baseType: !35, size: 32, offset: 2784)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !62, file: !63, line: 114, baseType: !35, size: 32, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !62, file: !63, line: 115, baseType: !52, size: 16, offset: 2848)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !62, file: !63, line: 115, baseType: !52, size: 16, offset: 2864)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !62, file: !63, line: 116, baseType: !52, size: 16, offset: 2880)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !62, file: !63, line: 117, baseType: !87, size: 8, offset: 2896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !62, file: !63, line: 117, baseType: !87, size: 8, offset: 2904)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !62, file: !63, line: 119, baseType: !35, size: 32, offset: 2912)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !62, file: !63, line: 119, baseType: !35, size: 32, offset: 2944)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !62, file: !63, line: 120, baseType: !52, size: 16, offset: 2976)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !62, file: !63, line: 120, baseType: !52, size: 16, offset: 2992)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !62, file: !63, line: 121, baseType: !35, size: 32, offset: 3008)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !62, file: !63, line: 121, baseType: !35, size: 32, offset: 3040)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !62, file: !63, line: 122, baseType: !35, size: 32, offset: 3072)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !62, file: !63, line: 123, baseType: !35, size: 32, offset: 3104)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !62, file: !63, line: 124, baseType: !52, size: 16, offset: 3136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !62, file: !63, line: 125, baseType: !52, size: 16, offset: 3152)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !62, file: !63, line: 127, baseType: !41, size: 32, offset: 3168)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !62, file: !63, line: 127, baseType: !41, size: 32, offset: 3200)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !62, file: !63, line: 128, baseType: !41, size: 32, offset: 3232)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !62, file: !63, line: 128, baseType: !41, size: 32, offset: 3264)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !62, file: !63, line: 129, baseType: !52, size: 16, offset: 3296)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !62, file: !63, line: 129, baseType: !52, size: 16, offset: 3312)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !62, file: !63, line: 129, baseType: !52, size: 16, offset: 3328)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !62, file: !63, line: 129, baseType: !52, size: 16, offset: 3344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !62, file: !63, line: 130, baseType: !35, size: 32, offset: 3360)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !62, file: !63, line: 130, baseType: !35, size: 32, offset: 3392)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !62, file: !63, line: 130, baseType: !35, size: 32, offset: 3424)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !62, file: !63, line: 130, baseType: !35, size: 32, offset: 3456)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !62, file: !63, line: 131, baseType: !35, size: 32, offset: 3488)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !62, file: !63, line: 131, baseType: !35, size: 32, offset: 3520)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !62, file: !63, line: 131, baseType: !35, size: 32, offset: 3552)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !62, file: !63, line: 131, baseType: !35, size: 32, offset: 3584)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !62, file: !63, line: 132, baseType: !35, size: 32, offset: 3616)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !62, file: !63, line: 132, baseType: !35, size: 32, offset: 3648)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !62, file: !63, line: 133, baseType: !115, size: 512, offset: 3680)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !62, file: !63, line: 135, baseType: !35, size: 32, offset: 4192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !62, file: !63, line: 136, baseType: !35, size: 32, offset: 4224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !62, file: !63, line: 137, baseType: !35, size: 32, offset: 4256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !62, file: !63, line: 138, baseType: !41, size: 32, offset: 4288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !62, file: !63, line: 141, baseType: !87, size: 8, offset: 4320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !62, file: !63, line: 141, baseType: !87, size: 8, offset: 4328)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !62, file: !63, line: 141, baseType: !87, size: 8, offset: 4336)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !62, file: !63, line: 141, baseType: !87, size: 8, offset: 4344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !62, file: !63, line: 142, baseType: !52, size: 16, offset: 4352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !62, file: !63, line: 142, baseType: !52, size: 16, offset: 4368)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !62, file: !63, line: 142, baseType: !52, size: 16, offset: 4384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !62, file: !63, line: 145, baseType: !87, size: 8, offset: 4400)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !62, file: !63, line: 145, baseType: !87, size: 8, offset: 4408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !62, file: !63, line: 148, baseType: !52, size: 16, offset: 4416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !62, file: !63, line: 148, baseType: !52, size: 16, offset: 4432)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !62, file: !63, line: 149, baseType: !35, size: 32, offset: 4448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !62, file: !63, line: 149, baseType: !35, size: 32, offset: 4480)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !62, file: !63, line: 152, baseType: !254, size: 128, offset: 4512)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 4)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !62, file: !63, line: 153, baseType: !35, size: 32, offset: 4640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !62, file: !63, line: 154, baseType: !35, size: 32, offset: 4672)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !62, file: !63, line: 157, baseType: !52, size: 16, offset: 4704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !62, file: !63, line: 157, baseType: !52, size: 16, offset: 4720)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !62, file: !63, line: 160, baseType: !262, size: 64, offset: 4736)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !264, line: 113, size: 6208, elements: !265)
!264 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!265 = !{!266, !267, !268, !269, !270, !271, !275}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !263, file: !264, line: 114, baseType: !52, size: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !263, file: !264, line: 114, baseType: !52, size: 16, offset: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !263, file: !264, line: 115, baseType: !87, size: 8, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !263, file: !264, line: 115, baseType: !87, size: 8, offset: 40)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !263, file: !264, line: 116, baseType: !87, size: 8, offset: 48)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !263, file: !264, line: 117, baseType: !272, size: 8, offset: 56)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 1)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 119, baseType: !276, size: 6144, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 6144, elements: !286)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !264, line: 109, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !264, line: 106, size: 192, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !278, file: !264, line: 107, baseType: !35, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !278, file: !264, line: 107, baseType: !35, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !278, file: !264, line: 107, baseType: !35, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !278, file: !264, line: 107, baseType: !35, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !278, file: !264, line: 107, baseType: !35, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !278, file: !264, line: 108, baseType: !41, size: 32, offset: 160)
!286 = !{!287}
!287 = !DISubrange(count: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !62, file: !63, line: 161, baseType: !262, size: 64, offset: 4800)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !62, file: !63, line: 162, baseType: !87, size: 8, offset: 4864)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !62, file: !63, line: 162, baseType: !87, size: 8, offset: 4872)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !62, file: !63, line: 163, baseType: !87, size: 8, offset: 4880)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !62, file: !63, line: 163, baseType: !87, size: 8, offset: 4888)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !62, file: !63, line: 164, baseType: !52, size: 16, offset: 4896)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !62, file: !63, line: 164, baseType: !52, size: 16, offset: 4912)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !62, file: !63, line: 165, baseType: !35, size: 32, offset: 4928)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !62, file: !63, line: 165, baseType: !35, size: 32, offset: 4960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !62, file: !63, line: 167, baseType: !298, size: 1152, offset: 4992)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 1152, elements: !2229)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !264, line: 57, size: 2496, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !2026, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !300, file: !264, line: 59, baseType: !52, size: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !300, file: !264, line: 59, baseType: !52, size: 16, offset: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !300, file: !264, line: 59, baseType: !52, size: 16, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !300, file: !264, line: 59, baseType: !52, size: 16, offset: 48)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !300, file: !264, line: 60, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !309, line: 115, size: 11392, elements: !310)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !{!311, !312, !313, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !347, !357, !371, !372, !413, !414, !418, !419, !435, !436, !437, !438, !439, !440, !441, !443, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !521, !522, !523, !524, !525, !526, !527, !528, !529, !532, !535, !538, !539, !540, !541, !542, !545, !548, !551, !552, !558, !559, !560, !561, !562, !563, !565, !568, !571, !575, !2014, !2015}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !309, line: 116, baseType: !66, size: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !308, file: !309, line: 117, baseType: !136, size: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !308, file: !309, line: 119, baseType: !314, size: 64, offset: 1024)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !309, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !309, line: 121, baseType: !52, size: 16, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !308, file: !309, line: 121, baseType: !52, size: 16, offset: 1104)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !308, file: !309, line: 122, baseType: !41, size: 32, offset: 1120)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !308, file: !309, line: 122, baseType: !41, size: 32, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !308, file: !309, line: 122, baseType: !41, size: 32, offset: 1184)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !308, file: !309, line: 123, baseType: !115, size: 512, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !309, line: 124, baseType: !307, size: 64, offset: 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !308, file: !309, line: 124, baseType: !307, size: 64, offset: 1792)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !308, file: !309, line: 127, baseType: !307, size: 64, offset: 1856)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !308, file: !309, line: 127, baseType: !307, size: 64, offset: 1920)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !308, file: !309, line: 127, baseType: !307, size: 64, offset: 1984)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !308, file: !309, line: 128, baseType: !328, size: 64, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !330, line: 91, size: 1280, elements: !331)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = !{!332, !333, !334, !343, !344, !345, !346}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !329, file: !330, line: 92, baseType: !66, size: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !329, file: !330, line: 94, baseType: !125, size: 128, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !329, file: !330, line: 95, baseType: !335, size: 128, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !336, line: 95, baseType: !337)
!336 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !336, line: 92, size: 128, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !337, file: !336, line: 93, baseType: !35, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !337, file: !336, line: 93, baseType: !35, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !337, file: !336, line: 94, baseType: !35, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !337, file: !336, line: 94, baseType: !35, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !329, file: !330, line: 97, baseType: !52, size: 16, offset: 1216)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !329, file: !330, line: 97, baseType: !52, size: 16, offset: 1232)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !329, file: !330, line: 98, baseType: !52, size: 16, offset: 1248)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !329, file: !330, line: 98, baseType: !52, size: 16, offset: 1264)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !308, file: !309, line: 130, baseType: !348, size: 64, offset: 2112)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !309, line: 97, size: 832, elements: !350)
!350 = !{!351, !355, !356}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !349, file: !309, line: 98, baseType: !352, size: 768)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 768, elements: !353)
!353 = !{!354, !174}
!354 = !DISubrange(count: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !309, line: 99, baseType: !41, size: 32, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !349, file: !309, line: 99, baseType: !41, size: 32, offset: 800)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !308, file: !309, line: 131, baseType: !358, size: 64, offset: 2176)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !360, line: 486, size: 1600, elements: !361)
!360 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !359, file: !360, line: 487, baseType: !66, size: 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !359, file: !360, line: 489, baseType: !125, size: 128, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !359, file: !360, line: 490, baseType: !125, size: 128, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !359, file: !360, line: 491, baseType: !125, size: 128, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !359, file: !360, line: 492, baseType: !125, size: 128, offset: 1344)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !359, file: !360, line: 494, baseType: !41, size: 32, offset: 1472)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !359, file: !360, line: 495, baseType: !41, size: 32, offset: 1504)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !359, file: !360, line: 497, baseType: !41, size: 32, offset: 1536)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !359, file: !360, line: 498, baseType: !41, size: 32, offset: 1568)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !308, file: !309, line: 132, baseType: !358, size: 64, offset: 2240)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !308, file: !309, line: 133, baseType: !373, size: 64, offset: 2304)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !360, line: 334, size: 1728, elements: !375)
!375 = !{!376, !377, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !412}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !374, file: !360, line: 335, baseType: !125, size: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !374, file: !360, line: 336, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !138, line: 51, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !360, line: 338, baseType: !52, size: 16, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !374, file: !360, line: 338, baseType: !52, size: 16, offset: 208)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !374, file: !360, line: 339, baseType: !10, size: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !374, file: !360, line: 340, baseType: !41, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !374, file: !360, line: 342, baseType: !35, size: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !374, file: !360, line: 343, baseType: !172, size: 96, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !374, file: !360, line: 344, baseType: !172, size: 96, offset: 416)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !374, file: !360, line: 347, baseType: !125, size: 128, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !374, file: !360, line: 349, baseType: !41, size: 32, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !374, file: !360, line: 350, baseType: !41, size: 32, offset: 672)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !374, file: !360, line: 351, baseType: !71, size: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !374, file: !360, line: 352, baseType: !71, size: 64, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !374, file: !360, line: 354, baseType: !393, size: 384, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !360, line: 116, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !360, line: 94, size: 384, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !394, file: !360, line: 96, baseType: !41, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !394, file: !360, line: 96, baseType: !41, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !394, file: !360, line: 97, baseType: !41, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !394, file: !360, line: 97, baseType: !41, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !394, file: !360, line: 99, baseType: !52, size: 16, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !394, file: !360, line: 100, baseType: !52, size: 16, offset: 144)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !394, file: !360, line: 102, baseType: !52, size: 16, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !394, file: !360, line: 105, baseType: !52, size: 16, offset: 176)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !394, file: !360, line: 108, baseType: !52, size: 16, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !394, file: !360, line: 109, baseType: !52, size: 16, offset: 208)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !394, file: !360, line: 111, baseType: !52, size: 16, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !394, file: !360, line: 112, baseType: !52, size: 16, offset: 240)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !394, file: !360, line: 114, baseType: !41, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !394, file: !360, line: 114, baseType: !41, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !394, file: !360, line: 115, baseType: !41, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !394, file: !360, line: 115, baseType: !41, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !374, file: !360, line: 355, baseType: !115, size: 512, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !309, line: 134, baseType: !71, size: 64, offset: 2368)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !308, file: !309, line: 136, baseType: !415, size: 64, offset: 2432)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !417, line: 61, flags: DIFlagFwdDecl)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !308, file: !309, line: 138, baseType: !393, size: 384, offset: 2496)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !308, file: !309, line: 139, baseType: !420, size: 64, offset: 2880)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !360, line: 80, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !360, line: 72, size: 192, elements: !423)
!423 = !{!424, !431, !432, !433, !434}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !422, file: !360, line: 73, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !360, line: 59, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !360, line: 56, size: 128, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !427, file: !360, line: 57, baseType: !172, size: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !427, file: !360, line: 58, baseType: !41, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !422, file: !360, line: 74, baseType: !41, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !422, file: !360, line: 76, baseType: !41, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !422, file: !360, line: 77, baseType: !41, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !422, file: !360, line: 79, baseType: !41, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !308, file: !309, line: 141, baseType: !125, size: 128, offset: 2944)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !308, file: !309, line: 142, baseType: !125, size: 128, offset: 3072)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !308, file: !309, line: 143, baseType: !125, size: 128, offset: 3200)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !308, file: !309, line: 144, baseType: !125, size: 128, offset: 3328)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !308, file: !309, line: 146, baseType: !41, size: 32, offset: 3456)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !308, file: !309, line: 147, baseType: !41, size: 32, offset: 3488)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !308, file: !309, line: 150, baseType: !442, size: 64, offset: 3520)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !308, file: !309, line: 151, baseType: !444, size: 64, offset: 3584)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !308, file: !309, line: 152, baseType: !41, size: 32, offset: 3648)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !308, file: !309, line: 153, baseType: !41, size: 32, offset: 3680)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !308, file: !309, line: 156, baseType: !172, size: 96, offset: 3712)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !308, file: !309, line: 156, baseType: !172, size: 96, offset: 3808)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !308, file: !309, line: 156, baseType: !172, size: 96, offset: 3904)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !309, line: 157, baseType: !172, size: 96, offset: 4000)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !308, file: !309, line: 158, baseType: !172, size: 96, offset: 4096)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !308, file: !309, line: 159, baseType: !172, size: 96, offset: 4192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !308, file: !309, line: 160, baseType: !172, size: 96, offset: 4288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !308, file: !309, line: 160, baseType: !172, size: 96, offset: 4384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !308, file: !309, line: 161, baseType: !254, size: 128, offset: 4480)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !308, file: !309, line: 161, baseType: !254, size: 128, offset: 4608)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !308, file: !309, line: 162, baseType: !172, size: 96, offset: 4736)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !308, file: !309, line: 162, baseType: !172, size: 96, offset: 4832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !308, file: !309, line: 163, baseType: !35, size: 32, offset: 4928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !308, file: !309, line: 163, baseType: !35, size: 32, offset: 4960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !308, file: !309, line: 164, baseType: !462, size: 512, offset: 4992)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !463)
!463 = !{!256, !256}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !308, file: !309, line: 165, baseType: !462, size: 512, offset: 5504)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !308, file: !309, line: 166, baseType: !462, size: 512, offset: 6016)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !308, file: !309, line: 167, baseType: !462, size: 512, offset: 6528)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !308, file: !309, line: 176, baseType: !462, size: 512, offset: 7040)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !308, file: !309, line: 178, baseType: !10, size: 32, offset: 7552)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !308, file: !309, line: 180, baseType: !52, size: 16, offset: 7584)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !308, file: !309, line: 181, baseType: !52, size: 16, offset: 7600)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !308, file: !309, line: 183, baseType: !52, size: 16, offset: 7616)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !308, file: !309, line: 183, baseType: !52, size: 16, offset: 7632)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !308, file: !309, line: 184, baseType: !52, size: 16, offset: 7648)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !308, file: !309, line: 184, baseType: !52, size: 16, offset: 7664)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !308, file: !309, line: 185, baseType: !52, size: 16, offset: 7680)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !308, file: !309, line: 186, baseType: !52, size: 16, offset: 7696)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !308, file: !309, line: 187, baseType: !52, size: 16, offset: 7712)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !308, file: !309, line: 188, baseType: !87, size: 8, offset: 7728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !308, file: !309, line: 189, baseType: !87, size: 8, offset: 7736)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !308, file: !309, line: 192, baseType: !41, size: 32, offset: 7744)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !308, file: !309, line: 192, baseType: !41, size: 32, offset: 7776)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !308, file: !309, line: 192, baseType: !41, size: 32, offset: 7808)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !308, file: !309, line: 192, baseType: !41, size: 32, offset: 7840)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !308, file: !309, line: 194, baseType: !41, size: 32, offset: 7872)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !308, file: !309, line: 202, baseType: !35, size: 32, offset: 7904)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !308, file: !309, line: 202, baseType: !35, size: 32, offset: 7936)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !308, file: !309, line: 202, baseType: !35, size: 32, offset: 7968)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !308, file: !309, line: 211, baseType: !35, size: 32, offset: 8000)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !308, file: !309, line: 212, baseType: !35, size: 32, offset: 8032)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !308, file: !309, line: 213, baseType: !35, size: 32, offset: 8064)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !308, file: !309, line: 214, baseType: !35, size: 32, offset: 8096)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !308, file: !309, line: 215, baseType: !35, size: 32, offset: 8128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !308, file: !309, line: 216, baseType: !35, size: 32, offset: 8160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !308, file: !309, line: 219, baseType: !35, size: 32, offset: 8192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !308, file: !309, line: 220, baseType: !35, size: 32, offset: 8224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !308, file: !309, line: 221, baseType: !35, size: 32, offset: 8256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !308, file: !309, line: 224, baseType: !498, size: 16, offset: 8288)
!498 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !308, file: !309, line: 224, baseType: !498, size: 16, offset: 8304)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !308, file: !309, line: 226, baseType: !52, size: 16, offset: 8320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !308, file: !309, line: 228, baseType: !87, size: 8, offset: 8336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !308, file: !309, line: 229, baseType: !87, size: 8, offset: 8344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !308, file: !309, line: 231, baseType: !52, size: 16, offset: 8352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !308, file: !309, line: 232, baseType: !87, size: 8, offset: 8368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !308, file: !309, line: 233, baseType: !87, size: 8, offset: 8376)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !308, file: !309, line: 234, baseType: !35, size: 32, offset: 8384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !308, file: !309, line: 235, baseType: !35, size: 32, offset: 8416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !308, file: !309, line: 237, baseType: !125, size: 128, offset: 8448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !308, file: !309, line: 238, baseType: !125, size: 128, offset: 8576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !308, file: !309, line: 239, baseType: !125, size: 128, offset: 8704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !308, file: !309, line: 240, baseType: !125, size: 128, offset: 8832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !308, file: !309, line: 242, baseType: !35, size: 32, offset: 8960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !308, file: !309, line: 244, baseType: !52, size: 16, offset: 8992)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !308, file: !309, line: 245, baseType: !498, size: 16, offset: 9008)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !308, file: !309, line: 246, baseType: !254, size: 128, offset: 9024)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !308, file: !309, line: 248, baseType: !41, size: 32, offset: 9152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !308, file: !309, line: 249, baseType: !41, size: 32, offset: 9184)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !308, file: !309, line: 251, baseType: !519, size: 64, offset: 9216)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !309, line: 251, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !308, file: !309, line: 253, baseType: !87, size: 8, offset: 9280)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !308, file: !309, line: 254, baseType: !87, size: 8, offset: 9288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !308, file: !309, line: 255, baseType: !52, size: 16, offset: 9296)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !308, file: !309, line: 256, baseType: !172, size: 96, offset: 9312)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !308, file: !309, line: 258, baseType: !125, size: 128, offset: 9408)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !308, file: !309, line: 259, baseType: !125, size: 128, offset: 9536)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !308, file: !309, line: 260, baseType: !125, size: 128, offset: 9664)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !308, file: !309, line: 261, baseType: !125, size: 128, offset: 9792)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !308, file: !309, line: 263, baseType: !530, size: 64, offset: 9920)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !309, line: 52, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !308, file: !309, line: 264, baseType: !533, size: 64, offset: 9984)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !309, line: 53, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !308, file: !309, line: 265, baseType: !536, size: 64, offset: 10048)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !63, line: 46, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !308, file: !309, line: 267, baseType: !87, size: 8, offset: 10112)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !308, file: !309, line: 268, baseType: !87, size: 8, offset: 10120)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !308, file: !309, line: 269, baseType: !52, size: 16, offset: 10128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !308, file: !309, line: 270, baseType: !35, size: 32, offset: 10144)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !308, file: !309, line: 272, baseType: !543, size: 64, offset: 10176)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !309, line: 54, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !308, file: !309, line: 275, baseType: !546, size: 64, offset: 10240)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !309, line: 275, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !308, file: !309, line: 277, baseType: !549, size: 64, offset: 10304)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !309, line: 56, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !308, file: !309, line: 277, baseType: !549, size: 64, offset: 10368)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !308, file: !309, line: 278, baseType: !553, size: 64, offset: 10432)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !554, line: 27, baseType: !555)
!554 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !556, line: 45, baseType: !557)
!556 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!557 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !308, file: !309, line: 279, baseType: !553, size: 64, offset: 10496)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !309, line: 280, baseType: !10, size: 32, offset: 10560)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !308, file: !309, line: 281, baseType: !10, size: 32, offset: 10592)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !308, file: !309, line: 283, baseType: !125, size: 128, offset: 10624)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !308, file: !309, line: 284, baseType: !125, size: 128, offset: 10752)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !308, file: !309, line: 285, baseType: !564, size: 64, offset: 10880)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !308, file: !309, line: 287, baseType: !566, size: 64, offset: 10944)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !309, line: 59, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !308, file: !309, line: 288, baseType: !569, size: 64, offset: 11008)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !309, line: 288, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !308, file: !309, line: 290, baseType: !572, size: 64, offset: 11072)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 2)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !308, file: !309, line: 291, baseType: !576, size: 64, offset: 11136)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !578, line: 65, baseType: !579)
!578 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !578, line: 50, size: 320, elements: !580)
!580 = !{!581, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !579, file: !578, line: 51, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !417, line: 1216, size: 39680, elements: !584)
!584 = !{!585, !586, !587, !588, !1232, !1233, !1234, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1261, !1588, !1591, !1874, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1896, !1897, !1898, !1899, !1900, !1908, !1975, !1982, !1983, !1990, !1993, !1994, !1995, !1996, !1997, !1998}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !417, line: 1217, baseType: !66, size: 960)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !583, file: !417, line: 1218, baseType: !136, size: 64, offset: 960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !583, file: !417, line: 1220, baseType: !307, size: 64, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !583, file: !417, line: 1221, baseType: !589, size: 64, offset: 1088)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !591, line: 52, size: 4224, elements: !592)
!591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !668, !684}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !590, file: !591, line: 53, baseType: !66, size: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !590, file: !591, line: 54, baseType: !136, size: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !590, file: !591, line: 56, baseType: !52, size: 16, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !590, file: !591, line: 56, baseType: !52, size: 16, offset: 1040)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !590, file: !591, line: 57, baseType: !52, size: 16, offset: 1056)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !590, file: !591, line: 57, baseType: !52, size: 16, offset: 1072)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !590, file: !591, line: 59, baseType: !35, size: 32, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !590, file: !591, line: 59, baseType: !35, size: 32, offset: 1120)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !590, file: !591, line: 59, baseType: !35, size: 32, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !590, file: !591, line: 60, baseType: !35, size: 32, offset: 1184)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !590, file: !591, line: 60, baseType: !35, size: 32, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !590, file: !591, line: 60, baseType: !35, size: 32, offset: 1248)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !590, file: !591, line: 61, baseType: !35, size: 32, offset: 1280)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !590, file: !591, line: 61, baseType: !35, size: 32, offset: 1312)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !590, file: !591, line: 61, baseType: !35, size: 32, offset: 1344)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !590, file: !591, line: 68, baseType: !35, size: 32, offset: 1376)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !590, file: !591, line: 68, baseType: !35, size: 32, offset: 1408)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !590, file: !591, line: 68, baseType: !35, size: 32, offset: 1440)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !590, file: !591, line: 69, baseType: !35, size: 32, offset: 1472)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !590, file: !591, line: 69, baseType: !35, size: 32, offset: 1504)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !590, file: !591, line: 74, baseType: !35, size: 32, offset: 1536)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !590, file: !591, line: 79, baseType: !35, size: 32, offset: 1568)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !590, file: !591, line: 81, baseType: !52, size: 16, offset: 1600)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !590, file: !591, line: 91, baseType: !52, size: 16, offset: 1616)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !590, file: !591, line: 92, baseType: !52, size: 16, offset: 1632)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !590, file: !591, line: 93, baseType: !52, size: 16, offset: 1648)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !590, file: !591, line: 94, baseType: !52, size: 16, offset: 1664)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !590, file: !591, line: 94, baseType: !52, size: 16, offset: 1680)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !590, file: !591, line: 94, baseType: !52, size: 16, offset: 1696)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !590, file: !591, line: 94, baseType: !52, size: 16, offset: 1712)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !590, file: !591, line: 96, baseType: !35, size: 32, offset: 1728)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !590, file: !591, line: 96, baseType: !35, size: 32, offset: 1760)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !590, file: !591, line: 96, baseType: !35, size: 32, offset: 1792)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !590, file: !591, line: 96, baseType: !35, size: 32, offset: 1824)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !590, file: !591, line: 98, baseType: !35, size: 32, offset: 1856)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !590, file: !591, line: 98, baseType: !35, size: 32, offset: 1888)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !590, file: !591, line: 98, baseType: !35, size: 32, offset: 1920)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !590, file: !591, line: 98, baseType: !35, size: 32, offset: 1952)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !590, file: !591, line: 99, baseType: !35, size: 32, offset: 1984)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !590, file: !591, line: 99, baseType: !35, size: 32, offset: 2016)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !590, file: !591, line: 100, baseType: !35, size: 32, offset: 2048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !590, file: !591, line: 100, baseType: !35, size: 32, offset: 2080)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !590, file: !591, line: 103, baseType: !52, size: 16, offset: 2112)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !590, file: !591, line: 103, baseType: !52, size: 16, offset: 2128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !590, file: !591, line: 103, baseType: !52, size: 16, offset: 2144)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !590, file: !591, line: 103, baseType: !52, size: 16, offset: 2160)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !590, file: !591, line: 106, baseType: !35, size: 32, offset: 2176)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !590, file: !591, line: 106, baseType: !35, size: 32, offset: 2208)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !590, file: !591, line: 106, baseType: !35, size: 32, offset: 2240)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !590, file: !591, line: 106, baseType: !35, size: 32, offset: 2272)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !590, file: !591, line: 107, baseType: !52, size: 16, offset: 2304)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !590, file: !591, line: 107, baseType: !52, size: 16, offset: 2320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !590, file: !591, line: 107, baseType: !52, size: 16, offset: 2336)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !590, file: !591, line: 107, baseType: !52, size: 16, offset: 2352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !590, file: !591, line: 108, baseType: !35, size: 32, offset: 2368)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !590, file: !591, line: 108, baseType: !35, size: 32, offset: 2400)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !590, file: !591, line: 109, baseType: !35, size: 32, offset: 2432)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !590, file: !591, line: 109, baseType: !35, size: 32, offset: 2464)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !590, file: !591, line: 110, baseType: !35, size: 32, offset: 2496)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !590, file: !591, line: 110, baseType: !35, size: 32, offset: 2528)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !590, file: !591, line: 110, baseType: !35, size: 32, offset: 2560)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !590, file: !591, line: 111, baseType: !52, size: 16, offset: 2592)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !590, file: !591, line: 111, baseType: !52, size: 16, offset: 2608)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !590, file: !591, line: 112, baseType: !52, size: 16, offset: 2624)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !590, file: !591, line: 112, baseType: !52, size: 16, offset: 2640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !590, file: !591, line: 112, baseType: !52, size: 16, offset: 2656)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !591, line: 115, baseType: !52, size: 16, offset: 2672)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !590, file: !591, line: 118, baseType: !43, size: 64, offset: 2688)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !590, file: !591, line: 118, baseType: !43, size: 64, offset: 2752)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !590, file: !591, line: 121, baseType: !328, size: 64, offset: 2816)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !590, file: !591, line: 122, baseType: !298, size: 1152, offset: 2880)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !590, file: !591, line: 123, baseType: !52, size: 16, offset: 4032)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !590, file: !591, line: 123, baseType: !52, size: 16, offset: 4048)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !590, file: !591, line: 123, baseType: !667, size: 32, offset: 4064)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !573)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !590, file: !591, line: 126, baseType: !669, size: 64, offset: 4096)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !67, line: 159, size: 448, elements: !671)
!671 = !{!672, !674, !675, !676, !677, !680}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !670, file: !67, line: 161, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !573)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !670, file: !67, line: 162, baseType: !673, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !670, file: !67, line: 163, baseType: !667, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !670, file: !67, line: 164, baseType: !667, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !670, file: !67, line: 165, baseType: !678, size: 128, offset: 192)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 128, elements: !573)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !670, file: !67, line: 166, baseType: !681, size: 128, offset: 320)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 128, elements: !573)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !67, line: 46, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !590, file: !591, line: 129, baseType: !685, size: 64, offset: 4160)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !687, line: 328, size: 3456, elements: !688)
!687 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!688 = !{!689, !690, !691, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1215, !1219, !1223, !1227, !1228, !1229, !1230, !1231}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !686, file: !687, line: 329, baseType: !66, size: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !686, file: !687, line: 330, baseType: !136, size: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !686, file: !687, line: 332, baseType: !692, size: 64, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !694, line: 283, size: 4096, elements: !695)
!694 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!695 = !{!696, !697, !698, !699, !703, !704, !708, !1157, !1165, !1169, !1175, !1179, !1180, !1181, !1182, !1186, !1187}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !693, file: !694, line: 284, baseType: !41, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !693, file: !694, line: 285, baseType: !115, size: 512, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !693, file: !694, line: 287, baseType: !115, size: 512, offset: 544)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !693, file: !694, line: 288, baseType: !700, size: 2048, offset: 1056)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 2048, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !693, file: !694, line: 289, baseType: !41, size: 32, offset: 3104)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !693, file: !694, line: 292, baseType: !705, size: 64, offset: 3136)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !685}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !693, file: !694, line: 293, baseType: !709, size: 64, offset: 3200)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !685, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !687, line: 167, size: 3712, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !687, line: 168, baseType: !712, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !713, file: !687, line: 168, baseType: !712, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !713, file: !687, line: 168, baseType: !712, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !713, file: !687, line: 170, baseType: !104, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !713, file: !687, line: 172, baseType: !720, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !694, line: 144, size: 6016, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !899, !900, !901, !915, !919, !923, !924, !1002, !1006, !1010, !1011, !1012, !1013, !1017, !1018, !1022, !1026, !1030, !1034, !1038, !1042, !1046, !1047, !1064, !1066, !1092, !1112}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !721, file: !694, line: 145, baseType: !71, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !721, file: !694, line: 145, baseType: !71, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !721, file: !694, line: 146, baseType: !52, size: 16, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !721, file: !694, line: 148, baseType: !115, size: 512, offset: 144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !721, file: !694, line: 149, baseType: !41, size: 32, offset: 672)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !721, file: !694, line: 151, baseType: !115, size: 512, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !721, file: !694, line: 152, baseType: !700, size: 2048, offset: 1216)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !721, file: !694, line: 153, baseType: !41, size: 32, offset: 3264)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !721, file: !694, line: 155, baseType: !35, size: 32, offset: 3296)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !721, file: !694, line: 155, baseType: !35, size: 32, offset: 3328)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !721, file: !694, line: 155, baseType: !35, size: 32, offset: 3360)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !721, file: !694, line: 156, baseType: !35, size: 32, offset: 3392)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !721, file: !694, line: 156, baseType: !35, size: 32, offset: 3424)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !721, file: !694, line: 156, baseType: !35, size: 32, offset: 3456)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !721, file: !694, line: 157, baseType: !52, size: 16, offset: 3488)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !721, file: !694, line: 157, baseType: !52, size: 16, offset: 3504)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !721, file: !694, line: 157, baseType: !52, size: 16, offset: 3520)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !721, file: !694, line: 160, baseType: !741, size: 64, offset: 3584)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !694, line: 109, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !694, line: 98, size: 1408, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !898}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !743, file: !694, line: 99, baseType: !41, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !743, file: !694, line: 99, baseType: !41, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !694, line: 100, baseType: !115, size: 512, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !743, file: !694, line: 101, baseType: !35, size: 32, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !743, file: !694, line: 101, baseType: !35, size: 32, offset: 608)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !743, file: !694, line: 101, baseType: !35, size: 32, offset: 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !743, file: !694, line: 101, baseType: !35, size: 32, offset: 672)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !743, file: !694, line: 102, baseType: !35, size: 32, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !743, file: !694, line: 102, baseType: !35, size: 32, offset: 736)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !743, file: !694, line: 103, baseType: !41, size: 32, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !694, line: 104, baseType: !41, size: 32, offset: 800)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !743, file: !694, line: 107, baseType: !757, size: 64, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !687, line: 87, size: 2816, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !883}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !758, file: !687, line: 88, baseType: !757, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !758, file: !687, line: 88, baseType: !757, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !758, file: !687, line: 88, baseType: !757, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !758, file: !687, line: 90, baseType: !104, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !758, file: !687, line: 92, baseType: !115, size: 512, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !758, file: !687, line: 94, baseType: !115, size: 512, offset: 768)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !758, file: !687, line: 99, baseType: !71, size: 64, offset: 1280)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !687, line: 101, baseType: !52, size: 16, offset: 1344)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !758, file: !687, line: 101, baseType: !52, size: 16, offset: 1360)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !758, file: !687, line: 102, baseType: !52, size: 16, offset: 1376)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !758, file: !687, line: 103, baseType: !52, size: 16, offset: 1392)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !758, file: !687, line: 104, baseType: !772, size: 64, offset: 1408)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !694, line: 114, size: 1600, elements: !774)
!774 = !{!775, !776, !799, !803, !807, !811, !815, !819, !820, !824, !853, !854, !855}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !773, file: !694, line: 115, baseType: !115, size: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !773, file: !694, line: 117, baseType: !777, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !780, !783, !785, !785, !797}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !782, line: 60, flags: DIFlagFwdDecl)
!782 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !694, line: 73, flags: DIFlagFwdDecl)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !787, line: 55, size: 192, elements: !788)
!787 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!788 = !{!789, !793, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !786, file: !787, line: 58, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !786, file: !787, line: 56, size: 64, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !790, file: !787, line: 57, baseType: !71, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !786, file: !787, line: 60, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !687, line: 335, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !786, file: !787, line: 61, baseType: !71, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !773, file: !694, line: 118, baseType: !800, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !780, !785, !785, !43}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !773, file: !694, line: 120, baseType: !804, size: 64, offset: 640)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
