; ModuleID = 'blender/source/blender/blenkernel/intern/crazyspace.c'
source_filename = "blender/source/blender/blenkernel/intern/crazyspace.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }

!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!150 = !DIEnumerator(name: "eModifierType_None", value: 0, isUnsigned: true)
!151 = !DIEnumerator(name: "eModifierType_Subsurf", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "eModifierType_Lattice", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "eModifierType_Curve", value: 3, isUnsigned: true)
!154 = !DIEnumerator(name: "eModifierType_Build", value: 4, isUnsigned: true)
!155 = !DIEnumerator(name: "eModifierType_Mirror", value: 5, isUnsigned: true)
!156 = !DIEnumerator(name: "eModifierType_Decimate", value: 6, isUnsigned: true)
!157 = !DIEnumerator(name: "eModifierType_Wave", value: 7, isUnsigned: true)
!158 = !DIEnumerator(name: "eModifierType_Armature", value: 8, isUnsigned: true)
!159 = !DIEnumerator(name: "eModifierType_Hook", value: 9, isUnsigned: true)
!160 = !DIEnumerator(name: "eModifierType_Softbody", value: 10, isUnsigned: true)
!161 = !DIEnumerator(name: "eModifierType_Boolean", value: 11, isUnsigned: true)
!162 = !DIEnumerator(name: "eModifierType_Array", value: 12, isUnsigned: true)
!163 = !DIEnumerator(name: "eModifierType_EdgeSplit", value: 13, isUnsigned: true)
!164 = !DIEnumerator(name: "eModifierType_Displace", value: 14, isUnsigned: true)
!165 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!166 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!167 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!168 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!169 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!170 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!171 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!172 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!173 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!174 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!175 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!176 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!177 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!178 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!179 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!180 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!181 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!182 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!183 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!184 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!185 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!186 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!187 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!188 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!189 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!190 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!191 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!192 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!193 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!194 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!195 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!196 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!197 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!198 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!199 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!200 = !{!201, !202, !2047, !2048, !2052, !543, !604, !608, !586, !228}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !204, line: 133, baseType: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !204, line: 58, size: 11008, elements: !206)
!206 = !{!207, !277, !281, !294, !298, !301, !305, !311, !320, !416, !422, !429, !437, !448, !461, !474, !485, !494, !506, !514, !516, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !205, file: !204, line: 59, baseType: !208, size: 960)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !209, line: 130, baseType: !210)
!209 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !209, line: 117, size: 960, elements: !211)
!211 = !{!212, !213, !214, !216, !236, !240, !242, !243, !244, !245}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !209, line: 118, baseType: !201, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !209, line: 118, baseType: !201, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !210, file: !209, line: 119, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !210, file: !209, line: 120, baseType: !217, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !209, line: 136, size: 17600, elements: !219)
!219 = !{!220, !221, !223, !226, !231, !232, !233}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !218, file: !209, line: 137, baseType: !208, size: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !218, file: !209, line: 138, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !218, file: !209, line: 139, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !209, line: 43, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !209, line: 140, baseType: !227, size: 8192, offset: 1088)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 8192, elements: !229)
!228 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!229 = !{!230}
!230 = !DISubrange(count: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !218, file: !209, line: 141, baseType: !227, size: 8192, offset: 9280)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !218, file: !209, line: 148, baseType: !217, size: 64, offset: 17472)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !218, file: !209, line: 150, baseType: !234, size: 64, offset: 17536)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !209, line: 45, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !209, line: 121, baseType: !237, size: 528, offset: 256)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 528, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 66)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !209, line: 126, baseType: !241, size: 16, offset: 784)
!241 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !210, file: !209, line: 127, baseType: !138, size: 32, offset: 800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !210, file: !209, line: 128, baseType: !138, size: 32, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !210, file: !209, line: 128, baseType: !138, size: 32, offset: 864)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !210, file: !209, line: 129, baseType: !246, size: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !209, line: 75, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !209, line: 62, size: 1024, elements: !249)
!249 = !{!250, !252, !253, !254, !255, !256, !260, !261, !275, !276}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !209, line: 63, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !248, file: !209, line: 63, baseType: !251, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !209, line: 64, baseType: !228, size: 8, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !248, file: !209, line: 64, baseType: !228, size: 8, offset: 136)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !248, file: !209, line: 65, baseType: !241, size: 16, offset: 144)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !248, file: !209, line: 66, baseType: !257, size: 512, offset: 160)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 512, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !248, file: !209, line: 67, baseType: !138, size: 32, offset: 672)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !209, line: 69, baseType: !262, size: 256, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !209, line: 60, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !209, line: 48, size: 256, elements: !264)
!264 = !{!265, !266, !273, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !263, file: !209, line: 49, baseType: !201, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !263, file: !209, line: 58, baseType: !267, size: 128, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !268, line: 71, baseType: !269)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !268, line: 69, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !269, file: !268, line: 70, baseType: !201, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !269, file: !268, line: 70, baseType: !201, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !263, file: !209, line: 59, baseType: !138, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !263, file: !209, line: 59, baseType: !138, size: 32, offset: 224)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !248, file: !209, line: 70, baseType: !138, size: 32, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !248, file: !209, line: 74, baseType: !138, size: 32, offset: 992)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !205, file: !204, line: 60, baseType: !278, size: 64, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !280, line: 58, flags: DIFlagFwdDecl)
!280 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !205, file: !204, line: 62, baseType: !282, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !284, line: 97, size: 832, elements: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = !{!286, !292, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !283, file: !284, line: 98, baseType: !287, size: 768)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 768, elements: !289)
!288 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!289 = !{!290, !291}
!290 = !DISubrange(count: 8)
!291 = !DISubrange(count: 3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !284, line: 99, baseType: !138, size: 32, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !283, file: !284, line: 99, baseType: !138, size: 32, offset: 800)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !205, file: !204, line: 64, baseType: !295, size: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !297, line: 46, flags: DIFlagFwdDecl)
!297 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !205, file: !204, line: 65, baseType: !299, size: 64, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !204, line: 42, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !205, file: !204, line: 66, baseType: !302, size: 64, offset: 1216)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !280, line: 179, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !205, file: !204, line: 67, baseType: !306, size: 64, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !103, line: 154, size: 64, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !307, file: !103, line: 155, baseType: !138, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !103, line: 156, baseType: !138, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !205, file: !204, line: 71, baseType: !312, size: 64, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !103, line: 79, size: 96, elements: !314)
!314 = !{!315, !316, !317, !318, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !313, file: !103, line: 81, baseType: !138, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !313, file: !103, line: 82, baseType: !138, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !313, file: !103, line: 83, baseType: !241, size: 16, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !103, line: 84, baseType: !228, size: 8, offset: 80)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !313, file: !103, line: 84, baseType: !228, size: 8, offset: 88)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !205, file: !204, line: 72, baseType: !321, size: 64, offset: 1408)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !103, line: 93, size: 128, elements: !323)
!323 = !{!324, !411, !412, !413, !414, !415}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !322, file: !103, line: 94, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !327, line: 77, size: 15424, elements: !328)
!327 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!328 = !{!329, !330, !331, !334, !337, !340, !343, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !362, !363, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !392, !393, !394, !400, !401, !405}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !326, file: !327, line: 78, baseType: !208, size: 960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !327, line: 80, baseType: !227, size: 8192, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !326, file: !327, line: 82, baseType: !332, size: 64, offset: 9152)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !327, line: 43, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !326, file: !327, line: 83, baseType: !335, size: 64, offset: 9216)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !209, line: 46, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !326, file: !327, line: 86, baseType: !338, size: 64, offset: 9280)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !327, line: 41, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !326, file: !327, line: 87, baseType: !341, size: 64, offset: 9344)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !327, line: 44, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !326, file: !327, line: 89, baseType: !344, size: 512, offset: 9408)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 512, elements: !345)
!345 = !{!290}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !326, file: !327, line: 90, baseType: !241, size: 16, offset: 9920)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !326, file: !327, line: 90, baseType: !241, size: 16, offset: 9936)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !326, file: !327, line: 92, baseType: !241, size: 16, offset: 9952)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !327, line: 92, baseType: !241, size: 16, offset: 9968)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !326, file: !327, line: 93, baseType: !241, size: 16, offset: 9984)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !327, line: 93, baseType: !241, size: 16, offset: 10000)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !326, file: !327, line: 94, baseType: !138, size: 32, offset: 10016)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !326, file: !327, line: 97, baseType: !241, size: 16, offset: 10048)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !326, file: !327, line: 97, baseType: !241, size: 16, offset: 10064)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !326, file: !327, line: 98, baseType: !241, size: 16, offset: 10080)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !326, file: !327, line: 98, baseType: !241, size: 16, offset: 10096)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !326, file: !327, line: 99, baseType: !241, size: 16, offset: 10112)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !326, file: !327, line: 99, baseType: !241, size: 16, offset: 10128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !326, file: !327, line: 100, baseType: !5, size: 32, offset: 10144)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !326, file: !327, line: 101, baseType: !361, size: 64, offset: 10176)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !326, file: !327, line: 103, baseType: !234, size: 64, offset: 10240)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !326, file: !327, line: 104, baseType: !364, size: 64, offset: 10304)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !209, line: 159, size: 448, elements: !366)
!366 = !{!367, !371, !372, !374, !375, !377}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !365, file: !209, line: 161, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 2)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !365, file: !209, line: 162, baseType: !368, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !365, file: !209, line: 163, baseType: !373, size: 32, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 32, elements: !369)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !365, file: !209, line: 164, baseType: !373, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !365, file: !209, line: 165, baseType: !376, size: 128, offset: 192)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 128, elements: !369)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !365, file: !209, line: 166, baseType: !378, size: 128, offset: 320)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 128, elements: !369)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !326, file: !327, line: 107, baseType: !288, size: 32, offset: 10368)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !326, file: !327, line: 108, baseType: !138, size: 32, offset: 10400)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !326, file: !327, line: 109, baseType: !241, size: 16, offset: 10432)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !326, file: !327, line: 110, baseType: !241, size: 16, offset: 10448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !326, file: !327, line: 113, baseType: !138, size: 32, offset: 10464)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !326, file: !327, line: 113, baseType: !138, size: 32, offset: 10496)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !326, file: !327, line: 114, baseType: !228, size: 8, offset: 10528)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !326, file: !327, line: 114, baseType: !228, size: 8, offset: 10536)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !326, file: !327, line: 115, baseType: !241, size: 16, offset: 10544)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !326, file: !327, line: 116, baseType: !389, size: 128, offset: 10560)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 128, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 4)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !326, file: !327, line: 119, baseType: !288, size: 32, offset: 10688)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !326, file: !327, line: 119, baseType: !288, size: 32, offset: 10720)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !326, file: !327, line: 122, baseType: !395, size: 512, offset: 10752)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !396, line: 182, baseType: !397)
!396 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !396, line: 180, size: 512, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !396, line: 181, baseType: !257, size: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !326, file: !327, line: 123, baseType: !228, size: 8, offset: 11264)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !326, file: !327, line: 125, baseType: !402, size: 56, offset: 11272)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 56, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 7)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !326, file: !327, line: 126, baseType: !406, size: 4096, offset: 11328)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 4096, elements: !345)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !327, line: 69, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !327, line: 67, size: 512, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !327, line: 68, baseType: !257, size: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !103, line: 95, baseType: !228, size: 8, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !322, file: !103, line: 95, baseType: !228, size: 8, offset: 72)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !322, file: !103, line: 96, baseType: !241, size: 16, offset: 80)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !322, file: !103, line: 96, baseType: !241, size: 16, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !322, file: !103, line: 96, baseType: !241, size: 16, offset: 112)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !205, file: !204, line: 73, baseType: !417, size: 64, offset: 1472)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !103, line: 88, size: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !418, file: !103, line: 89, baseType: !5, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !418, file: !103, line: 90, baseType: !5, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !205, file: !204, line: 74, baseType: !423, size: 64, offset: 1536)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !103, line: 109, size: 96, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !424, file: !103, line: 110, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 64, elements: !369)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !424, file: !103, line: 111, baseType: !138, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !205, file: !204, line: 75, baseType: !430, size: 64, offset: 1600)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !103, line: 129, size: 32, elements: !432)
!432 = !{!433, !434, !435, !436}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !431, file: !103, line: 130, baseType: !228, size: 8)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !431, file: !103, line: 130, baseType: !228, size: 8, offset: 8)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !431, file: !103, line: 130, baseType: !228, size: 8, offset: 16)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !431, file: !103, line: 130, baseType: !228, size: 8, offset: 24)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !205, file: !204, line: 80, baseType: !438, size: 64, offset: 1664)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !103, line: 42, size: 160, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !439, file: !103, line: 43, baseType: !5, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !439, file: !103, line: 43, baseType: !5, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !439, file: !103, line: 43, baseType: !5, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !439, file: !103, line: 43, baseType: !5, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !439, file: !103, line: 44, baseType: !241, size: 16, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !439, file: !103, line: 45, baseType: !228, size: 8, offset: 144)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !439, file: !103, line: 45, baseType: !228, size: 8, offset: 152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !205, file: !204, line: 81, baseType: !449, size: 64, offset: 1728)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !103, line: 160, size: 384, elements: !451)
!451 = !{!452, !455, !456, !457, !458, !459, !460}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !450, file: !103, line: 161, baseType: !453, size: 256)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 256, elements: !454)
!454 = !{!391, !370}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !450, file: !103, line: 162, baseType: !325, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !103, line: 163, baseType: !228, size: 8, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !450, file: !103, line: 163, baseType: !228, size: 8, offset: 328)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !450, file: !103, line: 164, baseType: !241, size: 16, offset: 336)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !450, file: !103, line: 164, baseType: !241, size: 16, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !450, file: !103, line: 164, baseType: !241, size: 16, offset: 368)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !205, file: !204, line: 82, baseType: !462, size: 64, offset: 1792)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !204, line: 136, size: 512, elements: !464)
!464 = !{!465, !466, !467, !469, !470, !471, !472, !473}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !463, file: !204, line: 137, baseType: !201, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !463, file: !204, line: 138, baseType: !453, size: 256, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !463, file: !204, line: 139, baseType: !468, size: 128, offset: 320)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !390)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !463, file: !204, line: 140, baseType: !228, size: 8, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !463, file: !204, line: 140, baseType: !228, size: 8, offset: 456)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !463, file: !204, line: 141, baseType: !241, size: 16, offset: 464)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !463, file: !204, line: 141, baseType: !241, size: 16, offset: 480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !463, file: !204, line: 141, baseType: !241, size: 16, offset: 496)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !205, file: !204, line: 83, baseType: !475, size: 64, offset: 1856)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !103, line: 65, size: 160, elements: !477)
!477 = !{!478, !481, !483, !484}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !476, file: !103, line: 66, baseType: !479, size: 96)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 96, elements: !480)
!480 = !{!291}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !476, file: !103, line: 67, baseType: !482, size: 48, offset: 96)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 48, elements: !480)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !476, file: !103, line: 68, baseType: !228, size: 8, offset: 144)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !476, file: !103, line: 68, baseType: !228, size: 8, offset: 152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !205, file: !204, line: 84, baseType: !486, size: 64, offset: 1920)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !103, line: 48, size: 96, elements: !488)
!488 = !{!489, !490, !491, !492, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !487, file: !103, line: 49, baseType: !5, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !487, file: !103, line: 49, baseType: !5, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !487, file: !103, line: 50, baseType: !228, size: 8, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !487, file: !103, line: 50, baseType: !228, size: 8, offset: 72)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !103, line: 51, baseType: !241, size: 16, offset: 80)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !205, file: !204, line: 85, baseType: !495, size: 64, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !103, line: 59, size: 128, elements: !497)
!497 = !{!498, !504, !505}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !496, file: !103, line: 60, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !103, line: 54, size: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !500, file: !103, line: 55, baseType: !138, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !500, file: !103, line: 56, baseType: !288, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !496, file: !103, line: 61, baseType: !138, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !103, line: 62, baseType: !138, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !205, file: !204, line: 89, baseType: !507, size: 64, offset: 2048)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !103, line: 74, size: 32, elements: !509)
!509 = !{!510, !511, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !508, file: !103, line: 75, baseType: !228, size: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !508, file: !103, line: 75, baseType: !228, size: 8, offset: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !508, file: !103, line: 75, baseType: !228, size: 8, offset: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !508, file: !103, line: 75, baseType: !228, size: 8, offset: 24)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !205, file: !204, line: 90, baseType: !515, size: 64, offset: 2112)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !205, file: !204, line: 93, baseType: !517, size: 64, offset: 2176)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !519, line: 54, size: 896, elements: !520)
!519 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!520 = !{!521, !716, !717, !718, !721, !722, !1986, !1987, !1990, !1992, !1993, !1994, !1995, !1996, !1997, !1998}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !518, file: !519, line: 55, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !87, line: 186, size: 8064, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !538, !539, !540, !541, !602, !606, !610, !611, !612, !613, !614, !615, !616, !617, !672, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !523, file: !87, line: 187, baseType: !138, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !523, file: !87, line: 187, baseType: !138, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !523, file: !87, line: 187, baseType: !138, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !523, file: !87, line: 187, baseType: !138, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !523, file: !87, line: 188, baseType: !138, size: 32, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !523, file: !87, line: 188, baseType: !138, size: 32, offset: 160)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !523, file: !87, line: 188, baseType: !138, size: 32, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !523, file: !87, line: 193, baseType: !228, size: 8, offset: 224)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !523, file: !87, line: 197, baseType: !228, size: 8, offset: 232)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !523, file: !87, line: 201, baseType: !535, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !537, line: 71, flags: DIFlagFwdDecl)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !523, file: !87, line: 201, baseType: !535, size: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !523, file: !87, line: 201, baseType: !535, size: 64, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !523, file: !87, line: 201, baseType: !535, size: 64, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !523, file: !87, line: 208, baseType: !542, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !87, line: 103, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !87, line: 90, size: 448, elements: !546)
!546 = !{!547, !556, !561, !562, !563}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !545, file: !87, line: 91, baseType: !548, size: 128)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !87, line: 82, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !87, line: 64, size: 128, elements: !550)
!550 = !{!551, !552, !553, !554, !555}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !549, file: !87, line: 65, baseType: !201, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !549, file: !87, line: 66, baseType: !138, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !549, file: !87, line: 73, baseType: !228, size: 8, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !549, file: !87, line: 74, baseType: !228, size: 8, offset: 104)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !549, file: !87, line: 80, baseType: !228, size: 8, offset: 112)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !545, file: !87, line: 92, baseType: !557, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !87, line: 180, size: 16, elements: !559)
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !558, file: !87, line: 181, baseType: !241, size: 16)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !545, file: !87, line: 94, baseType: !479, size: 96, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !545, file: !87, line: 95, baseType: !479, size: 96, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !545, file: !87, line: 102, baseType: !564, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !87, line: 110, size: 640, elements: !566)
!566 = !{!567, !568, !569, !571, !572, !595, !601}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !565, file: !87, line: 111, baseType: !548, size: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !565, file: !87, line: 112, baseType: !557, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !565, file: !87, line: 114, baseType: !570, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !565, file: !87, line: 114, baseType: !570, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !565, file: !87, line: 118, baseType: !573, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !87, line: 125, size: 576, elements: !575)
!575 = !{!576, !577, !578, !579, !591, !592, !593, !594}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !574, file: !87, line: 126, baseType: !548, size: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !574, file: !87, line: 129, baseType: !570, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !574, file: !87, line: 130, baseType: !564, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !574, file: !87, line: 131, baseType: !580, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !87, line: 164, size: 448, elements: !582)
!582 = !{!583, !584, !585, !588, !589, !590}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !581, file: !87, line: 165, baseType: !548, size: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !581, file: !87, line: 166, baseType: !557, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !581, file: !87, line: 172, baseType: !586, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !87, line: 140, baseType: !574)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !581, file: !87, line: 174, baseType: !138, size: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !581, file: !87, line: 175, baseType: !479, size: 96, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !581, file: !87, line: 176, baseType: !241, size: 16, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !574, file: !87, line: 135, baseType: !573, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !574, file: !87, line: 135, baseType: !573, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !87, line: 139, baseType: !573, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !574, file: !87, line: 139, baseType: !573, size: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !565, file: !87, line: 122, baseType: !596, size: 128, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !87, line: 108, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !87, line: 106, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !597, file: !87, line: 107, baseType: !564, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !597, file: !87, line: 107, baseType: !564, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !565, file: !87, line: 122, baseType: !596, size: 128, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !523, file: !87, line: 209, baseType: !603, size: 64, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !87, line: 123, baseType: !565)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !523, file: !87, line: 210, baseType: !607, size: 64, offset: 640)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !87, line: 178, baseType: !581)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !523, file: !87, line: 213, baseType: !138, size: 32, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !523, file: !87, line: 214, baseType: !138, size: 32, offset: 736)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !523, file: !87, line: 215, baseType: !138, size: 32, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !523, file: !87, line: 218, baseType: !535, size: 64, offset: 832)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !523, file: !87, line: 218, baseType: !535, size: 64, offset: 896)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !523, file: !87, line: 218, baseType: !535, size: 64, offset: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !523, file: !87, line: 220, baseType: !138, size: 32, offset: 1024)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !523, file: !87, line: 221, baseType: !618, size: 64, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !32, line: 190, size: 10496, elements: !620)
!620 = !{!621, !658, !659, !665, !668, !669, !671}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !619, file: !32, line: 191, baseType: !622, size: 5120)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 5120, elements: !656)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !32, line: 147, size: 320, elements: !624)
!624 = !{!625, !628, !630, !640, !641}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !623, file: !32, line: 148, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !623, file: !32, line: 149, baseType: !629, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !32, line: 112, baseType: !31)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !623, file: !32, line: 150, baseType: !631, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !32, line: 142, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !32, line: 138, size: 32, elements: !633)
!633 = !{!634, !636, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !632, file: !32, line: 139, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !32, line: 122, baseType: !42)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !632, file: !32, line: 140, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !32, line: 136, baseType: !48)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !632, file: !32, line: 141, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !32, line: 130, baseType: !54)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !623, file: !32, line: 152, baseType: !138, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !623, file: !32, line: 162, baseType: !642, size: 128, offset: 192)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !32, line: 155, size: 128, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !650}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !642, file: !32, line: 156, baseType: !138, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !642, file: !32, line: 157, baseType: !288, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !642, file: !32, line: 158, baseType: !201, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !642, file: !32, line: 159, baseType: !479, size: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !642, file: !32, line: 160, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !642, file: !32, line: 161, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !653, line: 48, baseType: !654)
!653 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !655, line: 47, flags: DIFlagFwdDecl)
!655 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!656 = !{!657}
!657 = !DISubrange(count: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !619, file: !32, line: 192, baseType: !622, size: 5120, offset: 5120)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !619, file: !32, line: 193, baseType: !660, size: 64, offset: 10240)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !663, !618}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !87, line: 246, baseType: !523)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !619, file: !32, line: 194, baseType: !666, size: 64, offset: 10304)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !32, line: 194, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !32, line: 195, baseType: !138, size: 32, offset: 10368)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !619, file: !32, line: 196, baseType: !670, size: 32, offset: 10400)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !32, line: 188, baseType: !62)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !32, line: 197, baseType: !138, size: 32, offset: 10432)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !523, file: !87, line: 223, baseType: !673, size: 1600, offset: 1152)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !537, line: 73, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !537, line: 64, size: 1600, elements: !675)
!675 = !{!676, !691, !695, !696, !697, !698, !699}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !674, file: !537, line: 65, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !537, line: 53, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !537, line: 42, size: 832, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !679, file: !537, line: 43, baseType: !138, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !679, file: !537, line: 44, baseType: !138, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !537, line: 45, baseType: !138, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !679, file: !537, line: 46, baseType: !138, size: 32, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !679, file: !537, line: 47, baseType: !138, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !679, file: !537, line: 48, baseType: !138, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !679, file: !537, line: 49, baseType: !138, size: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !679, file: !537, line: 50, baseType: !138, size: 32, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !537, line: 51, baseType: !257, size: 512, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !679, file: !537, line: 52, baseType: !201, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !674, file: !537, line: 66, baseType: !692, size: 1312, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1312, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 41)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !674, file: !537, line: 69, baseType: !138, size: 32, offset: 1376)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !674, file: !537, line: 69, baseType: !138, size: 32, offset: 1408)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !674, file: !537, line: 70, baseType: !138, size: 32, offset: 1440)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !674, file: !537, line: 71, baseType: !535, size: 64, offset: 1472)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !674, file: !537, line: 72, baseType: !700, size: 64, offset: 1536)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !537, line: 59, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !537, line: 57, size: 8192, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !702, file: !537, line: 58, baseType: !227, size: 8192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !523, file: !87, line: 223, baseType: !673, size: 1600, offset: 2752)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !523, file: !87, line: 223, baseType: !673, size: 1600, offset: 4352)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !523, file: !87, line: 223, baseType: !673, size: 1600, offset: 5952)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !523, file: !87, line: 233, baseType: !241, size: 16, offset: 7552)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !523, file: !87, line: 236, baseType: !138, size: 32, offset: 7584)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !523, file: !87, line: 238, baseType: !138, size: 32, offset: 7616)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !523, file: !87, line: 238, baseType: !138, size: 32, offset: 7648)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !523, file: !87, line: 239, baseType: !267, size: 128, offset: 7680)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !523, file: !87, line: 241, baseType: !608, size: 64, offset: 7808)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !523, file: !87, line: 243, baseType: !267, size: 128, offset: 7872)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !523, file: !87, line: 245, baseType: !201, size: 64, offset: 8000)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !518, file: !519, line: 58, baseType: !517, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !518, file: !519, line: 59, baseType: !138, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !518, file: !519, line: 63, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 192, elements: !480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !518, file: !519, line: 64, baseType: !138, size: 32, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !518, file: !519, line: 67, baseType: !723, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !743, !746, !748, !749, !751, !752, !753, !754, !760, !765, !766, !770, !771, !772, !773, !774, !778, !782, !786, !790, !794, !798, !802, !806, !810, !814, !818, !822, !826, !827, !828, !829, !830, !831, !835, !836, !837, !838, !842, !843, !844, !845, !846, !851, !852, !853, !854, !855, !859, !860, !861, !862, !863, !870, !881, !886, !892, !902, !907, !918, !925, !932, !936, !941, !945, !950, !951, !952, !1906, !1912, !1913, !1914, !1918, !1919, !1928, !1943, !1947, !1955, !1959, !1963, !1967, !1975, !1985}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !724, file: !4, line: 180, baseType: !673, size: 1600)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !724, file: !4, line: 180, baseType: !673, size: 1600, offset: 1600)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !724, file: !4, line: 180, baseType: !673, size: 1600, offset: 3200)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !724, file: !4, line: 180, baseType: !673, size: 1600, offset: 4800)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !724, file: !4, line: 180, baseType: !673, size: 1600, offset: 6400)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !724, file: !4, line: 181, baseType: !138, size: 32, offset: 8000)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !724, file: !4, line: 181, baseType: !138, size: 32, offset: 8032)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !724, file: !4, line: 181, baseType: !138, size: 32, offset: 8064)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !724, file: !4, line: 181, baseType: !138, size: 32, offset: 8096)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !724, file: !4, line: 181, baseType: !138, size: 32, offset: 8128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !724, file: !4, line: 182, baseType: !138, size: 32, offset: 8160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !724, file: !4, line: 183, baseType: !138, size: 32, offset: 8192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !724, file: !4, line: 184, baseType: !739, size: 64, offset: 8256)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !740, line: 124, baseType: !741)
!740 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !740, line: 124, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !724, file: !4, line: 185, baseType: !744, size: 64, offset: 8320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !724, file: !4, line: 186, baseType: !747, size: 32, offset: 8384)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !724, file: !4, line: 187, baseType: !288, size: 32, offset: 8416)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !724, file: !4, line: 188, baseType: !750, size: 32, offset: 8448)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !724, file: !4, line: 189, baseType: !138, size: 32, offset: 8480)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !724, file: !4, line: 190, baseType: !302, size: 64, offset: 8512)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !724, file: !4, line: 193, baseType: !228, size: 8, offset: 8576)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !724, file: !4, line: 196, baseType: !755, size: 64, offset: 8640)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !724)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !724, file: !4, line: 199, baseType: !761, size: 64, offset: 8704)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !758, !764}
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !724, file: !4, line: 202, baseType: !755, size: 64, offset: 8768)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !724, file: !4, line: 207, baseType: !767, size: 64, offset: 8832)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!138, !758}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !724, file: !4, line: 208, baseType: !767, size: 64, offset: 8896)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !724, file: !4, line: 209, baseType: !767, size: 64, offset: 8960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !724, file: !4, line: 210, baseType: !767, size: 64, offset: 9024)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !724, file: !4, line: 211, baseType: !767, size: 64, offset: 9088)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !724, file: !4, line: 218, baseType: !775, size: 64, offset: 9152)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !758, !138, !475}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !724, file: !4, line: 219, baseType: !779, size: 64, offset: 9216)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !758, !138, !486}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !724, file: !4, line: 220, baseType: !783, size: 64, offset: 9280)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !758, !138, !438}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !724, file: !4, line: 227, baseType: !787, size: 64, offset: 9344)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!475, !758}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !724, file: !4, line: 228, baseType: !791, size: 64, offset: 9408)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!486, !758}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !724, file: !4, line: 229, baseType: !795, size: 64, offset: 9472)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!438, !758}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !724, file: !4, line: 230, baseType: !799, size: 64, offset: 9536)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!417, !758}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !724, file: !4, line: 231, baseType: !803, size: 64, offset: 9600)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!312, !758}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !724, file: !4, line: 236, baseType: !807, size: 64, offset: 9664)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !758, !475}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !724, file: !4, line: 237, baseType: !811, size: 64, offset: 9728)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !758, !486}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !724, file: !4, line: 238, baseType: !815, size: 64, offset: 9792)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !758, !438}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !724, file: !4, line: 239, baseType: !819, size: 64, offset: 9856)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !758, !417}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !724, file: !4, line: 240, baseType: !823, size: 64, offset: 9920)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !758, !312}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !724, file: !4, line: 245, baseType: !787, size: 64, offset: 9984)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !724, file: !4, line: 246, baseType: !791, size: 64, offset: 10048)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !724, file: !4, line: 247, baseType: !795, size: 64, offset: 10112)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !724, file: !4, line: 248, baseType: !799, size: 64, offset: 10176)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !724, file: !4, line: 249, baseType: !803, size: 64, offset: 10240)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !724, file: !4, line: 255, baseType: !832, size: 64, offset: 10304)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!201, !758, !138, !138}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !724, file: !4, line: 256, baseType: !832, size: 64, offset: 10368)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !724, file: !4, line: 257, baseType: !832, size: 64, offset: 10432)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !724, file: !4, line: 258, baseType: !832, size: 64, offset: 10496)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !724, file: !4, line: 264, baseType: !839, size: 64, offset: 10560)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!201, !758, !138}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !724, file: !4, line: 265, baseType: !839, size: 64, offset: 10624)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !724, file: !4, line: 266, baseType: !839, size: 64, offset: 10688)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !724, file: !4, line: 267, baseType: !839, size: 64, offset: 10752)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !724, file: !4, line: 268, baseType: !839, size: 64, offset: 10816)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !724, file: !4, line: 272, baseType: !847, size: 64, offset: 10880)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!850, !758}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !724, file: !4, line: 273, baseType: !847, size: 64, offset: 10944)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !724, file: !4, line: 274, baseType: !847, size: 64, offset: 11008)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !724, file: !4, line: 275, baseType: !847, size: 64, offset: 11072)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !724, file: !4, line: 276, baseType: !847, size: 64, offset: 11136)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !724, file: !4, line: 279, baseType: !856, size: 64, offset: 11200)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !758, !138, !850, !138}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !724, file: !4, line: 280, baseType: !856, size: 64, offset: 11264)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !724, file: !4, line: 281, baseType: !856, size: 64, offset: 11328)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !724, file: !4, line: 284, baseType: !767, size: 64, offset: 11392)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !724, file: !4, line: 285, baseType: !767, size: 64, offset: 11456)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !724, file: !4, line: 286, baseType: !864, size: 64, offset: 11520)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!867, !758}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !724, file: !4, line: 287, baseType: !871, size: 64, offset: 11584)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!874, !758}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !877)
!877 = !{!878, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !876, file: !4, line: 118, baseType: !879, size: 128)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !390)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !876, file: !4, line: 119, baseType: !879, size: 128, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !724, file: !4, line: 288, baseType: !882, size: 64, offset: 11648)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!885, !758}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !724, file: !4, line: 289, baseType: !887, size: 64, offset: 11712)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !758, !890}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !724, file: !4, line: 290, baseType: !893, size: 64, offset: 11776)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!896, !758}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !898, file: !4, line: 124, baseType: !241, size: 16)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !898, file: !4, line: 125, baseType: !228, size: 8, offset: 16)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !724, file: !4, line: 291, baseType: !903, size: 64, offset: 11840)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!906, !758}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !724, file: !4, line: 299, baseType: !908, size: 64, offset: 11904)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !758, !911, !201, !917}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !201, !138, !914, !914, !915}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !4, line: 162, baseType: !15)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !724, file: !4, line: 309, baseType: !919, size: 64, offset: 11968)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !758, !922, !201}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !201, !138, !914, !914}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !724, file: !4, line: 317, baseType: !926, size: 64, offset: 12032)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !758, !929, !201, !917}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !201, !138, !138, !914, !914}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !724, file: !4, line: 327, baseType: !933, size: 64, offset: 12096)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !758, !922, !201, !917}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !724, file: !4, line: 337, baseType: !937, size: 64, offset: 12160)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !758, !940, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !724, file: !4, line: 344, baseType: !942, size: 64, offset: 12224)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !758, !138, !940}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !724, file: !4, line: 347, baseType: !946, size: 64, offset: 12288)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !758, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !724, file: !4, line: 350, baseType: !942, size: 64, offset: 12352)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !724, file: !4, line: 351, baseType: !942, size: 64, offset: 12416)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !724, file: !4, line: 355, baseType: !953, size: 64, offset: 12480)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!956, !959, !758}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !4, line: 355, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !284, line: 115, size: 11392, elements: !961)
!961 = !{!962, !963, !964, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !993, !994, !1034, !1035, !1038, !1039, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1151, !1154, !1158, !1159, !1160, !1161, !1162, !1165, !1168, !1169, !1170, !1176, !1177, !1178, !1179, !1180, !1181, !1183, !1186, !1189, !1190, !1894, !1895}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !960, file: !284, line: 116, baseType: !208, size: 960)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !960, file: !284, line: 117, baseType: !278, size: 64, offset: 960)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !960, file: !284, line: 119, baseType: !965, size: 64, offset: 1024)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !284, line: 57, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !960, file: !284, line: 121, baseType: !241, size: 16, offset: 1088)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !960, file: !284, line: 121, baseType: !241, size: 16, offset: 1104)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !960, file: !284, line: 122, baseType: !138, size: 32, offset: 1120)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !960, file: !284, line: 122, baseType: !138, size: 32, offset: 1152)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !960, file: !284, line: 122, baseType: !138, size: 32, offset: 1184)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !960, file: !284, line: 123, baseType: !257, size: 512, offset: 1216)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !960, file: !284, line: 124, baseType: !959, size: 64, offset: 1728)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !960, file: !284, line: 124, baseType: !959, size: 64, offset: 1792)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !960, file: !284, line: 127, baseType: !959, size: 64, offset: 1856)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !960, file: !284, line: 127, baseType: !959, size: 64, offset: 1920)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !960, file: !284, line: 127, baseType: !959, size: 64, offset: 1984)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !960, file: !284, line: 128, baseType: !295, size: 64, offset: 2048)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !960, file: !284, line: 130, baseType: !282, size: 64, offset: 2112)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !960, file: !284, line: 131, baseType: !981, size: 64, offset: 2176)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !655, line: 486, size: 1600, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !982, file: !655, line: 487, baseType: !208, size: 960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !982, file: !655, line: 489, baseType: !267, size: 128, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !982, file: !655, line: 490, baseType: !267, size: 128, offset: 1088)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !982, file: !655, line: 491, baseType: !267, size: 128, offset: 1216)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !982, file: !655, line: 492, baseType: !267, size: 128, offset: 1344)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !982, file: !655, line: 494, baseType: !138, size: 32, offset: 1472)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !982, file: !655, line: 495, baseType: !138, size: 32, offset: 1504)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !982, file: !655, line: 497, baseType: !138, size: 32, offset: 1536)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !982, file: !655, line: 498, baseType: !138, size: 32, offset: 1568)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !960, file: !284, line: 132, baseType: !981, size: 64, offset: 2240)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !960, file: !284, line: 133, baseType: !995, size: 64, offset: 2304)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !655, line: 334, size: 1728, elements: !997)
!997 = !{!998, !999, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1033}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !996, file: !655, line: 335, baseType: !267, size: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !996, file: !655, line: 336, baseType: !1000, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !996, file: !655, line: 338, baseType: !241, size: 16, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !996, file: !655, line: 338, baseType: !241, size: 16, offset: 208)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !996, file: !655, line: 339, baseType: !5, size: 32, offset: 224)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !996, file: !655, line: 340, baseType: !138, size: 32, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !996, file: !655, line: 342, baseType: !288, size: 32, offset: 288)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !996, file: !655, line: 343, baseType: !479, size: 96, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !996, file: !655, line: 344, baseType: !479, size: 96, offset: 416)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !996, file: !655, line: 347, baseType: !267, size: 128, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !996, file: !655, line: 349, baseType: !138, size: 32, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !996, file: !655, line: 350, baseType: !138, size: 32, offset: 672)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !996, file: !655, line: 351, baseType: !201, size: 64, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !996, file: !655, line: 352, baseType: !201, size: 64, offset: 768)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !996, file: !655, line: 354, baseType: !1014, size: 384, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !655, line: 116, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !655, line: 94, size: 384, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1015, file: !655, line: 96, baseType: !138, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1015, file: !655, line: 96, baseType: !138, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1015, file: !655, line: 97, baseType: !138, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1015, file: !655, line: 97, baseType: !138, size: 32, offset: 96)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1015, file: !655, line: 99, baseType: !241, size: 16, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1015, file: !655, line: 100, baseType: !241, size: 16, offset: 144)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1015, file: !655, line: 102, baseType: !241, size: 16, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1015, file: !655, line: 105, baseType: !241, size: 16, offset: 176)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1015, file: !655, line: 108, baseType: !241, size: 16, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1015, file: !655, line: 109, baseType: !241, size: 16, offset: 208)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1015, file: !655, line: 111, baseType: !241, size: 16, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1015, file: !655, line: 112, baseType: !241, size: 16, offset: 240)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1015, file: !655, line: 114, baseType: !138, size: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1015, file: !655, line: 114, baseType: !138, size: 32, offset: 288)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1015, file: !655, line: 115, baseType: !138, size: 32, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1015, file: !655, line: 115, baseType: !138, size: 32, offset: 352)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !996, file: !655, line: 355, baseType: !257, size: 512, offset: 1216)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !960, file: !284, line: 134, baseType: !201, size: 64, offset: 2368)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !960, file: !284, line: 136, baseType: !1036, size: 64, offset: 2432)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !280, line: 61, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !960, file: !284, line: 138, baseType: !1014, size: 384, offset: 2496)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !960, file: !284, line: 139, baseType: !1040, size: 64, offset: 2880)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !655, line: 80, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !655, line: 72, size: 192, elements: !1043)
!1043 = !{!1044, !1051, !1052, !1053, !1054}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1042, file: !655, line: 73, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !655, line: 59, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !655, line: 56, size: 128, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1047, file: !655, line: 57, baseType: !479, size: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1047, file: !655, line: 58, baseType: !138, size: 32, offset: 96)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1042, file: !655, line: 74, baseType: !138, size: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1042, file: !655, line: 76, baseType: !138, size: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1042, file: !655, line: 77, baseType: !138, size: 32, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1042, file: !655, line: 79, baseType: !138, size: 32, offset: 160)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !960, file: !284, line: 141, baseType: !267, size: 128, offset: 2944)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !960, file: !284, line: 142, baseType: !267, size: 128, offset: 3072)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !960, file: !284, line: 143, baseType: !267, size: 128, offset: 3200)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !960, file: !284, line: 144, baseType: !267, size: 128, offset: 3328)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !960, file: !284, line: 146, baseType: !138, size: 32, offset: 3456)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !960, file: !284, line: 147, baseType: !138, size: 32, offset: 3488)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !960, file: !284, line: 150, baseType: !302, size: 64, offset: 3520)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !960, file: !284, line: 151, baseType: !1063, size: 64, offset: 3584)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !960, file: !284, line: 152, baseType: !138, size: 32, offset: 3648)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !960, file: !284, line: 153, baseType: !138, size: 32, offset: 3680)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !960, file: !284, line: 156, baseType: !479, size: 96, offset: 3712)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !960, file: !284, line: 156, baseType: !479, size: 96, offset: 3808)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !960, file: !284, line: 156, baseType: !479, size: 96, offset: 3904)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !960, file: !284, line: 157, baseType: !479, size: 96, offset: 4000)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !960, file: !284, line: 158, baseType: !479, size: 96, offset: 4096)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !960, file: !284, line: 159, baseType: !479, size: 96, offset: 4192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !960, file: !284, line: 160, baseType: !479, size: 96, offset: 4288)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !960, file: !284, line: 160, baseType: !479, size: 96, offset: 4384)
