; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_curve_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_curve_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!78 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!79 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!80 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!81 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 519, baseType: !7, size: 32, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyFlag", file: !6, line: 151, baseType: !7, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!90 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!92 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!94 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!95 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!96 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!98 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!99 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!100 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!101 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!102 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!103 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!104 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!105 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!106 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!107 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!108 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!109 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!110 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!111 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!112 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!113 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!114 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!115 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!116 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!117 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!118 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!119 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!120 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!121 = !{!122, !1852, !48, !208, !133, !143, !2189, !2191, !2193, !1404, !2204, !2224, !2251, !1547, !2111, !2252, !2253, !136, !2229, !2254, !2256, !2257}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curve", file: !124, line: 273, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Curve", file: !124, line: 193, size: 4224, elements: !126)
!126 = !{!127, !198, !202, !214, !215, !230, !1704, !1705, !1706, !1707, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1827, !1828, !1831, !1832, !1833, !1834, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !124, line: 194, baseType: !128, size: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !129, line: 130, baseType: !130)
!129 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !129, line: 117, size: 960, elements: !131)
!131 = !{!132, !134, !135, !137, !157, !161, !163, !164, !165, !166}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !129, line: 118, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !130, file: !129, line: 118, baseType: !133, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !130, file: !129, line: 119, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !130, file: !129, line: 120, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !129, line: 136, size: 17600, elements: !140)
!140 = !{!141, !142, !144, !147, !152, !153, !154}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !129, line: 137, baseType: !128, size: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !139, file: !129, line: 138, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !139, file: !129, line: 139, baseType: !145, size: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !129, line: 43, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !129, line: 140, baseType: !148, size: 8192, offset: 1088)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 8192, elements: !150)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !{!151}
!151 = !DISubrange(count: 1024)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !139, file: !129, line: 141, baseType: !148, size: 8192, offset: 9280)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !129, line: 148, baseType: !138, size: 64, offset: 17472)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !139, file: !129, line: 150, baseType: !155, size: 64, offset: 17536)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !129, line: 45, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !129, line: 121, baseType: !158, size: 528, offset: 256)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 528, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 66)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !129, line: 126, baseType: !162, size: 16, offset: 784)
!162 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !130, file: !129, line: 127, baseType: !48, size: 32, offset: 800)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !130, file: !129, line: 128, baseType: !48, size: 32, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !130, file: !129, line: 128, baseType: !48, size: 32, offset: 864)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !130, file: !129, line: 129, baseType: !167, size: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !129, line: 75, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !129, line: 62, size: 1024, elements: !170)
!170 = !{!171, !173, !174, !175, !176, !177, !181, !182, !196, !197}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !129, line: 63, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !169, file: !129, line: 63, baseType: !172, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !129, line: 64, baseType: !149, size: 8, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !169, file: !129, line: 64, baseType: !149, size: 8, offset: 136)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !129, line: 65, baseType: !162, size: 16, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !129, line: 66, baseType: !178, size: 512, offset: 160)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 512, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !169, file: !129, line: 67, baseType: !48, size: 32, offset: 672)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !129, line: 69, baseType: !183, size: 256, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !129, line: 60, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !129, line: 48, size: 256, elements: !185)
!185 = !{!186, !187, !194, !195}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !184, file: !129, line: 49, baseType: !133, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !184, file: !129, line: 58, baseType: !188, size: 128, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !189, line: 71, baseType: !190)
!189 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !189, line: 69, size: 128, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !190, file: !189, line: 70, baseType: !133, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !190, file: !189, line: 70, baseType: !133, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !184, file: !129, line: 59, baseType: !48, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !184, file: !129, line: 59, baseType: !48, size: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !169, file: !129, line: 70, baseType: !48, size: 32, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !169, file: !129, line: 74, baseType: !48, size: 32, offset: 992)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !125, file: !124, line: 195, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !201, line: 58, flags: DIFlagFwdDecl)
!201 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !125, file: !124, line: 197, baseType: !203, size: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !57, line: 97, size: 832, elements: !205)
!205 = !{!206, !212, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !204, file: !57, line: 98, baseType: !207, size: 768)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 768, elements: !209)
!208 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!209 = !{!210, !211}
!210 = !DISubrange(count: 8)
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !57, line: 99, baseType: !48, size: 32, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !204, file: !57, line: 99, baseType: !48, size: 32, offset: 800)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nurb", scope: !125, file: !124, line: 199, baseType: !188, size: 128, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "editnurb", scope: !125, file: !124, line: 201, baseType: !216, size: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditNurb", file: !124, line: 191, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditNurb", file: !124, line: 180, size: 256, elements: !219)
!219 = !{!220, !221, !225, !226}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nurbs", scope: !218, file: !124, line: 182, baseType: !188, size: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "keyindex", scope: !218, file: !124, line: 185, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !224, line: 46, flags: DIFlagFwdDecl)
!224 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !218, file: !124, line: 188, baseType: !48, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !218, file: !124, line: 190, baseType: !227, size: 32, offset: 224)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 32, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 4)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bevobj", scope: !125, file: !124, line: 203, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !57, line: 115, size: 11392, elements: !233)
!233 = !{!234, !235, !236, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !253, !254, !268, !269, !310, !311, !314, !315, !331, !332, !333, !334, !335, !336, !337, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1637, !1640, !1641, !1642, !1643, !1644, !1645, !1648, !1670, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1682, !1685, !1688, !1689, !1692, !1693}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !232, file: !57, line: 116, baseType: !128, size: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !232, file: !57, line: 117, baseType: !199, size: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !232, file: !57, line: 119, baseType: !237, size: 64, offset: 1024)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !57, line: 57, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !57, line: 121, baseType: !162, size: 16, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !232, file: !57, line: 121, baseType: !162, size: 16, offset: 1104)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !232, file: !57, line: 122, baseType: !48, size: 32, offset: 1120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !232, file: !57, line: 122, baseType: !48, size: 32, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !232, file: !57, line: 122, baseType: !48, size: 32, offset: 1184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !232, file: !57, line: 123, baseType: !178, size: 512, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !232, file: !57, line: 124, baseType: !231, size: 64, offset: 1728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !232, file: !57, line: 124, baseType: !231, size: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !232, file: !57, line: 127, baseType: !231, size: 64, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !232, file: !57, line: 127, baseType: !231, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !232, file: !57, line: 127, baseType: !231, size: 64, offset: 1984)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !232, file: !57, line: 128, baseType: !251, size: 64, offset: 2048)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !124, line: 44, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !232, file: !57, line: 130, baseType: !203, size: 64, offset: 2112)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !232, file: !57, line: 131, baseType: !255, size: 64, offset: 2176)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !257, line: 486, size: 1600, elements: !258)
!257 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !256, file: !257, line: 487, baseType: !128, size: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !256, file: !257, line: 489, baseType: !188, size: 128, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !256, file: !257, line: 490, baseType: !188, size: 128, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !256, file: !257, line: 491, baseType: !188, size: 128, offset: 1216)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !256, file: !257, line: 492, baseType: !188, size: 128, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !256, file: !257, line: 494, baseType: !48, size: 32, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !256, file: !257, line: 495, baseType: !48, size: 32, offset: 1504)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !256, file: !257, line: 497, baseType: !48, size: 32, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !256, file: !257, line: 498, baseType: !48, size: 32, offset: 1568)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !232, file: !57, line: 132, baseType: !255, size: 64, offset: 2240)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !232, file: !57, line: 133, baseType: !270, size: 64, offset: 2304)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !257, line: 334, size: 1728, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !283, !284, !285, !286, !287, !288, !289, !309}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !271, file: !257, line: 335, baseType: !188, size: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !271, file: !257, line: 336, baseType: !222, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !271, file: !257, line: 338, baseType: !162, size: 16, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !271, file: !257, line: 338, baseType: !162, size: 16, offset: 208)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !271, file: !257, line: 339, baseType: !7, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !271, file: !257, line: 340, baseType: !48, size: 32, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !271, file: !257, line: 342, baseType: !208, size: 32, offset: 288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !271, file: !257, line: 343, baseType: !281, size: 96, offset: 320)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 96, elements: !282)
!282 = !{!211}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !271, file: !257, line: 344, baseType: !281, size: 96, offset: 416)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !271, file: !257, line: 347, baseType: !188, size: 128, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !271, file: !257, line: 349, baseType: !48, size: 32, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !271, file: !257, line: 350, baseType: !48, size: 32, offset: 672)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !271, file: !257, line: 351, baseType: !133, size: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !271, file: !257, line: 352, baseType: !133, size: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !271, file: !257, line: 354, baseType: !290, size: 384, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !257, line: 116, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !257, line: 94, size: 384, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !291, file: !257, line: 96, baseType: !48, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !291, file: !257, line: 96, baseType: !48, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !291, file: !257, line: 97, baseType: !48, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !291, file: !257, line: 97, baseType: !48, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !291, file: !257, line: 99, baseType: !162, size: 16, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !291, file: !257, line: 100, baseType: !162, size: 16, offset: 144)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !291, file: !257, line: 102, baseType: !162, size: 16, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !291, file: !257, line: 105, baseType: !162, size: 16, offset: 176)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !291, file: !257, line: 108, baseType: !162, size: 16, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !291, file: !257, line: 109, baseType: !162, size: 16, offset: 208)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !291, file: !257, line: 111, baseType: !162, size: 16, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !291, file: !257, line: 112, baseType: !162, size: 16, offset: 240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !291, file: !257, line: 114, baseType: !48, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !291, file: !257, line: 114, baseType: !48, size: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !291, file: !257, line: 115, baseType: !48, size: 32, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !291, file: !257, line: 115, baseType: !48, size: 32, offset: 352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !271, file: !257, line: 355, baseType: !178, size: 512, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !57, line: 134, baseType: !133, size: 64, offset: 2368)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !232, file: !57, line: 136, baseType: !312, size: 64, offset: 2432)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !201, line: 61, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !232, file: !57, line: 138, baseType: !290, size: 384, offset: 2496)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !232, file: !57, line: 139, baseType: !316, size: 64, offset: 2880)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !257, line: 80, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !257, line: 72, size: 192, elements: !319)
!319 = !{!320, !327, !328, !329, !330}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !318, file: !257, line: 73, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !257, line: 59, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !257, line: 56, size: 128, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !323, file: !257, line: 57, baseType: !281, size: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !257, line: 58, baseType: !48, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !318, file: !257, line: 74, baseType: !48, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !318, file: !257, line: 76, baseType: !48, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !318, file: !257, line: 77, baseType: !48, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !257, line: 79, baseType: !48, size: 32, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !232, file: !57, line: 141, baseType: !188, size: 128, offset: 2944)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !232, file: !57, line: 142, baseType: !188, size: 128, offset: 3072)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !232, file: !57, line: 143, baseType: !188, size: 128, offset: 3200)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !232, file: !57, line: 144, baseType: !188, size: 128, offset: 3328)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !232, file: !57, line: 146, baseType: !48, size: 32, offset: 3456)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !232, file: !57, line: 147, baseType: !48, size: 32, offset: 3488)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !232, file: !57, line: 150, baseType: !338, size: 64, offset: 3520)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !341, line: 93, size: 7552, elements: !342)
!341 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !391, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !458, !459, !460, !461, !462, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !1507, !1508, !1509, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1550}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !340, file: !341, line: 94, baseType: !128, size: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !340, file: !341, line: 95, baseType: !199, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !340, file: !341, line: 97, baseType: !162, size: 16, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !340, file: !341, line: 97, baseType: !162, size: 16, offset: 1040)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !340, file: !341, line: 99, baseType: !208, size: 32, offset: 1056)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !340, file: !341, line: 99, baseType: !208, size: 32, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !340, file: !341, line: 99, baseType: !208, size: 32, offset: 1120)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !340, file: !341, line: 100, baseType: !208, size: 32, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !340, file: !341, line: 100, baseType: !208, size: 32, offset: 1184)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !340, file: !341, line: 100, baseType: !208, size: 32, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !340, file: !341, line: 101, baseType: !208, size: 32, offset: 1248)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !340, file: !341, line: 101, baseType: !208, size: 32, offset: 1280)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !340, file: !341, line: 101, baseType: !208, size: 32, offset: 1312)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !340, file: !341, line: 102, baseType: !208, size: 32, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !340, file: !341, line: 102, baseType: !208, size: 32, offset: 1376)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !340, file: !341, line: 102, baseType: !208, size: 32, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !340, file: !341, line: 103, baseType: !208, size: 32, offset: 1440)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !340, file: !341, line: 103, baseType: !208, size: 32, offset: 1472)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !340, file: !341, line: 103, baseType: !208, size: 32, offset: 1504)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !340, file: !341, line: 103, baseType: !208, size: 32, offset: 1536)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !340, file: !341, line: 103, baseType: !208, size: 32, offset: 1568)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !340, file: !341, line: 104, baseType: !208, size: 32, offset: 1600)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !340, file: !341, line: 104, baseType: !208, size: 32, offset: 1632)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !340, file: !341, line: 104, baseType: !208, size: 32, offset: 1664)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !340, file: !341, line: 104, baseType: !208, size: 32, offset: 1696)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !340, file: !341, line: 104, baseType: !208, size: 32, offset: 1728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !340, file: !341, line: 105, baseType: !208, size: 32, offset: 1760)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !340, file: !341, line: 108, baseType: !371, size: 704, offset: 1792)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !341, line: 53, size: 704, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !371, file: !341, line: 54, baseType: !208, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !371, file: !341, line: 55, baseType: !208, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !371, file: !341, line: 56, baseType: !208, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !371, file: !341, line: 57, baseType: !208, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !371, file: !341, line: 59, baseType: !281, size: 96, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !371, file: !341, line: 60, baseType: !281, size: 96, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !371, file: !341, line: 61, baseType: !281, size: 96, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !371, file: !341, line: 63, baseType: !208, size: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !371, file: !341, line: 64, baseType: !208, size: 32, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !371, file: !341, line: 65, baseType: !208, size: 32, offset: 480)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !371, file: !341, line: 67, baseType: !162, size: 16, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !371, file: !341, line: 68, baseType: !162, size: 16, offset: 528)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !371, file: !341, line: 69, baseType: !162, size: 16, offset: 544)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !371, file: !341, line: 70, baseType: !162, size: 16, offset: 560)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !371, file: !341, line: 72, baseType: !208, size: 32, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !371, file: !341, line: 73, baseType: !208, size: 32, offset: 608)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !371, file: !341, line: 74, baseType: !208, size: 32, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !371, file: !341, line: 75, baseType: !208, size: 32, offset: 672)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !340, file: !341, line: 109, baseType: !392, size: 128, offset: 2496)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !341, line: 79, size: 128, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !392, file: !341, line: 80, baseType: !48, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !392, file: !341, line: 81, baseType: !48, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !392, file: !341, line: 82, baseType: !48, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !392, file: !341, line: 83, baseType: !48, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !340, file: !341, line: 111, baseType: !208, size: 32, offset: 2624)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !340, file: !341, line: 111, baseType: !208, size: 32, offset: 2656)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !340, file: !341, line: 112, baseType: !208, size: 32, offset: 2688)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !340, file: !341, line: 112, baseType: !208, size: 32, offset: 2720)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !340, file: !341, line: 113, baseType: !208, size: 32, offset: 2752)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !340, file: !341, line: 114, baseType: !208, size: 32, offset: 2784)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !340, file: !341, line: 114, baseType: !208, size: 32, offset: 2816)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !340, file: !341, line: 115, baseType: !162, size: 16, offset: 2848)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !340, file: !341, line: 115, baseType: !162, size: 16, offset: 2864)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !340, file: !341, line: 116, baseType: !162, size: 16, offset: 2880)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !340, file: !341, line: 117, baseType: !149, size: 8, offset: 2896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !340, file: !341, line: 117, baseType: !149, size: 8, offset: 2904)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !340, file: !341, line: 119, baseType: !208, size: 32, offset: 2912)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !340, file: !341, line: 119, baseType: !208, size: 32, offset: 2944)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !340, file: !341, line: 120, baseType: !162, size: 16, offset: 2976)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !340, file: !341, line: 120, baseType: !162, size: 16, offset: 2992)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !340, file: !341, line: 121, baseType: !208, size: 32, offset: 3008)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !340, file: !341, line: 121, baseType: !208, size: 32, offset: 3040)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !340, file: !341, line: 122, baseType: !208, size: 32, offset: 3072)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !340, file: !341, line: 123, baseType: !208, size: 32, offset: 3104)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !340, file: !341, line: 124, baseType: !162, size: 16, offset: 3136)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !340, file: !341, line: 125, baseType: !162, size: 16, offset: 3152)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !340, file: !341, line: 127, baseType: !48, size: 32, offset: 3168)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !340, file: !341, line: 127, baseType: !48, size: 32, offset: 3200)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !340, file: !341, line: 128, baseType: !48, size: 32, offset: 3232)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !340, file: !341, line: 128, baseType: !48, size: 32, offset: 3264)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !340, file: !341, line: 129, baseType: !162, size: 16, offset: 3296)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !340, file: !341, line: 129, baseType: !162, size: 16, offset: 3312)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !340, file: !341, line: 129, baseType: !162, size: 16, offset: 3328)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !340, file: !341, line: 129, baseType: !162, size: 16, offset: 3344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !340, file: !341, line: 130, baseType: !208, size: 32, offset: 3360)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !340, file: !341, line: 130, baseType: !208, size: 32, offset: 3392)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !340, file: !341, line: 130, baseType: !208, size: 32, offset: 3424)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !340, file: !341, line: 130, baseType: !208, size: 32, offset: 3456)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !340, file: !341, line: 131, baseType: !208, size: 32, offset: 3488)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !340, file: !341, line: 131, baseType: !208, size: 32, offset: 3520)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !340, file: !341, line: 131, baseType: !208, size: 32, offset: 3552)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !340, file: !341, line: 131, baseType: !208, size: 32, offset: 3584)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !340, file: !341, line: 132, baseType: !208, size: 32, offset: 3616)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !340, file: !341, line: 132, baseType: !208, size: 32, offset: 3648)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !340, file: !341, line: 133, baseType: !178, size: 512, offset: 3680)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !340, file: !341, line: 135, baseType: !208, size: 32, offset: 4192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !340, file: !341, line: 136, baseType: !208, size: 32, offset: 4224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !340, file: !341, line: 137, baseType: !208, size: 32, offset: 4256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !340, file: !341, line: 138, baseType: !48, size: 32, offset: 4288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !340, file: !341, line: 141, baseType: !149, size: 8, offset: 4320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !340, file: !341, line: 141, baseType: !149, size: 8, offset: 4328)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !340, file: !341, line: 141, baseType: !149, size: 8, offset: 4336)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !340, file: !341, line: 141, baseType: !149, size: 8, offset: 4344)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !340, file: !341, line: 142, baseType: !162, size: 16, offset: 4352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !340, file: !341, line: 142, baseType: !162, size: 16, offset: 4368)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !340, file: !341, line: 142, baseType: !162, size: 16, offset: 4384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !340, file: !341, line: 145, baseType: !149, size: 8, offset: 4400)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !340, file: !341, line: 145, baseType: !149, size: 8, offset: 4408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !340, file: !341, line: 148, baseType: !162, size: 16, offset: 4416)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !340, file: !341, line: 148, baseType: !162, size: 16, offset: 4432)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !340, file: !341, line: 149, baseType: !208, size: 32, offset: 4448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !340, file: !341, line: 149, baseType: !208, size: 32, offset: 4480)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !340, file: !341, line: 152, baseType: !457, size: 128, offset: 4512)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 128, elements: !228)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !340, file: !341, line: 153, baseType: !208, size: 32, offset: 4640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !340, file: !341, line: 154, baseType: !208, size: 32, offset: 4672)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !340, file: !341, line: 157, baseType: !162, size: 16, offset: 4704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !340, file: !341, line: 157, baseType: !162, size: 16, offset: 4720)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !340, file: !341, line: 160, baseType: !463, size: 64, offset: 4736)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !465, line: 113, size: 6208, elements: !466)
!465 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!466 = !{!467, !468, !469, !470, !471, !472, !476}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !464, file: !465, line: 114, baseType: !162, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !464, file: !465, line: 114, baseType: !162, size: 16, offset: 16)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !464, file: !465, line: 115, baseType: !149, size: 8, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !464, file: !465, line: 115, baseType: !149, size: 8, offset: 40)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !464, file: !465, line: 116, baseType: !149, size: 8, offset: 48)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !464, file: !465, line: 117, baseType: !473, size: 8, offset: 56)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 8, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 1)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !465, line: 119, baseType: !477, size: 6144, offset: 64)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 6144, elements: !487)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !465, line: 109, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !465, line: 106, size: 192, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !479, file: !465, line: 107, baseType: !208, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !479, file: !465, line: 107, baseType: !208, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !479, file: !465, line: 107, baseType: !208, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !479, file: !465, line: 107, baseType: !208, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !479, file: !465, line: 107, baseType: !208, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !479, file: !465, line: 108, baseType: !48, size: 32, offset: 160)
!487 = !{!488}
!488 = !DISubrange(count: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !340, file: !341, line: 161, baseType: !463, size: 64, offset: 4800)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !340, file: !341, line: 162, baseType: !149, size: 8, offset: 4864)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !340, file: !341, line: 162, baseType: !149, size: 8, offset: 4872)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !340, file: !341, line: 163, baseType: !149, size: 8, offset: 4880)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !340, file: !341, line: 163, baseType: !149, size: 8, offset: 4888)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !340, file: !341, line: 164, baseType: !162, size: 16, offset: 4896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !340, file: !341, line: 164, baseType: !162, size: 16, offset: 4912)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !340, file: !341, line: 165, baseType: !208, size: 32, offset: 4928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !340, file: !341, line: 165, baseType: !208, size: 32, offset: 4960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !340, file: !341, line: 167, baseType: !499, size: 1152, offset: 4992)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 1152, elements: !1505)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !465, line: 57, size: 2496, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !501, file: !465, line: 59, baseType: !162, size: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !501, file: !465, line: 59, baseType: !162, size: 16, offset: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !501, file: !465, line: 59, baseType: !162, size: 16, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !501, file: !465, line: 59, baseType: !162, size: 16, offset: 48)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !501, file: !465, line: 60, baseType: !231, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !501, file: !465, line: 61, baseType: !509, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !465, line: 202, size: 3328, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !1353, !1354, !1355, !1356, !1357, !1385, !1386, !1416, !1436, !1444, !1445}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !510, file: !465, line: 203, baseType: !128, size: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !510, file: !465, line: 204, baseType: !199, size: 64, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !510, file: !465, line: 206, baseType: !208, size: 32, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !510, file: !465, line: 206, baseType: !208, size: 32, offset: 1056)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !510, file: !465, line: 207, baseType: !208, size: 32, offset: 1088)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !510, file: !465, line: 207, baseType: !208, size: 32, offset: 1120)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !510, file: !465, line: 207, baseType: !208, size: 32, offset: 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !510, file: !465, line: 207, baseType: !208, size: 32, offset: 1184)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !510, file: !465, line: 207, baseType: !208, size: 32, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !510, file: !465, line: 207, baseType: !208, size: 32, offset: 1248)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !510, file: !465, line: 208, baseType: !208, size: 32, offset: 1280)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !510, file: !465, line: 208, baseType: !208, size: 32, offset: 1312)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !510, file: !465, line: 211, baseType: !208, size: 32, offset: 1344)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !510, file: !465, line: 211, baseType: !208, size: 32, offset: 1376)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !510, file: !465, line: 211, baseType: !208, size: 32, offset: 1408)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !510, file: !465, line: 211, baseType: !208, size: 32, offset: 1440)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !510, file: !465, line: 211, baseType: !208, size: 32, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !510, file: !465, line: 214, baseType: !208, size: 32, offset: 1504)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !510, file: !465, line: 214, baseType: !208, size: 32, offset: 1536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !510, file: !465, line: 217, baseType: !208, size: 32, offset: 1568)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !510, file: !465, line: 218, baseType: !208, size: 32, offset: 1600)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !510, file: !465, line: 219, baseType: !208, size: 32, offset: 1632)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !510, file: !465, line: 220, baseType: !208, size: 32, offset: 1664)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !510, file: !465, line: 221, baseType: !208, size: 32, offset: 1696)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !510, file: !465, line: 222, baseType: !162, size: 16, offset: 1728)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !510, file: !465, line: 222, baseType: !162, size: 16, offset: 1744)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !510, file: !465, line: 224, baseType: !162, size: 16, offset: 1760)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !510, file: !465, line: 224, baseType: !162, size: 16, offset: 1776)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !510, file: !465, line: 227, baseType: !162, size: 16, offset: 1792)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !510, file: !465, line: 227, baseType: !162, size: 16, offset: 1808)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !510, file: !465, line: 229, baseType: !162, size: 16, offset: 1824)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !465, line: 229, baseType: !162, size: 16, offset: 1840)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !510, file: !465, line: 230, baseType: !162, size: 16, offset: 1856)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !510, file: !465, line: 230, baseType: !162, size: 16, offset: 1872)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !510, file: !465, line: 232, baseType: !208, size: 32, offset: 1888)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !510, file: !465, line: 232, baseType: !208, size: 32, offset: 1920)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !510, file: !465, line: 232, baseType: !208, size: 32, offset: 1952)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !510, file: !465, line: 232, baseType: !208, size: 32, offset: 1984)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !510, file: !465, line: 233, baseType: !48, size: 32, offset: 2016)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !510, file: !465, line: 234, baseType: !48, size: 32, offset: 2048)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !510, file: !465, line: 235, baseType: !162, size: 16, offset: 2080)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !510, file: !465, line: 235, baseType: !162, size: 16, offset: 2096)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !510, file: !465, line: 236, baseType: !162, size: 16, offset: 2112)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !510, file: !465, line: 239, baseType: !162, size: 16, offset: 2128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !510, file: !465, line: 240, baseType: !48, size: 32, offset: 2144)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !510, file: !465, line: 241, baseType: !48, size: 32, offset: 2176)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !510, file: !465, line: 241, baseType: !48, size: 32, offset: 2208)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !510, file: !465, line: 241, baseType: !48, size: 32, offset: 2240)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !510, file: !465, line: 243, baseType: !208, size: 32, offset: 2272)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !510, file: !465, line: 243, baseType: !208, size: 32, offset: 2304)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !510, file: !465, line: 244, baseType: !208, size: 32, offset: 2336)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !510, file: !465, line: 246, baseType: !564, size: 320, offset: 2368)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !565, line: 50, size: 320, elements: !566)
!565 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!566 = !{!567, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !564, file: !565, line: 51, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !201, line: 1216, size: 39680, elements: !570)
!570 = !{!571, !572, !573, !574, !577, !578, !579, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !608, !907, !910, !1208, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1230, !1231, !1232, !1233, !1234, !1242, !1309, !1316, !1317, !1324, !1327, !1333, !1334, !1335, !1336, !1337}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !569, file: !201, line: 1217, baseType: !128, size: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !569, file: !201, line: 1218, baseType: !199, size: 64, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !569, file: !201, line: 1220, baseType: !231, size: 64, offset: 1024)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !569, file: !201, line: 1221, baseType: !575, size: 64, offset: 1088)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !201, line: 52, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !569, file: !201, line: 1223, baseType: !568, size: 64, offset: 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !569, file: !201, line: 1225, baseType: !188, size: 128, offset: 1216)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !569, file: !201, line: 1226, baseType: !580, size: 64, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !201, line: 69, size: 320, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !581, file: !201, line: 70, baseType: !580, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !581, file: !201, line: 70, baseType: !580, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !581, file: !201, line: 71, baseType: !7, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !581, file: !201, line: 71, baseType: !7, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !581, file: !201, line: 72, baseType: !48, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !581, file: !201, line: 73, baseType: !162, size: 16, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !581, file: !201, line: 73, baseType: !162, size: 16, offset: 240)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !581, file: !201, line: 74, baseType: !231, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !569, file: !201, line: 1227, baseType: !231, size: 64, offset: 1408)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !569, file: !201, line: 1229, baseType: !281, size: 96, offset: 1472)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !569, file: !201, line: 1230, baseType: !281, size: 96, offset: 1568)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !569, file: !201, line: 1231, baseType: !281, size: 96, offset: 1664)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !569, file: !201, line: 1231, baseType: !281, size: 96, offset: 1760)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !569, file: !201, line: 1233, baseType: !7, size: 32, offset: 1856)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !569, file: !201, line: 1234, baseType: !48, size: 32, offset: 1888)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !569, file: !201, line: 1235, baseType: !7, size: 32, offset: 1920)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !201, line: 1237, baseType: !162, size: 16, offset: 1952)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !569, file: !201, line: 1239, baseType: !149, size: 8, offset: 1968)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !569, file: !201, line: 1240, baseType: !473, size: 8, offset: 1976)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !569, file: !201, line: 1242, baseType: !603, size: 64, offset: 1984)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !201, line: 57, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !569, file: !201, line: 1244, baseType: !606, size: 64, offset: 2048)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !201, line: 59, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !569, file: !201, line: 1246, baseType: !609, size: 64, offset: 2112)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !201, line: 1067, size: 5184, elements: !611)
!611 = !{!612, !643, !644, !659, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !681, !778, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !827, !828, !829, !830, !831, !832, !833, !834, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !890}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !610, file: !201, line: 1068, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !201, line: 934, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !201, line: 925, size: 576, elements: !616)
!616 = !{!617, !634, !635, !636, !637, !639, !642}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !615, file: !201, line: 926, baseType: !618, size: 320)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !201, line: 830, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !201, line: 813, size: 320, elements: !620)
!620 = !{!621, !624, !627, !628, !631, !632, !633}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !619, file: !201, line: 814, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !201, line: 51, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !619, file: !201, line: 815, baseType: !625, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !201, line: 815, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !619, file: !201, line: 818, baseType: !133, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !619, file: !201, line: 819, baseType: !629, size: 32, offset: 192)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 32, elements: !228)
!630 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !619, file: !201, line: 822, baseType: !48, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !619, file: !201, line: 826, baseType: !48, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !619, file: !201, line: 829, baseType: !48, size: 32, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !201, line: 928, baseType: !162, size: 16, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !615, file: !201, line: 928, baseType: !162, size: 16, offset: 336)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !615, file: !201, line: 929, baseType: !48, size: 32, offset: 352)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !615, file: !201, line: 930, baseType: !638, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !615, file: !201, line: 931, baseType: !640, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !201, line: 931, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !615, file: !201, line: 933, baseType: !133, size: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !610, file: !201, line: 1069, baseType: !613, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !610, file: !201, line: 1070, baseType: !645, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !201, line: 916, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !201, line: 891, size: 704, elements: !648)
!648 = !{!649, !650, !651, !653, !654, !655, !656, !657, !658}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !647, file: !201, line: 892, baseType: !618, size: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !647, file: !201, line: 896, baseType: !48, size: 32, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !647, file: !201, line: 900, baseType: !652, size: 96, offset: 352)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !282)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !647, file: !201, line: 903, baseType: !208, size: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !647, file: !201, line: 906, baseType: !48, size: 32, offset: 480)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !647, file: !201, line: 909, baseType: !208, size: 32, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !647, file: !201, line: 912, baseType: !208, size: 32, offset: 544)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !647, file: !201, line: 914, baseType: !231, size: 64, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !647, file: !201, line: 915, baseType: !133, size: 64, offset: 640)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !610, file: !201, line: 1071, baseType: !660, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !201, line: 920, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !201, line: 918, size: 320, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !662, file: !201, line: 919, baseType: !618, size: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !610, file: !201, line: 1075, baseType: !208, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !610, file: !201, line: 1077, baseType: !208, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !610, file: !201, line: 1078, baseType: !208, size: 32, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !610, file: !201, line: 1079, baseType: !162, size: 16, offset: 352)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !610, file: !201, line: 1082, baseType: !162, size: 16, offset: 368)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !610, file: !201, line: 1085, baseType: !149, size: 8, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !610, file: !201, line: 1086, baseType: !149, size: 8, offset: 392)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !610, file: !201, line: 1087, baseType: !149, size: 8, offset: 400)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !610, file: !201, line: 1088, baseType: !149, size: 8, offset: 408)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !610, file: !201, line: 1090, baseType: !208, size: 32, offset: 416)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !610, file: !201, line: 1093, baseType: !162, size: 16, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !610, file: !201, line: 1096, baseType: !149, size: 8, offset: 464)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !610, file: !201, line: 1098, baseType: !678, size: 40, offset: 472)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 40, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 5)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !610, file: !201, line: 1101, baseType: !682, size: 832, offset: 512)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !201, line: 836, size: 832, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !693, !694, !695, !774, !775, !776, !777}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !682, file: !201, line: 837, baseType: !618, size: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !201, line: 839, baseType: !162, size: 16, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !682, file: !201, line: 839, baseType: !162, size: 16, offset: 336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !682, file: !201, line: 842, baseType: !162, size: 16, offset: 352)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !682, file: !201, line: 842, baseType: !162, size: 16, offset: 368)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !682, file: !201, line: 843, baseType: !690, size: 32, offset: 384)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 32, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 2)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !682, file: !201, line: 845, baseType: !48, size: 32, offset: 416)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !682, file: !201, line: 847, baseType: !133, size: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !682, file: !201, line: 848, baseType: !696, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !565, line: 77, size: 15424, elements: !698)
!698 = !{!699, !700, !701, !704, !707, !710, !713, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !763, !764, !768}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !697, file: !565, line: 78, baseType: !128, size: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !565, line: 80, baseType: !148, size: 8192, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !697, file: !565, line: 82, baseType: !702, size: 64, offset: 9152)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !565, line: 43, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !697, file: !565, line: 83, baseType: !705, size: 64, offset: 9216)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !129, line: 46, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !697, file: !565, line: 86, baseType: !708, size: 64, offset: 9280)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !565, line: 41, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !697, file: !565, line: 87, baseType: !711, size: 64, offset: 9344)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !565, line: 44, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !697, file: !565, line: 89, baseType: !714, size: 512, offset: 9408)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 512, elements: !715)
!715 = !{!210}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !697, file: !565, line: 90, baseType: !162, size: 16, offset: 9920)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !697, file: !565, line: 90, baseType: !162, size: 16, offset: 9936)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !697, file: !565, line: 92, baseType: !162, size: 16, offset: 9952)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !565, line: 92, baseType: !162, size: 16, offset: 9968)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !697, file: !565, line: 93, baseType: !162, size: 16, offset: 9984)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !565, line: 93, baseType: !162, size: 16, offset: 10000)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !697, file: !565, line: 94, baseType: !48, size: 32, offset: 10016)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !697, file: !565, line: 97, baseType: !162, size: 16, offset: 10048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !697, file: !565, line: 97, baseType: !162, size: 16, offset: 10064)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !697, file: !565, line: 98, baseType: !162, size: 16, offset: 10080)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !697, file: !565, line: 98, baseType: !162, size: 16, offset: 10096)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !697, file: !565, line: 99, baseType: !162, size: 16, offset: 10112)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !697, file: !565, line: 99, baseType: !162, size: 16, offset: 10128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !697, file: !565, line: 100, baseType: !7, size: 32, offset: 10144)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !697, file: !565, line: 101, baseType: !638, size: 64, offset: 10176)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !697, file: !565, line: 103, baseType: !155, size: 64, offset: 10240)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !697, file: !565, line: 104, baseType: !733, size: 64, offset: 10304)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !129, line: 159, size: 448, elements: !735)
!735 = !{!736, !738, !739, !740, !741, !743}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !734, file: !129, line: 161, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !691)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !734, file: !129, line: 162, baseType: !737, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !734, file: !129, line: 163, baseType: !690, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !734, file: !129, line: 164, baseType: !690, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !734, file: !129, line: 165, baseType: !742, size: 128, offset: 192)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 128, elements: !691)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !734, file: !129, line: 166, baseType: !744, size: 128, offset: 320)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !691)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !697, file: !565, line: 107, baseType: !208, size: 32, offset: 10368)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !697, file: !565, line: 108, baseType: !48, size: 32, offset: 10400)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !697, file: !565, line: 109, baseType: !162, size: 16, offset: 10432)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !697, file: !565, line: 110, baseType: !162, size: 16, offset: 10448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !697, file: !565, line: 113, baseType: !48, size: 32, offset: 10464)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !697, file: !565, line: 113, baseType: !48, size: 32, offset: 10496)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !697, file: !565, line: 114, baseType: !149, size: 8, offset: 10528)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !697, file: !565, line: 114, baseType: !149, size: 8, offset: 10536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !697, file: !565, line: 115, baseType: !162, size: 16, offset: 10544)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !697, file: !565, line: 116, baseType: !457, size: 128, offset: 10560)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !697, file: !565, line: 119, baseType: !208, size: 32, offset: 10688)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !697, file: !565, line: 119, baseType: !208, size: 32, offset: 10720)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !697, file: !565, line: 122, baseType: !758, size: 512, offset: 10752)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !759, line: 182, baseType: !760)
!759 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !759, line: 180, size: 512, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !760, file: !759, line: 181, baseType: !178, size: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !697, file: !565, line: 123, baseType: !149, size: 8, offset: 11264)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !697, file: !565, line: 125, baseType: !765, size: 56, offset: 11272)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 56, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 7)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !697, file: !565, line: 126, baseType: !769, size: 4096, offset: 11328)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 4096, elements: !715)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !565, line: 69, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !565, line: 67, size: 512, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !771, file: !565, line: 68, baseType: !178, size: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !682, file: !201, line: 849, baseType: !696, size: 64, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !682, file: !201, line: 850, baseType: !696, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !682, file: !201, line: 851, baseType: !281, size: 96, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !682, file: !201, line: 852, baseType: !208, size: 32, offset: 800)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !610, file: !201, line: 1104, baseType: !779, size: 1344, offset: 1344)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !201, line: 867, size: 1344, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !796, !797, !798, !799, !800, !801, !802, !803, !804}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !779, file: !201, line: 868, baseType: !162, size: 16)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !779, file: !201, line: 869, baseType: !162, size: 16, offset: 16)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !779, file: !201, line: 870, baseType: !162, size: 16, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !779, file: !201, line: 871, baseType: !162, size: 16, offset: 48)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !779, file: !201, line: 873, baseType: !786, size: 896, offset: 64)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 896, elements: !766)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !201, line: 864, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !201, line: 859, size: 128, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !788, file: !201, line: 860, baseType: !162, size: 16)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !788, file: !201, line: 861, baseType: !162, size: 16, offset: 16)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !788, file: !201, line: 861, baseType: !162, size: 16, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !788, file: !201, line: 861, baseType: !162, size: 16, offset: 48)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !201, line: 862, baseType: !48, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !788, file: !201, line: 863, baseType: !208, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !779, file: !201, line: 874, baseType: !133, size: 64, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !779, file: !201, line: 876, baseType: !208, size: 32, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !779, file: !201, line: 876, baseType: !208, size: 32, offset: 1056)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !779, file: !201, line: 878, baseType: !48, size: 32, offset: 1088)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !779, file: !201, line: 879, baseType: !48, size: 32, offset: 1120)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !779, file: !201, line: 881, baseType: !48, size: 32, offset: 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !779, file: !201, line: 881, baseType: !48, size: 32, offset: 1184)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !779, file: !201, line: 883, baseType: !568, size: 64, offset: 1216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !779, file: !201, line: 884, baseType: !231, size: 64, offset: 1280)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !610, file: !201, line: 1107, baseType: !208, size: 32, offset: 2688)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !610, file: !201, line: 1110, baseType: !208, size: 32, offset: 2720)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !610, file: !201, line: 1113, baseType: !162, size: 16, offset: 2752)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !610, file: !201, line: 1113, baseType: !162, size: 16, offset: 2768)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !610, file: !201, line: 1116, baseType: !149, size: 8, offset: 2784)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !610, file: !201, line: 1117, baseType: !473, size: 8, offset: 2792)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !610, file: !201, line: 1120, baseType: !162, size: 16, offset: 2800)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !610, file: !201, line: 1121, baseType: !208, size: 32, offset: 2816)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !610, file: !201, line: 1122, baseType: !208, size: 32, offset: 2848)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !610, file: !201, line: 1123, baseType: !208, size: 32, offset: 2880)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !610, file: !201, line: 1124, baseType: !208, size: 32, offset: 2912)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !610, file: !201, line: 1125, baseType: !208, size: 32, offset: 2944)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !610, file: !201, line: 1126, baseType: !208, size: 32, offset: 2976)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !610, file: !201, line: 1127, baseType: !208, size: 32, offset: 3008)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !610, file: !201, line: 1128, baseType: !208, size: 32, offset: 3040)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !610, file: !201, line: 1129, baseType: !208, size: 32, offset: 3072)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !610, file: !201, line: 1130, baseType: !208, size: 32, offset: 3104)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !610, file: !201, line: 1131, baseType: !162, size: 16, offset: 3136)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !610, file: !201, line: 1132, baseType: !149, size: 8, offset: 3152)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !610, file: !201, line: 1133, baseType: !149, size: 8, offset: 3160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !610, file: !201, line: 1134, baseType: !826, size: 24, offset: 3168)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 24, elements: !282)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !610, file: !201, line: 1135, baseType: !149, size: 8, offset: 3192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !610, file: !201, line: 1138, baseType: !231, size: 64, offset: 3200)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !610, file: !201, line: 1139, baseType: !149, size: 8, offset: 3264)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !610, file: !201, line: 1140, baseType: !149, size: 8, offset: 3272)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !610, file: !201, line: 1141, baseType: !149, size: 8, offset: 3280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !610, file: !201, line: 1142, baseType: !149, size: 8, offset: 3288)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !610, file: !201, line: 1143, baseType: !149, size: 8, offset: 3296)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !610, file: !201, line: 1144, baseType: !835, size: 64, offset: 3304)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !715)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !610, file: !201, line: 1145, baseType: !835, size: 64, offset: 3368)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !610, file: !201, line: 1148, baseType: !149, size: 8, offset: 3432)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !610, file: !201, line: 1149, baseType: !149, size: 8, offset: 3440)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !610, file: !201, line: 1152, baseType: !149, size: 8, offset: 3448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !610, file: !201, line: 1152, baseType: !149, size: 8, offset: 3456)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !610, file: !201, line: 1153, baseType: !149, size: 8, offset: 3464)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !610, file: !201, line: 1154, baseType: !162, size: 16, offset: 3472)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !610, file: !201, line: 1154, baseType: !162, size: 16, offset: 3488)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !610, file: !201, line: 1155, baseType: !162, size: 16, offset: 3504)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !610, file: !201, line: 1155, baseType: !162, size: 16, offset: 3520)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !610, file: !201, line: 1156, baseType: !149, size: 8, offset: 3536)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !610, file: !201, line: 1157, baseType: !149, size: 8, offset: 3544)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !610, file: !201, line: 1159, baseType: !149, size: 8, offset: 3552)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !610, file: !201, line: 1160, baseType: !149, size: 8, offset: 3560)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !610, file: !201, line: 1161, baseType: !149, size: 8, offset: 3568)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !610, file: !201, line: 1162, baseType: !149, size: 8, offset: 3576)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !610, file: !201, line: 1165, baseType: !48, size: 32, offset: 3584)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !610, file: !201, line: 1166, baseType: !48, size: 32, offset: 3616)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !610, file: !201, line: 1167, baseType: !48, size: 32, offset: 3648)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !610, file: !201, line: 1168, baseType: !48, size: 32, offset: 3680)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !610, file: !201, line: 1171, baseType: !162, size: 16, offset: 3712)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !610, file: !201, line: 1171, baseType: !162, size: 16, offset: 3728)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !610, file: !201, line: 1172, baseType: !48, size: 32, offset: 3744)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !610, file: !201, line: 1173, baseType: !208, size: 32, offset: 3776)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !610, file: !201, line: 1174, baseType: !208, size: 32, offset: 3808)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !610, file: !201, line: 1177, baseType: !862, size: 1024, offset: 3840)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !201, line: 963, size: 1024, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !888, !889}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !862, file: !201, line: 965, baseType: !48, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !862, file: !201, line: 968, baseType: !208, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !862, file: !201, line: 971, baseType: !208, size: 32, offset: 64)
