; ModuleID = 'blender/source/blender/imbuf/intern/thumbs_blend.c'
source_filename = "blender/source/blender/imbuf/intern/thumbs_blend.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.gzFile_s = type { i32, i8*, i64 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"BLENDER\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.ImBuf* @IMB_loadblend_thumb(i8* %path) #0 !dbg !15 {
entry:
  %retval = alloca %struct.ImBuf*, align 8
  %path.addr = alloca i8*, align 8
  %gzfile = alloca %struct.gzFile_s*, align 8
  %img = alloca %struct.ImBuf*, align 8
  store i8* %path, i8** %path.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/thumbs_blend.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !7, !8, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{i32 7, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 1, !"wchar_size", i32 4}
!14 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!15 = distinct !DISubprogram(name: "IMB_loadblend_thumb", scope: !1, file: !1, line: 126, type: !16, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !101}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !20, line: 141, baseType: !21)
!20 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !20, line: 70, size: 19840, elements: !22)
!22 = !{!23, !25, !26, !27, !28, !29, !30, !31, !32, !33, !35, !40, !41, !42, !43, !44, !46, !48, !49, !50, !54, !55, !56, !57, !58, !61, !62, !63, !68, !69, !72, !73, !74, !75, !76, !79, !80, !81, !84, !85, !94}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !20, line: 71, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !20, line: 71, baseType: !24, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !20, line: 74, baseType: !7, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !20, line: 74, baseType: !7, size: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !21, file: !20, line: 79, baseType: !6, size: 8, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !21, file: !20, line: 80, baseType: !7, size: 32, offset: 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !21, file: !20, line: 83, baseType: !7, size: 32, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !21, file: !20, line: 84, baseType: !7, size: 32, offset: 288)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !21, file: !20, line: 87, baseType: !9, size: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !21, file: !20, line: 88, baseType: !34, size: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !21, file: !20, line: 93, baseType: !36, size: 128, offset: 448)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !38)
!37 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!38 = !{!39}
!39 = !DISubrange(count: 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !21, file: !20, line: 96, baseType: !7, size: 32, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !21, file: !20, line: 96, baseType: !7, size: 32, offset: 608)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !21, file: !20, line: 97, baseType: !7, size: 32, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !21, file: !20, line: 97, baseType: !7, size: 32, offset: 672)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !21, file: !20, line: 98, baseType: !45, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !21, file: !20, line: 101, baseType: !47, size: 64, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !21, file: !20, line: 102, baseType: !34, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !21, file: !20, line: 105, baseType: !8, size: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !21, file: !20, line: 108, baseType: !51, size: 1280, offset: 960)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1280, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 20)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !21, file: !20, line: 109, baseType: !7, size: 32, offset: 2240)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !21, file: !20, line: 109, baseType: !7, size: 32, offset: 2272)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !21, file: !20, line: 112, baseType: !7, size: 32, offset: 2304)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !21, file: !20, line: 113, baseType: !7, size: 32, offset: 2336)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !21, file: !20, line: 114, baseType: !59, size: 64, offset: 2368)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !20, line: 50, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !21, file: !20, line: 115, baseType: !4, size: 64, offset: 2432)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !21, file: !20, line: 118, baseType: !7, size: 32, offset: 2496)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !20, line: 119, baseType: !64, size: 8192, offset: 2528)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8192, elements: !66)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !{!67}
!67 = !DISubrange(count: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !21, file: !20, line: 120, baseType: !64, size: 8192, offset: 10720)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !21, file: !20, line: 123, baseType: !70, size: 64, offset: 18944)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !20, line: 123, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !21, file: !20, line: 124, baseType: !7, size: 32, offset: 19008)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !21, file: !20, line: 127, baseType: !5, size: 64, offset: 19072)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !21, file: !20, line: 128, baseType: !10, size: 32, offset: 19136)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !21, file: !20, line: 129, baseType: !10, size: 32, offset: 19168)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !21, file: !20, line: 132, baseType: !77, size: 64, offset: 19200)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !20, line: 132, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !21, file: !20, line: 133, baseType: !77, size: 64, offset: 19264)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !21, file: !20, line: 134, baseType: !9, size: 64, offset: 19328)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !21, file: !20, line: 135, baseType: !82, size: 64, offset: 19392)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !20, line: 135, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !21, file: !20, line: 136, baseType: !7, size: 32, offset: 19456)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !21, file: !20, line: 137, baseType: !86, size: 128, offset: 19488)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !87, line: 89, baseType: !88)
!87 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !87, line: 86, size: 128, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !88, file: !87, line: 87, baseType: !7, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !88, file: !87, line: 87, baseType: !7, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !88, file: !87, line: 88, baseType: !7, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !88, file: !87, line: 88, baseType: !7, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !21, file: !20, line: 140, baseType: !95, size: 192, offset: 19648)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !20, line: 55, size: 192, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !95, file: !20, line: 56, baseType: !10, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !95, file: !20, line: 57, baseType: !10, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !20, line: 58, baseType: !5, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !20, line: 59, baseType: !10, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!103 = !DILocalVariable(name: "path", arg: 1, scope: !15, file: !1, line: 126, type: !101)
!104 = !DILocation(line: 126, column: 40, scope: !15)
!105 = !DILocalVariable(name: "gzfile", scope: !15, file: !1, line: 128, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !107, line: 1204, baseType: !108)
!107 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !107, line: 1648, size: 192, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !109, file: !107, line: 1649, baseType: !10, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !107, line: 1650, baseType: !5, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !109, file: !107, line: 1651, baseType: !114, size: 64, offset: 128)
!114 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!115 = !DILocation(line: 128, column: 9, scope: !15)
!116 = !DILocation(line: 130, column: 22, scope: !15)
!117 = !DILocation(line: 130, column: 11, scope: !15)
!118 = !DILocation(line: 130, column: 9, scope: !15)
!119 = !DILocation(line: 132, column: 14, scope: !120)
!120 = distinct !DILexicalBlock(scope: !15, file: !1, line: 132, column: 6)
!121 = !DILocation(line: 132, column: 11, scope: !120)
!122 = !DILocation(line: 132, column: 6, scope: !15)
!123 = !DILocation(line: 133, column: 3, scope: !124)
!124 = distinct !DILexicalBlock(scope: !120, file: !1, line: 132, column: 22)
!125 = !DILocalVariable(name: "img", scope: !126, file: !1, line: 136, type: !18)
!126 = distinct !DILexicalBlock(scope: !120, file: !1, line: 135, column: 7)
!127 = !DILocation(line: 136, column: 10, scope: !126)
!128 = !DILocation(line: 136, column: 32, scope: !126)
!129 = !DILocation(line: 136, column: 16, scope: !126)
!130 = !DILocation(line: 139, column: 11, scope: !126)
!131 = !DILocation(line: 139, column: 3, scope: !126)
!132 = !DILocation(line: 141, column: 10, scope: !126)
!133 = !DILocation(line: 141, column: 3, scope: !126)
!134 = !DILocation(line: 143, column: 1, scope: !15)
!135 = distinct !DISubprogram(name: "loadblend_thumb", scope: !1, file: !1, line: 49, type: !136, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!136 = !DISubroutineType(types: !137)
!137 = !{!18, !106}
!138 = !DILocalVariable(name: "gzfile", arg: 1, scope: !135, file: !1, line: 49, type: !106)
!139 = !DILocation(line: 49, column: 38, scope: !135)
!140 = !DILocalVariable(name: "buf", scope: !135, file: !1, line: 51, type: !141)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 96, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 12)
!144 = !DILocation(line: 51, column: 7, scope: !135)
!145 = !DILocalVariable(name: "bhead", scope: !135, file: !1, line: 52, type: !146)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 6)
!149 = !DILocation(line: 52, column: 6, scope: !135)
!150 = !DILocalVariable(name: "endian", scope: !135, file: !1, line: 53, type: !65)
!151 = !DILocation(line: 53, column: 7, scope: !135)
!152 = !DILocalVariable(name: "pointer_size", scope: !135, file: !1, line: 53, type: !65)
!153 = !DILocation(line: 53, column: 15, scope: !135)
!154 = !DILocalVariable(name: "endian_switch", scope: !135, file: !1, line: 54, type: !65)
!155 = !DILocation(line: 54, column: 7, scope: !135)
!156 = !DILocalVariable(name: "sizeof_bhead", scope: !135, file: !1, line: 55, type: !7)
!157 = !DILocation(line: 55, column: 6, scope: !135)
!158 = !DILocation(line: 58, column: 13, scope: !159)
!159 = distinct !DILexicalBlock(scope: !135, file: !1, line: 58, column: 6)
!160 = !DILocation(line: 58, column: 21, scope: !159)
!161 = !DILocation(line: 58, column: 6, scope: !159)
!162 = !DILocation(line: 58, column: 30, scope: !159)
!163 = !DILocation(line: 58, column: 6, scope: !135)
!164 = !DILocation(line: 59, column: 3, scope: !159)
!165 = !DILocation(line: 60, column: 14, scope: !166)
!166 = distinct !DILexicalBlock(scope: !135, file: !1, line: 60, column: 6)
!167 = !DILocation(line: 60, column: 6, scope: !166)
!168 = !DILocation(line: 60, column: 6, scope: !135)
!169 = !DILocation(line: 61, column: 3, scope: !166)
!170 = !DILocation(line: 63, column: 6, scope: !171)
!171 = distinct !DILexicalBlock(scope: !135, file: !1, line: 63, column: 6)
!172 = !DILocation(line: 63, column: 13, scope: !171)
!173 = !DILocation(line: 63, column: 6, scope: !135)
!174 = !DILocation(line: 64, column: 16, scope: !171)
!175 = !DILocation(line: 64, column: 3, scope: !171)
!176 = !DILocation(line: 65, column: 11, scope: !177)
