; ModuleID = 'blender/source/blender/editors/space_node/node_relationships.c'
source_filename = "blender/source/blender/editors/space_node/node_relationships.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }

!82 = !DIEnumerator(name: "NTREE_UPDATE_GROUP_OUT", value: 32, isUnsigned: true)
!83 = !DIEnumerator(name: "NTREE_UPDATE_GROUP", value: 48, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !76, line: 148, baseType: !5, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketFlag", file: !76, line: 154, baseType: !5, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96}
!90 = !DIEnumerator(name: "SOCK_HIDDEN", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "SOCK_IN_USE", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "SOCK_UNAVAIL", value: 8, isUnsigned: true)
!93 = !DIEnumerator(name: "SOCK_COLLAPSED", value: 64, isUnsigned: true)
!94 = !DIEnumerator(name: "SOCK_HIDE_VALUE", value: 128, isUnsigned: true)
!95 = !DIEnumerator(name: "SOCK_AUTO_HIDDEN__DEPRECATED", value: 256, isUnsigned: true)
!96 = !DIEnumerator(name: "SOCK_NO_INTERNAL_LINK", value: 512, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !98, line: 1163, baseType: !5, size: 32, elements: !99)
!98 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!100 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!106 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!107 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!108 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!109 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!110 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!111 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!112 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!113 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!114 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!115 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!116 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!117 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!118 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!119 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!120 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!121 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 46, baseType: !5, size: 32, elements: !124)
!123 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!125 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!126 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!127 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!128 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!129 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!130 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!131 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!132 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!133 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!136 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!141 = !{i32 7, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{i32 1, !"wchar_size", i32 4}
!144 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!145 = distinct !DISubprogram(name: "NODE_OT_link_viewer", scope: !1, file: !1, line: 382, type: !146, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2451)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !150, line: 568, baseType: !151)
!150 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !150, line: 508, size: 1536, elements: !152)
!152 = !{!153, !157, !158, !159, !160, !2402, !2406, !2412, !2416, !2417, !2421, !2422, !2423, !2424, !2428, !2429, !2444, !2445, !2449, !2450}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !150, line: 509, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !151, file: !150, line: 510, baseType: !154, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !151, file: !150, line: 511, baseType: !154, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !151, file: !150, line: 512, baseType: !154, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !151, file: !150, line: 518, baseType: !161, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!139, !164, !166}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !4, line: 44, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !67, line: 328, size: 1344, elements: !168)
!168 = !{!169, !170, !171, !175, !206, !208, !209, !210, !222, !2397, !2398, !2399, !2400, !2401}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !67, line: 329, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !167, file: !67, line: 329, baseType: !166, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !167, file: !67, line: 332, baseType: !172, size: 512, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 512, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !167, file: !67, line: 333, baseType: !176, size: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !178, line: 75, baseType: !179)
!178 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !178, line: 62, size: 1024, elements: !180)
!180 = !{!181, !183, !184, !185, !186, !188, !189, !190, !204, !205}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !178, line: 63, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !178, line: 63, baseType: !182, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !178, line: 64, baseType: !156, size: 8, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !179, file: !178, line: 64, baseType: !156, size: 8, offset: 136)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !178, line: 65, baseType: !187, size: 16, offset: 144)
!187 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !178, line: 66, baseType: !172, size: 512, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !179, file: !178, line: 67, baseType: !139, size: 32, offset: 672)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !178, line: 69, baseType: !191, size: 256, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !178, line: 60, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !178, line: 48, size: 256, elements: !193)
!193 = !{!194, !195, !202, !203}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !192, file: !178, line: 49, baseType: !138, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !192, file: !178, line: 58, baseType: !196, size: 128, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !197, line: 71, baseType: !198)
!197 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !197, line: 69, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !198, file: !197, line: 70, baseType: !138, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !198, file: !197, line: 70, baseType: !138, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !192, file: !178, line: 59, baseType: !139, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !192, file: !178, line: 59, baseType: !139, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !179, file: !178, line: 70, baseType: !139, size: 32, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !179, file: !178, line: 74, baseType: !139, size: 32, offset: 992)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !167, file: !67, line: 336, baseType: !207, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !167, file: !67, line: 337, baseType: !138, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !167, file: !67, line: 338, baseType: !138, size: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !167, file: !67, line: 340, baseType: !211, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !4, line: 55, size: 192, elements: !213)
!213 = !{!214, !218, !221}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !212, file: !4, line: 58, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !4, line: 56, size: 64, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !4, line: 57, baseType: !138, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !4, line: 60, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !76, line: 335, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !4, line: 61, baseType: !138, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !167, file: !67, line: 341, baseType: !223, size: 64, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !67, line: 106, size: 320, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !224, file: !67, line: 107, baseType: !196, size: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !224, file: !67, line: 108, baseType: !139, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !224, file: !67, line: 109, baseType: !139, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !224, file: !67, line: 110, baseType: !139, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !224, file: !67, line: 110, baseType: !139, size: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !224, file: !67, line: 111, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !150, line: 490, size: 768, elements: !234)
!234 = !{!235, !236, !237, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !150, line: 491, baseType: !232, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !233, file: !150, line: 491, baseType: !232, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !233, file: !150, line: 493, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !67, line: 169, size: 2048, elements: !240)
!240 = !{!241, !242, !243, !244, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2363, !2366, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !67, line: 170, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !67, line: 170, baseType: !238, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !239, file: !67, line: 172, baseType: !138, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !239, file: !67, line: 174, baseType: !245, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !247, line: 49, size: 1984, elements: !248)
!247 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!248 = !{!249, !285, !286, !287, !288, !289, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !246, file: !247, line: 50, baseType: !250, size: 960)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !178, line: 130, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !178, line: 117, size: 960, elements: !252)
!252 = !{!253, !254, !255, !257, !276, !280, !281, !282, !283, !284}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !178, line: 118, baseType: !138, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !178, line: 118, baseType: !138, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !251, file: !178, line: 119, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !251, file: !178, line: 120, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !178, line: 136, size: 17600, elements: !260)
!260 = !{!261, !262, !264, !267, !271, !272, !273}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !259, file: !178, line: 137, baseType: !250, size: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !259, file: !178, line: 138, baseType: !263, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !259, file: !178, line: 139, baseType: !265, size: 64, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !178, line: 43, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !178, line: 140, baseType: !268, size: 8192, offset: 1088)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 8192, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 1024)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !259, file: !178, line: 141, baseType: !268, size: 8192, offset: 9280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !259, file: !178, line: 148, baseType: !258, size: 64, offset: 17472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !259, file: !178, line: 150, baseType: !274, size: 64, offset: 17536)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !178, line: 45, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !178, line: 121, baseType: !277, size: 528, offset: 256)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 528, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 66)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !178, line: 126, baseType: !187, size: 16, offset: 784)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !251, file: !178, line: 127, baseType: !139, size: 32, offset: 800)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !251, file: !178, line: 128, baseType: !139, size: 32, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !251, file: !178, line: 128, baseType: !139, size: 32, offset: 864)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !251, file: !178, line: 129, baseType: !176, size: 64, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !246, file: !247, line: 52, baseType: !196, size: 128, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !246, file: !247, line: 53, baseType: !196, size: 128, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !246, file: !247, line: 54, baseType: !196, size: 128, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !246, file: !247, line: 55, baseType: !196, size: 128, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !246, file: !247, line: 57, baseType: !290, size: 64, offset: 1472)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !292, line: 1216, size: 39680, elements: !293)
!292 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!293 = !{!294, !295, !299, !302, !1330, !1331, !1332, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1702, !1916, !1919, !2159, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2181, !2182, !2183, !2184, !2185, !2193, !2259, !2266, !2267, !2274, !2275, !2281, !2282, !2283, !2284, !2285}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !291, file: !292, line: 1217, baseType: !250, size: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !291, file: !292, line: 1218, baseType: !296, size: 64, offset: 960)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !298, line: 45, flags: DIFlagFwdDecl)
!298 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !291, file: !292, line: 1220, baseType: !300, size: 64, offset: 1024)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !298, line: 49, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !291, file: !292, line: 1221, baseType: !303, size: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !305, line: 52, size: 4224, elements: !306)
!305 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !377, !378, !381, !1325, !1326, !1327, !1328, !1329}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !304, file: !305, line: 53, baseType: !250, size: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !304, file: !305, line: 54, baseType: !296, size: 64, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !304, file: !305, line: 56, baseType: !187, size: 16, offset: 1024)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !304, file: !305, line: 56, baseType: !187, size: 16, offset: 1040)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !304, file: !305, line: 57, baseType: !187, size: 16, offset: 1056)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !304, file: !305, line: 57, baseType: !187, size: 16, offset: 1072)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !304, file: !305, line: 59, baseType: !314, size: 32, offset: 1088)
!314 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !304, file: !305, line: 59, baseType: !314, size: 32, offset: 1120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !304, file: !305, line: 59, baseType: !314, size: 32, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !304, file: !305, line: 60, baseType: !314, size: 32, offset: 1184)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !304, file: !305, line: 60, baseType: !314, size: 32, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !304, file: !305, line: 60, baseType: !314, size: 32, offset: 1248)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !304, file: !305, line: 61, baseType: !314, size: 32, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !304, file: !305, line: 61, baseType: !314, size: 32, offset: 1312)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !304, file: !305, line: 61, baseType: !314, size: 32, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !304, file: !305, line: 68, baseType: !314, size: 32, offset: 1376)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !304, file: !305, line: 68, baseType: !314, size: 32, offset: 1408)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !304, file: !305, line: 68, baseType: !314, size: 32, offset: 1440)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !304, file: !305, line: 69, baseType: !314, size: 32, offset: 1472)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !304, file: !305, line: 69, baseType: !314, size: 32, offset: 1504)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !304, file: !305, line: 74, baseType: !314, size: 32, offset: 1536)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !304, file: !305, line: 79, baseType: !314, size: 32, offset: 1568)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !304, file: !305, line: 81, baseType: !187, size: 16, offset: 1600)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !304, file: !305, line: 91, baseType: !187, size: 16, offset: 1616)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !304, file: !305, line: 92, baseType: !187, size: 16, offset: 1632)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !304, file: !305, line: 93, baseType: !187, size: 16, offset: 1648)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !304, file: !305, line: 94, baseType: !187, size: 16, offset: 1664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !304, file: !305, line: 94, baseType: !187, size: 16, offset: 1680)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !304, file: !305, line: 94, baseType: !187, size: 16, offset: 1696)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !304, file: !305, line: 94, baseType: !187, size: 16, offset: 1712)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !304, file: !305, line: 96, baseType: !314, size: 32, offset: 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !304, file: !305, line: 96, baseType: !314, size: 32, offset: 1760)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !304, file: !305, line: 96, baseType: !314, size: 32, offset: 1792)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !304, file: !305, line: 96, baseType: !314, size: 32, offset: 1824)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !304, file: !305, line: 98, baseType: !314, size: 32, offset: 1856)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !304, file: !305, line: 98, baseType: !314, size: 32, offset: 1888)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !304, file: !305, line: 98, baseType: !314, size: 32, offset: 1920)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !304, file: !305, line: 98, baseType: !314, size: 32, offset: 1952)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !304, file: !305, line: 99, baseType: !314, size: 32, offset: 1984)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !304, file: !305, line: 99, baseType: !314, size: 32, offset: 2016)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !304, file: !305, line: 100, baseType: !314, size: 32, offset: 2048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !304, file: !305, line: 100, baseType: !314, size: 32, offset: 2080)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !304, file: !305, line: 103, baseType: !187, size: 16, offset: 2112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !304, file: !305, line: 103, baseType: !187, size: 16, offset: 2128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !304, file: !305, line: 103, baseType: !187, size: 16, offset: 2144)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !304, file: !305, line: 103, baseType: !187, size: 16, offset: 2160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !304, file: !305, line: 106, baseType: !314, size: 32, offset: 2176)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !304, file: !305, line: 106, baseType: !314, size: 32, offset: 2208)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !304, file: !305, line: 106, baseType: !314, size: 32, offset: 2240)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !304, file: !305, line: 106, baseType: !314, size: 32, offset: 2272)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !304, file: !305, line: 107, baseType: !187, size: 16, offset: 2304)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !304, file: !305, line: 107, baseType: !187, size: 16, offset: 2320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !304, file: !305, line: 107, baseType: !187, size: 16, offset: 2336)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !304, file: !305, line: 107, baseType: !187, size: 16, offset: 2352)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !304, file: !305, line: 108, baseType: !314, size: 32, offset: 2368)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !304, file: !305, line: 108, baseType: !314, size: 32, offset: 2400)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !304, file: !305, line: 109, baseType: !314, size: 32, offset: 2432)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !304, file: !305, line: 109, baseType: !314, size: 32, offset: 2464)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !304, file: !305, line: 110, baseType: !314, size: 32, offset: 2496)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !304, file: !305, line: 110, baseType: !314, size: 32, offset: 2528)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !304, file: !305, line: 110, baseType: !314, size: 32, offset: 2560)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !304, file: !305, line: 111, baseType: !187, size: 16, offset: 2592)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !304, file: !305, line: 111, baseType: !187, size: 16, offset: 2608)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !304, file: !305, line: 112, baseType: !187, size: 16, offset: 2624)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !304, file: !305, line: 112, baseType: !187, size: 16, offset: 2640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !304, file: !305, line: 112, baseType: !187, size: 16, offset: 2656)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !304, file: !305, line: 115, baseType: !187, size: 16, offset: 2672)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !304, file: !305, line: 118, baseType: !376, size: 64, offset: 2688)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !304, file: !305, line: 118, baseType: !376, size: 64, offset: 2752)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !304, file: !305, line: 121, baseType: !379, size: 64, offset: 2816)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !298, line: 46, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !304, file: !305, line: 122, baseType: !382, size: 1152, offset: 2880)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 1152, elements: !1323)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !298, line: 57, size: 2496, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !384, file: !298, line: 59, baseType: !187, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !384, file: !298, line: 59, baseType: !187, size: 16, offset: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !384, file: !298, line: 59, baseType: !187, size: 16, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !384, file: !298, line: 59, baseType: !187, size: 16, offset: 48)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !384, file: !298, line: 60, baseType: !300, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !384, file: !298, line: 61, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !298, line: 202, size: 3328, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !464, !1031, !1032, !1110, !1136, !1164, !1165, !1233, !1254, !1262, !1263}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !393, file: !298, line: 203, baseType: !250, size: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !393, file: !298, line: 204, baseType: !296, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !393, file: !298, line: 206, baseType: !314, size: 32, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !393, file: !298, line: 206, baseType: !314, size: 32, offset: 1056)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !393, file: !298, line: 207, baseType: !314, size: 32, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !393, file: !298, line: 207, baseType: !314, size: 32, offset: 1120)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !393, file: !298, line: 207, baseType: !314, size: 32, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !393, file: !298, line: 207, baseType: !314, size: 32, offset: 1184)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !393, file: !298, line: 207, baseType: !314, size: 32, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !393, file: !298, line: 207, baseType: !314, size: 32, offset: 1248)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !393, file: !298, line: 208, baseType: !314, size: 32, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !393, file: !298, line: 208, baseType: !314, size: 32, offset: 1312)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !393, file: !298, line: 211, baseType: !314, size: 32, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !393, file: !298, line: 211, baseType: !314, size: 32, offset: 1376)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !393, file: !298, line: 211, baseType: !314, size: 32, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !393, file: !298, line: 211, baseType: !314, size: 32, offset: 1440)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !393, file: !298, line: 211, baseType: !314, size: 32, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !393, file: !298, line: 214, baseType: !314, size: 32, offset: 1504)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !393, file: !298, line: 214, baseType: !314, size: 32, offset: 1536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !393, file: !298, line: 217, baseType: !314, size: 32, offset: 1568)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !393, file: !298, line: 218, baseType: !314, size: 32, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !393, file: !298, line: 219, baseType: !314, size: 32, offset: 1632)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !393, file: !298, line: 220, baseType: !314, size: 32, offset: 1664)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !393, file: !298, line: 221, baseType: !314, size: 32, offset: 1696)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !393, file: !298, line: 222, baseType: !187, size: 16, offset: 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !393, file: !298, line: 222, baseType: !187, size: 16, offset: 1744)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !393, file: !298, line: 224, baseType: !187, size: 16, offset: 1760)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !393, file: !298, line: 224, baseType: !187, size: 16, offset: 1776)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !393, file: !298, line: 227, baseType: !187, size: 16, offset: 1792)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !393, file: !298, line: 227, baseType: !187, size: 16, offset: 1808)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !393, file: !298, line: 229, baseType: !187, size: 16, offset: 1824)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !298, line: 229, baseType: !187, size: 16, offset: 1840)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !393, file: !298, line: 230, baseType: !187, size: 16, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !393, file: !298, line: 230, baseType: !187, size: 16, offset: 1872)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !393, file: !298, line: 232, baseType: !314, size: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !393, file: !298, line: 232, baseType: !314, size: 32, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !393, file: !298, line: 232, baseType: !314, size: 32, offset: 1952)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !393, file: !298, line: 232, baseType: !314, size: 32, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !393, file: !298, line: 233, baseType: !139, size: 32, offset: 2016)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !393, file: !298, line: 234, baseType: !139, size: 32, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !393, file: !298, line: 235, baseType: !187, size: 16, offset: 2080)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !393, file: !298, line: 235, baseType: !187, size: 16, offset: 2096)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !393, file: !298, line: 236, baseType: !187, size: 16, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !393, file: !298, line: 239, baseType: !187, size: 16, offset: 2128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !393, file: !298, line: 240, baseType: !139, size: 32, offset: 2144)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !393, file: !298, line: 241, baseType: !139, size: 32, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !393, file: !298, line: 241, baseType: !139, size: 32, offset: 2208)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !393, file: !298, line: 241, baseType: !139, size: 32, offset: 2240)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !393, file: !298, line: 243, baseType: !314, size: 32, offset: 2272)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !393, file: !298, line: 243, baseType: !314, size: 32, offset: 2304)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !393, file: !298, line: 244, baseType: !314, size: 32, offset: 2336)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !393, file: !298, line: 246, baseType: !447, size: 320, offset: 2368)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !448, line: 50, size: 320, elements: !449)
!448 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !447, file: !448, line: 51, baseType: !290, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !447, file: !448, line: 53, baseType: !139, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !447, file: !448, line: 54, baseType: !139, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !447, file: !448, line: 55, baseType: !139, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !447, file: !448, line: 55, baseType: !139, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !447, file: !448, line: 56, baseType: !156, size: 8, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !447, file: !448, line: 56, baseType: !156, size: 8, offset: 200)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !447, file: !448, line: 57, baseType: !156, size: 8, offset: 208)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !448, line: 57, baseType: !156, size: 8, offset: 216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !447, file: !448, line: 59, baseType: !187, size: 16, offset: 224)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !447, file: !448, line: 59, baseType: !187, size: 16, offset: 240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !447, file: !448, line: 59, baseType: !187, size: 16, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !448, line: 61, baseType: !187, size: 16, offset: 272)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !447, file: !448, line: 63, baseType: !139, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !393, file: !298, line: 248, baseType: !465, size: 64, offset: 2688)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !76, line: 328, size: 3456, elements: !467)
!467 = !{!468, !469, !470, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1009, !1010, !1011, !1014, !1018, !1022, !1026, !1027, !1028, !1029, !1030}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !466, file: !76, line: 329, baseType: !250, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !466, file: !76, line: 330, baseType: !296, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !466, file: !76, line: 332, baseType: !471, size: 64, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !473, line: 283, size: 4096, elements: !474)
!473 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!474 = !{!475, !476, !477, !478, !482, !483, !487, !948, !956, !960, !966, !970, !971, !972, !973, !977, !978}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !473, line: 284, baseType: !139, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !472, file: !473, line: 285, baseType: !172, size: 512, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !472, file: !473, line: 287, baseType: !172, size: 512, offset: 544)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !472, file: !473, line: 288, baseType: !479, size: 2048, offset: 1056)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 2048, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !472, file: !473, line: 289, baseType: !139, size: 32, offset: 3104)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !472, file: !473, line: 292, baseType: !484, size: 64, offset: 3136)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !465}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !472, file: !473, line: 293, baseType: !488, size: 64, offset: 3200)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !465, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !76, line: 167, size: 3712, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !76, line: 168, baseType: !491, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !492, file: !76, line: 168, baseType: !491, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !492, file: !76, line: 168, baseType: !491, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !492, file: !76, line: 170, baseType: !176, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !492, file: !76, line: 172, baseType: !499, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !473, line: 144, size: 6016, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !667, !668, !669, !812, !816, !820, !821, !828, !832, !836, !837, !838, !839, !843, !844, !848, !852, !856, !860, !864, !868, !872, !873, !880, !882, !891, !900}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !473, line: 145, baseType: !138, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !500, file: !473, line: 145, baseType: !138, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !500, file: !473, line: 146, baseType: !187, size: 16, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !500, file: !473, line: 148, baseType: !172, size: 512, offset: 144)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !473, line: 149, baseType: !139, size: 32, offset: 672)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !500, file: !473, line: 151, baseType: !172, size: 512, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !500, file: !473, line: 152, baseType: !479, size: 2048, offset: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !500, file: !473, line: 153, baseType: !139, size: 32, offset: 3264)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !500, file: !473, line: 155, baseType: !314, size: 32, offset: 3296)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !500, file: !473, line: 155, baseType: !314, size: 32, offset: 3328)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !500, file: !473, line: 155, baseType: !314, size: 32, offset: 3360)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !500, file: !473, line: 156, baseType: !314, size: 32, offset: 3392)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !500, file: !473, line: 156, baseType: !314, size: 32, offset: 3424)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !500, file: !473, line: 156, baseType: !314, size: 32, offset: 3456)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !500, file: !473, line: 157, baseType: !187, size: 16, offset: 3488)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !500, file: !473, line: 157, baseType: !187, size: 16, offset: 3504)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !500, file: !473, line: 157, baseType: !187, size: 16, offset: 3520)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !500, file: !473, line: 160, baseType: !520, size: 64, offset: 3584)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !473, line: 109, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !473, line: 98, size: 1408, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !666}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !522, file: !473, line: 99, baseType: !139, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !522, file: !473, line: 99, baseType: !139, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !522, file: !473, line: 100, baseType: !172, size: 512, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !522, file: !473, line: 101, baseType: !314, size: 32, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !522, file: !473, line: 101, baseType: !314, size: 32, offset: 608)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !522, file: !473, line: 101, baseType: !314, size: 32, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !522, file: !473, line: 101, baseType: !314, size: 32, offset: 672)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !522, file: !473, line: 102, baseType: !314, size: 32, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !522, file: !473, line: 102, baseType: !314, size: 32, offset: 736)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !522, file: !473, line: 103, baseType: !139, size: 32, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !473, line: 104, baseType: !139, size: 32, offset: 800)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !522, file: !473, line: 107, baseType: !536, size: 64, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !76, line: 87, size: 2816, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !645}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !537, file: !76, line: 88, baseType: !536, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !537, file: !76, line: 88, baseType: !536, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !537, file: !76, line: 88, baseType: !536, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !537, file: !76, line: 90, baseType: !176, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !537, file: !76, line: 92, baseType: !172, size: 512, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !537, file: !76, line: 94, baseType: !172, size: 512, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !537, file: !76, line: 99, baseType: !138, size: 64, offset: 1280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !76, line: 101, baseType: !187, size: 16, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !537, file: !76, line: 101, baseType: !187, size: 16, offset: 1360)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !537, file: !76, line: 102, baseType: !187, size: 16, offset: 1376)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !537, file: !76, line: 103, baseType: !187, size: 16, offset: 1392)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !537, file: !76, line: 104, baseType: !551, size: 64, offset: 1408)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !473, line: 114, size: 1600, elements: !553)
!553 = !{!554, !555, !561, !565, !569, !573, !577, !581, !582, !586, !615, !616, !617}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !552, file: !473, line: 115, baseType: !172, size: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !552, file: !473, line: 117, baseType: !556, size: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !164, !559, !211, !211, !154}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !473, line: 73, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !552, file: !473, line: 118, baseType: !562, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !164, !211, !211, !376}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !552, file: !473, line: 120, baseType: !566, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !164, !559, !211}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !552, file: !473, line: 121, baseType: !570, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !164, !211, !376}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !552, file: !473, line: 122, baseType: !574, size: 64, offset: 768)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !465, !536, !219}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !552, file: !473, line: 123, baseType: !578, size: 64, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !465, !536, !491, !536, !154}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !552, file: !473, line: 124, baseType: !578, size: 64, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !552, file: !473, line: 125, baseType: !583, size: 64, offset: 960)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !465, !536, !491, !536}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !552, file: !473, line: 128, baseType: !587, size: 256, offset: 1024)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !4, line: 436, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !4, line: 430, size: 256, elements: !589)
!589 = !{!590, !591, !594, !610}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !588, file: !4, line: 431, baseType: !138, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !588, file: !4, line: 432, baseType: !592, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !4, line: 417, baseType: !220)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !588, file: !4, line: 433, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !4, line: 408, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!139, !164, !211, !599, !601}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !4, line: 38, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !4, line: 348, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !4, line: 337, size: 256, elements: !604)
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !603, file: !4, line: 339, baseType: !138, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !603, file: !4, line: 342, baseType: !599, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !603, file: !4, line: 345, baseType: !139, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !603, file: !4, line: 347, baseType: !139, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !603, file: !4, line: 347, baseType: !139, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !588, file: !4, line: 434, baseType: !611, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !4, line: 409, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !138}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !552, file: !473, line: 129, baseType: !587, size: 256, offset: 1280)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !473, line: 132, baseType: !139, size: 32, offset: 1536)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !552, file: !473, line: 132, baseType: !139, size: 32, offset: 1568)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !537, file: !76, line: 105, baseType: !172, size: 512, offset: 1472)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !537, file: !76, line: 107, baseType: !314, size: 32, offset: 1984)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !537, file: !76, line: 107, baseType: !314, size: 32, offset: 2016)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !537, file: !76, line: 109, baseType: !138, size: 64, offset: 2048)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !537, file: !76, line: 112, baseType: !187, size: 16, offset: 2112)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !537, file: !76, line: 114, baseType: !187, size: 16, offset: 2128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !537, file: !76, line: 115, baseType: !139, size: 32, offset: 2144)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !537, file: !76, line: 117, baseType: !138, size: 64, offset: 2176)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !537, file: !76, line: 122, baseType: !139, size: 32, offset: 2240)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !537, file: !76, line: 124, baseType: !139, size: 32, offset: 2272)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !537, file: !76, line: 126, baseType: !536, size: 64, offset: 2304)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !537, file: !76, line: 128, baseType: !630, size: 64, offset: 2368)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !76, line: 298, size: 448, elements: !632)
!632 = !{!633, !634, !635, !638, !639, !642, !643, !644}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !631, file: !76, line: 299, baseType: !630, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !631, file: !76, line: 299, baseType: !630, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !631, file: !76, line: 301, baseType: !636, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !76, line: 218, baseType: !492)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !631, file: !76, line: 301, baseType: !636, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !631, file: !76, line: 302, baseType: !640, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !76, line: 132, baseType: !537)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !631, file: !76, line: 302, baseType: !640, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !631, file: !76, line: 304, baseType: !139, size: 32, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !631, file: !76, line: 305, baseType: !139, size: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !537, file: !76, line: 131, baseType: !646, size: 384, offset: 2432)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !76, line: 73, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !76, line: 62, size: 384, elements: !648)
!648 = !{!649, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !647, file: !76, line: 63, baseType: !650, size: 128)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 128, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 4)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !647, file: !76, line: 64, baseType: !314, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !647, file: !76, line: 64, baseType: !314, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !647, file: !76, line: 65, baseType: !138, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !647, file: !76, line: 66, baseType: !187, size: 16, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !647, file: !76, line: 67, baseType: !187, size: 16, offset: 272)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !647, file: !76, line: 68, baseType: !187, size: 16, offset: 288)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !647, file: !76, line: 69, baseType: !187, size: 16, offset: 304)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !647, file: !76, line: 70, baseType: !187, size: 16, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !647, file: !76, line: 71, baseType: !187, size: 16, offset: 336)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !647, file: !76, line: 72, baseType: !663, size: 32, offset: 352)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 32, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 2)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !522, file: !473, line: 108, baseType: !172, size: 512, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !500, file: !473, line: 160, baseType: !520, size: 64, offset: 3648)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !500, file: !473, line: 162, baseType: !172, size: 512, offset: 3712)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !500, file: !473, line: 165, baseType: !670, size: 64, offset: 4224)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !673, !675, !760, !465, !491, !808}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !247, line: 230, size: 3072, elements: !677)
!677 = !{!678, !679, !680, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !749, !750, !751, !752, !753, !754, !755, !756, !757, !759}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !247, line: 231, baseType: !675, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !676, file: !247, line: 231, baseType: !675, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !676, file: !247, line: 233, baseType: !681, size: 1280, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !682, line: 71, baseType: !683)
!682 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !682, line: 40, size: 1280, elements: !684)
!684 = !{!685, !694, !695, !703, !704, !705, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !728}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !683, file: !682, line: 41, baseType: !686, size: 128)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !687, line: 95, baseType: !688)
!687 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !687, line: 92, size: 128, elements: !689)
!689 = !{!690, !691, !692, !693}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !688, file: !687, line: 93, baseType: !314, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !688, file: !687, line: 93, baseType: !314, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !688, file: !687, line: 94, baseType: !314, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !688, file: !687, line: 94, baseType: !314, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !683, file: !682, line: 41, baseType: !686, size: 128, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !683, file: !682, line: 42, baseType: !696, size: 128, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !687, line: 89, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !687, line: 86, size: 128, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !697, file: !687, line: 87, baseType: !139, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !697, file: !687, line: 87, baseType: !139, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !697, file: !687, line: 88, baseType: !139, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !697, file: !687, line: 88, baseType: !139, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !683, file: !682, line: 42, baseType: !696, size: 128, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !683, file: !682, line: 43, baseType: !696, size: 128, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !683, file: !682, line: 45, baseType: !706, size: 64, offset: 640)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !664)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !683, file: !682, line: 45, baseType: !706, size: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !683, file: !682, line: 46, baseType: !314, size: 32, offset: 768)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !683, file: !682, line: 46, baseType: !314, size: 32, offset: 800)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !683, file: !682, line: 48, baseType: !187, size: 16, offset: 832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !683, file: !682, line: 49, baseType: !187, size: 16, offset: 848)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !683, file: !682, line: 51, baseType: !187, size: 16, offset: 864)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !683, file: !682, line: 52, baseType: !187, size: 16, offset: 880)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !683, file: !682, line: 53, baseType: !187, size: 16, offset: 896)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !683, file: !682, line: 55, baseType: !187, size: 16, offset: 912)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !683, file: !682, line: 56, baseType: !187, size: 16, offset: 928)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !683, file: !682, line: 58, baseType: !187, size: 16, offset: 944)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !683, file: !682, line: 58, baseType: !187, size: 16, offset: 960)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !683, file: !682, line: 59, baseType: !187, size: 16, offset: 976)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !683, file: !682, line: 59, baseType: !187, size: 16, offset: 992)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !683, file: !682, line: 61, baseType: !187, size: 16, offset: 1008)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !683, file: !682, line: 63, baseType: !376, size: 64, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !683, file: !682, line: 64, baseType: !139, size: 32, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !683, file: !682, line: 65, baseType: !139, size: 32, offset: 1120)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !683, file: !682, line: 68, baseType: !726, size: 64, offset: 1152)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !682, line: 68, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !683, file: !682, line: 69, baseType: !232, size: 64, offset: 1216)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !676, file: !247, line: 234, baseType: !696, size: 128, offset: 1408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !676, file: !247, line: 235, baseType: !696, size: 128, offset: 1536)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !676, file: !247, line: 236, baseType: !187, size: 16, offset: 1664)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !676, file: !247, line: 236, baseType: !187, size: 16, offset: 1680)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !676, file: !247, line: 238, baseType: !187, size: 16, offset: 1696)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !676, file: !247, line: 239, baseType: !187, size: 16, offset: 1712)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !676, file: !247, line: 240, baseType: !187, size: 16, offset: 1728)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !676, file: !247, line: 241, baseType: !187, size: 16, offset: 1744)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !676, file: !247, line: 243, baseType: !314, size: 32, offset: 1760)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !676, file: !247, line: 244, baseType: !187, size: 16, offset: 1792)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !676, file: !247, line: 244, baseType: !187, size: 16, offset: 1808)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !676, file: !247, line: 246, baseType: !187, size: 16, offset: 1824)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !676, file: !247, line: 247, baseType: !187, size: 16, offset: 1840)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !676, file: !247, line: 248, baseType: !187, size: 16, offset: 1856)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !676, file: !247, line: 249, baseType: !187, size: 16, offset: 1872)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !676, file: !247, line: 250, baseType: !187, size: 16, offset: 1888)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !676, file: !247, line: 251, baseType: !187, size: 16, offset: 1904)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !247, line: 253, baseType: !747, size: 64, offset: 1920)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !247, line: 42, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !676, file: !247, line: 255, baseType: !196, size: 128, offset: 1984)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !676, file: !247, line: 256, baseType: !196, size: 128, offset: 2112)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !676, file: !247, line: 257, baseType: !196, size: 128, offset: 2240)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !676, file: !247, line: 258, baseType: !196, size: 128, offset: 2368)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !676, file: !247, line: 259, baseType: !196, size: 128, offset: 2496)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !676, file: !247, line: 260, baseType: !196, size: 128, offset: 2624)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !676, file: !247, line: 261, baseType: !196, size: 128, offset: 2752)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !676, file: !247, line: 263, baseType: !232, size: 64, offset: 2880)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !676, file: !247, line: 265, baseType: !758, size: 64, offset: 2944)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !676, file: !247, line: 266, baseType: !138, size: 64, offset: 3008)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !98, line: 925, size: 3200, elements: !762)
!762 = !{!763, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !761, file: !98, line: 926, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !98, line: 91, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !98, line: 85, size: 448, elements: !767)
!767 = !{!768, !770, !771, !772, !773, !774}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !98, line: 86, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !766, file: !98, line: 86, baseType: !769, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !766, file: !98, line: 87, baseType: !196, size: 128, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !766, file: !98, line: 88, baseType: !139, size: 32, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !766, file: !98, line: 89, baseType: !314, size: 32, offset: 288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !766, file: !98, line: 90, baseType: !775, size: 128, offset: 320)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 128, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 8)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !761, file: !98, line: 926, baseType: !764, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !761, file: !98, line: 927, baseType: !196, size: 128, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !761, file: !98, line: 928, baseType: !139, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !761, file: !98, line: 929, baseType: !314, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !761, file: !98, line: 930, baseType: !775, size: 128, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !761, file: !98, line: 932, baseType: !681, size: 1280, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !761, file: !98, line: 934, baseType: !256, size: 64, offset: 1728)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !761, file: !98, line: 934, baseType: !256, size: 64, offset: 1792)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !761, file: !98, line: 935, baseType: !187, size: 16, offset: 1856)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !761, file: !98, line: 935, baseType: !187, size: 16, offset: 1872)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !761, file: !98, line: 936, baseType: !314, size: 32, offset: 1888)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !761, file: !98, line: 936, baseType: !314, size: 32, offset: 1920)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !761, file: !98, line: 938, baseType: !314, size: 32, offset: 1952)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !761, file: !98, line: 938, baseType: !314, size: 32, offset: 1984)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !761, file: !98, line: 939, baseType: !314, size: 32, offset: 2016)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !761, file: !98, line: 940, baseType: !706, size: 64, offset: 2048)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "treepath", scope: !761, file: !98, line: 947, baseType: !196, size: 128, offset: 2112)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !761, file: !98, line: 949, baseType: !465, size: 64, offset: 2240)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "edittree", scope: !761, file: !98, line: 949, baseType: !465, size: 64, offset: 2304)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tree_idname", scope: !761, file: !98, line: 952, baseType: !172, size: 512, offset: 2368)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "treetype", scope: !761, file: !98, line: 953, baseType: !139, size: 32, offset: 2880)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !761, file: !98, line: 954, baseType: !139, size: 32, offset: 2912)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "texfrom", scope: !761, file: !98, line: 956, baseType: !187, size: 16, offset: 2944)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "shaderfrom", scope: !761, file: !98, line: 957, baseType: !187, size: 16, offset: 2960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !761, file: !98, line: 958, baseType: !187, size: 16, offset: 2976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !761, file: !98, line: 959, baseType: !187, size: 16, offset: 2992)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "linkdrag", scope: !761, file: !98, line: 960, baseType: !196, size: 128, offset: 3008)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !761, file: !98, line: 962, baseType: !806, size: 64, offset: 3136)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !292, line: 61, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !76, line: 274, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !76, line: 271, size: 32, elements: !810)
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !809, file: !76, line: 273, baseType: !5, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !500, file: !473, line: 168, baseType: !813, size: 64, offset: 4288)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !673, !465, !491}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !500, file: !473, line: 171, baseType: !817, size: 64, offset: 4352)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !559, !164, !211}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !500, file: !473, line: 173, baseType: !817, size: 64, offset: 4416)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !500, file: !473, line: 176, baseType: !822, size: 64, offset: 4480)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !760, !825, !491, !139, !139}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !827, line: 136, flags: DIFlagFwdDecl)
!827 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!828 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !500, file: !473, line: 179, baseType: !829, size: 64, offset: 4544)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !465, !491, !758, !139}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !500, file: !473, line: 181, baseType: !833, size: 64, offset: 4608)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!139, !491, !139, !139}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !500, file: !473, line: 183, baseType: !833, size: 64, offset: 4672)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !500, file: !473, line: 185, baseType: !833, size: 64, offset: 4736)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !500, file: !473, line: 188, baseType: !488, size: 64, offset: 4800)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !500, file: !473, line: 190, baseType: !840, size: 64, offset: 4864)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !465, !491, !256}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !500, file: !473, line: 193, baseType: !488, size: 64, offset: 4928)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !500, file: !473, line: 195, baseType: !845, size: 64, offset: 4992)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !491}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !500, file: !473, line: 197, baseType: !849, size: 64, offset: 5056)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !465, !491, !491}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !500, file: !473, line: 200, baseType: !853, size: 64, offset: 5120)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !673, !211}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !500, file: !473, line: 201, baseType: !857, size: 64, offset: 5184)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !211}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !500, file: !473, line: 202, baseType: !861, size: 64, offset: 5248)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !211, !491}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !500, file: !473, line: 205, baseType: !865, size: 64, offset: 5312)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!139, !499, !465}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !500, file: !473, line: 207, baseType: !869, size: 64, offset: 5376)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!139, !491, !465}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !500, file: !473, line: 210, baseType: !488, size: 64, offset: 5440)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !500, file: !473, line: 213, baseType: !874, size: 64, offset: 5504)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !473, line: 135, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!138, !878, !491, !808}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !473, line: 62, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !500, file: !473, line: 214, baseType: !881, size: 64, offset: 5568)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !473, line: 136, baseType: !612)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !500, file: !473, line: 215, baseType: !883, size: 64, offset: 5632)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !473, line: 137, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !138, !139, !491, !887, !889, !889}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !473, line: 63, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !500, file: !473, line: 217, baseType: !892, size: 64, offset: 5696)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !473, line: 138, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!139, !896, !491, !887, !898, !898}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !473, line: 64, flags: DIFlagFwdDecl)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !473, line: 66, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !500, file: !473, line: 220, baseType: !587, size: 256, offset: 5760)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !492, file: !76, line: 173, baseType: !172, size: 512, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !492, file: !76, line: 175, baseType: !172, size: 512, offset: 832)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !492, file: !76, line: 176, baseType: !139, size: 32, offset: 1344)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !492, file: !76, line: 177, baseType: !187, size: 16, offset: 1376)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !492, file: !76, line: 177, baseType: !187, size: 16, offset: 1392)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !492, file: !76, line: 178, baseType: !187, size: 16, offset: 1408)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !492, file: !76, line: 178, baseType: !187, size: 16, offset: 1424)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !492, file: !76, line: 179, baseType: !187, size: 16, offset: 1440)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !492, file: !76, line: 179, baseType: !187, size: 16, offset: 1456)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !492, file: !76, line: 180, baseType: !187, size: 16, offset: 1472)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !492, file: !76, line: 181, baseType: !187, size: 16, offset: 1488)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !492, file: !76, line: 182, baseType: !913, size: 96, offset: 1504)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 96, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 3)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !492, file: !76, line: 184, baseType: !196, size: 128, offset: 1600)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !492, file: !76, line: 184, baseType: !196, size: 128, offset: 1728)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !492, file: !76, line: 185, baseType: !491, size: 64, offset: 1856)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !492, file: !76, line: 186, baseType: !256, size: 64, offset: 1920)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !492, file: !76, line: 187, baseType: !138, size: 64, offset: 1984)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !492, file: !76, line: 188, baseType: !491, size: 64, offset: 2048)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !492, file: !76, line: 189, baseType: !196, size: 128, offset: 2112)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !492, file: !76, line: 191, baseType: !314, size: 32, offset: 2240)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !492, file: !76, line: 191, baseType: !314, size: 32, offset: 2272)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !492, file: !76, line: 192, baseType: !314, size: 32, offset: 2304)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !492, file: !76, line: 192, baseType: !314, size: 32, offset: 2336)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !492, file: !76, line: 193, baseType: !314, size: 32, offset: 2368)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !492, file: !76, line: 194, baseType: !314, size: 32, offset: 2400)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !492, file: !76, line: 194, baseType: !314, size: 32, offset: 2432)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !492, file: !76, line: 196, baseType: !139, size: 32, offset: 2464)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !492, file: !76, line: 198, baseType: !172, size: 512, offset: 2496)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !492, file: !76, line: 199, baseType: !187, size: 16, offset: 3008)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !492, file: !76, line: 199, baseType: !187, size: 16, offset: 3024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !492, file: !76, line: 200, baseType: !314, size: 32, offset: 3040)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !492, file: !76, line: 200, baseType: !314, size: 32, offset: 3072)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !492, file: !76, line: 202, baseType: !187, size: 16, offset: 3104)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !492, file: !76, line: 202, baseType: !187, size: 16, offset: 3120)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !492, file: !76, line: 203, baseType: !138, size: 64, offset: 3136)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !492, file: !76, line: 204, baseType: !686, size: 128, offset: 3200)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !492, file: !76, line: 205, baseType: !686, size: 128, offset: 3328)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !492, file: !76, line: 206, baseType: !686, size: 128, offset: 3456)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !492, file: !76, line: 215, baseType: !187, size: 16, offset: 3584)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !492, file: !76, line: 215, baseType: !187, size: 16, offset: 3600)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !492, file: !76, line: 216, baseType: !139, size: 32, offset: 3616)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !492, file: !76, line: 217, baseType: !946, size: 64, offset: 3648)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !76, line: 51, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !472, file: !473, line: 294, baseType: !949, size: 64, offset: 3264)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !290, !138, !952}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeClassCallback", file: !473, line: 282, baseType: !953)
