; ModuleID = 'blender/source/blender/editors/armature/armature_skinning.c'
source_filename = "blender/source/blender/editors/armature/armature_skinning.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.ListBase = type { i8*, i8* }
%struct.wmTimer = type opaque
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque

!81 = !DIEnumerator(name: "eModifierType_Softbody", value: 10, isUnsigned: true)
!82 = !DIEnumerator(name: "eModifierType_Boolean", value: 11, isUnsigned: true)
!83 = !DIEnumerator(name: "eModifierType_Array", value: 12, isUnsigned: true)
!84 = !DIEnumerator(name: "eModifierType_EdgeSplit", value: 13, isUnsigned: true)
!85 = !DIEnumerator(name: "eModifierType_Displace", value: 14, isUnsigned: true)
!86 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!87 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!88 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!89 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!90 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!91 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!92 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!93 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!94 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!95 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!96 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!97 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!98 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!99 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!100 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!101 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!102 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!103 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!104 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!105 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!106 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!107 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!108 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!109 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!110 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!111 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!112 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!113 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!114 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!115 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!116 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!117 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!118 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!119 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!120 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !122, line: 67, baseType: !5, size: 32, elements: !123)
!122 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132}
!124 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!128 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!129 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!130 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!131 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!132 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!133 = !{!134, !135, !536, !578}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !137, line: 133, baseType: !138)
!137 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !137, line: 58, size: 11008, elements: !139)
!139 = !{!140, !211, !214, !226, !229, !232, !236, !243, !252, !348, !354, !361, !369, !380, !393, !406, !417, !426, !438, !446, !448, !451, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !137, line: 59, baseType: !141, size: 960)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !142, line: 130, baseType: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !142, line: 117, size: 960, elements: !144)
!144 = !{!145, !146, !147, !149, !169, !173, !175, !177, !178, !179}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !142, line: 118, baseType: !134, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !142, line: 118, baseType: !134, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !143, file: !142, line: 119, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !143, file: !142, line: 120, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !142, line: 136, size: 17600, elements: !152)
!152 = !{!153, !154, !156, !159, !164, !165, !166}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !142, line: 137, baseType: !141, size: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !151, file: !142, line: 138, baseType: !155, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !151, file: !142, line: 139, baseType: !157, size: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !142, line: 43, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !142, line: 140, baseType: !160, size: 8192, offset: 1088)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 8192, elements: !162)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !{!163}
!163 = !DISubrange(count: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !151, file: !142, line: 141, baseType: !160, size: 8192, offset: 9280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !151, file: !142, line: 148, baseType: !150, size: 64, offset: 17472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !151, file: !142, line: 150, baseType: !167, size: 64, offset: 17536)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !142, line: 45, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !142, line: 121, baseType: !170, size: 528, offset: 256)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 528, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 66)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !142, line: 126, baseType: !174, size: 16, offset: 784)
!174 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !143, file: !142, line: 127, baseType: !176, size: 32, offset: 800)
!176 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !143, file: !142, line: 128, baseType: !176, size: 32, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !143, file: !142, line: 128, baseType: !176, size: 32, offset: 864)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !143, file: !142, line: 129, baseType: !180, size: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !142, line: 75, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !142, line: 62, size: 1024, elements: !183)
!183 = !{!184, !186, !187, !188, !189, !190, !194, !195, !209, !210}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !142, line: 63, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !142, line: 63, baseType: !185, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !142, line: 64, baseType: !161, size: 8, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !182, file: !142, line: 64, baseType: !161, size: 8, offset: 136)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !142, line: 65, baseType: !174, size: 16, offset: 144)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !142, line: 66, baseType: !191, size: 512, offset: 160)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !182, file: !142, line: 67, baseType: !176, size: 32, offset: 672)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !142, line: 69, baseType: !196, size: 256, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !142, line: 60, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !142, line: 48, size: 256, elements: !198)
!198 = !{!199, !200, !207, !208}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !197, file: !142, line: 49, baseType: !134, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !197, file: !142, line: 58, baseType: !201, size: 128, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !202, line: 71, baseType: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !202, line: 69, size: 128, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !203, file: !202, line: 70, baseType: !134, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !203, file: !202, line: 70, baseType: !134, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !197, file: !142, line: 59, baseType: !176, size: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !197, file: !142, line: 59, baseType: !176, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !182, file: !142, line: 70, baseType: !176, size: 32, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !182, file: !142, line: 74, baseType: !176, size: 32, offset: 992)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !138, file: !137, line: 60, baseType: !212, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !137, line: 39, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !138, file: !137, line: 62, baseType: !215, size: 64, offset: 1024)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !58, line: 97, size: 832, elements: !217)
!217 = !{!218, !224, !225}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !216, file: !58, line: 98, baseType: !219, size: 768)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 768, elements: !221)
!220 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!221 = !{!222, !223}
!222 = !DISubrange(count: 8)
!223 = !DISubrange(count: 3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !216, file: !58, line: 99, baseType: !176, size: 32, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !216, file: !58, line: 99, baseType: !176, size: 32, offset: 800)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !138, file: !137, line: 64, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !137, line: 41, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !138, file: !137, line: 65, baseType: !230, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !137, line: 42, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !138, file: !137, line: 66, baseType: !233, size: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !137, line: 53, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !138, file: !137, line: 67, baseType: !237, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !239, line: 154, size: 64, elements: !240)
!239 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !238, file: !239, line: 155, baseType: !176, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !239, line: 156, baseType: !176, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !138, file: !137, line: 71, baseType: !244, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !239, line: 79, size: 96, elements: !246)
!246 = !{!247, !248, !249, !250, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !245, file: !239, line: 81, baseType: !176, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !245, file: !239, line: 82, baseType: !176, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !245, file: !239, line: 83, baseType: !174, size: 16, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !239, line: 84, baseType: !161, size: 8, offset: 80)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !245, file: !239, line: 84, baseType: !161, size: 8, offset: 88)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !138, file: !137, line: 72, baseType: !253, size: 64, offset: 1408)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !239, line: 93, size: 128, elements: !255)
!255 = !{!256, !343, !344, !345, !346, !347}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !254, file: !239, line: 94, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !259, line: 77, size: 15424, elements: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !{!261, !262, !263, !266, !269, !272, !275, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !294, !295, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !324, !325, !326, !332, !333, !337}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !258, file: !259, line: 78, baseType: !141, size: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !259, line: 80, baseType: !160, size: 8192, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !258, file: !259, line: 82, baseType: !264, size: 64, offset: 9152)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !259, line: 43, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !258, file: !259, line: 83, baseType: !267, size: 64, offset: 9216)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !142, line: 46, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !258, file: !259, line: 86, baseType: !270, size: 64, offset: 9280)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !259, line: 41, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !258, file: !259, line: 87, baseType: !273, size: 64, offset: 9344)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !259, line: 44, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !258, file: !259, line: 89, baseType: !276, size: 512, offset: 9408)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 512, elements: !277)
!277 = !{!222}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !258, file: !259, line: 90, baseType: !174, size: 16, offset: 9920)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !258, file: !259, line: 90, baseType: !174, size: 16, offset: 9936)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !258, file: !259, line: 92, baseType: !174, size: 16, offset: 9952)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !258, file: !259, line: 92, baseType: !174, size: 16, offset: 9968)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !258, file: !259, line: 93, baseType: !174, size: 16, offset: 9984)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !259, line: 93, baseType: !174, size: 16, offset: 10000)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !258, file: !259, line: 94, baseType: !176, size: 32, offset: 10016)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !258, file: !259, line: 97, baseType: !174, size: 16, offset: 10048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !258, file: !259, line: 97, baseType: !174, size: 16, offset: 10064)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !258, file: !259, line: 98, baseType: !174, size: 16, offset: 10080)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !258, file: !259, line: 98, baseType: !174, size: 16, offset: 10096)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !258, file: !259, line: 99, baseType: !174, size: 16, offset: 10112)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !258, file: !259, line: 99, baseType: !174, size: 16, offset: 10128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !258, file: !259, line: 100, baseType: !5, size: 32, offset: 10144)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !258, file: !259, line: 101, baseType: !293, size: 64, offset: 10176)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !258, file: !259, line: 103, baseType: !167, size: 64, offset: 10240)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !258, file: !259, line: 104, baseType: !296, size: 64, offset: 10304)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !142, line: 159, size: 448, elements: !298)
!298 = !{!299, !303, !304, !306, !307, !309}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !297, file: !142, line: 161, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !297, file: !142, line: 162, baseType: !300, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !297, file: !142, line: 163, baseType: !305, size: 32, offset: 128)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 32, elements: !301)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !297, file: !142, line: 164, baseType: !305, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !297, file: !142, line: 165, baseType: !308, size: 128, offset: 192)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 128, elements: !301)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !297, file: !142, line: 166, baseType: !310, size: 128, offset: 320)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !301)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !258, file: !259, line: 107, baseType: !220, size: 32, offset: 10368)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !258, file: !259, line: 108, baseType: !176, size: 32, offset: 10400)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !258, file: !259, line: 109, baseType: !174, size: 16, offset: 10432)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !258, file: !259, line: 110, baseType: !174, size: 16, offset: 10448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !258, file: !259, line: 113, baseType: !176, size: 32, offset: 10464)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !258, file: !259, line: 113, baseType: !176, size: 32, offset: 10496)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !258, file: !259, line: 114, baseType: !161, size: 8, offset: 10528)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !258, file: !259, line: 114, baseType: !161, size: 8, offset: 10536)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !258, file: !259, line: 115, baseType: !174, size: 16, offset: 10544)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !258, file: !259, line: 116, baseType: !321, size: 128, offset: 10560)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 128, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 4)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !258, file: !259, line: 119, baseType: !220, size: 32, offset: 10688)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !258, file: !259, line: 119, baseType: !220, size: 32, offset: 10720)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !258, file: !259, line: 122, baseType: !327, size: 512, offset: 10752)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !328, line: 182, baseType: !329)
!328 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !328, line: 180, size: 512, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !328, line: 181, baseType: !191, size: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !258, file: !259, line: 123, baseType: !161, size: 8, offset: 11264)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !258, file: !259, line: 125, baseType: !334, size: 56, offset: 11272)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 56, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 7)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !258, file: !259, line: 126, baseType: !338, size: 4096, offset: 11328)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 4096, elements: !277)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !259, line: 69, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !259, line: 67, size: 512, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !340, file: !259, line: 68, baseType: !191, size: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !254, file: !239, line: 95, baseType: !161, size: 8, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !254, file: !239, line: 95, baseType: !161, size: 8, offset: 72)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !254, file: !239, line: 96, baseType: !174, size: 16, offset: 80)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !254, file: !239, line: 96, baseType: !174, size: 16, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !254, file: !239, line: 96, baseType: !174, size: 16, offset: 112)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !138, file: !137, line: 73, baseType: !349, size: 64, offset: 1472)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !239, line: 88, size: 64, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !350, file: !239, line: 89, baseType: !5, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !350, file: !239, line: 90, baseType: !5, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !138, file: !137, line: 74, baseType: !355, size: 64, offset: 1536)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !239, line: 109, size: 96, elements: !357)
!357 = !{!358, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !356, file: !239, line: 110, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 64, elements: !301)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !356, file: !239, line: 111, baseType: !176, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !138, file: !137, line: 75, baseType: !362, size: 64, offset: 1600)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !239, line: 129, size: 32, elements: !364)
!364 = !{!365, !366, !367, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !363, file: !239, line: 130, baseType: !161, size: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !363, file: !239, line: 130, baseType: !161, size: 8, offset: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !363, file: !239, line: 130, baseType: !161, size: 8, offset: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !363, file: !239, line: 130, baseType: !161, size: 8, offset: 24)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !138, file: !137, line: 80, baseType: !370, size: 64, offset: 1664)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !239, line: 42, size: 160, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !371, file: !239, line: 43, baseType: !5, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !371, file: !239, line: 43, baseType: !5, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !371, file: !239, line: 43, baseType: !5, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !371, file: !239, line: 43, baseType: !5, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !371, file: !239, line: 44, baseType: !174, size: 16, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !371, file: !239, line: 45, baseType: !161, size: 8, offset: 144)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !239, line: 45, baseType: !161, size: 8, offset: 152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !138, file: !137, line: 81, baseType: !381, size: 64, offset: 1728)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !239, line: 160, size: 384, elements: !383)
!383 = !{!384, !387, !388, !389, !390, !391, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !382, file: !239, line: 161, baseType: !385, size: 256)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 256, elements: !386)
!386 = !{!323, !302}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !382, file: !239, line: 162, baseType: !257, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !382, file: !239, line: 163, baseType: !161, size: 8, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !382, file: !239, line: 163, baseType: !161, size: 8, offset: 328)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !382, file: !239, line: 164, baseType: !174, size: 16, offset: 336)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !382, file: !239, line: 164, baseType: !174, size: 16, offset: 352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !382, file: !239, line: 164, baseType: !174, size: 16, offset: 368)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !138, file: !137, line: 82, baseType: !394, size: 64, offset: 1792)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !137, line: 136, size: 512, elements: !396)
!396 = !{!397, !398, !399, !401, !402, !403, !404, !405}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !395, file: !137, line: 137, baseType: !134, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !395, file: !137, line: 138, baseType: !385, size: 256, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !395, file: !137, line: 139, baseType: !400, size: 128, offset: 320)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !322)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !137, line: 140, baseType: !161, size: 8, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !395, file: !137, line: 140, baseType: !161, size: 8, offset: 456)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !395, file: !137, line: 141, baseType: !174, size: 16, offset: 464)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !395, file: !137, line: 141, baseType: !174, size: 16, offset: 480)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !395, file: !137, line: 141, baseType: !174, size: 16, offset: 496)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !138, file: !137, line: 83, baseType: !407, size: 64, offset: 1856)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !239, line: 65, size: 160, elements: !409)
!409 = !{!410, !413, !415, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !408, file: !239, line: 66, baseType: !411, size: 96)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 96, elements: !412)
!412 = !{!223}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !408, file: !239, line: 67, baseType: !414, size: 48, offset: 96)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 48, elements: !412)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !408, file: !239, line: 68, baseType: !161, size: 8, offset: 144)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !408, file: !239, line: 68, baseType: !161, size: 8, offset: 152)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !138, file: !137, line: 84, baseType: !418, size: 64, offset: 1920)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !239, line: 48, size: 96, elements: !420)
!420 = !{!421, !422, !423, !424, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !419, file: !239, line: 49, baseType: !5, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !419, file: !239, line: 49, baseType: !5, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !419, file: !239, line: 50, baseType: !161, size: 8, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !419, file: !239, line: 50, baseType: !161, size: 8, offset: 72)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !239, line: 51, baseType: !174, size: 16, offset: 80)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !138, file: !137, line: 85, baseType: !427, size: 64, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !239, line: 59, size: 128, elements: !429)
!429 = !{!430, !436, !437}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !428, file: !239, line: 60, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !239, line: 54, size: 64, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !432, file: !239, line: 55, baseType: !176, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !432, file: !239, line: 56, baseType: !220, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !428, file: !239, line: 61, baseType: !176, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !239, line: 62, baseType: !176, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !138, file: !137, line: 89, baseType: !439, size: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !239, line: 74, size: 32, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !440, file: !239, line: 75, baseType: !161, size: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !440, file: !239, line: 75, baseType: !161, size: 8, offset: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !440, file: !239, line: 75, baseType: !161, size: 8, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !440, file: !239, line: 75, baseType: !161, size: 8, offset: 24)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !138, file: !137, line: 90, baseType: !447, size: 64, offset: 2112)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !138, file: !137, line: 93, baseType: !449, size: 64, offset: 2176)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !137, line: 93, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !138, file: !137, line: 95, baseType: !452, size: 1600, offset: 2240)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !453, line: 64, size: 1600, elements: !454)
!453 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!454 = !{!455, !470, !474, !475, !476, !477, !480}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !452, file: !453, line: 65, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !453, line: 53, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !453, line: 42, size: 832, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !458, file: !453, line: 43, baseType: !176, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !458, file: !453, line: 44, baseType: !176, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !453, line: 45, baseType: !176, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !458, file: !453, line: 46, baseType: !176, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !458, file: !453, line: 47, baseType: !176, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !458, file: !453, line: 48, baseType: !176, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !458, file: !453, line: 49, baseType: !176, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !458, file: !453, line: 50, baseType: !176, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !453, line: 51, baseType: !191, size: 512, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !458, file: !453, line: 52, baseType: !134, size: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !452, file: !453, line: 66, baseType: !471, size: 1312, offset: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 1312, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 41)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !452, file: !453, line: 69, baseType: !176, size: 32, offset: 1376)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !452, file: !453, line: 69, baseType: !176, size: 32, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !452, file: !453, line: 70, baseType: !176, size: 32, offset: 1440)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !452, file: !453, line: 71, baseType: !478, size: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !453, line: 71, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !452, file: !453, line: 72, baseType: !481, size: 64, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !453, line: 59, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !453, line: 57, size: 8192, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !483, file: !453, line: 58, baseType: !160, size: 8192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !138, file: !137, line: 95, baseType: !452, size: 1600, offset: 3840)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !138, file: !137, line: 95, baseType: !452, size: 1600, offset: 5440)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !138, file: !137, line: 98, baseType: !452, size: 1600, offset: 7040)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !138, file: !137, line: 98, baseType: !452, size: 1600, offset: 8640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !138, file: !137, line: 101, baseType: !176, size: 32, offset: 10240)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !138, file: !137, line: 101, baseType: !176, size: 32, offset: 10272)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !138, file: !137, line: 101, baseType: !176, size: 32, offset: 10304)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !138, file: !137, line: 101, baseType: !176, size: 32, offset: 10336)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !138, file: !137, line: 104, baseType: !176, size: 32, offset: 10368)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !138, file: !137, line: 104, baseType: !176, size: 32, offset: 10400)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !138, file: !137, line: 111, baseType: !176, size: 32, offset: 10432)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !138, file: !137, line: 114, baseType: !411, size: 96, offset: 10464)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !138, file: !137, line: 115, baseType: !411, size: 96, offset: 10560)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !138, file: !137, line: 116, baseType: !411, size: 96, offset: 10656)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !138, file: !137, line: 118, baseType: !176, size: 32, offset: 10752)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !138, file: !137, line: 119, baseType: !174, size: 16, offset: 10784)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !138, file: !137, line: 119, baseType: !174, size: 16, offset: 10800)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !138, file: !137, line: 120, baseType: !220, size: 32, offset: 10816)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !138, file: !137, line: 121, baseType: !176, size: 32, offset: 10848)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !138, file: !137, line: 124, baseType: !161, size: 8, offset: 10880)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !138, file: !137, line: 124, baseType: !161, size: 8, offset: 10888)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !138, file: !137, line: 126, baseType: !161, size: 8, offset: 10896)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !138, file: !137, line: 126, baseType: !161, size: 8, offset: 10904)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !138, file: !137, line: 127, baseType: !161, size: 8, offset: 10912)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !138, file: !137, line: 128, baseType: !161, size: 8, offset: 10920)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !138, file: !137, line: 130, baseType: !174, size: 16, offset: 10928)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !138, file: !137, line: 132, baseType: !513, size: 64, offset: 10944)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !239, line: 233, size: 3584, elements: !515)
!515 = !{!516, !517, !520, !522, !523, !524, !525, !526, !527, !528, !529, !531, !532, !534}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !514, file: !239, line: 234, baseType: !201, size: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !514, file: !239, line: 235, baseType: !518, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !239, line: 69, baseType: !408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !514, file: !239, line: 237, baseType: !521, size: 8, offset: 192)
!521 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !514, file: !239, line: 237, baseType: !521, size: 8, offset: 200)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !514, file: !239, line: 237, baseType: !521, size: 8, offset: 208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !514, file: !239, line: 237, baseType: !521, size: 8, offset: 216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !514, file: !239, line: 237, baseType: !521, size: 8, offset: 224)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !514, file: !239, line: 237, baseType: !521, size: 8, offset: 232)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !514, file: !239, line: 238, baseType: !521, size: 8, offset: 240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !239, line: 238, baseType: !521, size: 8, offset: 248)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !514, file: !239, line: 241, baseType: !530, size: 1600, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !453, line: 73, baseType: !452)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !514, file: !239, line: 242, baseType: !530, size: 1600, offset: 1856)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !514, file: !239, line: 243, baseType: !533, size: 64, offset: 3456)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !514, file: !239, line: 244, baseType: !535, size: 64, offset: 3520)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !32, line: 76, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !32, line: 48, size: 2624, elements: !541)
!541 = !{!542, !544, !545, !546, !547, !548, !549, !550, !551, !552, !555, !556, !557, !558, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !32, line: 49, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !540, file: !32, line: 49, baseType: !543, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !540, file: !32, line: 50, baseType: !180, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !540, file: !32, line: 51, baseType: !543, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !540, file: !32, line: 52, baseType: !201, size: 128, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !32, line: 53, baseType: !191, size: 512, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !540, file: !32, line: 55, baseType: !220, size: 32, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !540, file: !32, line: 56, baseType: !411, size: 96, offset: 928)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !540, file: !32, line: 57, baseType: !411, size: 96, offset: 1024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !540, file: !32, line: 58, baseType: !553, size: 288, offset: 1120)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 288, elements: !554)
!554 = !{!223, !223}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !32, line: 60, baseType: !176, size: 32, offset: 1408)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !540, file: !32, line: 62, baseType: !411, size: 96, offset: 1440)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !540, file: !32, line: 63, baseType: !411, size: 96, offset: 1536)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !540, file: !32, line: 64, baseType: !559, size: 512, offset: 1632)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 512, elements: !560)
!560 = !{!323, !323}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !540, file: !32, line: 65, baseType: !220, size: 32, offset: 2144)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !540, file: !32, line: 67, baseType: !220, size: 32, offset: 2176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !540, file: !32, line: 67, baseType: !220, size: 32, offset: 2208)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !540, file: !32, line: 68, baseType: !220, size: 32, offset: 2240)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !540, file: !32, line: 68, baseType: !220, size: 32, offset: 2272)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !540, file: !32, line: 68, baseType: !220, size: 32, offset: 2304)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !540, file: !32, line: 69, baseType: !220, size: 32, offset: 2336)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !540, file: !32, line: 69, baseType: !220, size: 32, offset: 2368)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !540, file: !32, line: 70, baseType: !220, size: 32, offset: 2400)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !540, file: !32, line: 70, baseType: !220, size: 32, offset: 2432)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !540, file: !32, line: 72, baseType: !411, size: 96, offset: 2464)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !540, file: !32, line: 73, baseType: !176, size: 32, offset: 2560)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !540, file: !32, line: 74, baseType: !174, size: 16, offset: 2592)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !540, file: !32, line: 75, baseType: !575, size: 16, offset: 2608)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 16, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 1)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "bDeformGroup", file: !58, line: 68, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDeformGroup", file: !58, line: 63, size: 704, elements: !583)
!583 = !{!584, !586, !587, !588, !589}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !582, file: !58, line: 64, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !582, file: !58, line: 64, baseType: !585, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !582, file: !58, line: 65, baseType: !191, size: 512, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !582, file: !58, line: 67, baseType: !161, size: 8, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !582, file: !58, line: 67, baseType: !334, size: 56, offset: 648)
!590 = !{i32 7, !"Dwarf Version", i32 4}
!591 = !{i32 2, !"Debug Info Version", i32 3}
!592 = !{i32 1, !"wchar_size", i32 4}
!593 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!594 = distinct !DISubprogram(name: "create_vgroups_from_armature", scope: !1, file: !1, line: 422, type: !595, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1877)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !597, !610, !1874, !1874, !1876, !1094}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !122, line: 112, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !122, line: 106, size: 320, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !599, file: !122, line: 107, baseType: !201, size: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !599, file: !122, line: 108, baseType: !176, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !599, file: !122, line: 109, baseType: !176, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !599, file: !122, line: 110, baseType: !176, size: 32, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !599, file: !122, line: 110, baseType: !176, size: 32, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !599, file: !122, line: 111, baseType: !607, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !609, line: 69, flags: DIFlagFwdDecl)
!609 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !612, line: 1299, baseType: !613)
!612 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !612, line: 1216, size: 39680, elements: !614)
!614 = !{!615, !616, !617, !1196, !1199, !1200, !1201, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1225, !1229, !1232, !1445, !1448, !1748, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1770, !1771, !1772, !1773, !1774, !1782, !1848, !1855, !1856, !1863, !1866, !1867, !1868, !1869, !1870, !1871}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !613, file: !612, line: 1217, baseType: !141, size: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !613, file: !612, line: 1218, baseType: !212, size: 64, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !613, file: !612, line: 1220, baseType: !618, size: 64, offset: 1024)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !58, line: 115, size: 11392, elements: !620)
!620 = !{!621, !622, !623, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !653, !654, !695, !696, !699, !700, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !798, !799, !800, !801, !802, !803, !804, !805, !806, !809, !812, !815, !816, !817, !818, !819, !822, !825, !1143, !1144, !1150, !1151, !1152, !1153, !1154, !1155, !1157, !1160, !1163, !1164, !1184, !1185}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !619, file: !58, line: 116, baseType: !141, size: 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !619, file: !58, line: 117, baseType: !212, size: 64, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !619, file: !58, line: 119, baseType: !624, size: 64, offset: 1024)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !58, line: 57, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !58, line: 121, baseType: !174, size: 16, offset: 1088)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !619, file: !58, line: 121, baseType: !174, size: 16, offset: 1104)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !619, file: !58, line: 122, baseType: !176, size: 32, offset: 1120)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !619, file: !58, line: 122, baseType: !176, size: 32, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !619, file: !58, line: 122, baseType: !176, size: 32, offset: 1184)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !619, file: !58, line: 123, baseType: !191, size: 512, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !619, file: !58, line: 124, baseType: !618, size: 64, offset: 1728)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !619, file: !58, line: 124, baseType: !618, size: 64, offset: 1792)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !619, file: !58, line: 127, baseType: !618, size: 64, offset: 1856)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !619, file: !58, line: 127, baseType: !618, size: 64, offset: 1920)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !619, file: !58, line: 127, baseType: !618, size: 64, offset: 1984)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !619, file: !58, line: 128, baseType: !227, size: 64, offset: 2048)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !619, file: !58, line: 130, baseType: !215, size: 64, offset: 2112)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !619, file: !58, line: 131, baseType: !640, size: 64, offset: 2176)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !642, line: 486, size: 1600, elements: !643)
!642 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !641, file: !642, line: 487, baseType: !141, size: 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !641, file: !642, line: 489, baseType: !201, size: 128, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !641, file: !642, line: 490, baseType: !201, size: 128, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !641, file: !642, line: 491, baseType: !201, size: 128, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !641, file: !642, line: 492, baseType: !201, size: 128, offset: 1344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !641, file: !642, line: 494, baseType: !176, size: 32, offset: 1472)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !641, file: !642, line: 495, baseType: !176, size: 32, offset: 1504)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !641, file: !642, line: 497, baseType: !176, size: 32, offset: 1536)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !641, file: !642, line: 498, baseType: !176, size: 32, offset: 1568)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !619, file: !58, line: 132, baseType: !640, size: 64, offset: 2240)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !619, file: !58, line: 133, baseType: !655, size: 64, offset: 2304)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !642, line: 334, size: 1728, elements: !657)
!657 = !{!658, !659, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !694}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !656, file: !642, line: 335, baseType: !201, size: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !656, file: !642, line: 336, baseType: !660, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !642, line: 47, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !642, line: 338, baseType: !174, size: 16, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !656, file: !642, line: 338, baseType: !174, size: 16, offset: 208)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !656, file: !642, line: 339, baseType: !5, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !656, file: !642, line: 340, baseType: !176, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !656, file: !642, line: 342, baseType: !220, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !656, file: !642, line: 343, baseType: !411, size: 96, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !656, file: !642, line: 344, baseType: !411, size: 96, offset: 416)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !656, file: !642, line: 347, baseType: !201, size: 128, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !656, file: !642, line: 349, baseType: !176, size: 32, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !656, file: !642, line: 350, baseType: !176, size: 32, offset: 672)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !656, file: !642, line: 351, baseType: !134, size: 64, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !656, file: !642, line: 352, baseType: !134, size: 64, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !656, file: !642, line: 354, baseType: !675, size: 384, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !642, line: 116, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !642, line: 94, size: 384, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !676, file: !642, line: 96, baseType: !176, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !676, file: !642, line: 96, baseType: !176, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !676, file: !642, line: 97, baseType: !176, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !676, file: !642, line: 97, baseType: !176, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !676, file: !642, line: 99, baseType: !174, size: 16, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !676, file: !642, line: 100, baseType: !174, size: 16, offset: 144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !676, file: !642, line: 102, baseType: !174, size: 16, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !676, file: !642, line: 105, baseType: !174, size: 16, offset: 176)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !676, file: !642, line: 108, baseType: !174, size: 16, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !676, file: !642, line: 109, baseType: !174, size: 16, offset: 208)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !676, file: !642, line: 111, baseType: !174, size: 16, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !676, file: !642, line: 112, baseType: !174, size: 16, offset: 240)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !676, file: !642, line: 114, baseType: !176, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !676, file: !642, line: 114, baseType: !176, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !676, file: !642, line: 115, baseType: !176, size: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !676, file: !642, line: 115, baseType: !176, size: 32, offset: 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !656, file: !642, line: 355, baseType: !191, size: 512, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !619, file: !58, line: 134, baseType: !134, size: 64, offset: 2368)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !619, file: !58, line: 136, baseType: !697, size: 64, offset: 2432)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !58, line: 58, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !619, file: !58, line: 138, baseType: !675, size: 384, offset: 2496)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !619, file: !58, line: 139, baseType: !701, size: 64, offset: 2880)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !642, line: 80, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !642, line: 72, size: 192, elements: !704)
!704 = !{!705, !712, !713, !714, !715}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !703, file: !642, line: 73, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !642, line: 59, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !642, line: 56, size: 128, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !708, file: !642, line: 57, baseType: !411, size: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !708, file: !642, line: 58, baseType: !176, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !703, file: !642, line: 74, baseType: !176, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !703, file: !642, line: 76, baseType: !176, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !703, file: !642, line: 77, baseType: !176, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !703, file: !642, line: 79, baseType: !176, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !619, file: !58, line: 141, baseType: !201, size: 128, offset: 2944)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !619, file: !58, line: 142, baseType: !201, size: 128, offset: 3072)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !619, file: !58, line: 143, baseType: !201, size: 128, offset: 3200)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !619, file: !58, line: 144, baseType: !201, size: 128, offset: 3328)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !619, file: !58, line: 146, baseType: !176, size: 32, offset: 3456)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !619, file: !58, line: 147, baseType: !176, size: 32, offset: 3488)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !619, file: !58, line: 150, baseType: !233, size: 64, offset: 3520)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !619, file: !58, line: 151, baseType: !535, size: 64, offset: 3584)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !619, file: !58, line: 152, baseType: !176, size: 32, offset: 3648)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !619, file: !58, line: 153, baseType: !176, size: 32, offset: 3680)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !619, file: !58, line: 156, baseType: !411, size: 96, offset: 3712)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !619, file: !58, line: 156, baseType: !411, size: 96, offset: 3808)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !619, file: !58, line: 156, baseType: !411, size: 96, offset: 3904)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !58, line: 157, baseType: !411, size: 96, offset: 4000)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !619, file: !58, line: 158, baseType: !411, size: 96, offset: 4096)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !619, file: !58, line: 159, baseType: !411, size: 96, offset: 4192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !619, file: !58, line: 160, baseType: !411, size: 96, offset: 4288)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !619, file: !58, line: 160, baseType: !411, size: 96, offset: 4384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !619, file: !58, line: 161, baseType: !321, size: 128, offset: 4480)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !619, file: !58, line: 161, baseType: !321, size: 128, offset: 4608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !619, file: !58, line: 162, baseType: !411, size: 96, offset: 4736)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !619, file: !58, line: 162, baseType: !411, size: 96, offset: 4832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !619, file: !58, line: 163, baseType: !220, size: 32, offset: 4928)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !619, file: !58, line: 163, baseType: !220, size: 32, offset: 4960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !619, file: !58, line: 164, baseType: !559, size: 512, offset: 4992)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !619, file: !58, line: 165, baseType: !559, size: 512, offset: 5504)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !619, file: !58, line: 166, baseType: !559, size: 512, offset: 6016)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !619, file: !58, line: 167, baseType: !559, size: 512, offset: 6528)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !619, file: !58, line: 176, baseType: !559, size: 512, offset: 7040)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !619, file: !58, line: 178, baseType: !5, size: 32, offset: 7552)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !58, line: 180, baseType: !174, size: 16, offset: 7584)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !619, file: !58, line: 181, baseType: !174, size: 16, offset: 7600)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !619, file: !58, line: 183, baseType: !174, size: 16, offset: 7616)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !619, file: !58, line: 183, baseType: !174, size: 16, offset: 7632)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !619, file: !58, line: 184, baseType: !174, size: 16, offset: 7648)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !619, file: !58, line: 184, baseType: !174, size: 16, offset: 7664)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !619, file: !58, line: 185, baseType: !174, size: 16, offset: 7680)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !619, file: !58, line: 186, baseType: !174, size: 16, offset: 7696)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !619, file: !58, line: 187, baseType: !174, size: 16, offset: 7712)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !619, file: !58, line: 188, baseType: !161, size: 8, offset: 7728)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !619, file: !58, line: 189, baseType: !161, size: 8, offset: 7736)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !619, file: !58, line: 192, baseType: !176, size: 32, offset: 7744)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !619, file: !58, line: 192, baseType: !176, size: 32, offset: 7776)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !619, file: !58, line: 192, baseType: !176, size: 32, offset: 7808)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !619, file: !58, line: 192, baseType: !176, size: 32, offset: 7840)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !619, file: !58, line: 194, baseType: !176, size: 32, offset: 7872)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !619, file: !58, line: 202, baseType: !220, size: 32, offset: 7904)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !619, file: !58, line: 202, baseType: !220, size: 32, offset: 7936)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !619, file: !58, line: 202, baseType: !220, size: 32, offset: 7968)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !619, file: !58, line: 211, baseType: !220, size: 32, offset: 8000)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !619, file: !58, line: 212, baseType: !220, size: 32, offset: 8032)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !619, file: !58, line: 213, baseType: !220, size: 32, offset: 8064)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !619, file: !58, line: 214, baseType: !220, size: 32, offset: 8096)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !619, file: !58, line: 215, baseType: !220, size: 32, offset: 8128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !619, file: !58, line: 216, baseType: !220, size: 32, offset: 8160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !619, file: !58, line: 219, baseType: !220, size: 32, offset: 8192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !619, file: !58, line: 220, baseType: !220, size: 32, offset: 8224)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !619, file: !58, line: 221, baseType: !220, size: 32, offset: 8256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !619, file: !58, line: 224, baseType: !775, size: 16, offset: 8288)
!775 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !619, file: !58, line: 224, baseType: !775, size: 16, offset: 8304)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !619, file: !58, line: 226, baseType: !174, size: 16, offset: 8320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !619, file: !58, line: 228, baseType: !161, size: 8, offset: 8336)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !619, file: !58, line: 229, baseType: !161, size: 8, offset: 8344)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !619, file: !58, line: 231, baseType: !174, size: 16, offset: 8352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !619, file: !58, line: 232, baseType: !161, size: 8, offset: 8368)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !619, file: !58, line: 233, baseType: !161, size: 8, offset: 8376)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !619, file: !58, line: 234, baseType: !220, size: 32, offset: 8384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !619, file: !58, line: 235, baseType: !220, size: 32, offset: 8416)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !619, file: !58, line: 237, baseType: !201, size: 128, offset: 8448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !619, file: !58, line: 238, baseType: !201, size: 128, offset: 8576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !619, file: !58, line: 239, baseType: !201, size: 128, offset: 8704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !619, file: !58, line: 240, baseType: !201, size: 128, offset: 8832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !619, file: !58, line: 242, baseType: !220, size: 32, offset: 8960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !619, file: !58, line: 244, baseType: !174, size: 16, offset: 8992)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !619, file: !58, line: 245, baseType: !775, size: 16, offset: 9008)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !619, file: !58, line: 246, baseType: !321, size: 128, offset: 9024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !619, file: !58, line: 248, baseType: !176, size: 32, offset: 9152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !619, file: !58, line: 249, baseType: !176, size: 32, offset: 9184)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !619, file: !58, line: 251, baseType: !796, size: 64, offset: 9216)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !58, line: 251, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !619, file: !58, line: 253, baseType: !161, size: 8, offset: 9280)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !619, file: !58, line: 254, baseType: !161, size: 8, offset: 9288)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !619, file: !58, line: 255, baseType: !174, size: 16, offset: 9296)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !619, file: !58, line: 256, baseType: !411, size: 96, offset: 9312)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !619, file: !58, line: 258, baseType: !201, size: 128, offset: 9408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !619, file: !58, line: 259, baseType: !201, size: 128, offset: 9536)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !619, file: !58, line: 260, baseType: !201, size: 128, offset: 9664)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !619, file: !58, line: 261, baseType: !201, size: 128, offset: 9792)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !619, file: !58, line: 263, baseType: !807, size: 64, offset: 9920)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !58, line: 52, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !619, file: !58, line: 264, baseType: !810, size: 64, offset: 9984)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !58, line: 53, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !619, file: !58, line: 265, baseType: !813, size: 64, offset: 10048)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !642, line: 46, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !619, file: !58, line: 267, baseType: !161, size: 8, offset: 10112)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !619, file: !58, line: 268, baseType: !161, size: 8, offset: 10120)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !619, file: !58, line: 269, baseType: !174, size: 16, offset: 10128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !619, file: !58, line: 270, baseType: !220, size: 32, offset: 10144)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !619, file: !58, line: 272, baseType: !820, size: 64, offset: 10176)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !58, line: 54, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !619, file: !58, line: 275, baseType: !823, size: 64, offset: 10240)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !58, line: 275, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !619, file: !58, line: 277, baseType: !826, size: 64, offset: 10304)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !847, !850, !852, !853, !855, !856, !857, !858, !864, !869, !870, !874, !875, !876, !877, !878, !882, !886, !890, !894, !898, !902, !906, !910, !914, !918, !922, !926, !930, !931, !932, !933, !934, !935, !939, !940, !941, !942, !946, !947, !948, !949, !950, !955, !956, !957, !958, !959, !963, !964, !965, !966, !967, !974, !985, !990, !996, !1006, !1011, !1022, !1029, !1036, !1040, !1045, !1049, !1054, !1055, !1056, !1063, !1069, !1070, !1071, !1075, !1076, !1085, !1100, !1104, !1112, !1116, !1120, !1124, !1132, !1142}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !827, file: !4, line: 180, baseType: !530, size: 1600)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !827, file: !4, line: 180, baseType: !530, size: 1600, offset: 1600)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !827, file: !4, line: 180, baseType: !530, size: 1600, offset: 3200)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !827, file: !4, line: 180, baseType: !530, size: 1600, offset: 4800)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !827, file: !4, line: 180, baseType: !530, size: 1600, offset: 6400)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !827, file: !4, line: 181, baseType: !176, size: 32, offset: 8000)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !827, file: !4, line: 181, baseType: !176, size: 32, offset: 8032)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !827, file: !4, line: 181, baseType: !176, size: 32, offset: 8064)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !827, file: !4, line: 181, baseType: !176, size: 32, offset: 8096)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !827, file: !4, line: 181, baseType: !176, size: 32, offset: 8128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !827, file: !4, line: 182, baseType: !176, size: 32, offset: 8160)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !827, file: !4, line: 183, baseType: !176, size: 32, offset: 8192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !827, file: !4, line: 184, baseType: !842, size: 64, offset: 8256)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !843, line: 124, baseType: !844)
!843 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !846, line: 118, flags: DIFlagFwdDecl)
!846 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!847 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !827, file: !4, line: 185, baseType: !848, size: 64, offset: 8320)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !827, file: !4, line: 186, baseType: !851, size: 32, offset: 8384)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !827, file: !4, line: 187, baseType: !220, size: 32, offset: 8416)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !827, file: !4, line: 188, baseType: !854, size: 32, offset: 8448)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !827, file: !4, line: 189, baseType: !176, size: 32, offset: 8480)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !827, file: !4, line: 190, baseType: !233, size: 64, offset: 8512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !827, file: !4, line: 193, baseType: !161, size: 8, offset: 8576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !827, file: !4, line: 196, baseType: !859, size: 64, offset: 8640)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !827)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !827, file: !4, line: 199, baseType: !865, size: 64, offset: 8704)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !862, !868}
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !827, file: !4, line: 202, baseType: !859, size: 64, offset: 8768)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !827, file: !4, line: 207, baseType: !871, size: 64, offset: 8832)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!176, !862}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !827, file: !4, line: 208, baseType: !871, size: 64, offset: 8896)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !827, file: !4, line: 209, baseType: !871, size: 64, offset: 8960)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !827, file: !4, line: 210, baseType: !871, size: 64, offset: 9024)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !827, file: !4, line: 211, baseType: !871, size: 64, offset: 9088)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !827, file: !4, line: 218, baseType: !879, size: 64, offset: 9152)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !862, !176, !407}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !827, file: !4, line: 219, baseType: !883, size: 64, offset: 9216)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !862, !176, !418}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !827, file: !4, line: 220, baseType: !887, size: 64, offset: 9280)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !862, !176, !370}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !827, file: !4, line: 227, baseType: !891, size: 64, offset: 9344)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!407, !862}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !827, file: !4, line: 228, baseType: !895, size: 64, offset: 9408)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!418, !862}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !827, file: !4, line: 229, baseType: !899, size: 64, offset: 9472)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!370, !862}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !827, file: !4, line: 230, baseType: !903, size: 64, offset: 9536)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!349, !862}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !827, file: !4, line: 231, baseType: !907, size: 64, offset: 9600)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!244, !862}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !827, file: !4, line: 236, baseType: !911, size: 64, offset: 9664)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !862, !407}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !827, file: !4, line: 237, baseType: !915, size: 64, offset: 9728)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !862, !418}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !827, file: !4, line: 238, baseType: !919, size: 64, offset: 9792)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !862, !370}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !827, file: !4, line: 239, baseType: !923, size: 64, offset: 9856)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !862, !349}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !827, file: !4, line: 240, baseType: !927, size: 64, offset: 9920)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !862, !244}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !827, file: !4, line: 245, baseType: !891, size: 64, offset: 9984)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !827, file: !4, line: 246, baseType: !895, size: 64, offset: 10048)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !827, file: !4, line: 247, baseType: !899, size: 64, offset: 10112)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !827, file: !4, line: 248, baseType: !903, size: 64, offset: 10176)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !827, file: !4, line: 249, baseType: !907, size: 64, offset: 10240)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !827, file: !4, line: 255, baseType: !936, size: 64, offset: 10304)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!134, !862, !176, !176}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !827, file: !4, line: 256, baseType: !936, size: 64, offset: 10368)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !827, file: !4, line: 257, baseType: !936, size: 64, offset: 10432)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !827, file: !4, line: 258, baseType: !936, size: 64, offset: 10496)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !827, file: !4, line: 264, baseType: !943, size: 64, offset: 10560)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!134, !862, !176}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !827, file: !4, line: 265, baseType: !943, size: 64, offset: 10624)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !827, file: !4, line: 266, baseType: !943, size: 64, offset: 10688)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !827, file: !4, line: 267, baseType: !943, size: 64, offset: 10752)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !827, file: !4, line: 268, baseType: !943, size: 64, offset: 10816)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !827, file: !4, line: 272, baseType: !951, size: 64, offset: 10880)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!954, !862}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !827, file: !4, line: 273, baseType: !951, size: 64, offset: 10944)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !827, file: !4, line: 274, baseType: !951, size: 64, offset: 11008)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !827, file: !4, line: 275, baseType: !951, size: 64, offset: 11072)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !827, file: !4, line: 276, baseType: !951, size: 64, offset: 11136)
