; ModuleID = 'blender/source/blender/modifiers/intern/MOD_uvwarp.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_uvwarp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !28, line: 152, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 76, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!63 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!104 = !{!105, !155}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVWarpModifierData", file: !107, line: 1270, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UVWarpModifierData", file: !107, line: 1256, size: 3200, elements: !109)
!109 = !{!110, !133, !134, !135, !139, !144, !980, !981, !982, !983, !984}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !108, file: !107, line: 1257, baseType: !111, size: 896)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !107, line: 110, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !107, line: 99, size: 896, elements: !113)
!113 = !{!114, !116, !117, !119, !120, !121, !122, !127, !131}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !107, line: 100, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !112, file: !107, line: 100, baseType: !115, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !107, line: 102, baseType: !118, size: 32, offset: 128)
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !112, file: !107, line: 102, baseType: !118, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !112, file: !107, line: 103, baseType: !118, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !112, file: !107, line: 103, baseType: !118, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !107, line: 104, baseType: !123, size: 512, offset: 256)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 512, elements: !125)
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !{!126}
!126 = !DISubrange(count: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !112, file: !107, line: 107, baseType: !128, size: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !130, line: 40, flags: DIFlagFwdDecl)
!130 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!131 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !112, file: !107, line: 109, baseType: !132, size: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "axis_u", scope: !108, file: !107, line: 1259, baseType: !124, size: 8, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "axis_v", scope: !108, file: !107, line: 1259, baseType: !124, size: 8, offset: 904)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !108, file: !107, line: 1260, baseType: !136, size: 48, offset: 912)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 48, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 6)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !108, file: !107, line: 1261, baseType: !140, size: 64, offset: 960)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !142)
!141 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!142 = !{!143}
!143 = !DISubrange(count: 2)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "object_src", scope: !108, file: !107, line: 1263, baseType: !145, size: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !147, line: 115, size: 11392, elements: !148)
!147 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!148 = !{!149, !216, !220, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !237, !248, !262, !263, !306, !307, !310, !311, !327, !328, !329, !330, !331, !332, !333, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !352, !353, !354, !355, !356, !357, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !417, !418, !419, !420, !421, !422, !423, !424, !425, !428, !431, !434, !435, !436, !437, !438, !441, !444, !928, !929, !935, !936, !937, !938, !939, !940, !942, !945, !948, !949, !968, !969}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !146, file: !147, line: 116, baseType: !150, size: 960)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !151, line: 130, baseType: !152)
!151 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !151, line: 117, size: 960, elements: !153)
!153 = !{!154, !156, !157, !159, !178, !182, !184, !185, !186, !187}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !151, line: 118, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !151, line: 118, baseType: !155, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !152, file: !151, line: 119, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !152, file: !151, line: 120, baseType: !160, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !151, line: 136, size: 17600, elements: !162)
!162 = !{!163, !164, !166, !169, !173, !174, !175}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !161, file: !151, line: 137, baseType: !150, size: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !161, file: !151, line: 138, baseType: !165, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !161, file: !151, line: 139, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !151, line: 43, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !151, line: 140, baseType: !170, size: 8192, offset: 1088)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 8192, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !161, file: !151, line: 141, baseType: !170, size: 8192, offset: 9280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !161, file: !151, line: 148, baseType: !160, size: 64, offset: 17472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !161, file: !151, line: 150, baseType: !176, size: 64, offset: 17536)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !151, line: 45, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !151, line: 121, baseType: !179, size: 528, offset: 256)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 528, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 66)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !151, line: 126, baseType: !183, size: 16, offset: 784)
!183 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !152, file: !151, line: 127, baseType: !118, size: 32, offset: 800)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !152, file: !151, line: 128, baseType: !118, size: 32, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !152, file: !151, line: 128, baseType: !118, size: 32, offset: 864)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !152, file: !151, line: 129, baseType: !188, size: 64, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !151, line: 75, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !151, line: 62, size: 1024, elements: !191)
!191 = !{!192, !194, !195, !196, !197, !198, !199, !200, !214, !215}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !151, line: 63, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !151, line: 63, baseType: !193, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !151, line: 64, baseType: !124, size: 8, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !190, file: !151, line: 64, baseType: !124, size: 8, offset: 136)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !151, line: 65, baseType: !183, size: 16, offset: 144)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !151, line: 66, baseType: !123, size: 512, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !190, file: !151, line: 67, baseType: !118, size: 32, offset: 672)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !151, line: 69, baseType: !201, size: 256, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !151, line: 60, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !151, line: 48, size: 256, elements: !203)
!203 = !{!204, !205, !212, !213}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !202, file: !151, line: 49, baseType: !155, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !202, file: !151, line: 58, baseType: !206, size: 128, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !207, line: 71, baseType: !208)
!207 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !207, line: 69, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !208, file: !207, line: 70, baseType: !155, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !208, file: !207, line: 70, baseType: !155, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !202, file: !151, line: 59, baseType: !118, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !202, file: !151, line: 59, baseType: !118, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !190, file: !151, line: 70, baseType: !118, size: 32, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !190, file: !151, line: 74, baseType: !118, size: 32, offset: 992)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !146, file: !147, line: 117, baseType: !217, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !219, line: 45, flags: DIFlagFwdDecl)
!219 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !146, file: !147, line: 119, baseType: !221, size: 64, offset: 1024)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !147, line: 57, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !147, line: 121, baseType: !183, size: 16, offset: 1088)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !146, file: !147, line: 121, baseType: !183, size: 16, offset: 1104)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !146, file: !147, line: 122, baseType: !118, size: 32, offset: 1120)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !146, file: !147, line: 122, baseType: !118, size: 32, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !146, file: !147, line: 122, baseType: !118, size: 32, offset: 1184)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !146, file: !147, line: 123, baseType: !123, size: 512, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !146, file: !147, line: 124, baseType: !145, size: 64, offset: 1728)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !146, file: !147, line: 124, baseType: !145, size: 64, offset: 1792)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !146, file: !147, line: 127, baseType: !145, size: 64, offset: 1856)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !146, file: !147, line: 127, baseType: !145, size: 64, offset: 1920)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !146, file: !147, line: 127, baseType: !145, size: 64, offset: 1984)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !146, file: !147, line: 128, baseType: !235, size: 64, offset: 2048)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !219, line: 46, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !146, file: !147, line: 130, baseType: !238, size: 64, offset: 2112)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !147, line: 97, size: 832, elements: !240)
!240 = !{!241, !246, !247}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !239, file: !147, line: 98, baseType: !242, size: 768)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 768, elements: !243)
!243 = !{!244, !245}
!244 = !DISubrange(count: 8)
!245 = !DISubrange(count: 3)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !147, line: 99, baseType: !118, size: 32, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !239, file: !147, line: 99, baseType: !118, size: 32, offset: 800)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !146, file: !147, line: 131, baseType: !249, size: 64, offset: 2176)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !251, line: 486, size: 1600, elements: !252)
!251 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !250, file: !251, line: 487, baseType: !150, size: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !250, file: !251, line: 489, baseType: !206, size: 128, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !250, file: !251, line: 490, baseType: !206, size: 128, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !250, file: !251, line: 491, baseType: !206, size: 128, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !250, file: !251, line: 492, baseType: !206, size: 128, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !250, file: !251, line: 494, baseType: !118, size: 32, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !250, file: !251, line: 495, baseType: !118, size: 32, offset: 1504)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !250, file: !251, line: 497, baseType: !118, size: 32, offset: 1536)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !250, file: !251, line: 498, baseType: !118, size: 32, offset: 1568)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !146, file: !147, line: 132, baseType: !249, size: 64, offset: 2240)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !146, file: !147, line: 133, baseType: !264, size: 64, offset: 2304)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !251, line: 334, size: 1728, elements: !266)
!266 = !{!267, !268, !271, !272, !273, !274, !275, !276, !279, !280, !281, !282, !283, !284, !285, !305}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !265, file: !251, line: 335, baseType: !206, size: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !265, file: !251, line: 336, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !251, line: 47, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !251, line: 338, baseType: !183, size: 16, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !265, file: !251, line: 338, baseType: !183, size: 16, offset: 208)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !265, file: !251, line: 339, baseType: !7, size: 32, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !265, file: !251, line: 340, baseType: !118, size: 32, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !265, file: !251, line: 342, baseType: !141, size: 32, offset: 288)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !265, file: !251, line: 343, baseType: !277, size: 96, offset: 320)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 96, elements: !278)
!278 = !{!245}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !265, file: !251, line: 344, baseType: !277, size: 96, offset: 416)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !265, file: !251, line: 347, baseType: !206, size: 128, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !265, file: !251, line: 349, baseType: !118, size: 32, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !265, file: !251, line: 350, baseType: !118, size: 32, offset: 672)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !265, file: !251, line: 351, baseType: !155, size: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !265, file: !251, line: 352, baseType: !155, size: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !265, file: !251, line: 354, baseType: !286, size: 384, offset: 832)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !251, line: 116, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !251, line: 94, size: 384, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !287, file: !251, line: 96, baseType: !118, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !287, file: !251, line: 96, baseType: !118, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !287, file: !251, line: 97, baseType: !118, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !287, file: !251, line: 97, baseType: !118, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !287, file: !251, line: 99, baseType: !183, size: 16, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !287, file: !251, line: 100, baseType: !183, size: 16, offset: 144)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !287, file: !251, line: 102, baseType: !183, size: 16, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !287, file: !251, line: 105, baseType: !183, size: 16, offset: 176)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !287, file: !251, line: 108, baseType: !183, size: 16, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !287, file: !251, line: 109, baseType: !183, size: 16, offset: 208)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !287, file: !251, line: 111, baseType: !183, size: 16, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !287, file: !251, line: 112, baseType: !183, size: 16, offset: 240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !287, file: !251, line: 114, baseType: !118, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !287, file: !251, line: 114, baseType: !118, size: 32, offset: 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !287, file: !251, line: 115, baseType: !118, size: 32, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !287, file: !251, line: 115, baseType: !118, size: 32, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !265, file: !251, line: 355, baseType: !123, size: 512, offset: 1216)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 134, baseType: !155, size: 64, offset: 2368)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !146, file: !147, line: 136, baseType: !308, size: 64, offset: 2432)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !147, line: 58, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !146, file: !147, line: 138, baseType: !286, size: 384, offset: 2496)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !146, file: !147, line: 139, baseType: !312, size: 64, offset: 2880)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !251, line: 80, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !251, line: 72, size: 192, elements: !315)
!315 = !{!316, !323, !324, !325, !326}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !314, file: !251, line: 73, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !251, line: 59, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !251, line: 56, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !319, file: !251, line: 57, baseType: !277, size: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !319, file: !251, line: 58, baseType: !118, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !314, file: !251, line: 74, baseType: !118, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !314, file: !251, line: 76, baseType: !118, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !314, file: !251, line: 77, baseType: !118, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !314, file: !251, line: 79, baseType: !118, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !146, file: !147, line: 141, baseType: !206, size: 128, offset: 2944)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !146, file: !147, line: 142, baseType: !206, size: 128, offset: 3072)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !146, file: !147, line: 143, baseType: !206, size: 128, offset: 3200)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !146, file: !147, line: 144, baseType: !206, size: 128, offset: 3328)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !146, file: !147, line: 146, baseType: !118, size: 32, offset: 3456)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !146, file: !147, line: 147, baseType: !118, size: 32, offset: 3488)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !146, file: !147, line: 150, baseType: !334, size: 64, offset: 3520)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !147, line: 50, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !146, file: !147, line: 151, baseType: !132, size: 64, offset: 3584)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !146, file: !147, line: 152, baseType: !118, size: 32, offset: 3648)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !146, file: !147, line: 153, baseType: !118, size: 32, offset: 3680)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !146, file: !147, line: 156, baseType: !277, size: 96, offset: 3712)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !146, file: !147, line: 156, baseType: !277, size: 96, offset: 3808)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !146, file: !147, line: 156, baseType: !277, size: 96, offset: 3904)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !147, line: 157, baseType: !277, size: 96, offset: 4000)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !146, file: !147, line: 158, baseType: !277, size: 96, offset: 4096)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !146, file: !147, line: 159, baseType: !277, size: 96, offset: 4192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !146, file: !147, line: 160, baseType: !277, size: 96, offset: 4288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !146, file: !147, line: 160, baseType: !277, size: 96, offset: 4384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !146, file: !147, line: 161, baseType: !349, size: 128, offset: 4480)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 4)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !146, file: !147, line: 161, baseType: !349, size: 128, offset: 4608)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !146, file: !147, line: 162, baseType: !277, size: 96, offset: 4736)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !146, file: !147, line: 162, baseType: !277, size: 96, offset: 4832)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !146, file: !147, line: 163, baseType: !141, size: 32, offset: 4928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !146, file: !147, line: 163, baseType: !141, size: 32, offset: 4960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !146, file: !147, line: 164, baseType: !358, size: 512, offset: 4992)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 512, elements: !359)
!359 = !{!351, !351}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !146, file: !147, line: 165, baseType: !358, size: 512, offset: 5504)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !146, file: !147, line: 166, baseType: !358, size: 512, offset: 6016)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !146, file: !147, line: 167, baseType: !358, size: 512, offset: 6528)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !146, file: !147, line: 176, baseType: !358, size: 512, offset: 7040)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !146, file: !147, line: 178, baseType: !7, size: 32, offset: 7552)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !147, line: 180, baseType: !183, size: 16, offset: 7584)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !146, file: !147, line: 181, baseType: !183, size: 16, offset: 7600)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !146, file: !147, line: 183, baseType: !183, size: 16, offset: 7616)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !146, file: !147, line: 183, baseType: !183, size: 16, offset: 7632)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !146, file: !147, line: 184, baseType: !183, size: 16, offset: 7648)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !146, file: !147, line: 184, baseType: !183, size: 16, offset: 7664)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !146, file: !147, line: 185, baseType: !183, size: 16, offset: 7680)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !146, file: !147, line: 186, baseType: !183, size: 16, offset: 7696)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !146, file: !147, line: 187, baseType: !183, size: 16, offset: 7712)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !146, file: !147, line: 188, baseType: !124, size: 8, offset: 7728)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !146, file: !147, line: 189, baseType: !124, size: 8, offset: 7736)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !146, file: !147, line: 192, baseType: !118, size: 32, offset: 7744)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !146, file: !147, line: 192, baseType: !118, size: 32, offset: 7776)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !146, file: !147, line: 192, baseType: !118, size: 32, offset: 7808)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !146, file: !147, line: 192, baseType: !118, size: 32, offset: 7840)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !146, file: !147, line: 194, baseType: !118, size: 32, offset: 7872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !146, file: !147, line: 202, baseType: !141, size: 32, offset: 7904)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !146, file: !147, line: 202, baseType: !141, size: 32, offset: 7936)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !146, file: !147, line: 202, baseType: !141, size: 32, offset: 7968)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !146, file: !147, line: 211, baseType: !141, size: 32, offset: 8000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !146, file: !147, line: 212, baseType: !141, size: 32, offset: 8032)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !146, file: !147, line: 213, baseType: !141, size: 32, offset: 8064)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !146, file: !147, line: 214, baseType: !141, size: 32, offset: 8096)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !146, file: !147, line: 215, baseType: !141, size: 32, offset: 8128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !146, file: !147, line: 216, baseType: !141, size: 32, offset: 8160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !146, file: !147, line: 219, baseType: !141, size: 32, offset: 8192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !146, file: !147, line: 220, baseType: !141, size: 32, offset: 8224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !146, file: !147, line: 221, baseType: !141, size: 32, offset: 8256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !146, file: !147, line: 224, baseType: !394, size: 16, offset: 8288)
!394 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !146, file: !147, line: 224, baseType: !394, size: 16, offset: 8304)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !146, file: !147, line: 226, baseType: !183, size: 16, offset: 8320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !146, file: !147, line: 228, baseType: !124, size: 8, offset: 8336)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !146, file: !147, line: 229, baseType: !124, size: 8, offset: 8344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !146, file: !147, line: 231, baseType: !183, size: 16, offset: 8352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !146, file: !147, line: 232, baseType: !124, size: 8, offset: 8368)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !146, file: !147, line: 233, baseType: !124, size: 8, offset: 8376)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !146, file: !147, line: 234, baseType: !141, size: 32, offset: 8384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !146, file: !147, line: 235, baseType: !141, size: 32, offset: 8416)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !146, file: !147, line: 237, baseType: !206, size: 128, offset: 8448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !146, file: !147, line: 238, baseType: !206, size: 128, offset: 8576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !146, file: !147, line: 239, baseType: !206, size: 128, offset: 8704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !146, file: !147, line: 240, baseType: !206, size: 128, offset: 8832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !146, file: !147, line: 242, baseType: !141, size: 32, offset: 8960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !146, file: !147, line: 244, baseType: !183, size: 16, offset: 8992)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !146, file: !147, line: 245, baseType: !394, size: 16, offset: 9008)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !146, file: !147, line: 246, baseType: !349, size: 128, offset: 9024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !146, file: !147, line: 248, baseType: !118, size: 32, offset: 9152)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !146, file: !147, line: 249, baseType: !118, size: 32, offset: 9184)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !146, file: !147, line: 251, baseType: !415, size: 64, offset: 9216)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !147, line: 251, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !146, file: !147, line: 253, baseType: !124, size: 8, offset: 9280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !146, file: !147, line: 254, baseType: !124, size: 8, offset: 9288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !146, file: !147, line: 255, baseType: !183, size: 16, offset: 9296)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !146, file: !147, line: 256, baseType: !277, size: 96, offset: 9312)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !146, file: !147, line: 258, baseType: !206, size: 128, offset: 9408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !146, file: !147, line: 259, baseType: !206, size: 128, offset: 9536)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !146, file: !147, line: 260, baseType: !206, size: 128, offset: 9664)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !146, file: !147, line: 261, baseType: !206, size: 128, offset: 9792)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !146, file: !147, line: 263, baseType: !426, size: 64, offset: 9920)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !147, line: 52, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !146, file: !147, line: 264, baseType: !429, size: 64, offset: 9984)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !147, line: 53, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !146, file: !147, line: 265, baseType: !432, size: 64, offset: 10048)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !251, line: 46, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !146, file: !147, line: 267, baseType: !124, size: 8, offset: 10112)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !146, file: !147, line: 268, baseType: !124, size: 8, offset: 10120)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !146, file: !147, line: 269, baseType: !183, size: 16, offset: 10128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !146, file: !147, line: 270, baseType: !141, size: 32, offset: 10144)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !146, file: !147, line: 272, baseType: !439, size: 64, offset: 10176)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !147, line: 54, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !146, file: !147, line: 275, baseType: !442, size: 64, offset: 10240)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !147, line: 275, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !146, file: !147, line: 277, baseType: !445, size: 64, offset: 10304)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !447)
!447 = !{!448, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !499, !502, !504, !505, !507, !508, !509, !510, !516, !521, !522, !526, !527, !528, !529, !530, !543, !555, !569, !573, !577, !581, !590, !602, !606, !610, !614, !618, !622, !623, !624, !625, !626, !627, !631, !632, !633, !634, !638, !639, !640, !641, !642, !647, !648, !649, !650, !651, !655, !656, !657, !658, !659, !666, !677, !682, !688, !698, !704, !715, !722, !729, !733, !738, !742, !747, !748, !749, !756, !762, !763, !764, !769, !770, !779, !885, !889, !897, !901, !905, !909, !917, !927}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !446, file: !28, line: 180, baseType: !449, size: 1600)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !61, line: 73, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !61, line: 64, size: 1600, elements: !451)
!451 = !{!452, !467, !471, !472, !473, !474, !477}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !450, file: !61, line: 65, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !61, line: 53, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !61, line: 42, size: 832, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !61, line: 43, baseType: !118, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !455, file: !61, line: 44, baseType: !118, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !455, file: !61, line: 45, baseType: !118, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !455, file: !61, line: 46, baseType: !118, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !455, file: !61, line: 47, baseType: !118, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !455, file: !61, line: 48, baseType: !118, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !455, file: !61, line: 49, baseType: !118, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !455, file: !61, line: 50, baseType: !118, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !61, line: 51, baseType: !123, size: 512, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !455, file: !61, line: 52, baseType: !155, size: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !450, file: !61, line: 66, baseType: !468, size: 1312, offset: 64)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 1312, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 41)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !450, file: !61, line: 69, baseType: !118, size: 32, offset: 1376)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !450, file: !61, line: 69, baseType: !118, size: 32, offset: 1408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !450, file: !61, line: 70, baseType: !118, size: 32, offset: 1440)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !450, file: !61, line: 71, baseType: !475, size: 64, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !61, line: 71, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !450, file: !61, line: 72, baseType: !478, size: 64, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !61, line: 59, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !61, line: 57, size: 8192, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !480, file: !61, line: 58, baseType: !170, size: 8192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !446, file: !28, line: 180, baseType: !449, size: 1600, offset: 1600)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !446, file: !28, line: 180, baseType: !449, size: 1600, offset: 3200)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !446, file: !28, line: 180, baseType: !449, size: 1600, offset: 4800)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !446, file: !28, line: 180, baseType: !449, size: 1600, offset: 6400)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !446, file: !28, line: 181, baseType: !118, size: 32, offset: 8000)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !446, file: !28, line: 181, baseType: !118, size: 32, offset: 8032)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !446, file: !28, line: 181, baseType: !118, size: 32, offset: 8064)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !446, file: !28, line: 181, baseType: !118, size: 32, offset: 8096)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !446, file: !28, line: 181, baseType: !118, size: 32, offset: 8128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !446, file: !28, line: 182, baseType: !118, size: 32, offset: 8160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !446, file: !28, line: 183, baseType: !118, size: 32, offset: 8192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !446, file: !28, line: 184, baseType: !495, size: 64, offset: 8256)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !496, line: 124, baseType: !497)
!496 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !496, line: 124, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !446, file: !28, line: 185, baseType: !500, size: 64, offset: 8320)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !28, line: 186, baseType: !503, size: 32, offset: 8384)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !446, file: !28, line: 187, baseType: !141, size: 32, offset: 8416)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !446, file: !28, line: 188, baseType: !506, size: 32, offset: 8448)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !446, file: !28, line: 189, baseType: !118, size: 32, offset: 8480)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !446, file: !28, line: 190, baseType: !334, size: 64, offset: 8512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !446, file: !28, line: 193, baseType: !124, size: 8, offset: 8576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !446, file: !28, line: 196, baseType: !511, size: 64, offset: 8640)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !446)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !446, file: !28, line: 199, baseType: !517, size: 64, offset: 8704)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !514, !520}
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !446, file: !28, line: 202, baseType: !511, size: 64, offset: 8768)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !446, file: !28, line: 207, baseType: !523, size: 64, offset: 8832)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!118, !514}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !446, file: !28, line: 208, baseType: !523, size: 64, offset: 8896)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !446, file: !28, line: 209, baseType: !523, size: 64, offset: 8960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !446, file: !28, line: 210, baseType: !523, size: 64, offset: 9024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !446, file: !28, line: 211, baseType: !523, size: 64, offset: 9088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !446, file: !28, line: 218, baseType: !531, size: 64, offset: 9152)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !514, !118, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !536, line: 65, size: 160, elements: !537)
!536 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !{!538, !539, !541, !542}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !535, file: !536, line: 66, baseType: !277, size: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !535, file: !536, line: 67, baseType: !540, size: 48, offset: 96)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 48, elements: !278)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !535, file: !536, line: 68, baseType: !124, size: 8, offset: 144)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !535, file: !536, line: 68, baseType: !124, size: 8, offset: 152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !446, file: !28, line: 219, baseType: !544, size: 64, offset: 9216)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !514, !118, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !536, line: 48, size: 96, elements: !549)
!549 = !{!550, !551, !552, !553, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !548, file: !536, line: 49, baseType: !7, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !548, file: !536, line: 49, baseType: !7, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !548, file: !536, line: 50, baseType: !124, size: 8, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !548, file: !536, line: 50, baseType: !124, size: 8, offset: 72)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !548, file: !536, line: 51, baseType: !183, size: 16, offset: 80)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !446, file: !28, line: 220, baseType: !556, size: 64, offset: 9280)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !514, !118, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !536, line: 42, size: 160, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !560, file: !536, line: 43, baseType: !7, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !560, file: !536, line: 43, baseType: !7, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !560, file: !536, line: 43, baseType: !7, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !560, file: !536, line: 43, baseType: !7, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !560, file: !536, line: 44, baseType: !183, size: 16, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !560, file: !536, line: 45, baseType: !124, size: 8, offset: 144)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !536, line: 45, baseType: !124, size: 8, offset: 152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !446, file: !28, line: 227, baseType: !570, size: 64, offset: 9344)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!534, !514}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !446, file: !28, line: 228, baseType: !574, size: 64, offset: 9408)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!547, !514}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !446, file: !28, line: 229, baseType: !578, size: 64, offset: 9472)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!559, !514}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !446, file: !28, line: 230, baseType: !582, size: 64, offset: 9536)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !514}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !536, line: 88, size: 64, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !586, file: !536, line: 89, baseType: !7, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !586, file: !536, line: 90, baseType: !7, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !446, file: !28, line: 231, baseType: !591, size: 64, offset: 9600)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !514}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !536, line: 79, size: 96, elements: !596)
!596 = !{!597, !598, !599, !600, !601}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !595, file: !536, line: 81, baseType: !118, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !595, file: !536, line: 82, baseType: !118, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !595, file: !536, line: 83, baseType: !183, size: 16, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !536, line: 84, baseType: !124, size: 8, offset: 80)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !595, file: !536, line: 84, baseType: !124, size: 8, offset: 88)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !446, file: !28, line: 236, baseType: !603, size: 64, offset: 9664)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !514, !534}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !446, file: !28, line: 237, baseType: !607, size: 64, offset: 9728)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !514, !547}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !446, file: !28, line: 238, baseType: !611, size: 64, offset: 9792)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !514, !559}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !446, file: !28, line: 239, baseType: !615, size: 64, offset: 9856)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !514, !585}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !446, file: !28, line: 240, baseType: !619, size: 64, offset: 9920)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !514, !594}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !446, file: !28, line: 245, baseType: !570, size: 64, offset: 9984)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !446, file: !28, line: 246, baseType: !574, size: 64, offset: 10048)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !446, file: !28, line: 247, baseType: !578, size: 64, offset: 10112)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !446, file: !28, line: 248, baseType: !582, size: 64, offset: 10176)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !446, file: !28, line: 249, baseType: !591, size: 64, offset: 10240)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !446, file: !28, line: 255, baseType: !628, size: 64, offset: 10304)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!155, !514, !118, !118}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !446, file: !28, line: 256, baseType: !628, size: 64, offset: 10368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !446, file: !28, line: 257, baseType: !628, size: 64, offset: 10432)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !446, file: !28, line: 258, baseType: !628, size: 64, offset: 10496)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !446, file: !28, line: 264, baseType: !635, size: 64, offset: 10560)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!155, !514, !118}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !446, file: !28, line: 265, baseType: !635, size: 64, offset: 10624)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !446, file: !28, line: 266, baseType: !635, size: 64, offset: 10688)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !446, file: !28, line: 267, baseType: !635, size: 64, offset: 10752)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !446, file: !28, line: 268, baseType: !635, size: 64, offset: 10816)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !446, file: !28, line: 272, baseType: !643, size: 64, offset: 10880)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!646, !514}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !446, file: !28, line: 273, baseType: !643, size: 64, offset: 10944)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !446, file: !28, line: 274, baseType: !643, size: 64, offset: 11008)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !446, file: !28, line: 275, baseType: !643, size: 64, offset: 11072)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !446, file: !28, line: 276, baseType: !643, size: 64, offset: 11136)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !446, file: !28, line: 279, baseType: !652, size: 64, offset: 11200)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !514, !118, !646, !118}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !446, file: !28, line: 280, baseType: !652, size: 64, offset: 11264)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !446, file: !28, line: 281, baseType: !652, size: 64, offset: 11328)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !446, file: !28, line: 284, baseType: !523, size: 64, offset: 11392)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !446, file: !28, line: 285, baseType: !523, size: 64, offset: 11456)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !446, file: !28, line: 286, baseType: !660, size: 64, offset: 11520)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!663, !514}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !446, file: !28, line: 287, baseType: !667, size: 64, offset: 11584)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!670, !514}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !673)
!673 = !{!674, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !672, file: !28, line: 118, baseType: !675, size: 128)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, elements: !350)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !672, file: !28, line: 119, baseType: !675, size: 128, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !446, file: !28, line: 288, baseType: !678, size: 64, offset: 11648)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !514}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !446, file: !28, line: 289, baseType: !683, size: 64, offset: 11712)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !514, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !446, file: !28, line: 290, baseType: !689, size: 64, offset: 11776)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !514}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !694, file: !28, line: 124, baseType: !183, size: 16)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !28, line: 125, baseType: !124, size: 8, offset: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !446, file: !28, line: 291, baseType: !699, size: 64, offset: 11840)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!702, !514}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !446, file: !28, line: 299, baseType: !705, size: 64, offset: 11904)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !514, !708, !155, !714}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !155, !118, !711, !711, !712}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !446, file: !28, line: 309, baseType: !716, size: 64, offset: 11968)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !514, !719, !155}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !155, !118, !711, !711}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !446, file: !28, line: 317, baseType: !723, size: 64, offset: 12032)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !514, !726, !155, !714}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !155, !118, !118, !711, !711}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !446, file: !28, line: 327, baseType: !730, size: 64, offset: 12096)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !514, !719, !155, !714}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !446, file: !28, line: 337, baseType: !734, size: 64, offset: 12160)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !514, !737, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !446, file: !28, line: 344, baseType: !739, size: 64, offset: 12224)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !514, !118, !737}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !446, file: !28, line: 347, baseType: !743, size: 64, offset: 12288)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !514, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !446, file: !28, line: 350, baseType: !739, size: 64, offset: 12352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !446, file: !28, line: 351, baseType: !739, size: 64, offset: 12416)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !446, file: !28, line: 355, baseType: !750, size: 64, offset: 12480)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!753, !145, !514}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !446, file: !28, line: 359, baseType: !757, size: 64, offset: 12544)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!760, !145, !514}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !446, file: !28, line: 364, baseType: !511, size: 64, offset: 12608)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !446, file: !28, line: 367, baseType: !511, size: 64, offset: 12672)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !446, file: !28, line: 373, baseType: !765, size: 64, offset: 12736)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !514, !768, !768}
!768 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !446, file: !28, line: 376, baseType: !511, size: 64, offset: 12800)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !446, file: !28, line: 385, baseType: !771, size: 64, offset: 12864)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !514, !774, !768, !775}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!118, !118, !155}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !446, file: !28, line: 391, baseType: !780, size: 64, offset: 12928)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !514, !783, !880, !155, !884}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !788, !879, !118}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !536, line: 160, size: 384, elements: !790)
!790 = !{!791, !794, !874, !875, !876, !877, !878}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !789, file: !536, line: 161, baseType: !792, size: 256)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 256, elements: !793)
!793 = !{!351, !143}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !789, file: !536, line: 162, baseType: !795, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !130, line: 77, size: 15424, elements: !797)
!797 = !{!798, !799, !800, !803, !806, !809, !812, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !863, !864, !868}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !796, file: !130, line: 78, baseType: !150, size: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !130, line: 80, baseType: !170, size: 8192, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !796, file: !130, line: 82, baseType: !801, size: 64, offset: 9152)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !130, line: 43, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !796, file: !130, line: 83, baseType: !804, size: 64, offset: 9216)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !151, line: 46, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !796, file: !130, line: 86, baseType: !807, size: 64, offset: 9280)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !130, line: 41, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !796, file: !130, line: 87, baseType: !810, size: 64, offset: 9344)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !130, line: 44, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !796, file: !130, line: 89, baseType: !813, size: 512, offset: 9408)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 512, elements: !814)
!814 = !{!244}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !796, file: !130, line: 90, baseType: !183, size: 16, offset: 9920)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !796, file: !130, line: 90, baseType: !183, size: 16, offset: 9936)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !796, file: !130, line: 92, baseType: !183, size: 16, offset: 9952)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !796, file: !130, line: 92, baseType: !183, size: 16, offset: 9968)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !796, file: !130, line: 93, baseType: !183, size: 16, offset: 9984)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !796, file: !130, line: 93, baseType: !183, size: 16, offset: 10000)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !796, file: !130, line: 94, baseType: !118, size: 32, offset: 10016)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !796, file: !130, line: 97, baseType: !183, size: 16, offset: 10048)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !796, file: !130, line: 97, baseType: !183, size: 16, offset: 10064)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !796, file: !130, line: 98, baseType: !183, size: 16, offset: 10080)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !796, file: !130, line: 98, baseType: !183, size: 16, offset: 10096)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !796, file: !130, line: 99, baseType: !183, size: 16, offset: 10112)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !796, file: !130, line: 99, baseType: !183, size: 16, offset: 10128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !796, file: !130, line: 100, baseType: !7, size: 32, offset: 10144)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !796, file: !130, line: 101, baseType: !703, size: 64, offset: 10176)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !796, file: !130, line: 103, baseType: !176, size: 64, offset: 10240)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !796, file: !130, line: 104, baseType: !832, size: 64, offset: 10304)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !151, line: 159, size: 448, elements: !834)
!834 = !{!835, !837, !838, !840, !841, !843}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !833, file: !151, line: 161, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !142)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !833, file: !151, line: 162, baseType: !836, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !833, file: !151, line: 163, baseType: !839, size: 32, offset: 128)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 32, elements: !142)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !833, file: !151, line: 164, baseType: !839, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !833, file: !151, line: 165, baseType: !842, size: 128, offset: 192)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 128, elements: !142)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !833, file: !151, line: 166, baseType: !844, size: 128, offset: 320)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 128, elements: !142)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !796, file: !130, line: 107, baseType: !141, size: 32, offset: 10368)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !796, file: !130, line: 108, baseType: !118, size: 32, offset: 10400)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !796, file: !130, line: 109, baseType: !183, size: 16, offset: 10432)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !796, file: !130, line: 110, baseType: !183, size: 16, offset: 10448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !796, file: !130, line: 113, baseType: !118, size: 32, offset: 10464)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !796, file: !130, line: 113, baseType: !118, size: 32, offset: 10496)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !796, file: !130, line: 114, baseType: !124, size: 8, offset: 10528)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !796, file: !130, line: 114, baseType: !124, size: 8, offset: 10536)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !796, file: !130, line: 115, baseType: !183, size: 16, offset: 10544)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !796, file: !130, line: 116, baseType: !349, size: 128, offset: 10560)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !796, file: !130, line: 119, baseType: !141, size: 32, offset: 10688)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !796, file: !130, line: 119, baseType: !141, size: 32, offset: 10720)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !796, file: !130, line: 122, baseType: !858, size: 512, offset: 10752)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !859, line: 182, baseType: !860)
!859 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !859, line: 180, size: 512, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !860, file: !859, line: 181, baseType: !123, size: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !796, file: !130, line: 123, baseType: !124, size: 8, offset: 11264)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !796, file: !130, line: 125, baseType: !865, size: 56, offset: 11272)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 56, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 7)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !796, file: !130, line: 126, baseType: !869, size: 4096, offset: 11328)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 4096, elements: !814)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !130, line: 69, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !130, line: 67, size: 512, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !871, file: !130, line: 68, baseType: !123, size: 512)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !789, file: !536, line: 163, baseType: !124, size: 8, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !789, file: !536, line: 163, baseType: !124, size: 8, offset: 328)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !789, file: !536, line: 164, baseType: !183, size: 16, offset: 336)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !789, file: !536, line: 164, baseType: !183, size: 16, offset: 352)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !789, file: !536, line: 164, baseType: !183, size: 16, offset: 368)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!118, !155, !118, !118}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !446, file: !28, line: 400, baseType: !886, size: 64, offset: 12992)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !514, !775}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !446, file: !28, line: 415, baseType: !890, size: 64, offset: 13056)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !514, !893, !775, !880, !155, !884}
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!787, !155, !118}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !446, file: !28, line: 425, baseType: !898, size: 64, offset: 13120)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !514, !893, !880, !155, !884}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !446, file: !28, line: 435, baseType: !902, size: 64, offset: 13184)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !514, !775, !893, !155}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !446, file: !28, line: 444, baseType: !906, size: 64, offset: 13248)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !514, !893, !155}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !446, file: !28, line: 455, baseType: !910, size: 64, offset: 13312)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !514, !893, !913, !155}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !155, !118, !141}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !446, file: !28, line: 464, baseType: !918, size: 64, offset: 13376)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !514, !921, !924, !155}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !155, !118, !155}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!768, !155, !118}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !446, file: !28, line: 470, baseType: !511, size: 64, offset: 13440)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !146, file: !147, line: 277, baseType: !445, size: 64, offset: 10368)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !146, file: !147, line: 278, baseType: !930, size: 64, offset: 10432)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !931, line: 27, baseType: !932)
!931 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !933, line: 45, baseType: !934)
!933 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!934 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !146, file: !147, line: 279, baseType: !930, size: 64, offset: 10496)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !146, file: !147, line: 280, baseType: !7, size: 32, offset: 10560)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !146, file: !147, line: 281, baseType: !7, size: 32, offset: 10592)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !146, file: !147, line: 283, baseType: !206, size: 128, offset: 10624)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !146, file: !147, line: 284, baseType: !206, size: 128, offset: 10752)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !146, file: !147, line: 285, baseType: !941, size: 64, offset: 10880)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !146, file: !147, line: 287, baseType: !943, size: 64, offset: 10944)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !147, line: 59, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !146, file: !147, line: 288, baseType: !946, size: 64, offset: 11008)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !147, line: 288, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !146, file: !147, line: 290, baseType: !140, size: 64, offset: 11072)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !146, file: !147, line: 291, baseType: !950, size: 64, offset: 11136)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !130, line: 65, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !130, line: 50, size: 320, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !952, file: !130, line: 51, baseType: !128, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !952, file: !130, line: 53, baseType: !118, size: 32, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !952, file: !130, line: 54, baseType: !118, size: 32, offset: 96)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !952, file: !130, line: 55, baseType: !118, size: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !952, file: !130, line: 55, baseType: !118, size: 32, offset: 160)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !952, file: !130, line: 56, baseType: !124, size: 8, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !952, file: !130, line: 56, baseType: !124, size: 8, offset: 200)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !952, file: !130, line: 57, baseType: !124, size: 8, offset: 208)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !952, file: !130, line: 57, baseType: !124, size: 8, offset: 216)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !952, file: !130, line: 59, baseType: !183, size: 16, offset: 224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !952, file: !130, line: 59, baseType: !183, size: 16, offset: 240)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !952, file: !130, line: 59, baseType: !183, size: 16, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !952, file: !130, line: 61, baseType: !183, size: 16, offset: 272)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !952, file: !130, line: 63, baseType: !118, size: 32, offset: 288)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !146, file: !147, line: 293, baseType: !206, size: 128, offset: 11200)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !146, file: !147, line: 294, baseType: !970, size: 64, offset: 11328)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !147, line: 113, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !147, line: 108, size: 256, elements: !973)
!973 = !{!974, !976, !977, !978, !979}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !972, file: !147, line: 109, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !972, file: !147, line: 109, baseType: !975, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !972, file: !147, line: 110, baseType: !145, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !147, line: 111, baseType: !118, size: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !972, file: !147, line: 112, baseType: !141, size: 32, offset: 224)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "bone_src", scope: !108, file: !107, line: 1264, baseType: !123, size: 512, offset: 1088)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "object_dst", scope: !108, file: !107, line: 1265, baseType: !145, size: 64, offset: 1600)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "bone_dst", scope: !108, file: !107, line: 1266, baseType: !123, size: 512, offset: 1664)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_name", scope: !108, file: !107, line: 1268, baseType: !123, size: 512, offset: 2176)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "uvlayer_name", scope: !108, file: !107, line: 1269, baseType: !123, size: 512, offset: 2688)
!985 = !{!0}
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !988)
!988 = !{!989, !993, !994, !995, !997, !999, !1003, !1008, !1015, !1021, !1025, !1029, !1033, !1037, !1043, !1044, !1048, !1100, !1104, !1105, !1114, !1123}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !987, file: !6, line: 123, baseType: !990, size: 256)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 256, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !987, file: !6, line: 128, baseType: !990, size: 256, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !987, file: !6, line: 131, baseType: !118, size: 32, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !987, file: !6, line: 133, baseType: !996, size: 32, offset: 544)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !6, line: 134, baseType: !998, size: 32, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !987, file: !6, line: 142, baseType: !1000, size: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !115, !115}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !987, file: !6, line: 151, baseType: !1004, size: 64, offset: 704)
