; ModuleID = 'blender/source/blender/modifiers/intern/MOD_skin.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_skin.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!161 = !{!162, !163, !164, !165}
!162 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!163 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!164 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!165 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!166 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !160, line: 260, baseType: !7, size: 32, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174}
!168 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!171 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!172 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!173 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!174 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !176, line: 57, baseType: !7, size: 32, elements: !177)
!176 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!178 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!179 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!180 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!181 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!182 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!183 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!184 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!185 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!186 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!187 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!188 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!189 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!190 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!191 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 1203, baseType: !7, size: 32, elements: !194)
!193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !{!195}
!195 = !DIEnumerator(name: "MOD_SKIN_SMOOTH_SHADING", value: 1, isUnsigned: true)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 200, baseType: !7, size: 32, elements: !197)
!197 = !{!198}
!198 = !DIEnumerator(name: "BMO_FLAG_RESPECT_HIDE", value: 1, isUnsigned: true)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !200, line: 35, baseType: !7, size: 32, elements: !201)
!200 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!201 = !{!202, !203, !204, !205}
!202 = !DIEnumerator(name: "SUBD_INNERVERT", value: 0, isUnsigned: true)
!203 = !DIEnumerator(name: "SUBD_PATH", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "SUBD_FAN", value: 2, isUnsigned: true)
!205 = !DIEnumerator(name: "SUBD_STRAIGHT_CUT", value: 3, isUnsigned: true)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierMode", file: !193, line: 88, baseType: !207, size: 32, elements: !208)
!207 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216}
!209 = !DIEnumerator(name: "eModifierMode_Realtime", value: 1)
!210 = !DIEnumerator(name: "eModifierMode_Render", value: 2)
!211 = !DIEnumerator(name: "eModifierMode_Editmode", value: 4)
!212 = !DIEnumerator(name: "eModifierMode_OnCage", value: 8)
!213 = !DIEnumerator(name: "eModifierMode_Expanded", value: 16)
!214 = !DIEnumerator(name: "eModifierMode_Virtual", value: 32)
!215 = !DIEnumerator(name: "eModifierMode_ApplyOnSpline", value: 64)
!216 = !DIEnumerator(name: "eModifierMode_DisableTemporary", value: -2147483648)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 1196, baseType: !7, size: 32, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIEnumerator(name: "MOD_SKIN_SYMM_X", value: 1, isUnsigned: true)
!220 = !DIEnumerator(name: "MOD_SKIN_SYMM_Y", value: 2, isUnsigned: true)
!221 = !DIEnumerator(name: "MOD_SKIN_SYMM_Z", value: 4, isUnsigned: true)
!222 = !{!223, !250, !207, !257, !260, !261, !262, !266, !270, !333, !335, !317, !337, !340, !248}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "SkinModifierData", file: !193, line: 1193, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SkinModifierData", file: !193, line: 1183, size: 960, elements: !226)
!226 = !{!227, !249, !251, !252, !253}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !225, file: !193, line: 1184, baseType: !228, size: 896)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !193, line: 110, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !193, line: 99, size: 896, elements: !230)
!230 = !{!231, !233, !234, !235, !236, !237, !238, !243, !247}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !193, line: 100, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !229, file: !193, line: 100, baseType: !232, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !193, line: 102, baseType: !207, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !229, file: !193, line: 102, baseType: !207, size: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !229, file: !193, line: 103, baseType: !207, size: 32, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !229, file: !193, line: 103, baseType: !207, size: 32, offset: 224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !193, line: 104, baseType: !239, size: 512, offset: 256)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 512, elements: !241)
!240 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!241 = !{!242}
!242 = !DISubrange(count: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !229, file: !193, line: 107, baseType: !244, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !246, line: 40, flags: DIFlagFwdDecl)
!246 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !229, file: !193, line: 109, baseType: !248, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "branch_smoothing", scope: !225, file: !193, line: 1186, baseType: !250, size: 32, offset: 896)
!250 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !193, line: 1188, baseType: !240, size: 8, offset: 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_axes", scope: !225, file: !193, line: 1190, baseType: !240, size: 8, offset: 936)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !225, file: !193, line: 1192, baseType: !254, size: 16, offset: 944)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 16, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 2)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !259, line: 33, baseType: !7)
!259 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !176, line: 79, baseType: !175)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !176, line: 158, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !260}
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !176, line: 159, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!260, !260}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !160, line: 103, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !160, line: 90, size: 448, elements: !273)
!273 = !{!274, !283, !289, !293, !294}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !272, file: !160, line: 91, baseType: !275, size: 128)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !160, line: 82, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !160, line: 64, size: 128, elements: !277)
!277 = !{!278, !279, !280, !281, !282}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !160, line: 65, baseType: !260, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !276, file: !160, line: 66, baseType: !207, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !276, file: !160, line: 73, baseType: !240, size: 8, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !276, file: !160, line: 74, baseType: !240, size: 8, offset: 104)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !276, file: !160, line: 80, baseType: !240, size: 8, offset: 112)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !272, file: !160, line: 92, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !160, line: 180, size: 16, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !285, file: !160, line: 181, baseType: !288, size: 16)
!288 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !272, file: !160, line: 94, baseType: !290, size: 96, offset: 192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 96, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 3)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !272, file: !160, line: 95, baseType: !290, size: 96, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !272, file: !160, line: 102, baseType: !295, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !160, line: 110, size: 640, elements: !297)
!297 = !{!298, !299, !300, !302, !303, !326, !332}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !296, file: !160, line: 111, baseType: !275, size: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !296, file: !160, line: 112, baseType: !284, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !296, file: !160, line: 114, baseType: !301, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !296, file: !160, line: 114, baseType: !301, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !296, file: !160, line: 118, baseType: !304, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !160, line: 125, size: 576, elements: !306)
!306 = !{!307, !308, !309, !310, !322, !323, !324, !325}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !305, file: !160, line: 126, baseType: !275, size: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !305, file: !160, line: 129, baseType: !301, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !305, file: !160, line: 130, baseType: !295, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !305, file: !160, line: 131, baseType: !311, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !160, line: 164, size: 448, elements: !313)
!313 = !{!314, !315, !316, !319, !320, !321}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !312, file: !160, line: 165, baseType: !275, size: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !312, file: !160, line: 166, baseType: !284, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !312, file: !160, line: 172, baseType: !317, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !160, line: 140, baseType: !305)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !312, file: !160, line: 174, baseType: !207, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !312, file: !160, line: 175, baseType: !290, size: 96, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !312, file: !160, line: 176, baseType: !288, size: 16, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !305, file: !160, line: 135, baseType: !304, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !305, file: !160, line: 135, baseType: !304, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !160, line: 139, baseType: !304, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !305, file: !160, line: 139, baseType: !304, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !296, file: !160, line: 122, baseType: !327, size: 128, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !160, line: 108, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !160, line: 106, size: 128, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !160, line: 107, baseType: !295, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !328, file: !160, line: 107, baseType: !295, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !296, file: !160, line: 122, baseType: !327, size: 128, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !160, line: 123, baseType: !296)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !160, line: 178, baseType: !312)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !338, line: 46, baseType: !339)
!338 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!339 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!341 = !{!0}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !344)
!344 = !{!345, !349, !350, !351, !353, !355, !359, !1197, !1204, !1210, !1214, !1218, !1222, !1226, !1232, !1233, !1237, !1245, !1249, !1250, !1259, !1268}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !6, line: 123, baseType: !346, size: 256)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 256, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !343, file: !6, line: 128, baseType: !346, size: 256, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !343, file: !6, line: 131, baseType: !207, size: 32, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !343, file: !6, line: 133, baseType: !352, size: 32, offset: 544)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !343, file: !6, line: 134, baseType: !354, size: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !343, file: !6, line: 142, baseType: !356, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !232, !232}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !343, file: !6, line: 151, baseType: !360, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !232, !363, !658, !958, !207, !1196}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !365, line: 115, size: 11392, elements: !366)
!365 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!366 = !{!367, !432, !436, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !453, !463, !477, !478, !519, !520, !523, !524, !540, !541, !542, !543, !544, !545, !546, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !566, !567, !568, !569, !570, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !630, !631, !632, !633, !634, !635, !636, !637, !638, !641, !644, !647, !648, !649, !650, !651, !654, !657, !1144, !1145, !1150, !1151, !1152, !1153, !1154, !1155, !1157, !1160, !1163, !1165, !1184, !1185}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !364, file: !365, line: 116, baseType: !368, size: 960)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !369, line: 130, baseType: !370)
!369 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !369, line: 117, size: 960, elements: !371)
!371 = !{!372, !373, !374, !376, !395, !399, !400, !401, !402, !403}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !369, line: 118, baseType: !260, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !370, file: !369, line: 118, baseType: !260, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !370, file: !369, line: 119, baseType: !375, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !370, file: !369, line: 120, baseType: !377, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !369, line: 136, size: 17600, elements: !379)
!379 = !{!380, !381, !383, !386, !390, !391, !392}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !378, file: !369, line: 137, baseType: !368, size: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !378, file: !369, line: 138, baseType: !382, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !378, file: !369, line: 139, baseType: !384, size: 64, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !369, line: 43, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !378, file: !369, line: 140, baseType: !387, size: 8192, offset: 1088)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 8192, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 1024)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !378, file: !369, line: 141, baseType: !387, size: 8192, offset: 9280)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !378, file: !369, line: 148, baseType: !377, size: 64, offset: 17472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !378, file: !369, line: 150, baseType: !393, size: 64, offset: 17536)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !369, line: 45, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !369, line: 121, baseType: !396, size: 528, offset: 256)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 528, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 66)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !369, line: 126, baseType: !288, size: 16, offset: 784)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !370, file: !369, line: 127, baseType: !207, size: 32, offset: 800)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !370, file: !369, line: 128, baseType: !207, size: 32, offset: 832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !370, file: !369, line: 128, baseType: !207, size: 32, offset: 864)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !370, file: !369, line: 129, baseType: !404, size: 64, offset: 896)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !369, line: 75, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !369, line: 62, size: 1024, elements: !407)
!407 = !{!408, !410, !411, !412, !413, !414, !415, !416, !430, !431}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !369, line: 63, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !406, file: !369, line: 63, baseType: !409, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !406, file: !369, line: 64, baseType: !240, size: 8, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !406, file: !369, line: 64, baseType: !240, size: 8, offset: 136)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !369, line: 65, baseType: !288, size: 16, offset: 144)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !406, file: !369, line: 66, baseType: !239, size: 512, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !406, file: !369, line: 67, baseType: !207, size: 32, offset: 672)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !406, file: !369, line: 69, baseType: !417, size: 256, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !369, line: 60, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !369, line: 48, size: 256, elements: !419)
!419 = !{!420, !421, !428, !429}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !418, file: !369, line: 49, baseType: !260, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !418, file: !369, line: 58, baseType: !422, size: 128, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !423, line: 71, baseType: !424)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !423, line: 69, size: 128, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !424, file: !423, line: 70, baseType: !260, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !424, file: !423, line: 70, baseType: !260, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !418, file: !369, line: 59, baseType: !207, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !418, file: !369, line: 59, baseType: !207, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !406, file: !369, line: 70, baseType: !207, size: 32, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !406, file: !369, line: 74, baseType: !207, size: 32, offset: 992)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !364, file: !365, line: 117, baseType: !433, size: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !435, line: 45, flags: DIFlagFwdDecl)
!435 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !364, file: !365, line: 119, baseType: !437, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !365, line: 57, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !365, line: 121, baseType: !288, size: 16, offset: 1088)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !364, file: !365, line: 121, baseType: !288, size: 16, offset: 1104)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !364, file: !365, line: 122, baseType: !207, size: 32, offset: 1120)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !364, file: !365, line: 122, baseType: !207, size: 32, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !364, file: !365, line: 122, baseType: !207, size: 32, offset: 1184)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !364, file: !365, line: 123, baseType: !239, size: 512, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !364, file: !365, line: 124, baseType: !363, size: 64, offset: 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !364, file: !365, line: 124, baseType: !363, size: 64, offset: 1792)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !364, file: !365, line: 127, baseType: !363, size: 64, offset: 1856)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !364, file: !365, line: 127, baseType: !363, size: 64, offset: 1920)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !364, file: !365, line: 127, baseType: !363, size: 64, offset: 1984)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !364, file: !365, line: 128, baseType: !451, size: 64, offset: 2048)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !435, line: 46, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !364, file: !365, line: 130, baseType: !454, size: 64, offset: 2112)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !365, line: 97, size: 832, elements: !456)
!456 = !{!457, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !455, file: !365, line: 98, baseType: !458, size: 768)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 768, elements: !459)
!459 = !{!460, !292}
!460 = !DISubrange(count: 8)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !455, file: !365, line: 99, baseType: !207, size: 32, offset: 768)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !455, file: !365, line: 99, baseType: !207, size: 32, offset: 800)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !364, file: !365, line: 131, baseType: !464, size: 64, offset: 2176)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !466, line: 486, size: 1600, elements: !467)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !466, line: 487, baseType: !368, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !465, file: !466, line: 489, baseType: !422, size: 128, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !465, file: !466, line: 490, baseType: !422, size: 128, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !465, file: !466, line: 491, baseType: !422, size: 128, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !465, file: !466, line: 492, baseType: !422, size: 128, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 494, baseType: !207, size: 32, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !465, file: !466, line: 495, baseType: !207, size: 32, offset: 1504)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !465, file: !466, line: 497, baseType: !207, size: 32, offset: 1536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !466, line: 498, baseType: !207, size: 32, offset: 1568)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !364, file: !365, line: 132, baseType: !464, size: 64, offset: 2240)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !364, file: !365, line: 133, baseType: !479, size: 64, offset: 2304)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !466, line: 334, size: 1728, elements: !481)
!481 = !{!482, !483, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !518}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !480, file: !466, line: 335, baseType: !422, size: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !480, file: !466, line: 336, baseType: !484, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !466, line: 47, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !480, file: !466, line: 338, baseType: !288, size: 16, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !480, file: !466, line: 338, baseType: !288, size: 16, offset: 208)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !480, file: !466, line: 339, baseType: !7, size: 32, offset: 224)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !480, file: !466, line: 340, baseType: !207, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !480, file: !466, line: 342, baseType: !250, size: 32, offset: 288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !480, file: !466, line: 343, baseType: !290, size: 96, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !480, file: !466, line: 344, baseType: !290, size: 96, offset: 416)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !480, file: !466, line: 347, baseType: !422, size: 128, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !480, file: !466, line: 349, baseType: !207, size: 32, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !480, file: !466, line: 350, baseType: !207, size: 32, offset: 672)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !480, file: !466, line: 351, baseType: !260, size: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !480, file: !466, line: 352, baseType: !260, size: 64, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !480, file: !466, line: 354, baseType: !499, size: 384, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !466, line: 116, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !466, line: 94, size: 384, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !500, file: !466, line: 96, baseType: !207, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !500, file: !466, line: 96, baseType: !207, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !500, file: !466, line: 97, baseType: !207, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !500, file: !466, line: 97, baseType: !207, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !500, file: !466, line: 99, baseType: !288, size: 16, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !500, file: !466, line: 100, baseType: !288, size: 16, offset: 144)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !500, file: !466, line: 102, baseType: !288, size: 16, offset: 160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !500, file: !466, line: 105, baseType: !288, size: 16, offset: 176)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !500, file: !466, line: 108, baseType: !288, size: 16, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !500, file: !466, line: 109, baseType: !288, size: 16, offset: 208)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !500, file: !466, line: 111, baseType: !288, size: 16, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !500, file: !466, line: 112, baseType: !288, size: 16, offset: 240)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !500, file: !466, line: 114, baseType: !207, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !500, file: !466, line: 114, baseType: !207, size: 32, offset: 288)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !500, file: !466, line: 115, baseType: !207, size: 32, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !500, file: !466, line: 115, baseType: !207, size: 32, offset: 352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !480, file: !466, line: 355, baseType: !239, size: 512, offset: 1216)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !365, line: 134, baseType: !260, size: 64, offset: 2368)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !364, file: !365, line: 136, baseType: !521, size: 64, offset: 2432)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !365, line: 58, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !364, file: !365, line: 138, baseType: !499, size: 384, offset: 2496)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !364, file: !365, line: 139, baseType: !525, size: 64, offset: 2880)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !466, line: 80, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !466, line: 72, size: 192, elements: !528)
!528 = !{!529, !536, !537, !538, !539}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !527, file: !466, line: 73, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !466, line: 59, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !466, line: 56, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !532, file: !466, line: 57, baseType: !290, size: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !466, line: 58, baseType: !207, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !527, file: !466, line: 74, baseType: !207, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !527, file: !466, line: 76, baseType: !207, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !527, file: !466, line: 77, baseType: !207, size: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !466, line: 79, baseType: !207, size: 32, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !364, file: !365, line: 141, baseType: !422, size: 128, offset: 2944)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !364, file: !365, line: 142, baseType: !422, size: 128, offset: 3072)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !364, file: !365, line: 143, baseType: !422, size: 128, offset: 3200)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !364, file: !365, line: 144, baseType: !422, size: 128, offset: 3328)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !364, file: !365, line: 146, baseType: !207, size: 32, offset: 3456)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !364, file: !365, line: 147, baseType: !207, size: 32, offset: 3488)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !364, file: !365, line: 150, baseType: !547, size: 64, offset: 3520)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !365, line: 50, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !364, file: !365, line: 151, baseType: !248, size: 64, offset: 3584)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !364, file: !365, line: 152, baseType: !207, size: 32, offset: 3648)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !364, file: !365, line: 153, baseType: !207, size: 32, offset: 3680)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !364, file: !365, line: 156, baseType: !290, size: 96, offset: 3712)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !364, file: !365, line: 156, baseType: !290, size: 96, offset: 3808)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !364, file: !365, line: 156, baseType: !290, size: 96, offset: 3904)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !364, file: !365, line: 157, baseType: !290, size: 96, offset: 4000)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !364, file: !365, line: 158, baseType: !290, size: 96, offset: 4096)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !364, file: !365, line: 159, baseType: !290, size: 96, offset: 4192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !364, file: !365, line: 160, baseType: !290, size: 96, offset: 4288)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !364, file: !365, line: 160, baseType: !290, size: 96, offset: 4384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !364, file: !365, line: 161, baseType: !562, size: 128, offset: 4480)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 128, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 4)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !364, file: !365, line: 161, baseType: !562, size: 128, offset: 4608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !364, file: !365, line: 162, baseType: !290, size: 96, offset: 4736)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !364, file: !365, line: 162, baseType: !290, size: 96, offset: 4832)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !364, file: !365, line: 163, baseType: !250, size: 32, offset: 4928)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !364, file: !365, line: 163, baseType: !250, size: 32, offset: 4960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !364, file: !365, line: 164, baseType: !571, size: 512, offset: 4992)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 512, elements: !572)
!572 = !{!564, !564}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !364, file: !365, line: 165, baseType: !571, size: 512, offset: 5504)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !364, file: !365, line: 166, baseType: !571, size: 512, offset: 6016)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !364, file: !365, line: 167, baseType: !571, size: 512, offset: 6528)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !364, file: !365, line: 176, baseType: !571, size: 512, offset: 7040)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !364, file: !365, line: 178, baseType: !7, size: 32, offset: 7552)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !364, file: !365, line: 180, baseType: !288, size: 16, offset: 7584)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !364, file: !365, line: 181, baseType: !288, size: 16, offset: 7600)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !364, file: !365, line: 183, baseType: !288, size: 16, offset: 7616)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !364, file: !365, line: 183, baseType: !288, size: 16, offset: 7632)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !364, file: !365, line: 184, baseType: !288, size: 16, offset: 7648)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !364, file: !365, line: 184, baseType: !288, size: 16, offset: 7664)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !364, file: !365, line: 185, baseType: !288, size: 16, offset: 7680)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !364, file: !365, line: 186, baseType: !288, size: 16, offset: 7696)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !364, file: !365, line: 187, baseType: !288, size: 16, offset: 7712)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !364, file: !365, line: 188, baseType: !240, size: 8, offset: 7728)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !364, file: !365, line: 189, baseType: !240, size: 8, offset: 7736)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !364, file: !365, line: 192, baseType: !207, size: 32, offset: 7744)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !364, file: !365, line: 192, baseType: !207, size: 32, offset: 7776)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !364, file: !365, line: 192, baseType: !207, size: 32, offset: 7808)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !364, file: !365, line: 192, baseType: !207, size: 32, offset: 7840)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !364, file: !365, line: 194, baseType: !207, size: 32, offset: 7872)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !364, file: !365, line: 202, baseType: !250, size: 32, offset: 7904)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !364, file: !365, line: 202, baseType: !250, size: 32, offset: 7936)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !364, file: !365, line: 202, baseType: !250, size: 32, offset: 7968)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !364, file: !365, line: 211, baseType: !250, size: 32, offset: 8000)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !364, file: !365, line: 212, baseType: !250, size: 32, offset: 8032)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !364, file: !365, line: 213, baseType: !250, size: 32, offset: 8064)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !364, file: !365, line: 214, baseType: !250, size: 32, offset: 8096)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !364, file: !365, line: 215, baseType: !250, size: 32, offset: 8128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !364, file: !365, line: 216, baseType: !250, size: 32, offset: 8160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !364, file: !365, line: 219, baseType: !250, size: 32, offset: 8192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !364, file: !365, line: 220, baseType: !250, size: 32, offset: 8224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !364, file: !365, line: 221, baseType: !250, size: 32, offset: 8256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !364, file: !365, line: 224, baseType: !607, size: 16, offset: 8288)
!607 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !364, file: !365, line: 224, baseType: !607, size: 16, offset: 8304)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !364, file: !365, line: 226, baseType: !288, size: 16, offset: 8320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !364, file: !365, line: 228, baseType: !240, size: 8, offset: 8336)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !364, file: !365, line: 229, baseType: !240, size: 8, offset: 8344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !364, file: !365, line: 231, baseType: !288, size: 16, offset: 8352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !364, file: !365, line: 232, baseType: !240, size: 8, offset: 8368)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !364, file: !365, line: 233, baseType: !240, size: 8, offset: 8376)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !364, file: !365, line: 234, baseType: !250, size: 32, offset: 8384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !364, file: !365, line: 235, baseType: !250, size: 32, offset: 8416)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !364, file: !365, line: 237, baseType: !422, size: 128, offset: 8448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !364, file: !365, line: 238, baseType: !422, size: 128, offset: 8576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !364, file: !365, line: 239, baseType: !422, size: 128, offset: 8704)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !364, file: !365, line: 240, baseType: !422, size: 128, offset: 8832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !364, file: !365, line: 242, baseType: !250, size: 32, offset: 8960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !364, file: !365, line: 244, baseType: !288, size: 16, offset: 8992)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !364, file: !365, line: 245, baseType: !607, size: 16, offset: 9008)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !364, file: !365, line: 246, baseType: !562, size: 128, offset: 9024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !364, file: !365, line: 248, baseType: !207, size: 32, offset: 9152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !364, file: !365, line: 249, baseType: !207, size: 32, offset: 9184)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !364, file: !365, line: 251, baseType: !628, size: 64, offset: 9216)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !365, line: 251, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !364, file: !365, line: 253, baseType: !240, size: 8, offset: 9280)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !364, file: !365, line: 254, baseType: !240, size: 8, offset: 9288)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !364, file: !365, line: 255, baseType: !288, size: 16, offset: 9296)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !364, file: !365, line: 256, baseType: !290, size: 96, offset: 9312)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !364, file: !365, line: 258, baseType: !422, size: 128, offset: 9408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !364, file: !365, line: 259, baseType: !422, size: 128, offset: 9536)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !364, file: !365, line: 260, baseType: !422, size: 128, offset: 9664)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !364, file: !365, line: 261, baseType: !422, size: 128, offset: 9792)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !364, file: !365, line: 263, baseType: !639, size: 64, offset: 9920)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !365, line: 52, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !364, file: !365, line: 264, baseType: !642, size: 64, offset: 9984)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !365, line: 53, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !364, file: !365, line: 265, baseType: !645, size: 64, offset: 10048)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !466, line: 46, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !364, file: !365, line: 267, baseType: !240, size: 8, offset: 10112)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !364, file: !365, line: 268, baseType: !240, size: 8, offset: 10120)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !364, file: !365, line: 269, baseType: !288, size: 16, offset: 10128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !364, file: !365, line: 270, baseType: !250, size: 32, offset: 10144)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !364, file: !365, line: 272, baseType: !652, size: 64, offset: 10176)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !365, line: 54, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !364, file: !365, line: 275, baseType: !655, size: 64, offset: 10240)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !365, line: 275, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !364, file: !365, line: 277, baseType: !658, size: 64, offset: 10304)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !660)
!660 = !{!661, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !712, !715, !717, !718, !720, !721, !722, !723, !729, !734, !735, !739, !740, !741, !742, !743, !755, !767, !781, !785, !789, !793, !802, !814, !818, !822, !826, !830, !834, !835, !836, !837, !838, !839, !843, !844, !845, !846, !850, !851, !852, !853, !854, !859, !860, !861, !862, !863, !867, !868, !869, !870, !871, !878, !889, !894, !900, !910, !916, !927, !934, !941, !945, !950, !954, !959, !960, !961, !972, !978, !979, !980, !985, !986, !995, !1101, !1105, !1113, !1117, !1121, !1125, !1133, !1143}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !659, file: !28, line: 180, baseType: !662, size: 1600)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !61, line: 73, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !61, line: 64, size: 1600, elements: !664)
!664 = !{!665, !680, !684, !685, !686, !687, !690}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !663, file: !61, line: 65, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !61, line: 53, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !61, line: 42, size: 832, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !61, line: 43, baseType: !207, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !668, file: !61, line: 44, baseType: !207, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !61, line: 45, baseType: !207, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !668, file: !61, line: 46, baseType: !207, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !668, file: !61, line: 47, baseType: !207, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !668, file: !61, line: 48, baseType: !207, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !668, file: !61, line: 49, baseType: !207, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !668, file: !61, line: 50, baseType: !207, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !61, line: 51, baseType: !239, size: 512, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !668, file: !61, line: 52, baseType: !260, size: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !663, file: !61, line: 66, baseType: !681, size: 1312, offset: 64)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1312, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 41)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !663, file: !61, line: 69, baseType: !207, size: 32, offset: 1376)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !663, file: !61, line: 69, baseType: !207, size: 32, offset: 1408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !663, file: !61, line: 70, baseType: !207, size: 32, offset: 1440)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !663, file: !61, line: 71, baseType: !688, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !61, line: 71, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !663, file: !61, line: 72, baseType: !691, size: 64, offset: 1536)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !61, line: 59, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !61, line: 57, size: 8192, elements: !694)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !693, file: !61, line: 58, baseType: !387, size: 8192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !659, file: !28, line: 180, baseType: !662, size: 1600, offset: 1600)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !659, file: !28, line: 180, baseType: !662, size: 1600, offset: 3200)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !659, file: !28, line: 180, baseType: !662, size: 1600, offset: 4800)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !659, file: !28, line: 180, baseType: !662, size: 1600, offset: 6400)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !659, file: !28, line: 181, baseType: !207, size: 32, offset: 8000)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !659, file: !28, line: 181, baseType: !207, size: 32, offset: 8032)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !659, file: !28, line: 181, baseType: !207, size: 32, offset: 8064)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !659, file: !28, line: 181, baseType: !207, size: 32, offset: 8096)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !659, file: !28, line: 181, baseType: !207, size: 32, offset: 8128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !659, file: !28, line: 182, baseType: !207, size: 32, offset: 8160)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !659, file: !28, line: 183, baseType: !207, size: 32, offset: 8192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !659, file: !28, line: 184, baseType: !708, size: 64, offset: 8256)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !709, line: 124, baseType: !710)
!709 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !709, line: 124, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !659, file: !28, line: 185, baseType: !713, size: 64, offset: 8320)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !659, file: !28, line: 186, baseType: !716, size: 32, offset: 8384)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !659, file: !28, line: 187, baseType: !250, size: 32, offset: 8416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !659, file: !28, line: 188, baseType: !719, size: 32, offset: 8448)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !659, file: !28, line: 189, baseType: !207, size: 32, offset: 8480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !659, file: !28, line: 190, baseType: !547, size: 64, offset: 8512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !659, file: !28, line: 193, baseType: !240, size: 8, offset: 8576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !659, file: !28, line: 196, baseType: !724, size: 64, offset: 8640)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !659)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !659, file: !28, line: 199, baseType: !730, size: 64, offset: 8704)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !727, !733}
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !659, file: !28, line: 202, baseType: !724, size: 64, offset: 8768)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !659, file: !28, line: 207, baseType: !736, size: 64, offset: 8832)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!207, !727}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !659, file: !28, line: 208, baseType: !736, size: 64, offset: 8896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !659, file: !28, line: 209, baseType: !736, size: 64, offset: 8960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !659, file: !28, line: 210, baseType: !736, size: 64, offset: 9024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !659, file: !28, line: 211, baseType: !736, size: 64, offset: 9088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !659, file: !28, line: 218, baseType: !744, size: 64, offset: 9152)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !727, !207, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !105, line: 65, size: 160, elements: !749)
!749 = !{!750, !751, !753, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !748, file: !105, line: 66, baseType: !290, size: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !748, file: !105, line: 67, baseType: !752, size: 48, offset: 96)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 48, elements: !291)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !105, line: 68, baseType: !240, size: 8, offset: 144)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !748, file: !105, line: 68, baseType: !240, size: 8, offset: 152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !659, file: !28, line: 219, baseType: !756, size: 64, offset: 9216)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !727, !207, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !105, line: 48, size: 96, elements: !761)
!761 = !{!762, !763, !764, !765, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !760, file: !105, line: 49, baseType: !7, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !760, file: !105, line: 49, baseType: !7, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !760, file: !105, line: 50, baseType: !240, size: 8, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !760, file: !105, line: 50, baseType: !240, size: 8, offset: 72)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !105, line: 51, baseType: !288, size: 16, offset: 80)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !659, file: !28, line: 220, baseType: !768, size: 64, offset: 9280)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !727, !207, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !105, line: 42, size: 160, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !772, file: !105, line: 43, baseType: !7, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !772, file: !105, line: 43, baseType: !7, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !772, file: !105, line: 43, baseType: !7, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !772, file: !105, line: 43, baseType: !7, size: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !772, file: !105, line: 44, baseType: !288, size: 16, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !772, file: !105, line: 45, baseType: !240, size: 8, offset: 144)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !105, line: 45, baseType: !240, size: 8, offset: 152)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !659, file: !28, line: 227, baseType: !782, size: 64, offset: 9344)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!747, !727}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !659, file: !28, line: 228, baseType: !786, size: 64, offset: 9408)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!759, !727}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !659, file: !28, line: 229, baseType: !790, size: 64, offset: 9472)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!771, !727}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !659, file: !28, line: 230, baseType: !794, size: 64, offset: 9536)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !727}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !105, line: 88, size: 64, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !798, file: !105, line: 89, baseType: !7, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !798, file: !105, line: 90, baseType: !7, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !659, file: !28, line: 231, baseType: !803, size: 64, offset: 9600)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!806, !727}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !105, line: 79, size: 96, elements: !808)
!808 = !{!809, !810, !811, !812, !813}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !807, file: !105, line: 81, baseType: !207, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !807, file: !105, line: 82, baseType: !207, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !807, file: !105, line: 83, baseType: !288, size: 16, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !105, line: 84, baseType: !240, size: 8, offset: 80)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !105, line: 84, baseType: !240, size: 8, offset: 88)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !659, file: !28, line: 236, baseType: !815, size: 64, offset: 9664)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !727, !747}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !659, file: !28, line: 237, baseType: !819, size: 64, offset: 9728)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !727, !759}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !659, file: !28, line: 238, baseType: !823, size: 64, offset: 9792)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !727, !771}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !659, file: !28, line: 239, baseType: !827, size: 64, offset: 9856)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !727, !797}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !659, file: !28, line: 240, baseType: !831, size: 64, offset: 9920)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !727, !806}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !659, file: !28, line: 245, baseType: !782, size: 64, offset: 9984)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !659, file: !28, line: 246, baseType: !786, size: 64, offset: 10048)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !659, file: !28, line: 247, baseType: !790, size: 64, offset: 10112)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !659, file: !28, line: 248, baseType: !794, size: 64, offset: 10176)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !659, file: !28, line: 249, baseType: !803, size: 64, offset: 10240)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !659, file: !28, line: 255, baseType: !840, size: 64, offset: 10304)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!260, !727, !207, !207}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !659, file: !28, line: 256, baseType: !840, size: 64, offset: 10368)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !659, file: !28, line: 257, baseType: !840, size: 64, offset: 10432)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !659, file: !28, line: 258, baseType: !840, size: 64, offset: 10496)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !659, file: !28, line: 264, baseType: !847, size: 64, offset: 10560)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!260, !727, !207}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !659, file: !28, line: 265, baseType: !847, size: 64, offset: 10624)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !659, file: !28, line: 266, baseType: !847, size: 64, offset: 10688)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !659, file: !28, line: 267, baseType: !847, size: 64, offset: 10752)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !659, file: !28, line: 268, baseType: !847, size: 64, offset: 10816)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !659, file: !28, line: 272, baseType: !855, size: 64, offset: 10880)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!858, !727}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !659, file: !28, line: 273, baseType: !855, size: 64, offset: 10944)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !659, file: !28, line: 274, baseType: !855, size: 64, offset: 11008)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !659, file: !28, line: 275, baseType: !855, size: 64, offset: 11072)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !659, file: !28, line: 276, baseType: !855, size: 64, offset: 11136)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !659, file: !28, line: 279, baseType: !864, size: 64, offset: 11200)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !727, !207, !858, !207}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !659, file: !28, line: 280, baseType: !864, size: 64, offset: 11264)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !659, file: !28, line: 281, baseType: !864, size: 64, offset: 11328)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !659, file: !28, line: 284, baseType: !736, size: 64, offset: 11392)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !659, file: !28, line: 285, baseType: !736, size: 64, offset: 11456)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !659, file: !28, line: 286, baseType: !872, size: 64, offset: 11520)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!875, !727}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !659, file: !28, line: 287, baseType: !879, size: 64, offset: 11584)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !727}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !885)
!885 = !{!886, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !884, file: !28, line: 118, baseType: !887, size: 128)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 128, elements: !563)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !884, file: !28, line: 119, baseType: !887, size: 128, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !659, file: !28, line: 288, baseType: !890, size: 64, offset: 11648)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!893, !727}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !659, file: !28, line: 289, baseType: !895, size: 64, offset: 11712)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !727, !898}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !659, file: !28, line: 290, baseType: !901, size: 64, offset: 11776)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!904, !727}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !906, file: !28, line: 124, baseType: !288, size: 16)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !906, file: !28, line: 125, baseType: !240, size: 8, offset: 16)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !659, file: !28, line: 291, baseType: !911, size: 64, offset: 11840)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!914, !727}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !659, file: !28, line: 299, baseType: !917, size: 64, offset: 11904)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !727, !920, !260, !926}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !260, !207, !923, !923, !924}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !659, file: !28, line: 309, baseType: !928, size: 64, offset: 11968)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !727, !931, !260}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !260, !207, !923, !923}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !659, file: !28, line: 317, baseType: !935, size: 64, offset: 12032)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !727, !938, !260, !926}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !260, !207, !207, !923, !923}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !659, file: !28, line: 327, baseType: !942, size: 64, offset: 12096)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !727, !931, !260, !926}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !659, file: !28, line: 337, baseType: !946, size: 64, offset: 12160)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !727, !949, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !659, file: !28, line: 344, baseType: !951, size: 64, offset: 12224)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !727, !207, !949}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !659, file: !28, line: 347, baseType: !955, size: 64, offset: 12288)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !727, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !659, file: !28, line: 350, baseType: !951, size: 64, offset: 12352)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !659, file: !28, line: 351, baseType: !951, size: 64, offset: 12416)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !659, file: !28, line: 355, baseType: !962, size: 64, offset: 12480)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!965, !363, !727}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !968, line: 96, size: 128, elements: !969)
!968 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_mesh_mapping.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !967, file: !968, line: 97, baseType: !893, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !967, file: !968, line: 98, baseType: !207, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !659, file: !28, line: 359, baseType: !973, size: 64, offset: 12544)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !363, !727}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !659, file: !28, line: 364, baseType: !724, size: 64, offset: 12608)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !659, file: !28, line: 367, baseType: !724, size: 64, offset: 12672)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !659, file: !28, line: 373, baseType: !981, size: 64, offset: 12736)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !727, !984, !984}
!984 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !659, file: !28, line: 376, baseType: !724, size: 64, offset: 12800)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !659, file: !28, line: 385, baseType: !987, size: 64, offset: 12864)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !727, !990, !984, !991}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!207, !207, !260}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !659, file: !28, line: 391, baseType: !996, size: 64, offset: 12928)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !727, !999, !1096, !260, !1100}
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !1004, !1095, !207}
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !105, line: 160, size: 384, elements: !1006)
!1006 = !{!1007, !1010, !1090, !1091, !1092, !1093, !1094}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !1005, file: !105, line: 161, baseType: !1008, size: 256)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 256, elements: !1009)
!1009 = !{!564, !256}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !1005, file: !105, line: 162, baseType: !1011, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !246, line: 77, size: 15424, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1019, !1022, !1025, !1028, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1079, !1080, !1084}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1012, file: !246, line: 78, baseType: !368, size: 960)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1012, file: !246, line: 80, baseType: !387, size: 8192, offset: 960)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1012, file: !246, line: 82, baseType: !1017, size: 64, offset: 9152)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !246, line: 43, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1012, file: !246, line: 83, baseType: !1020, size: 64, offset: 9216)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !369, line: 46, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1012, file: !246, line: 86, baseType: !1023, size: 64, offset: 9280)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !246, line: 41, flags: DIFlagFwdDecl)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1012, file: !246, line: 87, baseType: !1026, size: 64, offset: 9344)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !246, line: 44, flags: DIFlagFwdDecl)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1012, file: !246, line: 89, baseType: !1029, size: 512, offset: 9408)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 512, elements: !1030)
!1030 = !{!460}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1012, file: !246, line: 90, baseType: !288, size: 16, offset: 9920)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1012, file: !246, line: 90, baseType: !288, size: 16, offset: 9936)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1012, file: !246, line: 92, baseType: !288, size: 16, offset: 9952)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1012, file: !246, line: 92, baseType: !288, size: 16, offset: 9968)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1012, file: !246, line: 93, baseType: !288, size: 16, offset: 9984)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1012, file: !246, line: 93, baseType: !288, size: 16, offset: 10000)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1012, file: !246, line: 94, baseType: !207, size: 32, offset: 10016)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1012, file: !246, line: 97, baseType: !288, size: 16, offset: 10048)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1012, file: !246, line: 97, baseType: !288, size: 16, offset: 10064)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1012, file: !246, line: 98, baseType: !288, size: 16, offset: 10080)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1012, file: !246, line: 98, baseType: !288, size: 16, offset: 10096)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1012, file: !246, line: 99, baseType: !288, size: 16, offset: 10112)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1012, file: !246, line: 99, baseType: !288, size: 16, offset: 10128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1012, file: !246, line: 100, baseType: !7, size: 32, offset: 10144)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1012, file: !246, line: 101, baseType: !915, size: 64, offset: 10176)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1012, file: !246, line: 103, baseType: !393, size: 64, offset: 10240)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1012, file: !246, line: 104, baseType: !1048, size: 64, offset: 10304)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !369, line: 159, size: 448, elements: !1050)
!1050 = !{!1051, !1053, !1054, !1056, !1057, !1059}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1049, file: !369, line: 161, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !255)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1049, file: !369, line: 162, baseType: !1052, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1049, file: !369, line: 163, baseType: !1055, size: 32, offset: 128)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 32, elements: !255)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1049, file: !369, line: 164, baseType: !1055, size: 32, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1049, file: !369, line: 165, baseType: !1058, size: 128, offset: 192)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 128, elements: !255)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1049, file: !369, line: 166, baseType: !1060, size: 128, offset: 320)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 128, elements: !255)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1012, file: !246, line: 107, baseType: !250, size: 32, offset: 10368)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1012, file: !246, line: 108, baseType: !207, size: 32, offset: 10400)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1012, file: !246, line: 109, baseType: !288, size: 16, offset: 10432)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1012, file: !246, line: 110, baseType: !288, size: 16, offset: 10448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1012, file: !246, line: 113, baseType: !207, size: 32, offset: 10464)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1012, file: !246, line: 113, baseType: !207, size: 32, offset: 10496)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1012, file: !246, line: 114, baseType: !240, size: 8, offset: 10528)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1012, file: !246, line: 114, baseType: !240, size: 8, offset: 10536)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1012, file: !246, line: 115, baseType: !288, size: 16, offset: 10544)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1012, file: !246, line: 116, baseType: !562, size: 128, offset: 10560)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1012, file: !246, line: 119, baseType: !250, size: 32, offset: 10688)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1012, file: !246, line: 119, baseType: !250, size: 32, offset: 10720)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1012, file: !246, line: 122, baseType: !1074, size: 512, offset: 10752)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1075, line: 182, baseType: !1076)
!1075 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1075, line: 180, size: 512, elements: !1077)
!1077 = !{!1078}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1076, file: !1075, line: 181, baseType: !239, size: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1012, file: !246, line: 123, baseType: !240, size: 8, offset: 11264)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1012, file: !246, line: 125, baseType: !1081, size: 56, offset: 11272)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 56, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 7)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1012, file: !246, line: 126, baseType: !1085, size: 4096, offset: 11328)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 4096, elements: !1030)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !246, line: 69, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !246, line: 67, size: 512, elements: !1088)
!1088 = !{!1089}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !246, line: 68, baseType: !239, size: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1005, file: !105, line: 163, baseType: !240, size: 8, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !1005, file: !105, line: 163, baseType: !240, size: 8, offset: 328)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1005, file: !105, line: 164, baseType: !288, size: 16, offset: 336)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1005, file: !105, line: 164, baseType: !288, size: 16, offset: 352)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !1005, file: !105, line: 164, baseType: !288, size: 16, offset: 368)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!207, !260, !207, !207}
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !659, file: !28, line: 400, baseType: !1102, size: 64, offset: 12992)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !727, !991}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !659, file: !28, line: 415, baseType: !1106, size: 64, offset: 13056)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !727, !1109, !991, !1096, !260, !1100}
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!1003, !260, !207}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !659, file: !28, line: 425, baseType: !1114, size: 64, offset: 13120)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !727, !1109, !1096, !260, !1100}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !659, file: !28, line: 435, baseType: !1118, size: 64, offset: 13184)
