; ModuleID = 'blender/source/blender/editors/sculpt_paint/sculpt_undo.c'
source_filename = "blender/source/blender/editors/sculpt_paint/sculpt_undo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMAllocTemplate = type { i32, i32, i32, i32 }
%struct.SculptUndoNode = type { %struct.SculptUndoNode*, %struct.SculptUndoNode*, i32, [66 x i8], i8*, [3 x float]*, [3 x float]*, [3 x i16]*, float*, i32, i32, i32*, i32*, i32, i32, i32, i32*, i32**, %struct.BMLogEntry*, i8, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i32, i32, i32, i32, [64 x i8] }
%struct.BMLogEntry = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }
%struct.CustomDataLayer = type { i32, i32, i32, i32, i32, i32, i32, i32, [64 x i8], i8* }
%struct.BLI_mempool = type opaque
%struct.CustomDataExternal = type { [1024 x i8] }
%struct.PBVHNode = type opaque
%struct.ListBase = type { i8*, i8* }

!110 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!111 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!112 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!113 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 76, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!117 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!144 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!145 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!146 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!147 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!148 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!149 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!150 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!151 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!152 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!153 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!154 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!155 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!156 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!157 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!158 = !{!159, !162, !163, !165, !167, !171, !184, !177, !190, !191, !627}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !161, line: 33, baseType: !5)
!161 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCGElem", file: !169, line: 51, baseType: !170)
!169 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_ccg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !169, line: 51, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !173, line: 54, baseType: !174)
!173 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !173, line: 50, size: 192, elements: !175)
!175 = !{!176, !180, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !174, file: !173, line: 51, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !173, line: 48, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !173, line: 48, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !174, file: !173, line: 52, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !173, line: 52, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !174, file: !173, line: 53, baseType: !5, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !173, line: 94, size: 192, elements: !186)
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !173, line: 94, baseType: !162, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !185, file: !173, line: 94, baseType: !162, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !185, file: !173, line: 94, baseType: !162, size: 64, offset: 128)
!190 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !193, line: 133, baseType: !194)
!193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !193, line: 58, size: 11008, elements: !195)
!195 = !{!196, !265, !269, !280, !283, !326, !330, !336, !345, !441, !447, !454, !462, !473, !486, !499, !510, !519, !531, !539, !541, !544, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !193, line: 59, baseType: !197, size: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !198, line: 130, baseType: !199)
!198 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !198, line: 117, size: 960, elements: !200)
!200 = !{!201, !202, !203, !205, !224, !228, !229, !231, !232, !233}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !198, line: 118, baseType: !162, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !198, line: 118, baseType: !162, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !199, file: !198, line: 119, baseType: !204, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !199, file: !198, line: 120, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !198, line: 136, size: 17600, elements: !208)
!208 = !{!209, !210, !212, !215, !219, !220, !221}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !207, file: !198, line: 137, baseType: !197, size: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !207, file: !198, line: 138, baseType: !211, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !207, file: !198, line: 139, baseType: !213, size: 64, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !198, line: 43, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !198, line: 140, baseType: !216, size: 8192, offset: 1088)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 8192, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 1024)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !207, file: !198, line: 141, baseType: !216, size: 8192, offset: 9280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !207, file: !198, line: 148, baseType: !206, size: 64, offset: 17472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !207, file: !198, line: 150, baseType: !222, size: 64, offset: 17536)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !198, line: 45, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !198, line: 121, baseType: !225, size: 528, offset: 256)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 528, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 66)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !199, file: !198, line: 126, baseType: !190, size: 16, offset: 784)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !199, file: !198, line: 127, baseType: !230, size: 32, offset: 800)
!230 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !199, file: !198, line: 128, baseType: !230, size: 32, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !199, file: !198, line: 128, baseType: !230, size: 32, offset: 864)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !199, file: !198, line: 129, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !198, line: 75, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !198, line: 62, size: 1024, elements: !237)
!237 = !{!238, !240, !241, !242, !243, !244, !248, !249, !263, !264}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !198, line: 63, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !198, line: 63, baseType: !239, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !198, line: 64, baseType: !164, size: 8, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !236, file: !198, line: 64, baseType: !164, size: 8, offset: 136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !198, line: 65, baseType: !190, size: 16, offset: 144)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !198, line: 66, baseType: !245, size: 512, offset: 160)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 512, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !236, file: !198, line: 67, baseType: !230, size: 32, offset: 672)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !198, line: 69, baseType: !250, size: 256, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !198, line: 60, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !198, line: 48, size: 256, elements: !252)
!252 = !{!253, !254, !261, !262}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !251, file: !198, line: 49, baseType: !162, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !251, file: !198, line: 58, baseType: !255, size: 128, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !256, line: 71, baseType: !257)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !256, line: 69, size: 128, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !257, file: !256, line: 70, baseType: !162, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !257, file: !256, line: 70, baseType: !162, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !251, file: !198, line: 59, baseType: !230, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !251, file: !198, line: 59, baseType: !230, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !198, line: 70, baseType: !230, size: 32, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !236, file: !198, line: 74, baseType: !230, size: 32, offset: 992)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !194, file: !193, line: 60, baseType: !266, size: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !268, line: 45, flags: DIFlagFwdDecl)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !194, file: !193, line: 62, baseType: !270, size: 64, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !108, line: 97, size: 832, elements: !272)
!272 = !{!273, !278, !279}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !271, file: !108, line: 98, baseType: !274, size: 768)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 768, elements: !275)
!275 = !{!276, !277}
!276 = !DISubrange(count: 8)
!277 = !DISubrange(count: 3)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !271, file: !108, line: 99, baseType: !230, size: 32, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !271, file: !108, line: 99, baseType: !230, size: 32, offset: 800)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !194, file: !193, line: 64, baseType: !281, size: 64, offset: 1088)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !268, line: 46, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !194, file: !193, line: 65, baseType: !284, size: 64, offset: 1152)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !286, line: 73, size: 1792, elements: !287)
!286 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!287 = !{!288, !289, !290, !311, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !285, file: !286, line: 74, baseType: !197, size: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !285, file: !286, line: 75, baseType: !266, size: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "refkey", scope: !285, file: !286, line: 80, baseType: !291, size: 64, offset: 1024)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyBlock", file: !286, line: 70, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !286, line: 45, size: 1472, elements: !294)
!294 = !{!295, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !286, line: 46, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !293, file: !286, line: 46, baseType: !296, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !293, file: !286, line: 48, baseType: !166, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !293, file: !286, line: 51, baseType: !166, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !293, file: !286, line: 53, baseType: !190, size: 16, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !293, file: !286, line: 54, baseType: !190, size: 16, offset: 208)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !293, file: !286, line: 56, baseType: !190, size: 16, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !286, line: 57, baseType: !190, size: 16, offset: 240)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !293, file: !286, line: 59, baseType: !230, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !293, file: !286, line: 60, baseType: !230, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !286, line: 62, baseType: !162, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !286, line: 63, baseType: !245, size: 512, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !293, file: !286, line: 64, baseType: !245, size: 512, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !293, file: !286, line: 67, baseType: !166, size: 32, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !293, file: !286, line: 68, baseType: !166, size: 32, offset: 1440)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "elemstr", scope: !285, file: !286, line: 85, baseType: !312, size: 256, offset: 1088)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 256, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !285, file: !286, line: 86, baseType: !230, size: 32, offset: 1344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !285, file: !286, line: 87, baseType: !230, size: 32, offset: 1376)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !285, file: !286, line: 89, baseType: !255, size: 128, offset: 1408)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !285, file: !286, line: 90, baseType: !281, size: 64, offset: 1536)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !285, file: !286, line: 92, baseType: !211, size: 64, offset: 1600)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !285, file: !286, line: 94, baseType: !190, size: 16, offset: 1664)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !285, file: !286, line: 95, baseType: !190, size: 16, offset: 1680)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "slurph", scope: !285, file: !286, line: 96, baseType: !190, size: 16, offset: 1696)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !286, line: 97, baseType: !190, size: 16, offset: 1712)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !285, file: !286, line: 101, baseType: !166, size: 32, offset: 1728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "uidgen", scope: !285, file: !286, line: 104, baseType: !230, size: 32, offset: 1760)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !194, file: !193, line: 66, baseType: !327, size: 64, offset: 1216)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !108, line: 50, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !194, file: !193, line: 67, baseType: !331, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !84, line: 154, size: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !332, file: !84, line: 155, baseType: !230, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !84, line: 156, baseType: !230, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !194, file: !193, line: 71, baseType: !337, size: 64, offset: 1344)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !84, line: 79, size: 96, elements: !339)
!339 = !{!340, !341, !342, !343, !344}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !338, file: !84, line: 81, baseType: !230, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !338, file: !84, line: 82, baseType: !230, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !338, file: !84, line: 83, baseType: !190, size: 16, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !338, file: !84, line: 84, baseType: !164, size: 8, offset: 80)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !338, file: !84, line: 84, baseType: !164, size: 8, offset: 88)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !194, file: !193, line: 72, baseType: !346, size: 64, offset: 1408)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !84, line: 93, size: 128, elements: !348)
!348 = !{!349, !436, !437, !438, !439, !440}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !347, file: !84, line: 94, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !352, line: 77, size: 15424, elements: !353)
!352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!353 = !{!354, !355, !356, !359, !362, !365, !368, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !387, !388, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !417, !418, !419, !425, !426, !430}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !351, file: !352, line: 78, baseType: !197, size: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !351, file: !352, line: 80, baseType: !216, size: 8192, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !351, file: !352, line: 82, baseType: !357, size: 64, offset: 9152)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !352, line: 43, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !351, file: !352, line: 83, baseType: !360, size: 64, offset: 9216)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !198, line: 46, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !351, file: !352, line: 86, baseType: !363, size: 64, offset: 9280)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !352, line: 41, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !351, file: !352, line: 87, baseType: !366, size: 64, offset: 9344)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !352, line: 44, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !351, file: !352, line: 89, baseType: !369, size: 512, offset: 9408)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 512, elements: !370)
!370 = !{!276}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !351, file: !352, line: 90, baseType: !190, size: 16, offset: 9920)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !351, file: !352, line: 90, baseType: !190, size: 16, offset: 9936)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !351, file: !352, line: 92, baseType: !190, size: 16, offset: 9952)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !351, file: !352, line: 92, baseType: !190, size: 16, offset: 9968)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !351, file: !352, line: 93, baseType: !190, size: 16, offset: 9984)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !351, file: !352, line: 93, baseType: !190, size: 16, offset: 10000)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !351, file: !352, line: 94, baseType: !230, size: 32, offset: 10016)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !351, file: !352, line: 97, baseType: !190, size: 16, offset: 10048)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !351, file: !352, line: 97, baseType: !190, size: 16, offset: 10064)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !351, file: !352, line: 98, baseType: !190, size: 16, offset: 10080)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !351, file: !352, line: 98, baseType: !190, size: 16, offset: 10096)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !351, file: !352, line: 99, baseType: !190, size: 16, offset: 10112)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !351, file: !352, line: 99, baseType: !190, size: 16, offset: 10128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !351, file: !352, line: 100, baseType: !5, size: 32, offset: 10144)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !351, file: !352, line: 101, baseType: !386, size: 64, offset: 10176)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !351, file: !352, line: 103, baseType: !222, size: 64, offset: 10240)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !351, file: !352, line: 104, baseType: !389, size: 64, offset: 10304)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !198, line: 159, size: 448, elements: !391)
!391 = !{!392, !396, !397, !399, !400, !402}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !390, file: !198, line: 161, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 2)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !390, file: !198, line: 162, baseType: !393, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !390, file: !198, line: 163, baseType: !398, size: 32, offset: 128)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 32, elements: !394)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !390, file: !198, line: 164, baseType: !398, size: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !390, file: !198, line: 165, baseType: !401, size: 128, offset: 192)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 128, elements: !394)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !390, file: !198, line: 166, baseType: !403, size: 128, offset: 320)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 128, elements: !394)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !351, file: !352, line: 107, baseType: !166, size: 32, offset: 10368)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !351, file: !352, line: 108, baseType: !230, size: 32, offset: 10400)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !351, file: !352, line: 109, baseType: !190, size: 16, offset: 10432)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !351, file: !352, line: 110, baseType: !190, size: 16, offset: 10448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !351, file: !352, line: 113, baseType: !230, size: 32, offset: 10464)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !351, file: !352, line: 113, baseType: !230, size: 32, offset: 10496)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !351, file: !352, line: 114, baseType: !164, size: 8, offset: 10528)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !351, file: !352, line: 114, baseType: !164, size: 8, offset: 10536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !351, file: !352, line: 115, baseType: !190, size: 16, offset: 10544)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !351, file: !352, line: 116, baseType: !414, size: 128, offset: 10560)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 128, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 4)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !351, file: !352, line: 119, baseType: !166, size: 32, offset: 10688)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !351, file: !352, line: 119, baseType: !166, size: 32, offset: 10720)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !351, file: !352, line: 122, baseType: !420, size: 512, offset: 10752)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !421, line: 182, baseType: !422)
!421 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !421, line: 180, size: 512, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !421, line: 181, baseType: !245, size: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !351, file: !352, line: 123, baseType: !164, size: 8, offset: 11264)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !351, file: !352, line: 125, baseType: !427, size: 56, offset: 11272)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 56, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 7)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !351, file: !352, line: 126, baseType: !431, size: 4096, offset: 11328)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 4096, elements: !370)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !352, line: 69, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !352, line: 67, size: 512, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !352, line: 68, baseType: !245, size: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !84, line: 95, baseType: !164, size: 8, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !347, file: !84, line: 95, baseType: !164, size: 8, offset: 72)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !347, file: !84, line: 96, baseType: !190, size: 16, offset: 80)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !347, file: !84, line: 96, baseType: !190, size: 16, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !347, file: !84, line: 96, baseType: !190, size: 16, offset: 112)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !194, file: !193, line: 73, baseType: !442, size: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !84, line: 88, size: 64, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !443, file: !84, line: 89, baseType: !5, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !443, file: !84, line: 90, baseType: !5, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !194, file: !193, line: 74, baseType: !448, size: 64, offset: 1536)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !84, line: 109, size: 96, elements: !450)
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !449, file: !84, line: 110, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !394)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !449, file: !84, line: 111, baseType: !230, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !194, file: !193, line: 75, baseType: !455, size: 64, offset: 1600)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !84, line: 129, size: 32, elements: !457)
!457 = !{!458, !459, !460, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !456, file: !84, line: 130, baseType: !164, size: 8)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !456, file: !84, line: 130, baseType: !164, size: 8, offset: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !456, file: !84, line: 130, baseType: !164, size: 8, offset: 16)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !456, file: !84, line: 130, baseType: !164, size: 8, offset: 24)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !194, file: !193, line: 80, baseType: !463, size: 64, offset: 1664)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !84, line: 42, size: 160, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !464, file: !84, line: 43, baseType: !5, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !464, file: !84, line: 43, baseType: !5, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !464, file: !84, line: 43, baseType: !5, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !464, file: !84, line: 43, baseType: !5, size: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !464, file: !84, line: 44, baseType: !190, size: 16, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !464, file: !84, line: 45, baseType: !164, size: 8, offset: 144)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !464, file: !84, line: 45, baseType: !164, size: 8, offset: 152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !194, file: !193, line: 81, baseType: !474, size: 64, offset: 1728)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !84, line: 160, size: 384, elements: !476)
!476 = !{!477, !480, !481, !482, !483, !484, !485}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !475, file: !84, line: 161, baseType: !478, size: 256)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 256, elements: !479)
!479 = !{!416, !395}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !475, file: !84, line: 162, baseType: !350, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !475, file: !84, line: 163, baseType: !164, size: 8, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !475, file: !84, line: 163, baseType: !164, size: 8, offset: 328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !475, file: !84, line: 164, baseType: !190, size: 16, offset: 336)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !475, file: !84, line: 164, baseType: !190, size: 16, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !475, file: !84, line: 164, baseType: !190, size: 16, offset: 368)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !194, file: !193, line: 82, baseType: !487, size: 64, offset: 1792)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !193, line: 136, size: 512, elements: !489)
!489 = !{!490, !491, !492, !494, !495, !496, !497, !498}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !488, file: !193, line: 137, baseType: !162, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !488, file: !193, line: 138, baseType: !478, size: 256, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !488, file: !193, line: 139, baseType: !493, size: 128, offset: 320)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !415)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !193, line: 140, baseType: !164, size: 8, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !488, file: !193, line: 140, baseType: !164, size: 8, offset: 456)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !488, file: !193, line: 141, baseType: !190, size: 16, offset: 464)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !488, file: !193, line: 141, baseType: !190, size: 16, offset: 480)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !488, file: !193, line: 141, baseType: !190, size: 16, offset: 496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !194, file: !193, line: 83, baseType: !500, size: 64, offset: 1856)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !84, line: 65, size: 160, elements: !502)
!502 = !{!503, !506, !508, !509}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !501, file: !84, line: 66, baseType: !504, size: 96)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 96, elements: !505)
!505 = !{!277}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !501, file: !84, line: 67, baseType: !507, size: 48, offset: 96)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 48, elements: !505)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !84, line: 68, baseType: !164, size: 8, offset: 144)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !501, file: !84, line: 68, baseType: !164, size: 8, offset: 152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !194, file: !193, line: 84, baseType: !511, size: 64, offset: 1920)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !84, line: 48, size: 96, elements: !513)
!513 = !{!514, !515, !516, !517, !518}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !512, file: !84, line: 49, baseType: !5, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !512, file: !84, line: 49, baseType: !5, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !512, file: !84, line: 50, baseType: !164, size: 8, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !512, file: !84, line: 50, baseType: !164, size: 8, offset: 72)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !84, line: 51, baseType: !190, size: 16, offset: 80)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !194, file: !193, line: 85, baseType: !520, size: 64, offset: 1984)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !84, line: 59, size: 128, elements: !522)
!522 = !{!523, !529, !530}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !521, file: !84, line: 60, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !84, line: 54, size: 64, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !525, file: !84, line: 55, baseType: !230, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !525, file: !84, line: 56, baseType: !166, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !521, file: !84, line: 61, baseType: !230, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !84, line: 62, baseType: !230, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !194, file: !193, line: 89, baseType: !532, size: 64, offset: 2048)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !84, line: 74, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !533, file: !84, line: 75, baseType: !164, size: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !533, file: !84, line: 75, baseType: !164, size: 8, offset: 8)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !533, file: !84, line: 75, baseType: !164, size: 8, offset: 16)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !533, file: !84, line: 75, baseType: !164, size: 8, offset: 24)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !194, file: !193, line: 90, baseType: !540, size: 64, offset: 2112)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !194, file: !193, line: 93, baseType: !542, size: 64, offset: 2176)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !193, line: 93, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !194, file: !193, line: 95, baseType: !545, size: 1600, offset: 2240)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !115, line: 64, size: 1600, elements: !546)
!546 = !{!547, !562, !566, !567, !568, !569, !572}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !545, file: !115, line: 65, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !115, line: 53, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !115, line: 42, size: 832, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !115, line: 43, baseType: !230, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !550, file: !115, line: 44, baseType: !230, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !115, line: 45, baseType: !230, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !550, file: !115, line: 46, baseType: !230, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !550, file: !115, line: 47, baseType: !230, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !550, file: !115, line: 48, baseType: !230, size: 32, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !550, file: !115, line: 49, baseType: !230, size: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !550, file: !115, line: 50, baseType: !230, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !550, file: !115, line: 51, baseType: !245, size: 512, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !115, line: 52, baseType: !162, size: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !545, file: !115, line: 66, baseType: !563, size: 1312, offset: 64)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 1312, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 41)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !545, file: !115, line: 69, baseType: !230, size: 32, offset: 1376)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !545, file: !115, line: 69, baseType: !230, size: 32, offset: 1408)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !545, file: !115, line: 70, baseType: !230, size: 32, offset: 1440)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !545, file: !115, line: 71, baseType: !570, size: 64, offset: 1472)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !115, line: 71, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !545, file: !115, line: 72, baseType: !573, size: 64, offset: 1536)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !115, line: 59, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !115, line: 57, size: 8192, elements: !576)
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !575, file: !115, line: 58, baseType: !216, size: 8192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !194, file: !193, line: 95, baseType: !545, size: 1600, offset: 3840)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !194, file: !193, line: 95, baseType: !545, size: 1600, offset: 5440)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !194, file: !193, line: 98, baseType: !545, size: 1600, offset: 7040)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !194, file: !193, line: 98, baseType: !545, size: 1600, offset: 8640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !194, file: !193, line: 101, baseType: !230, size: 32, offset: 10240)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !194, file: !193, line: 101, baseType: !230, size: 32, offset: 10272)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !194, file: !193, line: 101, baseType: !230, size: 32, offset: 10304)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !194, file: !193, line: 101, baseType: !230, size: 32, offset: 10336)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !194, file: !193, line: 104, baseType: !230, size: 32, offset: 10368)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !194, file: !193, line: 104, baseType: !230, size: 32, offset: 10400)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !194, file: !193, line: 111, baseType: !230, size: 32, offset: 10432)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !194, file: !193, line: 114, baseType: !504, size: 96, offset: 10464)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !193, line: 115, baseType: !504, size: 96, offset: 10560)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !194, file: !193, line: 116, baseType: !504, size: 96, offset: 10656)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !194, file: !193, line: 118, baseType: !230, size: 32, offset: 10752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !194, file: !193, line: 119, baseType: !190, size: 16, offset: 10784)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !193, line: 119, baseType: !190, size: 16, offset: 10800)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !194, file: !193, line: 120, baseType: !166, size: 32, offset: 10816)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !194, file: !193, line: 121, baseType: !230, size: 32, offset: 10848)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !194, file: !193, line: 124, baseType: !164, size: 8, offset: 10880)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !194, file: !193, line: 124, baseType: !164, size: 8, offset: 10888)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !194, file: !193, line: 126, baseType: !164, size: 8, offset: 10896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !194, file: !193, line: 126, baseType: !164, size: 8, offset: 10904)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !194, file: !193, line: 127, baseType: !164, size: 8, offset: 10912)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !194, file: !193, line: 128, baseType: !164, size: 8, offset: 10920)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !194, file: !193, line: 130, baseType: !190, size: 16, offset: 10928)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !194, file: !193, line: 132, baseType: !605, size: 64, offset: 10944)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !84, line: 233, size: 3584, elements: !607)
!607 = !{!608, !609, !612, !614, !615, !616, !617, !618, !619, !620, !621, !623, !624, !626}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !606, file: !84, line: 234, baseType: !255, size: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !606, file: !84, line: 235, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !84, line: 69, baseType: !501)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !606, file: !84, line: 237, baseType: !613, size: 8, offset: 192)
!613 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !606, file: !84, line: 237, baseType: !613, size: 8, offset: 200)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !606, file: !84, line: 237, baseType: !613, size: 8, offset: 208)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !606, file: !84, line: 237, baseType: !613, size: 8, offset: 216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !606, file: !84, line: 237, baseType: !613, size: 8, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !606, file: !84, line: 237, baseType: !613, size: 8, offset: 232)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !606, file: !84, line: 238, baseType: !613, size: 8, offset: 240)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !84, line: 238, baseType: !613, size: 8, offset: 248)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !606, file: !84, line: 241, baseType: !622, size: 1600, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !115, line: 73, baseType: !545)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !606, file: !84, line: 242, baseType: !622, size: 1600, offset: 1856)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !606, file: !84, line: 243, baseType: !625, size: 64, offset: 3456)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !606, file: !84, line: 244, baseType: !163, size: 64, offset: 3520)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!628 = !{i32 7, !"Dwarf Version", i32 4}
!629 = !{i32 2, !"Debug Info Version", i32 3}
!630 = !{i32 1, !"wchar_size", i32 4}
!631 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!632 = distinct !DISubprogram(name: "sculpt_undo_get_node", scope: !1, file: !1, line: 565, type: !633, scopeLine: 566, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !680)
!633 = !DISubroutineType(types: !634)
!634 = !{!635, !677}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "SculptUndoNode", file: !4, line: 122, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptUndoNode", file: !4, line: 82, size: 8640, elements: !638)
!638 = !{!639, !641, !642, !644, !645, !646, !648, !649, !651, !652, !653, !654, !656, !657, !658, !659, !660, !661, !663, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !4, line: 83, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !637, file: !4, line: 83, baseType: !640, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !4, line: 85, baseType: !643, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "SculptUndoType", file: !4, line: 80, baseType: !3)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !637, file: !4, line: 87, baseType: !225, size: 528, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !637, file: !4, line: 88, baseType: !162, size: 64, offset: 704)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !637, file: !4, line: 90, baseType: !647, size: 64, offset: 768)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "orig_co", scope: !637, file: !4, line: 91, baseType: !647, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !637, file: !4, line: 92, baseType: !650, size: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !637, file: !4, line: 93, baseType: !165, size: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !637, file: !4, line: 94, baseType: !230, size: 32, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "maxvert", scope: !637, file: !4, line: 97, baseType: !230, size: 32, offset: 1056)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !637, file: !4, line: 98, baseType: !655, size: 64, offset: 1088)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "vert_hidden", scope: !637, file: !4, line: 99, baseType: !159, size: 64, offset: 1152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "maxgrid", scope: !637, file: !4, line: 102, baseType: !230, size: 32, offset: 1216)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gridsize", scope: !637, file: !4, line: 103, baseType: !230, size: 32, offset: 1248)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "totgrid", scope: !637, file: !4, line: 104, baseType: !230, size: 32, offset: 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "grids", scope: !637, file: !4, line: 105, baseType: !655, size: 64, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "grid_hidden", scope: !637, file: !4, line: 106, baseType: !662, size: 64, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bm_entry", scope: !637, file: !4, line: 109, baseType: !664, size: 64, offset: 1472)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLogEntry", file: !666, line: 34, flags: DIFlagFwdDecl)
!666 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!667 = !DIDerivedType(tag: DW_TAG_member, name: "applied", scope: !637, file: !4, line: 110, baseType: !613, size: 8, offset: 1536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_vdata", scope: !637, file: !4, line: 111, baseType: !622, size: 1600, offset: 1600)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_edata", scope: !637, file: !4, line: 112, baseType: !622, size: 1600, offset: 3200)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_ldata", scope: !637, file: !4, line: 113, baseType: !622, size: 1600, offset: 4800)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_pdata", scope: !637, file: !4, line: 114, baseType: !622, size: 1600, offset: 6400)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_totvert", scope: !637, file: !4, line: 115, baseType: !230, size: 32, offset: 8000)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_totedge", scope: !637, file: !4, line: 116, baseType: !230, size: 32, offset: 8032)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_totloop", scope: !637, file: !4, line: 117, baseType: !230, size: 32, offset: 8064)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bm_enter_totpoly", scope: !637, file: !4, line: 118, baseType: !230, size: 32, offset: 8096)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "shapeName", scope: !637, file: !4, line: 121, baseType: !245, size: 512, offset: 8128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHNode", file: !91, line: 47, baseType: !679)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVHNode", file: !91, line: 42, flags: DIFlagFwdDecl)
!680 = !{}
!681 = !DILocalVariable(name: "node", arg: 1, scope: !632, file: !1, line: 565, type: !677)
!682 = !DILocation(line: 565, column: 48, scope: !632)
!683 = !DILocalVariable(name: "lb", scope: !632, file: !1, line: 567, type: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!685 = !DILocation(line: 567, column: 12, scope: !632)
!686 = !DILocation(line: 567, column: 17, scope: !632)
!687 = !DILocation(line: 569, column: 7, scope: !688)
!688 = distinct !DILexicalBlock(scope: !632, file: !1, line: 569, column: 6)
!689 = !DILocation(line: 569, column: 6, scope: !632)
!690 = !DILocation(line: 570, column: 3, scope: !691)
!691 = distinct !DILexicalBlock(scope: !688, file: !1, line: 569, column: 11)
!692 = !DILocation(line: 573, column: 21, scope: !632)
!693 = !DILocation(line: 573, column: 25, scope: !632)
!694 = !DILocation(line: 573, column: 9, scope: !632)
!695 = !DILocation(line: 573, column: 2, scope: !632)
!696 = !DILocation(line: 574, column: 1, scope: !632)
!697 = distinct !DISubprogram(name: "sculpt_undo_push_node", scope: !1, file: !1, line: 813, type: !698, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !680)
!698 = !DISubroutineType(types: !699)
!699 = !{!635, !700, !677, !643}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !108, line: 295, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !108, line: 115, size: 11392, elements: !703)
!703 = !{!704, !705, !706, !917, !918, !919, !920, !921, !922, !923, !925, !926, !927, !928, !929, !930, !931, !945, !946, !986, !987, !990, !991, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1102, !1105, !1108, !1109, !1110, !1111, !1112, !1115, !1118, !1471, !1472, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1487, !1490, !1491, !2530, !2531}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !702, file: !108, line: 116, baseType: !197, size: 960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !702, file: !108, line: 117, baseType: !266, size: 64, offset: 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !702, file: !108, line: 119, baseType: !707, size: 64, offset: 1024)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !709, line: 155, size: 1856, elements: !710)
!709 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!710 = !{!711, !714, !715, !716, !717, !718, !719, !720, !721, !722, !726, !882, !883, !884, !885, !888, !891, !892, !893, !894, !895, !899, !900, !901, !902, !903, !906, !907, !910, !913, !914, !915, !916}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !708, file: !709, line: 157, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !103, line: 130, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !708, file: !709, line: 158, baseType: !500, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !708, file: !709, line: 159, baseType: !337, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !708, file: !709, line: 160, baseType: !442, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !708, file: !709, line: 161, baseType: !230, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !708, file: !709, line: 161, baseType: !230, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !708, file: !709, line: 162, baseType: !647, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !708, file: !709, line: 163, baseType: !296, size: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !708, file: !709, line: 164, baseType: !165, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !708, file: !709, line: 167, baseType: !723, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !57, line: 355, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !708, file: !709, line: 170, baseType: !727, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !729, line: 186, size: 8064, elements: !730)
!729 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !805, !809, !813, !814, !815, !816, !817, !818, !819, !820, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !728, file: !729, line: 187, baseType: !230, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !728, file: !729, line: 187, baseType: !230, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !728, file: !729, line: 187, baseType: !230, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !728, file: !729, line: 187, baseType: !230, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !728, file: !729, line: 188, baseType: !230, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !728, file: !729, line: 188, baseType: !230, size: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !728, file: !729, line: 188, baseType: !230, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !728, file: !729, line: 193, baseType: !164, size: 8, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !728, file: !729, line: 197, baseType: !164, size: 8, offset: 232)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !728, file: !729, line: 201, baseType: !570, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !728, file: !729, line: 201, baseType: !570, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !728, file: !729, line: 201, baseType: !570, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !728, file: !729, line: 201, baseType: !570, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !728, file: !729, line: 208, baseType: !745, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !729, line: 103, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !729, line: 90, size: 448, elements: !749)
!749 = !{!750, !759, !764, !765, !766}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !748, file: !729, line: 91, baseType: !751, size: 128)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !729, line: 82, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !729, line: 64, size: 128, elements: !753)
!753 = !{!754, !755, !756, !757, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !752, file: !729, line: 65, baseType: !162, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !752, file: !729, line: 66, baseType: !230, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !752, file: !729, line: 73, baseType: !164, size: 8, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !752, file: !729, line: 74, baseType: !164, size: 8, offset: 104)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !752, file: !729, line: 80, baseType: !164, size: 8, offset: 112)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !748, file: !729, line: 92, baseType: !760, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !729, line: 180, size: 16, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !761, file: !729, line: 181, baseType: !190, size: 16)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !748, file: !729, line: 94, baseType: !504, size: 96, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !748, file: !729, line: 95, baseType: !504, size: 96, offset: 288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !748, file: !729, line: 102, baseType: !767, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !729, line: 110, size: 640, elements: !769)
!769 = !{!770, !771, !772, !774, !775, !798, !804}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !768, file: !729, line: 111, baseType: !751, size: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !768, file: !729, line: 112, baseType: !760, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !768, file: !729, line: 114, baseType: !773, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !768, file: !729, line: 114, baseType: !773, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !768, file: !729, line: 118, baseType: !776, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !729, line: 125, size: 576, elements: !778)
!778 = !{!779, !780, !781, !782, !794, !795, !796, !797}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !777, file: !729, line: 126, baseType: !751, size: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !777, file: !729, line: 129, baseType: !773, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !777, file: !729, line: 130, baseType: !767, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !777, file: !729, line: 131, baseType: !783, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !729, line: 164, size: 448, elements: !785)
!785 = !{!786, !787, !788, !791, !792, !793}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !784, file: !729, line: 165, baseType: !751, size: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !784, file: !729, line: 166, baseType: !760, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !784, file: !729, line: 172, baseType: !789, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !729, line: 140, baseType: !777)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !784, file: !729, line: 174, baseType: !230, size: 32, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !784, file: !729, line: 175, baseType: !504, size: 96, offset: 288)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !784, file: !729, line: 176, baseType: !190, size: 16, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !777, file: !729, line: 135, baseType: !776, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !777, file: !729, line: 135, baseType: !776, size: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !729, line: 139, baseType: !776, size: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !777, file: !729, line: 139, baseType: !776, size: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !768, file: !729, line: 122, baseType: !799, size: 128, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !729, line: 108, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !729, line: 106, size: 128, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !729, line: 107, baseType: !767, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !800, file: !729, line: 107, baseType: !767, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !768, file: !729, line: 122, baseType: !799, size: 128, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !728, file: !729, line: 209, baseType: !806, size: 64, offset: 576)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !729, line: 123, baseType: !768)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !728, file: !729, line: 210, baseType: !810, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !729, line: 178, baseType: !784)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !728, file: !729, line: 213, baseType: !230, size: 32, offset: 704)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !728, file: !729, line: 214, baseType: !230, size: 32, offset: 736)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !728, file: !729, line: 215, baseType: !230, size: 32, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !728, file: !729, line: 218, baseType: !570, size: 64, offset: 832)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !728, file: !729, line: 218, baseType: !570, size: 64, offset: 896)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !728, file: !729, line: 218, baseType: !570, size: 64, offset: 960)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !728, file: !729, line: 220, baseType: !230, size: 32, offset: 1024)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !728, file: !729, line: 221, baseType: !821, size: 64, offset: 1088)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !19, line: 190, size: 10496, elements: !823)
!823 = !{!824, !856, !857, !863, !866, !867, !869}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !822, file: !19, line: 191, baseType: !825, size: 5120)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 5120, elements: !854)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !19, line: 147, size: 320, elements: !827)
!827 = !{!828, !831, !833, !843, !844}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !826, file: !19, line: 148, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !826, file: !19, line: 149, baseType: !832, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !19, line: 112, baseType: !18)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !826, file: !19, line: 150, baseType: !834, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !19, line: 142, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !19, line: 138, size: 32, elements: !836)
!836 = !{!837, !839, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !835, file: !19, line: 139, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !19, line: 122, baseType: !29)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !835, file: !19, line: 140, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !19, line: 136, baseType: !35)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !835, file: !19, line: 141, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !19, line: 130, baseType: !41)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !826, file: !19, line: 152, baseType: !230, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !826, file: !19, line: 162, baseType: !845, size: 128, offset: 192)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !826, file: !19, line: 155, size: 128, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !853}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !845, file: !19, line: 156, baseType: !230, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !845, file: !19, line: 157, baseType: !166, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !845, file: !19, line: 158, baseType: !162, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !845, file: !19, line: 159, baseType: !504, size: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !845, file: !19, line: 160, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !845, file: !19, line: 161, baseType: !177, size: 64)
!854 = !{!855}
!855 = !DISubrange(count: 16)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !822, file: !19, line: 192, baseType: !825, size: 5120, offset: 5120)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !822, file: !19, line: 193, baseType: !858, size: 64, offset: 10240)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !861, !821}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !729, line: 246, baseType: !728)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !822, file: !19, line: 194, baseType: !864, size: 64, offset: 10304)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !19, line: 194, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !822, file: !19, line: 195, baseType: !230, size: 32, offset: 10368)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !822, file: !19, line: 196, baseType: !868, size: 32, offset: 10400)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !19, line: 188, baseType: !49)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !822, file: !19, line: 197, baseType: !230, size: 32, offset: 10432)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !728, file: !729, line: 223, baseType: !622, size: 1600, offset: 1152)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !728, file: !729, line: 223, baseType: !622, size: 1600, offset: 2752)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !728, file: !729, line: 223, baseType: !622, size: 1600, offset: 4352)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !728, file: !729, line: 223, baseType: !622, size: 1600, offset: 5952)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !728, file: !729, line: 233, baseType: !190, size: 16, offset: 7552)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !728, file: !729, line: 236, baseType: !230, size: 32, offset: 7584)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !728, file: !729, line: 238, baseType: !230, size: 32, offset: 7616)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !728, file: !729, line: 238, baseType: !230, size: 32, offset: 7648)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !728, file: !729, line: 239, baseType: !255, size: 128, offset: 7680)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !728, file: !729, line: 241, baseType: !811, size: 64, offset: 7808)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !728, file: !729, line: 243, baseType: !255, size: 128, offset: 7872)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !728, file: !729, line: 245, baseType: !162, size: 64, offset: 8000)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !708, file: !709, line: 171, baseType: !230, size: 32, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !708, file: !709, line: 172, baseType: !230, size: 32, offset: 672)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !708, file: !709, line: 173, baseType: !613, size: 8, offset: 704)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !708, file: !709, line: 175, baseType: !886, size: 64, offset: 768)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !709, line: 175, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !708, file: !709, line: 178, baseType: !889, size: 64, offset: 832)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !57, line: 100, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !708, file: !709, line: 179, baseType: !613, size: 8, offset: 896)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !708, file: !709, line: 182, baseType: !613, size: 8, offset: 904)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !708, file: !709, line: 183, baseType: !647, size: 64, offset: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !708, file: !709, line: 184, baseType: !647, size: 64, offset: 1024)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !708, file: !709, line: 185, baseType: !896, size: 64, offset: 1088)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 288, elements: !898)
!898 = !{!277, !277}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !708, file: !709, line: 188, baseType: !613, size: 8, offset: 1152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !708, file: !709, line: 191, baseType: !5, size: 32, offset: 1184)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !708, file: !709, line: 191, baseType: !386, size: 64, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !708, file: !709, line: 191, baseType: !5, size: 32, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !708, file: !709, line: 192, baseType: !904, size: 64, offset: 1344)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !709, line: 61, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !708, file: !709, line: 195, baseType: !647, size: 64, offset: 1408)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !708, file: !709, line: 197, baseType: !908, size: 64, offset: 1472)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !709, line: 197, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !708, file: !709, line: 198, baseType: !911, size: 64, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !709, line: 59, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !708, file: !709, line: 201, baseType: !613, size: 8, offset: 1600)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !708, file: !709, line: 202, baseType: !504, size: 96, offset: 1632)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !708, file: !709, line: 204, baseType: !504, size: 96, offset: 1728)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !708, file: !709, line: 205, baseType: !230, size: 32, offset: 1824)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !108, line: 121, baseType: !190, size: 16, offset: 1088)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !702, file: !108, line: 121, baseType: !190, size: 16, offset: 1104)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !702, file: !108, line: 122, baseType: !230, size: 32, offset: 1120)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !702, file: !108, line: 122, baseType: !230, size: 32, offset: 1152)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !702, file: !108, line: 122, baseType: !230, size: 32, offset: 1184)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !702, file: !108, line: 123, baseType: !245, size: 512, offset: 1216)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !702, file: !108, line: 124, baseType: !924, size: 64, offset: 1728)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !702, file: !108, line: 124, baseType: !924, size: 64, offset: 1792)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !702, file: !108, line: 127, baseType: !924, size: 64, offset: 1856)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !702, file: !108, line: 127, baseType: !924, size: 64, offset: 1920)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !702, file: !108, line: 127, baseType: !924, size: 64, offset: 1984)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !702, file: !108, line: 128, baseType: !281, size: 64, offset: 2048)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !702, file: !108, line: 130, baseType: !270, size: 64, offset: 2112)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !702, file: !108, line: 131, baseType: !932, size: 64, offset: 2176)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !934, line: 486, size: 1600, elements: !935)
!934 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !933, file: !934, line: 487, baseType: !197, size: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !933, file: !934, line: 489, baseType: !255, size: 128, offset: 960)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !933, file: !934, line: 490, baseType: !255, size: 128, offset: 1088)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !933, file: !934, line: 491, baseType: !255, size: 128, offset: 1216)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !933, file: !934, line: 492, baseType: !255, size: 128, offset: 1344)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !933, file: !934, line: 494, baseType: !230, size: 32, offset: 1472)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !933, file: !934, line: 495, baseType: !230, size: 32, offset: 1504)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !933, file: !934, line: 497, baseType: !230, size: 32, offset: 1536)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !933, file: !934, line: 498, baseType: !230, size: 32, offset: 1568)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !702, file: !108, line: 132, baseType: !932, size: 64, offset: 2240)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !702, file: !108, line: 133, baseType: !947, size: 64, offset: 2304)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !934, line: 334, size: 1728, elements: !949)
!949 = !{!950, !951, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !985}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !948, file: !934, line: 335, baseType: !255, size: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !948, file: !934, line: 336, baseType: !952, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !948, file: !934, line: 338, baseType: !190, size: 16, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !948, file: !934, line: 338, baseType: !190, size: 16, offset: 208)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !948, file: !934, line: 339, baseType: !5, size: 32, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !948, file: !934, line: 340, baseType: !230, size: 32, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !948, file: !934, line: 342, baseType: !166, size: 32, offset: 288)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !948, file: !934, line: 343, baseType: !504, size: 96, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !948, file: !934, line: 344, baseType: !504, size: 96, offset: 416)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !948, file: !934, line: 347, baseType: !255, size: 128, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !948, file: !934, line: 349, baseType: !230, size: 32, offset: 640)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !948, file: !934, line: 350, baseType: !230, size: 32, offset: 672)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !948, file: !934, line: 351, baseType: !162, size: 64, offset: 704)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !948, file: !934, line: 352, baseType: !162, size: 64, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !948, file: !934, line: 354, baseType: !966, size: 384, offset: 832)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !934, line: 116, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !934, line: 94, size: 384, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !967, file: !934, line: 96, baseType: !230, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !967, file: !934, line: 96, baseType: !230, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !967, file: !934, line: 97, baseType: !230, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !967, file: !934, line: 97, baseType: !230, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !967, file: !934, line: 99, baseType: !190, size: 16, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !967, file: !934, line: 100, baseType: !190, size: 16, offset: 144)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !967, file: !934, line: 102, baseType: !190, size: 16, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !967, file: !934, line: 105, baseType: !190, size: 16, offset: 176)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !967, file: !934, line: 108, baseType: !190, size: 16, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !967, file: !934, line: 109, baseType: !190, size: 16, offset: 208)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !967, file: !934, line: 111, baseType: !190, size: 16, offset: 224)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !967, file: !934, line: 112, baseType: !190, size: 16, offset: 240)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !967, file: !934, line: 114, baseType: !230, size: 32, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !967, file: !934, line: 114, baseType: !230, size: 32, offset: 288)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !967, file: !934, line: 115, baseType: !230, size: 32, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !967, file: !934, line: 115, baseType: !230, size: 32, offset: 352)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !948, file: !934, line: 355, baseType: !245, size: 512, offset: 1216)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !702, file: !108, line: 134, baseType: !162, size: 64, offset: 2368)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !702, file: !108, line: 136, baseType: !988, size: 64, offset: 2432)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !108, line: 58, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !702, file: !108, line: 138, baseType: !966, size: 384, offset: 2496)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !702, file: !108, line: 139, baseType: !992, size: 64, offset: 2880)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !934, line: 80, baseType: !994)
