; ModuleID = 'blender/source/blender/blenkernel/intern/constraint.c'
source_filename = "blender/source/blender/blenkernel/intern/constraint.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bConstraintTypeInfo = type { i16, i16, [32 x i8], [32 x i8], void (%struct.bConstraint*)*, void (%struct.bConstraint*, void (%struct.bConstraint*, %struct.ID**, i8, i8*)*, i8*)*, void (%struct.bConstraint*, %struct.bConstraint*)*, void (i8*)*, i32 (%struct.bConstraint*, %struct.ListBase*)*, void (%struct.bConstraint*, %struct.ListBase*, i8)*, void (%struct.bConstraint*, %struct.bConstraintOb*, %struct.bConstraintTarget*, float)*, void (%struct.bConstraint*, %struct.bConstraintOb*, %struct.ListBase*)* }
%struct.bConstraint = type { %struct.bConstraint*, %struct.bConstraint*, i8*, i16, i16, i8, i8, [64 x i8], i16, float, float, %struct.Ipo*, float, float }
%struct.Ipo = type opaque
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 758, baseType: !7, size: 32, elements: !342)
!341 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = !{!343, !344, !345}
!343 = !DIEnumerator(name: "MOD_SHRINKWRAP_NEAREST_SURFACE", value: 0, isUnsigned: true)
!344 = !DIEnumerator(name: "MOD_SHRINKWRAP_PROJECT", value: 1, isUnsigned: true)
!345 = !DIEnumerator(name: "MOD_SHRINKWRAP_NEAREST_VERTEX", value: 2, isUnsigned: true)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSameVolume_Modes", file: !44, line: 581, baseType: !7, size: 32, elements: !347)
!347 = !{!348, !349, !350}
!348 = !DIEnumerator(name: "SAMEVOL_X", value: 0, isUnsigned: true)
!349 = !DIEnumerator(name: "SAMEVOL_Y", value: 1, isUnsigned: true)
!350 = !DIEnumerator(name: "SAMEVOL_Z", value: 2, isUnsigned: true)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ePivotConstraint_Axis", file: !44, line: 774, baseType: !352, size: 32, elements: !353)
!352 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!353 = !{!354, !355, !356, !357, !358, !359, !360}
!354 = !DIEnumerator(name: "PIVOTCON_AXIS_NONE", value: -1)
!355 = !DIEnumerator(name: "PIVOTCON_AXIS_X_NEG", value: 0)
!356 = !DIEnumerator(name: "PIVOTCON_AXIS_Y_NEG", value: 1)
!357 = !DIEnumerator(name: "PIVOTCON_AXIS_Z_NEG", value: 2)
!358 = !DIEnumerator(name: "PIVOTCON_AXIS_X", value: 3)
!359 = !DIEnumerator(name: "PIVOTCON_AXIS_Y", value: 4)
!360 = !DIEnumerator(name: "PIVOTCON_AXIS_Z", value: 5)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ePivotConstraint_Flag", file: !44, line: 794, baseType: !7, size: 32, elements: !362)
!362 = !{!363, !364}
!363 = !DIEnumerator(name: "PIVOTCON_FLAG_OFFSET_ABS", value: 1, isUnsigned: true)
!364 = !DIEnumerator(name: "PIVOTCON_FLAG_ROTACT_NEG", value: 2, isUnsigned: true)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFollowTrack_Flags", file: !44, line: 801, baseType: !7, size: 32, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIEnumerator(name: "FOLLOWTRACK_ACTIVECLIP", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "FOLLOWTRACK_USE_3D_POSITION", value: 2, isUnsigned: true)
!369 = !DIEnumerator(name: "FOLLOWTRACK_USE_UNDISTORTION", value: 4, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 380, baseType: !7, size: 32, elements: !372)
!371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!373 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!374 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!375 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!376 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!377 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!378 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!379 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!380 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!381 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!382 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!383 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 473, baseType: !7, size: 32, elements: !385)
!385 = !{!386}
!386 = !DIEnumerator(name: "TRACKING_OBJECT_CAMERA", value: 1, isUnsigned: true)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFollowTrack_FrameMethod", file: !44, line: 807, baseType: !7, size: 32, elements: !388)
!388 = !{!389, !390, !391}
!389 = !DIEnumerator(name: "FOLLOWTRACK_FRAME_STRETCH", value: 0, isUnsigned: true)
!390 = !DIEnumerator(name: "FOLLOWTRACK_FRAME_FIT", value: 1, isUnsigned: true)
!391 = !DIEnumerator(name: "FOLLOWTRACK_FRAME_CROP", value: 2, isUnsigned: true)
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eCameraSolver_Flags", file: !44, line: 814, baseType: !7, size: 32, elements: !393)
!393 = !{!394}
!394 = !DIEnumerator(name: "CAMERASOLVER_ACTIVECLIP", value: 1, isUnsigned: true)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eObjectSolver_Flags", file: !44, line: 819, baseType: !7, size: 32, elements: !396)
!396 = !{!397}
!397 = !DIEnumerator(name: "OBJECTSOLVER_ACTIVECLIP", value: 1, isUnsigned: true)
!398 = !{!399, !431, !2242, !2244, !2258, !2259, !417, !857, !2268, !2320, !420, !467, !2330, !2349, !2359, !2367, !2375, !2383, !2394, !2408, !2416, !2427, !2441, !2455, !352, !2476, !2498, !2509, !2517, !2527, !2533, !2544, !2551}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "bPoseChannel", file: !401, line: 243, baseType: !402)
!401 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPoseChannel", file: !401, line: 187, size: 4352, elements: !403)
!403 = !{!404, !406, !407, !443, !444, !445, !446, !447, !448, !449, !450, !451, !455, !500, !501, !502, !503, !504, !520, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !401, line: 188, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !402, file: !401, line: 188, baseType: !405, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !402, file: !401, line: 190, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !410, line: 75, baseType: !411)
!410 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !410, line: 62, size: 1024, elements: !412)
!412 = !{!413, !415, !416, !418, !419, !421, !425, !426, !441, !442}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !410, line: 63, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !411, file: !410, line: 63, baseType: !414, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !410, line: 64, baseType: !417, size: 8, offset: 128)
!417 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !411, file: !410, line: 64, baseType: !417, size: 8, offset: 136)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !411, file: !410, line: 65, baseType: !420, size: 16, offset: 144)
!420 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !410, line: 66, baseType: !422, size: 512, offset: 160)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 512, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !411, file: !410, line: 67, baseType: !352, size: 32, offset: 672)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !410, line: 69, baseType: !427, size: 256, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !410, line: 60, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !410, line: 48, size: 256, elements: !429)
!429 = !{!430, !432, !439, !440}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !428, file: !410, line: 49, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !428, file: !410, line: 58, baseType: !433, size: 128, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !434, line: 71, baseType: !435)
!434 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !434, line: 69, size: 128, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !435, file: !434, line: 70, baseType: !431, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !435, file: !434, line: 70, baseType: !431, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !428, file: !410, line: 59, baseType: !352, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !428, file: !410, line: 59, baseType: !352, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !411, file: !410, line: 70, baseType: !352, size: 32, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !411, file: !410, line: 74, baseType: !352, size: 32, offset: 992)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !402, file: !401, line: 192, baseType: !433, size: 128, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !402, file: !401, line: 193, baseType: !422, size: 512, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !401, line: 195, baseType: !420, size: 16, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ikflag", scope: !402, file: !401, line: 196, baseType: !420, size: 16, offset: 848)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !402, file: !401, line: 197, baseType: !420, size: 16, offset: 864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "agrp_index", scope: !402, file: !401, line: 198, baseType: !420, size: 16, offset: 880)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "constflag", scope: !402, file: !401, line: 199, baseType: !417, size: 8, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "selectflag", scope: !402, file: !401, line: 200, baseType: !417, size: 8, offset: 904)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !402, file: !401, line: 201, baseType: !452, size: 48, offset: 912)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 48, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 6)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bone", scope: !402, file: !401, line: 203, baseType: !456, size: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !458, line: 48, size: 2624, elements: !459)
!458 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !468, !472, !473, !476, !477, !478, !479, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !458, line: 49, baseType: !456, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !458, line: 49, baseType: !456, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !457, file: !458, line: 50, baseType: !408, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !457, file: !458, line: 51, baseType: !456, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !457, file: !458, line: 52, baseType: !433, size: 128, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !457, file: !458, line: 53, baseType: !422, size: 512, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !457, file: !458, line: 55, baseType: !467, size: 32, offset: 896)
!467 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !457, file: !458, line: 56, baseType: !469, size: 96, offset: 928)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 96, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 3)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !457, file: !458, line: 57, baseType: !469, size: 96, offset: 1024)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !457, file: !458, line: 58, baseType: !474, size: 288, offset: 1120)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 288, elements: !475)
!475 = !{!471, !471}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !458, line: 60, baseType: !352, size: 32, offset: 1408)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !457, file: !458, line: 62, baseType: !469, size: 96, offset: 1440)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !457, file: !458, line: 63, baseType: !469, size: 96, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !457, file: !458, line: 64, baseType: !480, size: 512, offset: 1632)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 512, elements: !481)
!481 = !{!482, !482}
!482 = !DISubrange(count: 4)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !457, file: !458, line: 65, baseType: !467, size: 32, offset: 2144)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !457, file: !458, line: 67, baseType: !467, size: 32, offset: 2176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !457, file: !458, line: 67, baseType: !467, size: 32, offset: 2208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !457, file: !458, line: 68, baseType: !467, size: 32, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !457, file: !458, line: 68, baseType: !467, size: 32, offset: 2272)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !457, file: !458, line: 68, baseType: !467, size: 32, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !457, file: !458, line: 69, baseType: !467, size: 32, offset: 2336)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !457, file: !458, line: 69, baseType: !467, size: 32, offset: 2368)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !457, file: !458, line: 70, baseType: !467, size: 32, offset: 2400)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !457, file: !458, line: 70, baseType: !467, size: 32, offset: 2432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !457, file: !458, line: 72, baseType: !469, size: 96, offset: 2464)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !457, file: !458, line: 73, baseType: !352, size: 32, offset: 2560)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !457, file: !458, line: 74, baseType: !420, size: 16, offset: 2592)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !457, file: !458, line: 75, baseType: !497, size: 16, offset: 2608)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 16, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 1)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !402, file: !401, line: 204, baseType: !405, size: 64, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !402, file: !401, line: 205, baseType: !405, size: 64, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "iktree", scope: !402, file: !401, line: 207, baseType: !435, size: 128, offset: 1152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "siktree", scope: !402, file: !401, line: 208, baseType: !435, size: 128, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !402, file: !401, line: 210, baseType: !505, size: 64, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !401, line: 80, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !401, line: 72, size: 192, elements: !508)
!508 = !{!509, !516, !517, !518, !519}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !507, file: !401, line: 73, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !401, line: 59, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !401, line: 56, size: 128, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !512, file: !401, line: 57, baseType: !469, size: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !401, line: 58, baseType: !352, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !507, file: !401, line: 74, baseType: !352, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !507, file: !401, line: 76, baseType: !352, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !507, file: !401, line: 77, baseType: !352, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !401, line: 79, baseType: !352, size: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !402, file: !401, line: 211, baseType: !521, size: 64, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !108, line: 115, size: 11392, elements: !523)
!523 = !{!524, !560, !563, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !580, !590, !603, !604, !645, !646, !649, !650, !651, !652, !653, !654, !655, !656, !657, !661, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !739, !740, !741, !742, !743, !744, !745, !746, !747, !750, !753, !756, !757, !758, !759, !760, !763, !786, !1274, !1275, !1281, !1282, !1283, !1284, !1285, !1286, !1288, !1291, !1294, !1296, !2209, !2210}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !522, file: !108, line: 116, baseType: !525, size: 960)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !410, line: 130, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !410, line: 117, size: 960, elements: !527)
!527 = !{!528, !529, !530, !532, !551, !555, !556, !557, !558, !559}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !410, line: 118, baseType: !431, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !410, line: 118, baseType: !431, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !526, file: !410, line: 119, baseType: !531, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !526, file: !410, line: 120, baseType: !533, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !410, line: 136, size: 17600, elements: !535)
!535 = !{!536, !537, !539, !542, !546, !547, !548}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !534, file: !410, line: 137, baseType: !525, size: 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !534, file: !410, line: 138, baseType: !538, size: 64, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !534, file: !410, line: 139, baseType: !540, size: 64, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !410, line: 43, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !534, file: !410, line: 140, baseType: !543, size: 8192, offset: 1088)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 8192, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 1024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !534, file: !410, line: 141, baseType: !543, size: 8192, offset: 9280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !534, file: !410, line: 148, baseType: !533, size: 64, offset: 17472)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !534, file: !410, line: 150, baseType: !549, size: 64, offset: 17536)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !410, line: 45, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !526, file: !410, line: 121, baseType: !552, size: 528, offset: 256)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 528, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 66)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !526, file: !410, line: 126, baseType: !420, size: 16, offset: 784)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !526, file: !410, line: 127, baseType: !352, size: 32, offset: 800)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !526, file: !410, line: 128, baseType: !352, size: 32, offset: 832)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !526, file: !410, line: 128, baseType: !352, size: 32, offset: 864)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !526, file: !410, line: 129, baseType: !408, size: 64, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !522, file: !108, line: 117, baseType: !561, size: 64, offset: 960)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !458, line: 37, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !522, file: !108, line: 119, baseType: !564, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !108, line: 57, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !522, file: !108, line: 121, baseType: !420, size: 16, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !522, file: !108, line: 121, baseType: !420, size: 16, offset: 1104)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !522, file: !108, line: 122, baseType: !352, size: 32, offset: 1120)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !522, file: !108, line: 122, baseType: !352, size: 32, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !522, file: !108, line: 122, baseType: !352, size: 32, offset: 1184)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !522, file: !108, line: 123, baseType: !422, size: 512, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !522, file: !108, line: 124, baseType: !521, size: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !522, file: !108, line: 124, baseType: !521, size: 64, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !522, file: !108, line: 127, baseType: !521, size: 64, offset: 1856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !522, file: !108, line: 127, baseType: !521, size: 64, offset: 1920)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !522, file: !108, line: 127, baseType: !521, size: 64, offset: 1984)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !522, file: !108, line: 128, baseType: !578, size: 64, offset: 2048)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !44, line: 42, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !522, file: !108, line: 130, baseType: !581, size: 64, offset: 2112)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !108, line: 97, size: 832, elements: !583)
!583 = !{!584, !588, !589}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !582, file: !108, line: 98, baseType: !585, size: 768)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 768, elements: !586)
!586 = !{!587, !471}
!587 = !DISubrange(count: 8)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !582, file: !108, line: 99, baseType: !352, size: 32, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !582, file: !108, line: 99, baseType: !352, size: 32, offset: 800)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !522, file: !108, line: 131, baseType: !591, size: 64, offset: 2176)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !401, line: 486, size: 1600, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !592, file: !401, line: 487, baseType: !525, size: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !592, file: !401, line: 489, baseType: !433, size: 128, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !592, file: !401, line: 490, baseType: !433, size: 128, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !592, file: !401, line: 491, baseType: !433, size: 128, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !592, file: !401, line: 492, baseType: !433, size: 128, offset: 1344)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !592, file: !401, line: 494, baseType: !352, size: 32, offset: 1472)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !592, file: !401, line: 495, baseType: !352, size: 32, offset: 1504)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !592, file: !401, line: 497, baseType: !352, size: 32, offset: 1536)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !592, file: !401, line: 498, baseType: !352, size: 32, offset: 1568)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !522, file: !108, line: 132, baseType: !591, size: 64, offset: 2240)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !522, file: !108, line: 133, baseType: !605, size: 64, offset: 2304)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !401, line: 334, size: 1728, elements: !607)
!607 = !{!608, !609, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !644}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !606, file: !401, line: 335, baseType: !433, size: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !606, file: !401, line: 336, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !401, line: 47, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !401, line: 338, baseType: !420, size: 16, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !606, file: !401, line: 338, baseType: !420, size: 16, offset: 208)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !606, file: !401, line: 339, baseType: !7, size: 32, offset: 224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !606, file: !401, line: 340, baseType: !352, size: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !606, file: !401, line: 342, baseType: !467, size: 32, offset: 288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !606, file: !401, line: 343, baseType: !469, size: 96, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !606, file: !401, line: 344, baseType: !469, size: 96, offset: 416)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !606, file: !401, line: 347, baseType: !433, size: 128, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !606, file: !401, line: 349, baseType: !352, size: 32, offset: 640)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !606, file: !401, line: 350, baseType: !352, size: 32, offset: 672)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !606, file: !401, line: 351, baseType: !431, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !606, file: !401, line: 352, baseType: !431, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !606, file: !401, line: 354, baseType: !625, size: 384, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !401, line: 116, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !401, line: 94, size: 384, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !626, file: !401, line: 96, baseType: !352, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !626, file: !401, line: 96, baseType: !352, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !626, file: !401, line: 97, baseType: !352, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !626, file: !401, line: 97, baseType: !352, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !626, file: !401, line: 99, baseType: !420, size: 16, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !626, file: !401, line: 100, baseType: !420, size: 16, offset: 144)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !626, file: !401, line: 102, baseType: !420, size: 16, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !626, file: !401, line: 105, baseType: !420, size: 16, offset: 176)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !626, file: !401, line: 108, baseType: !420, size: 16, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !626, file: !401, line: 109, baseType: !420, size: 16, offset: 208)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !626, file: !401, line: 111, baseType: !420, size: 16, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !626, file: !401, line: 112, baseType: !420, size: 16, offset: 240)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !626, file: !401, line: 114, baseType: !352, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !626, file: !401, line: 114, baseType: !352, size: 32, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !626, file: !401, line: 115, baseType: !352, size: 32, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !626, file: !401, line: 115, baseType: !352, size: 32, offset: 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !606, file: !401, line: 355, baseType: !422, size: 512, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !522, file: !108, line: 134, baseType: !431, size: 64, offset: 2368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !522, file: !108, line: 136, baseType: !647, size: 64, offset: 2432)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !108, line: 58, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !522, file: !108, line: 138, baseType: !625, size: 384, offset: 2496)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !522, file: !108, line: 139, baseType: !505, size: 64, offset: 2880)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !522, file: !108, line: 141, baseType: !433, size: 128, offset: 2944)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !522, file: !108, line: 142, baseType: !433, size: 128, offset: 3072)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !522, file: !108, line: 143, baseType: !433, size: 128, offset: 3200)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !522, file: !108, line: 144, baseType: !433, size: 128, offset: 3328)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !522, file: !108, line: 146, baseType: !352, size: 32, offset: 3456)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !522, file: !108, line: 147, baseType: !352, size: 32, offset: 3488)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !522, file: !108, line: 150, baseType: !658, size: 64, offset: 3520)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !108, line: 50, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !522, file: !108, line: 151, baseType: !662, size: 64, offset: 3584)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !522, file: !108, line: 152, baseType: !352, size: 32, offset: 3648)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !522, file: !108, line: 153, baseType: !352, size: 32, offset: 3680)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !522, file: !108, line: 156, baseType: !469, size: 96, offset: 3712)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !522, file: !108, line: 156, baseType: !469, size: 96, offset: 3808)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !522, file: !108, line: 156, baseType: !469, size: 96, offset: 3904)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !522, file: !108, line: 157, baseType: !469, size: 96, offset: 4000)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !522, file: !108, line: 158, baseType: !469, size: 96, offset: 4096)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !522, file: !108, line: 159, baseType: !469, size: 96, offset: 4192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !522, file: !108, line: 160, baseType: !469, size: 96, offset: 4288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !522, file: !108, line: 160, baseType: !469, size: 96, offset: 4384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !522, file: !108, line: 161, baseType: !674, size: 128, offset: 4480)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 128, elements: !675)
!675 = !{!482}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !522, file: !108, line: 161, baseType: !674, size: 128, offset: 4608)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !522, file: !108, line: 162, baseType: !469, size: 96, offset: 4736)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !522, file: !108, line: 162, baseType: !469, size: 96, offset: 4832)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !522, file: !108, line: 163, baseType: !467, size: 32, offset: 4928)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !522, file: !108, line: 163, baseType: !467, size: 32, offset: 4960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !522, file: !108, line: 164, baseType: !480, size: 512, offset: 4992)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !522, file: !108, line: 165, baseType: !480, size: 512, offset: 5504)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !522, file: !108, line: 166, baseType: !480, size: 512, offset: 6016)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !522, file: !108, line: 167, baseType: !480, size: 512, offset: 6528)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !522, file: !108, line: 176, baseType: !480, size: 512, offset: 7040)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !522, file: !108, line: 178, baseType: !7, size: 32, offset: 7552)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !108, line: 180, baseType: !420, size: 16, offset: 7584)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !522, file: !108, line: 181, baseType: !420, size: 16, offset: 7600)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !522, file: !108, line: 183, baseType: !420, size: 16, offset: 7616)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !522, file: !108, line: 183, baseType: !420, size: 16, offset: 7632)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !522, file: !108, line: 184, baseType: !420, size: 16, offset: 7648)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !522, file: !108, line: 184, baseType: !420, size: 16, offset: 7664)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !522, file: !108, line: 185, baseType: !420, size: 16, offset: 7680)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !522, file: !108, line: 186, baseType: !420, size: 16, offset: 7696)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !522, file: !108, line: 187, baseType: !420, size: 16, offset: 7712)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !522, file: !108, line: 188, baseType: !417, size: 8, offset: 7728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !522, file: !108, line: 189, baseType: !417, size: 8, offset: 7736)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !522, file: !108, line: 192, baseType: !352, size: 32, offset: 7744)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !522, file: !108, line: 192, baseType: !352, size: 32, offset: 7776)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !522, file: !108, line: 192, baseType: !352, size: 32, offset: 7808)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !522, file: !108, line: 192, baseType: !352, size: 32, offset: 7840)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !522, file: !108, line: 194, baseType: !352, size: 32, offset: 7872)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !522, file: !108, line: 202, baseType: !467, size: 32, offset: 7904)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !522, file: !108, line: 202, baseType: !467, size: 32, offset: 7936)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !522, file: !108, line: 202, baseType: !467, size: 32, offset: 7968)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !522, file: !108, line: 211, baseType: !467, size: 32, offset: 8000)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !522, file: !108, line: 212, baseType: !467, size: 32, offset: 8032)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !522, file: !108, line: 213, baseType: !467, size: 32, offset: 8064)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !522, file: !108, line: 214, baseType: !467, size: 32, offset: 8096)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !522, file: !108, line: 215, baseType: !467, size: 32, offset: 8128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !522, file: !108, line: 216, baseType: !467, size: 32, offset: 8160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !522, file: !108, line: 219, baseType: !467, size: 32, offset: 8192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !522, file: !108, line: 220, baseType: !467, size: 32, offset: 8224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !522, file: !108, line: 221, baseType: !467, size: 32, offset: 8256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !522, file: !108, line: 224, baseType: !716, size: 16, offset: 8288)
!716 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !522, file: !108, line: 224, baseType: !716, size: 16, offset: 8304)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !522, file: !108, line: 226, baseType: !420, size: 16, offset: 8320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !522, file: !108, line: 228, baseType: !417, size: 8, offset: 8336)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !522, file: !108, line: 229, baseType: !417, size: 8, offset: 8344)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !522, file: !108, line: 231, baseType: !420, size: 16, offset: 8352)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !522, file: !108, line: 232, baseType: !417, size: 8, offset: 8368)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !522, file: !108, line: 233, baseType: !417, size: 8, offset: 8376)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !522, file: !108, line: 234, baseType: !467, size: 32, offset: 8384)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !522, file: !108, line: 235, baseType: !467, size: 32, offset: 8416)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !522, file: !108, line: 237, baseType: !433, size: 128, offset: 8448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !522, file: !108, line: 238, baseType: !433, size: 128, offset: 8576)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !522, file: !108, line: 239, baseType: !433, size: 128, offset: 8704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !522, file: !108, line: 240, baseType: !433, size: 128, offset: 8832)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !522, file: !108, line: 242, baseType: !467, size: 32, offset: 8960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !522, file: !108, line: 244, baseType: !420, size: 16, offset: 8992)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !522, file: !108, line: 245, baseType: !716, size: 16, offset: 9008)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !522, file: !108, line: 246, baseType: !674, size: 128, offset: 9024)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !522, file: !108, line: 248, baseType: !352, size: 32, offset: 9152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !522, file: !108, line: 249, baseType: !352, size: 32, offset: 9184)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !522, file: !108, line: 251, baseType: !737, size: 64, offset: 9216)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !108, line: 251, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !522, file: !108, line: 253, baseType: !417, size: 8, offset: 9280)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !522, file: !108, line: 254, baseType: !417, size: 8, offset: 9288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !522, file: !108, line: 255, baseType: !420, size: 16, offset: 9296)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !522, file: !108, line: 256, baseType: !469, size: 96, offset: 9312)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !522, file: !108, line: 258, baseType: !433, size: 128, offset: 9408)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !522, file: !108, line: 259, baseType: !433, size: 128, offset: 9536)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !522, file: !108, line: 260, baseType: !433, size: 128, offset: 9664)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !522, file: !108, line: 261, baseType: !433, size: 128, offset: 9792)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !522, file: !108, line: 263, baseType: !748, size: 64, offset: 9920)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !108, line: 52, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !522, file: !108, line: 264, baseType: !751, size: 64, offset: 9984)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !108, line: 53, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !522, file: !108, line: 265, baseType: !754, size: 64, offset: 10048)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !401, line: 46, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !522, file: !108, line: 267, baseType: !417, size: 8, offset: 10112)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !522, file: !108, line: 268, baseType: !417, size: 8, offset: 10120)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !522, file: !108, line: 269, baseType: !420, size: 16, offset: 10128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !522, file: !108, line: 270, baseType: !467, size: 32, offset: 10144)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !522, file: !108, line: 272, baseType: !761, size: 64, offset: 10176)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !341, line: 732, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !522, file: !108, line: 275, baseType: !764, size: 64, offset: 10240)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !766, line: 49, size: 448, elements: !767)
!766 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!767 = !{!768, !769, !770, !771}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !765, file: !766, line: 50, baseType: !433, size: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !765, file: !766, line: 51, baseType: !433, size: 128, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !765, file: !766, line: 52, baseType: !433, size: 128, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !765, file: !766, line: 53, baseType: !772, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !774, line: 65, size: 128, elements: !775)
!774 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!775 = !{!776, !784, !785}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !773, file: !774, line: 66, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !774, line: 56, size: 320, elements: !779)
!779 = !{!780, !781, !782, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !778, file: !774, line: 57, baseType: !674, size: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !778, file: !774, line: 58, baseType: !674, size: 128, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !778, file: !774, line: 59, baseType: !467, size: 32, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !778, file: !774, line: 59, baseType: !467, size: 32, offset: 288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !773, file: !774, line: 67, baseType: !352, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !773, file: !774, line: 68, baseType: !467, size: 32, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !522, file: !108, line: 277, baseType: !787, size: 64, offset: 10304)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 178, size: 13504, elements: !789)
!789 = !{!790, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !842, !845, !847, !848, !850, !851, !852, !853, !859, !864, !865, !869, !870, !871, !872, !873, !886, !898, !912, !916, !920, !924, !933, !945, !949, !953, !957, !961, !965, !966, !967, !968, !969, !970, !974, !975, !976, !977, !981, !982, !983, !984, !985, !990, !991, !992, !993, !994, !998, !999, !1000, !1001, !1002, !1009, !1020, !1025, !1031, !1041, !1047, !1058, !1065, !1072, !1076, !1081, !1085, !1090, !1091, !1092, !1099, !1105, !1106, !1107, !1112, !1113, !1122, !1231, !1235, !1243, !1247, !1251, !1255, !1263, !1273}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !788, file: !6, line: 180, baseType: !791, size: 1600)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !166, line: 73, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !166, line: 64, size: 1600, elements: !793)
!793 = !{!794, !809, !813, !814, !815, !816, !819}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !792, file: !166, line: 65, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !166, line: 53, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !166, line: 42, size: 832, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !797, file: !166, line: 43, baseType: !352, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !797, file: !166, line: 44, baseType: !352, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !797, file: !166, line: 45, baseType: !352, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !797, file: !166, line: 46, baseType: !352, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !797, file: !166, line: 47, baseType: !352, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !797, file: !166, line: 48, baseType: !352, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !797, file: !166, line: 49, baseType: !352, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !797, file: !166, line: 50, baseType: !352, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !166, line: 51, baseType: !422, size: 512, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !166, line: 52, baseType: !431, size: 64, offset: 768)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !792, file: !166, line: 66, baseType: !810, size: 1312, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 1312, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 41)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !792, file: !166, line: 69, baseType: !352, size: 32, offset: 1376)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !792, file: !166, line: 69, baseType: !352, size: 32, offset: 1408)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !792, file: !166, line: 70, baseType: !352, size: 32, offset: 1440)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !792, file: !166, line: 71, baseType: !817, size: 64, offset: 1472)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !166, line: 71, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !792, file: !166, line: 72, baseType: !820, size: 64, offset: 1536)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !166, line: 59, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !166, line: 57, size: 8192, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !822, file: !166, line: 58, baseType: !543, size: 8192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !788, file: !6, line: 180, baseType: !791, size: 1600, offset: 1600)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !788, file: !6, line: 180, baseType: !791, size: 1600, offset: 3200)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !788, file: !6, line: 180, baseType: !791, size: 1600, offset: 4800)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !788, file: !6, line: 180, baseType: !791, size: 1600, offset: 6400)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !788, file: !6, line: 181, baseType: !352, size: 32, offset: 8000)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !788, file: !6, line: 181, baseType: !352, size: 32, offset: 8032)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !788, file: !6, line: 181, baseType: !352, size: 32, offset: 8064)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !788, file: !6, line: 181, baseType: !352, size: 32, offset: 8096)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !788, file: !6, line: 181, baseType: !352, size: 32, offset: 8128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !788, file: !6, line: 182, baseType: !352, size: 32, offset: 8160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !788, file: !6, line: 183, baseType: !352, size: 32, offset: 8192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !788, file: !6, line: 184, baseType: !837, size: 64, offset: 8256)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !838, line: 124, baseType: !839)
!838 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !841, line: 118, flags: DIFlagFwdDecl)
!841 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!842 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !788, file: !6, line: 185, baseType: !843, size: 64, offset: 8320)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !6, line: 97, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !788, file: !6, line: 186, baseType: !846, size: 32, offset: 8384)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !6, line: 132, baseType: !5)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !788, file: !6, line: 187, baseType: !467, size: 32, offset: 8416)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !788, file: !6, line: 188, baseType: !849, size: 32, offset: 8448)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !6, line: 175, baseType: !12)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !788, file: !6, line: 189, baseType: !352, size: 32, offset: 8480)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !788, file: !6, line: 190, baseType: !658, size: 64, offset: 8512)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !788, file: !6, line: 193, baseType: !417, size: 8, offset: 8576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !788, file: !6, line: 196, baseType: !854, size: 64, offset: 8640)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !6, line: 177, baseType: !788)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !788, file: !6, line: 199, baseType: !860, size: 64, offset: 8704)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !857, !863}
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !788, file: !6, line: 202, baseType: !854, size: 64, offset: 8768)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !788, file: !6, line: 207, baseType: !866, size: 64, offset: 8832)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!352, !857}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !788, file: !6, line: 208, baseType: !866, size: 64, offset: 8896)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !788, file: !6, line: 209, baseType: !866, size: 64, offset: 8960)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !788, file: !6, line: 210, baseType: !866, size: 64, offset: 9024)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !788, file: !6, line: 211, baseType: !866, size: 64, offset: 9088)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !788, file: !6, line: 218, baseType: !874, size: 64, offset: 9152)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !857, !352, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !879, line: 65, size: 160, elements: !880)
!879 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!880 = !{!881, !882, !884, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !878, file: !879, line: 66, baseType: !469, size: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !878, file: !879, line: 67, baseType: !883, size: 48, offset: 96)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 48, elements: !470)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !878, file: !879, line: 68, baseType: !417, size: 8, offset: 144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !878, file: !879, line: 68, baseType: !417, size: 8, offset: 152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !788, file: !6, line: 219, baseType: !887, size: 64, offset: 9216)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !857, !352, !890}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !879, line: 48, size: 96, elements: !892)
!892 = !{!893, !894, !895, !896, !897}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !891, file: !879, line: 49, baseType: !7, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !891, file: !879, line: 49, baseType: !7, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !891, file: !879, line: 50, baseType: !417, size: 8, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !891, file: !879, line: 50, baseType: !417, size: 8, offset: 72)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !891, file: !879, line: 51, baseType: !420, size: 16, offset: 80)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !788, file: !6, line: 220, baseType: !899, size: 64, offset: 9280)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !857, !352, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !879, line: 42, size: 160, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !903, file: !879, line: 43, baseType: !7, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !903, file: !879, line: 43, baseType: !7, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !903, file: !879, line: 43, baseType: !7, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !903, file: !879, line: 43, baseType: !7, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !903, file: !879, line: 44, baseType: !420, size: 16, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !903, file: !879, line: 45, baseType: !417, size: 8, offset: 144)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !903, file: !879, line: 45, baseType: !417, size: 8, offset: 152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !788, file: !6, line: 227, baseType: !913, size: 64, offset: 9344)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!877, !857}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !788, file: !6, line: 228, baseType: !917, size: 64, offset: 9408)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!890, !857}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !788, file: !6, line: 229, baseType: !921, size: 64, offset: 9472)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!902, !857}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !788, file: !6, line: 230, baseType: !925, size: 64, offset: 9536)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!928, !857}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !879, line: 88, size: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !929, file: !879, line: 89, baseType: !7, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !929, file: !879, line: 90, baseType: !7, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !788, file: !6, line: 231, baseType: !934, size: 64, offset: 9600)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!937, !857}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !879, line: 79, size: 96, elements: !939)
!939 = !{!940, !941, !942, !943, !944}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !938, file: !879, line: 81, baseType: !352, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !938, file: !879, line: 82, baseType: !352, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !938, file: !879, line: 83, baseType: !420, size: 16, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !938, file: !879, line: 84, baseType: !417, size: 8, offset: 80)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !938, file: !879, line: 84, baseType: !417, size: 8, offset: 88)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !788, file: !6, line: 236, baseType: !946, size: 64, offset: 9664)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !857, !877}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !788, file: !6, line: 237, baseType: !950, size: 64, offset: 9728)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !857, !890}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !788, file: !6, line: 238, baseType: !954, size: 64, offset: 9792)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !857, !902}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !788, file: !6, line: 239, baseType: !958, size: 64, offset: 9856)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !857, !928}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !788, file: !6, line: 240, baseType: !962, size: 64, offset: 9920)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !857, !937}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !788, file: !6, line: 245, baseType: !913, size: 64, offset: 9984)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !788, file: !6, line: 246, baseType: !917, size: 64, offset: 10048)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !788, file: !6, line: 247, baseType: !921, size: 64, offset: 10112)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !788, file: !6, line: 248, baseType: !925, size: 64, offset: 10176)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !788, file: !6, line: 249, baseType: !934, size: 64, offset: 10240)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !788, file: !6, line: 255, baseType: !971, size: 64, offset: 10304)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!431, !857, !352, !352}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !788, file: !6, line: 256, baseType: !971, size: 64, offset: 10368)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !788, file: !6, line: 257, baseType: !971, size: 64, offset: 10432)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !788, file: !6, line: 258, baseType: !971, size: 64, offset: 10496)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !788, file: !6, line: 264, baseType: !978, size: 64, offset: 10560)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!431, !857, !352}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !788, file: !6, line: 265, baseType: !978, size: 64, offset: 10624)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !788, file: !6, line: 266, baseType: !978, size: 64, offset: 10688)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !788, file: !6, line: 267, baseType: !978, size: 64, offset: 10752)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !788, file: !6, line: 268, baseType: !978, size: 64, offset: 10816)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !788, file: !6, line: 272, baseType: !986, size: 64, offset: 10880)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!989, !857}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !788, file: !6, line: 273, baseType: !986, size: 64, offset: 10944)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !788, file: !6, line: 274, baseType: !986, size: 64, offset: 11008)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !788, file: !6, line: 275, baseType: !986, size: 64, offset: 11072)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !788, file: !6, line: 276, baseType: !986, size: 64, offset: 11136)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !788, file: !6, line: 279, baseType: !995, size: 64, offset: 11200)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !857, !352, !989, !352}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !788, file: !6, line: 280, baseType: !995, size: 64, offset: 11264)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !788, file: !6, line: 281, baseType: !995, size: 64, offset: 11328)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !788, file: !6, line: 284, baseType: !866, size: 64, offset: 11392)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !788, file: !6, line: 285, baseType: !866, size: 64, offset: 11456)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !788, file: !6, line: 286, baseType: !1003, size: 64, offset: 11520)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1006, !857}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !6, line: 82, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !788, file: !6, line: 287, baseType: !1010, size: 64, offset: 11584)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!1013, !857}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !6, line: 120, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !6, line: 117, size: 256, elements: !1016)
!1016 = !{!1017, !1019}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1015, file: !6, line: 118, baseType: !1018, size: 128)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 128, elements: !675)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !1015, file: !6, line: 119, baseType: !1018, size: 128, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !788, file: !6, line: 288, baseType: !1021, size: 64, offset: 11648)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024, !857}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !788, file: !6, line: 289, baseType: !1026, size: 64, offset: 11712)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !857, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !6, line: 83, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !788, file: !6, line: 290, baseType: !1032, size: 64, offset: 11776)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1035, !857}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !6, line: 126, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !6, line: 123, size: 32, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1037, file: !6, line: 124, baseType: !420, size: 16)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1037, file: !6, line: 125, baseType: !417, size: 8, offset: 16)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !788, file: !6, line: 291, baseType: !1042, size: 64, offset: 11840)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1045, !857}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !788, file: !6, line: 299, baseType: !1048, size: 64, offset: 11904)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !857, !1051, !431, !1057}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !431, !352, !1054, !1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !6, line: 162, baseType: !17)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !788, file: !6, line: 309, baseType: !1059, size: 64, offset: 11968)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{null, !857, !1062, !431}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !431, !352, !1054, !1054}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !788, file: !6, line: 317, baseType: !1066, size: 64, offset: 12032)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !857, !1069, !431, !1057}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{null, !431, !352, !352, !1054, !1054}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !788, file: !6, line: 327, baseType: !1073, size: 64, offset: 12096)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !857, !1062, !431, !1057}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !788, file: !6, line: 337, baseType: !1077, size: 64, offset: 12160)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !857, !1080, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !788, file: !6, line: 344, baseType: !1082, size: 64, offset: 12224)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !857, !352, !1080}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !788, file: !6, line: 347, baseType: !1086, size: 64, offset: 12288)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{null, !857, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !788, file: !6, line: 350, baseType: !1082, size: 64, offset: 12352)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !788, file: !6, line: 351, baseType: !1082, size: 64, offset: 12416)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !788, file: !6, line: 355, baseType: !1093, size: 64, offset: 12480)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!1096, !521, !857}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !6, line: 355, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !788, file: !6, line: 359, baseType: !1100, size: 64, offset: 12544)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!1103, !521, !857}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !6, line: 100, flags: DIFlagFwdDecl)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !788, file: !6, line: 364, baseType: !854, size: 64, offset: 12608)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !788, file: !6, line: 367, baseType: !854, size: 64, offset: 12672)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !788, file: !6, line: 373, baseType: !1108, size: 64, offset: 12736)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !857, !1111, !1111}
!1111 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !788, file: !6, line: 376, baseType: !854, size: 64, offset: 12800)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !788, file: !6, line: 385, baseType: !1114, size: 64, offset: 12864)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !857, !1117, !1111, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !6, line: 146, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!352, !352, !431}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !788, file: !6, line: 391, baseType: !1123, size: 64, offset: 12928)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !857, !1126, !1226, !431, !1230}
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !6, line: 150, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!1130, !1131, !1225, !352}
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !6, line: 143, baseType: !21)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !879, line: 160, size: 384, elements: !1133)
!1133 = !{!1134, !1138, !1220, !1221, !1222, !1223, !1224}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !1132, file: !879, line: 161, baseType: !1135, size: 256)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 256, elements: !1136)
!1136 = !{!482, !1137}
!1137 = !DISubrange(count: 2)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !1132, file: !879, line: 162, baseType: !1139, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1141, line: 77, size: 15424, elements: !1142)
!1141 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1142 = !{!1143, !1144, !1145, !1148, !1151, !1154, !1157, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1209, !1210, !1214}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1140, file: !1141, line: 78, baseType: !525, size: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1140, file: !1141, line: 80, baseType: !543, size: 8192, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1140, file: !1141, line: 82, baseType: !1146, size: 64, offset: 9152)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1141, line: 43, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1140, file: !1141, line: 83, baseType: !1149, size: 64, offset: 9216)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !410, line: 46, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1140, file: !1141, line: 86, baseType: !1152, size: 64, offset: 9280)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1141, line: 41, flags: DIFlagFwdDecl)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1140, file: !1141, line: 87, baseType: !1155, size: 64, offset: 9344)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1141, line: 44, flags: DIFlagFwdDecl)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1140, file: !1141, line: 89, baseType: !1158, size: 512, offset: 9408)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 512, elements: !1159)
!1159 = !{!587}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1140, file: !1141, line: 90, baseType: !420, size: 16, offset: 9920)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1140, file: !1141, line: 90, baseType: !420, size: 16, offset: 9936)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1140, file: !1141, line: 92, baseType: !420, size: 16, offset: 9952)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1140, file: !1141, line: 92, baseType: !420, size: 16, offset: 9968)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1140, file: !1141, line: 93, baseType: !420, size: 16, offset: 9984)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1140, file: !1141, line: 93, baseType: !420, size: 16, offset: 10000)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1140, file: !1141, line: 94, baseType: !352, size: 32, offset: 10016)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1140, file: !1141, line: 97, baseType: !420, size: 16, offset: 10048)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1140, file: !1141, line: 97, baseType: !420, size: 16, offset: 10064)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1140, file: !1141, line: 98, baseType: !420, size: 16, offset: 10080)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1140, file: !1141, line: 98, baseType: !420, size: 16, offset: 10096)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1140, file: !1141, line: 99, baseType: !420, size: 16, offset: 10112)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1140, file: !1141, line: 99, baseType: !420, size: 16, offset: 10128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1140, file: !1141, line: 100, baseType: !7, size: 32, offset: 10144)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1140, file: !1141, line: 101, baseType: !1046, size: 64, offset: 10176)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1140, file: !1141, line: 103, baseType: !549, size: 64, offset: 10240)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1140, file: !1141, line: 104, baseType: !1177, size: 64, offset: 10304)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !410, line: 159, size: 448, elements: !1179)
!1179 = !{!1180, !1183, !1184, !1186, !1187, !1189}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1178, file: !410, line: 161, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1182)
!1182 = !{!1137}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1178, file: !410, line: 162, baseType: !1181, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1178, file: !410, line: 163, baseType: !1185, size: 32, offset: 128)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 32, elements: !1182)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1178, file: !410, line: 164, baseType: !1185, size: 32, offset: 160)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1178, file: !410, line: 165, baseType: !1188, size: 128, offset: 192)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 128, elements: !1182)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1178, file: !410, line: 166, baseType: !1190, size: 128, offset: 320)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 128, elements: !1182)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1140, file: !1141, line: 107, baseType: !467, size: 32, offset: 10368)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1140, file: !1141, line: 108, baseType: !352, size: 32, offset: 10400)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1140, file: !1141, line: 109, baseType: !420, size: 16, offset: 10432)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1140, file: !1141, line: 110, baseType: !420, size: 16, offset: 10448)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1140, file: !1141, line: 113, baseType: !352, size: 32, offset: 10464)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1140, file: !1141, line: 113, baseType: !352, size: 32, offset: 10496)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1140, file: !1141, line: 114, baseType: !417, size: 8, offset: 10528)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1140, file: !1141, line: 114, baseType: !417, size: 8, offset: 10536)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1140, file: !1141, line: 115, baseType: !420, size: 16, offset: 10544)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1140, file: !1141, line: 116, baseType: !674, size: 128, offset: 10560)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1140, file: !1141, line: 119, baseType: !467, size: 32, offset: 10688)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1140, file: !1141, line: 119, baseType: !467, size: 32, offset: 10720)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1140, file: !1141, line: 122, baseType: !1204, size: 512, offset: 10752)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1205, line: 182, baseType: !1206)
!1205 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1205, line: 180, size: 512, elements: !1207)
!1207 = !{!1208}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1206, file: !1205, line: 181, baseType: !422, size: 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1140, file: !1141, line: 123, baseType: !417, size: 8, offset: 11264)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1140, file: !1141, line: 125, baseType: !1211, size: 56, offset: 11272)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 56, elements: !1212)
!1212 = !{!1213}
!1213 = !DISubrange(count: 7)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1140, file: !1141, line: 126, baseType: !1215, size: 4096, offset: 11328)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1216, size: 4096, elements: !1159)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1141, line: 69, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1141, line: 67, size: 512, elements: !1218)
!1218 = !{!1219}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1217, file: !1141, line: 68, baseType: !422, size: 512)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1132, file: !879, line: 163, baseType: !417, size: 8, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !1132, file: !879, line: 163, baseType: !417, size: 8, offset: 328)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1132, file: !879, line: 164, baseType: !420, size: 16, offset: 336)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1132, file: !879, line: 164, baseType: !420, size: 16, offset: 352)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !1132, file: !879, line: 164, baseType: !420, size: 16, offset: 368)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !6, line: 147, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!352, !431, !352, !352}
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !6, line: 157, baseType: !27)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !788, file: !6, line: 400, baseType: !1232, size: 64, offset: 12992)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !857, !1118}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !788, file: !6, line: 415, baseType: !1236, size: 64, offset: 13056)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !857, !1239, !1118, !1226, !431, !1230}
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !6, line: 149, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1130, !431, !352}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !788, file: !6, line: 425, baseType: !1244, size: 64, offset: 13120)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !857, !1239, !1226, !431, !1230}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !788, file: !6, line: 435, baseType: !1248, size: 64, offset: 13184)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{null, !857, !1118, !1239, !431}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !788, file: !6, line: 444, baseType: !1252, size: 64, offset: 13248)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !857, !1239, !431}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !788, file: !6, line: 455, baseType: !1256, size: 64, offset: 13312)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !857, !1239, !1259, !431}
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !6, line: 148, baseType: !1260)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !431, !352, !467}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !788, file: !6, line: 464, baseType: !1264, size: 64, offset: 13376)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{null, !857, !1267, !1270, !431}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{null, !431, !352, !431}
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!1111, !431, !352}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !788, file: !6, line: 470, baseType: !854, size: 64, offset: 13440)
