; ModuleID = 'libpng/pngread.c'
source_filename = "libpng/pngread.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "libpng/pngread.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !63, !126, !26, !57, !436, !108, !83, !67, !377}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !6, line: 851, baseType: !7)
!6 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !6, line: 849, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !10, line: 29, size: 9728, elements: !11)
!10 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!11 = !{!12, !39, !45, !55, !56, !58, !70, !71, !72, !90, !91, !92, !93, !94, !95, !96, !97, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !175, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !198, !199, !200, !203, !212, !213, !218, !219, !220, !221, !222, !223, !224, !228, !229, !230, !231, !232, !241, !242, !243, !244, !249, !251, !379, !384, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !412, !413, !414, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !435, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !9, file: !10, line: 32, baseType: !13, size: 1600)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !14, line: 45, baseType: !15)
!14 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 1600, elements: !37)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !14, line: 33, size: 1600, elements: !17)
!17 = !{!18, !25, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !16, file: !14, line: 39, baseType: !19, size: 512)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !20, line: 31, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, elements: !23)
!22 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!23 = !{!24}
!24 = !DISubrange(count: 8)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !16, file: !14, line: 40, baseType: !26, size: 32, offset: 512)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !16, file: !14, line: 41, baseType: !28, size: 1024, offset: 576)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !29, line: 8, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 5, size: 1024, elements: !31)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !30, file: !29, line: 7, baseType: !33, size: 1024)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1024, elements: !35)
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !{!36}
!36 = !DISubrange(count: 16)
!37 = !{!38}
!38 = !DISubrange(count: 1)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !9, file: !10, line: 33, baseType: !40, size: 64, offset: 1600)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !6, line: 913, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44, !26}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !9, file: !10, line: 35, baseType: !46, size: 64, offset: 1664)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !6, line: 861, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !5, !50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !51, line: 537, baseType: !52)
!51 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !9, file: !10, line: 37, baseType: !46, size: 64, offset: 1728)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !9, file: !10, line: 39, baseType: !57, size: 64, offset: 1792)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !51, line: 524, baseType: !4)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !9, file: !10, line: 40, baseType: !59, size: 64, offset: 1856)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !6, line: 862, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !5, !63, !67}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !51, line: 526, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !51, line: 449, baseType: !66)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !51, line: 454, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !34)
!69 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !9, file: !10, line: 41, baseType: !59, size: 64, offset: 1920)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !9, file: !10, line: 42, baseType: !57, size: 64, offset: 1984)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !9, file: !10, line: 45, baseType: !73, size: 64, offset: 2048)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !6, line: 889, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !5, !77, !63}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !6, line: 842, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !6, line: 840, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !6, line: 832, size: 192, elements: !81)
!81 = !{!82, !85, !86, !87, !88, !89}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !80, file: !6, line: 834, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !51, line: 441, baseType: !84)
!84 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !80, file: !6, line: 835, baseType: !67, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !80, file: !6, line: 836, baseType: !65, size: 8, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !80, file: !6, line: 837, baseType: !65, size: 8, offset: 136)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !80, file: !6, line: 838, baseType: !65, size: 8, offset: 144)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !80, file: !6, line: 839, baseType: !65, size: 8, offset: 152)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !9, file: !10, line: 49, baseType: !73, size: 64, offset: 2112)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !9, file: !10, line: 56, baseType: !57, size: 64, offset: 2176)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !9, file: !10, line: 57, baseType: !65, size: 8, offset: 2240)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !9, file: !10, line: 58, baseType: !65, size: 8, offset: 2248)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !9, file: !10, line: 62, baseType: !83, size: 32, offset: 2272)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !9, file: !10, line: 63, baseType: !83, size: 32, offset: 2304)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !9, file: !10, line: 64, baseType: !83, size: 32, offset: 2336)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !9, file: !10, line: 66, baseType: !98, size: 896, offset: 2368)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !99, line: 104, baseType: !100)
!99 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !99, line: 85, size: 896, elements: !101)
!101 = !{!102, !107, !109, !111, !112, !113, !114, !116, !121, !127, !132, !133, !134, !135}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !100, file: !99, line: 86, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !105, line: 374, baseType: !106)
!105 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !105, line: 365, baseType: !66)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !100, file: !99, line: 87, baseType: !108, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !105, line: 367, baseType: !84)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !100, file: !99, line: 88, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !105, line: 368, baseType: !34)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !100, file: !99, line: 90, baseType: !103, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !100, file: !99, line: 91, baseType: !108, size: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !100, file: !99, line: 92, baseType: !110, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !100, file: !99, line: 94, baseType: !115, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !100, file: !99, line: 95, baseType: !117, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !99, line: 1714, size: 32, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !118, file: !99, line: 1714, baseType: !26, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !100, file: !99, line: 97, baseType: !122, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !99, line: 80, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !126, !108, !108}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !105, line: 383, baseType: !4)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !100, file: !99, line: 98, baseType: !128, size: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !99, line: 81, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !126, !126}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !100, file: !99, line: 99, baseType: !126, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !100, file: !99, line: 101, baseType: !26, size: 32, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !100, file: !99, line: 102, baseType: !110, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !100, file: !99, line: 103, baseType: !110, size: 64, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !9, file: !10, line: 67, baseType: !63, size: 64, offset: 3264)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !9, file: !10, line: 68, baseType: !108, size: 32, offset: 3328)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !9, file: !10, line: 80, baseType: !83, size: 32, offset: 3360)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !9, file: !10, line: 83, baseType: !26, size: 32, offset: 3392)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !9, file: !10, line: 84, baseType: !26, size: 32, offset: 3424)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !9, file: !10, line: 85, baseType: !26, size: 32, offset: 3456)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !9, file: !10, line: 86, baseType: !26, size: 32, offset: 3488)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !9, file: !10, line: 87, baseType: !26, size: 32, offset: 3520)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !9, file: !10, line: 92, baseType: !26, size: 32, offset: 3552)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !9, file: !10, line: 93, baseType: !26, size: 32, offset: 3584)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !9, file: !10, line: 94, baseType: !26, size: 32, offset: 3616)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !9, file: !10, line: 95, baseType: !26, size: 32, offset: 3648)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !9, file: !10, line: 96, baseType: !26, size: 32, offset: 3680)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !9, file: !10, line: 100, baseType: !83, size: 32, offset: 3712)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !9, file: !10, line: 101, baseType: !83, size: 32, offset: 3744)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !9, file: !10, line: 102, baseType: !83, size: 32, offset: 3776)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !9, file: !10, line: 103, baseType: !83, size: 32, offset: 3808)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !9, file: !10, line: 104, baseType: !67, size: 64, offset: 3840)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !9, file: !10, line: 105, baseType: !83, size: 32, offset: 3904)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !9, file: !10, line: 106, baseType: !83, size: 32, offset: 3936)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !9, file: !10, line: 107, baseType: !83, size: 32, offset: 3968)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !9, file: !10, line: 108, baseType: !63, size: 64, offset: 4032)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !9, file: !10, line: 111, baseType: !63, size: 64, offset: 4096)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !9, file: !10, line: 114, baseType: !63, size: 64, offset: 4160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !9, file: !10, line: 115, baseType: !63, size: 64, offset: 4224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !9, file: !10, line: 116, baseType: !63, size: 64, offset: 4288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !9, file: !10, line: 117, baseType: !63, size: 64, offset: 4352)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !9, file: !10, line: 118, baseType: !67, size: 64, offset: 4416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !9, file: !10, line: 120, baseType: !83, size: 32, offset: 4480)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !9, file: !10, line: 121, baseType: !83, size: 32, offset: 4512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !9, file: !10, line: 122, baseType: !167, size: 64, offset: 4544)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !6, line: 559, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !6, line: 558, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !6, line: 553, size: 24, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !170, file: !6, line: 555, baseType: !65, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !170, file: !6, line: 556, baseType: !65, size: 8, offset: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !170, file: !6, line: 557, baseType: !65, size: 8, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !9, file: !10, line: 123, baseType: !176, size: 16, offset: 4608)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !51, line: 447, baseType: !177)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !9, file: !10, line: 127, baseType: !26, size: 32, offset: 4640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !9, file: !10, line: 130, baseType: !176, size: 16, offset: 4672)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !9, file: !10, line: 131, baseType: !65, size: 8, offset: 4688)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !9, file: !10, line: 132, baseType: !65, size: 8, offset: 4696)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !9, file: !10, line: 133, baseType: !65, size: 8, offset: 4704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !9, file: !10, line: 134, baseType: !65, size: 8, offset: 4712)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !9, file: !10, line: 135, baseType: !65, size: 8, offset: 4720)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !9, file: !10, line: 136, baseType: !65, size: 8, offset: 4728)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !9, file: !10, line: 137, baseType: !65, size: 8, offset: 4736)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !9, file: !10, line: 138, baseType: !65, size: 8, offset: 4744)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !9, file: !10, line: 139, baseType: !65, size: 8, offset: 4752)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !9, file: !10, line: 140, baseType: !65, size: 8, offset: 4760)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !9, file: !10, line: 141, baseType: !65, size: 8, offset: 4768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !9, file: !10, line: 142, baseType: !65, size: 8, offset: 4776)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !9, file: !10, line: 143, baseType: !65, size: 8, offset: 4784)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !9, file: !10, line: 145, baseType: !65, size: 8, offset: 4792)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !9, file: !10, line: 147, baseType: !195, size: 40, offset: 4800)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 40, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 5)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !9, file: !10, line: 151, baseType: !176, size: 16, offset: 4848)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !9, file: !10, line: 156, baseType: !65, size: 8, offset: 4864)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !9, file: !10, line: 157, baseType: !201, size: 32, offset: 4896)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !51, line: 521, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !51, line: 442, baseType: !26)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !9, file: !10, line: 158, baseType: !204, size: 80, offset: 4928)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !6, line: 570, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !6, line: 563, size: 80, elements: !206)
!206 = !{!207, !208, !209, !210, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !205, file: !6, line: 565, baseType: !65, size: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !205, file: !6, line: 566, baseType: !176, size: 16, offset: 16)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !205, file: !6, line: 567, baseType: !176, size: 16, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !205, file: !6, line: 568, baseType: !176, size: 16, offset: 48)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !205, file: !6, line: 569, baseType: !176, size: 16, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !9, file: !10, line: 160, baseType: !204, size: 80, offset: 5008)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !9, file: !10, line: 165, baseType: !214, size: 64, offset: 5120)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !6, line: 863, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !5}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !9, file: !10, line: 166, baseType: !83, size: 32, offset: 5184)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !9, file: !10, line: 167, baseType: !83, size: 32, offset: 5216)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !9, file: !10, line: 171, baseType: !26, size: 32, offset: 5248)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !9, file: !10, line: 172, baseType: !201, size: 32, offset: 5280)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !9, file: !10, line: 173, baseType: !201, size: 32, offset: 5312)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !9, file: !10, line: 175, baseType: !63, size: 64, offset: 5376)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !9, file: !10, line: 176, baseType: !225, size: 64, offset: 5440)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !51, line: 556, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !9, file: !10, line: 180, baseType: !63, size: 64, offset: 5504)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !9, file: !10, line: 181, baseType: !63, size: 64, offset: 5568)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !9, file: !10, line: 182, baseType: !225, size: 64, offset: 5632)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !9, file: !10, line: 183, baseType: !225, size: 64, offset: 5696)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !9, file: !10, line: 188, baseType: !233, size: 40, offset: 5760)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !6, line: 582, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !6, line: 575, size: 40, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !234, file: !6, line: 577, baseType: !65, size: 8)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !234, file: !6, line: 578, baseType: !65, size: 8, offset: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !234, file: !6, line: 579, baseType: !65, size: 8, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !234, file: !6, line: 580, baseType: !65, size: 8, offset: 24)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !234, file: !6, line: 581, baseType: !65, size: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !9, file: !10, line: 192, baseType: !233, size: 40, offset: 5800)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !9, file: !10, line: 197, baseType: !63, size: 64, offset: 5888)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !9, file: !10, line: 198, baseType: !204, size: 80, offset: 5952)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !9, file: !10, line: 201, baseType: !245, size: 64, offset: 6080)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !6, line: 864, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !5, !83, !26}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !9, file: !10, line: 202, baseType: !250, size: 64, offset: 6144)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !6, line: 866, baseType: !246)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !9, file: !10, line: 204, baseType: !252, size: 64, offset: 6208)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !6, line: 870, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !256}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !6, line: 723, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !6, line: 722, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !260, line: 56, size: 2496, elements: !261)
!260 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !279, !280, !281, !282, !283, !297, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !334, !335, !336, !337, !347, !348, !349, !350, !351, !352, !372, !373, !374, !375, !376}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !259, file: !260, line: 59, baseType: !83, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !259, file: !260, line: 60, baseType: !83, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !259, file: !260, line: 61, baseType: !83, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !259, file: !260, line: 62, baseType: !67, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !259, file: !260, line: 63, baseType: !167, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !259, file: !260, line: 64, baseType: !176, size: 16, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !259, file: !260, line: 65, baseType: !176, size: 16, offset: 272)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !259, file: !260, line: 66, baseType: !65, size: 8, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !259, file: !260, line: 67, baseType: !65, size: 8, offset: 296)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !259, file: !260, line: 69, baseType: !65, size: 8, offset: 304)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !259, file: !260, line: 70, baseType: !65, size: 8, offset: 312)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !259, file: !260, line: 71, baseType: !65, size: 8, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !259, file: !260, line: 74, baseType: !65, size: 8, offset: 328)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !259, file: !260, line: 75, baseType: !65, size: 8, offset: 336)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !259, file: !260, line: 76, baseType: !65, size: 8, offset: 344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !259, file: !260, line: 77, baseType: !278, size: 64, offset: 352)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 64, elements: !23)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !259, file: !260, line: 90, baseType: !201, size: 32, offset: 416)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !259, file: !260, line: 96, baseType: !65, size: 8, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !259, file: !260, line: 108, baseType: !26, size: 32, offset: 480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !259, file: !260, line: 109, baseType: !26, size: 32, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !259, file: !260, line: 110, baseType: !284, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !6, line: 654, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !6, line: 653, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !6, line: 637, size: 448, elements: !288)
!288 = !{!289, !290, !292, !293, !294, !295, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !287, file: !6, line: 639, baseType: !26, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !287, file: !6, line: 644, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !51, line: 536, baseType: !115)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !287, file: !6, line: 645, baseType: !291, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !287, file: !6, line: 647, baseType: !67, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !287, file: !6, line: 648, baseType: !67, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !287, file: !6, line: 649, baseType: !291, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !287, file: !6, line: 651, baseType: !291, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !259, file: !260, line: 117, baseType: !298, size: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !6, line: 683, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !6, line: 675, size: 64, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !299, file: !6, line: 677, baseType: !176, size: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !299, file: !6, line: 678, baseType: !65, size: 8, offset: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !299, file: !6, line: 679, baseType: !65, size: 8, offset: 24)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !299, file: !6, line: 680, baseType: !65, size: 8, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !299, file: !6, line: 681, baseType: !65, size: 8, offset: 40)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !299, file: !6, line: 682, baseType: !65, size: 8, offset: 48)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !259, file: !260, line: 127, baseType: !233, size: 40, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !259, file: !260, line: 141, baseType: !63, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !259, file: !260, line: 142, baseType: !204, size: 80, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !259, file: !260, line: 152, baseType: !204, size: 80, offset: 912)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !259, file: !260, line: 161, baseType: !202, size: 32, offset: 992)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !259, file: !260, line: 162, baseType: !202, size: 32, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !259, file: !260, line: 163, baseType: !65, size: 8, offset: 1056)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !259, file: !260, line: 171, baseType: !83, size: 32, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !259, file: !260, line: 172, baseType: !83, size: 32, offset: 1120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !259, file: !260, line: 173, baseType: !65, size: 8, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !259, file: !260, line: 183, baseType: !318, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !51, line: 532, baseType: !227)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !259, file: !260, line: 193, baseType: !201, size: 32, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !259, file: !260, line: 194, baseType: !201, size: 32, offset: 1312)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !259, file: !260, line: 195, baseType: !201, size: 32, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !259, file: !260, line: 196, baseType: !201, size: 32, offset: 1376)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !259, file: !260, line: 197, baseType: !201, size: 32, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !259, file: !260, line: 198, baseType: !201, size: 32, offset: 1440)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !259, file: !260, line: 199, baseType: !201, size: 32, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !259, file: !260, line: 200, baseType: !201, size: 32, offset: 1504)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !259, file: !260, line: 215, baseType: !291, size: 64, offset: 1536)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !259, file: !260, line: 216, baseType: !202, size: 32, offset: 1600)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !259, file: !260, line: 217, baseType: !202, size: 32, offset: 1632)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !259, file: !260, line: 218, baseType: !291, size: 64, offset: 1664)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !259, file: !260, line: 219, baseType: !332, size: 64, offset: 1728)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !51, line: 559, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !259, file: !260, line: 220, baseType: !65, size: 8, offset: 1792)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !259, file: !260, line: 221, baseType: !65, size: 8, offset: 1800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !259, file: !260, line: 225, baseType: !83, size: 32, offset: 1824)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !259, file: !260, line: 230, baseType: !338, size: 64, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !6, line: 707, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !6, line: 706, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !6, line: 695, size: 256, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !6, line: 697, baseType: !195, size: 40)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !6, line: 698, baseType: !64, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !341, file: !6, line: 699, baseType: !67, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !341, file: !6, line: 702, baseType: !65, size: 8, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !259, file: !260, line: 231, baseType: !26, size: 32, offset: 1920)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !259, file: !260, line: 236, baseType: !291, size: 64, offset: 1984)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !259, file: !260, line: 237, baseType: !63, size: 64, offset: 2048)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !259, file: !260, line: 238, baseType: !83, size: 32, offset: 2112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !259, file: !260, line: 239, baseType: !65, size: 8, offset: 2144)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !259, file: !260, line: 244, baseType: !353, size: 64, offset: 2176)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !6, line: 615, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !6, line: 614, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !6, line: 608, size: 256, elements: !357)
!357 = !{!358, !359, !360, !371}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !6, line: 610, baseType: !291, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !356, file: !6, line: 611, baseType: !65, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !356, file: !6, line: 612, baseType: !361, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !6, line: 599, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !6, line: 598, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !6, line: 591, size: 80, elements: !365)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !364, file: !6, line: 593, baseType: !176, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !364, file: !6, line: 594, baseType: !176, size: 16, offset: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !364, file: !6, line: 595, baseType: !176, size: 16, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !364, file: !6, line: 596, baseType: !176, size: 16, offset: 48)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !364, file: !6, line: 597, baseType: !176, size: 16, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !356, file: !6, line: 613, baseType: !202, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !259, file: !260, line: 245, baseType: !83, size: 32, offset: 2240)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !259, file: !260, line: 256, baseType: !65, size: 8, offset: 2272)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !259, file: !260, line: 257, baseType: !291, size: 64, offset: 2304)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !259, file: !260, line: 258, baseType: !291, size: 64, offset: 2368)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !259, file: !260, line: 265, baseType: !377, size: 64, offset: 2432)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !51, line: 553, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !9, file: !10, line: 205, baseType: !380, size: 64, offset: 6272)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !6, line: 883, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !5, !63, !83, !26}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !9, file: !10, line: 206, baseType: !385, size: 64, offset: 6336)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !6, line: 871, baseType: !253)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !9, file: !10, line: 207, baseType: !63, size: 64, offset: 6400)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !9, file: !10, line: 208, baseType: !63, size: 64, offset: 6464)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !9, file: !10, line: 209, baseType: !63, size: 64, offset: 6528)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !9, file: !10, line: 210, baseType: !63, size: 64, offset: 6592)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !9, file: !10, line: 211, baseType: !83, size: 32, offset: 6656)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !9, file: !10, line: 212, baseType: !83, size: 32, offset: 6688)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !9, file: !10, line: 213, baseType: !67, size: 64, offset: 6720)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !9, file: !10, line: 214, baseType: !67, size: 64, offset: 6784)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !9, file: !10, line: 215, baseType: !67, size: 64, offset: 6848)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !9, file: !10, line: 216, baseType: !67, size: 64, offset: 6912)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !9, file: !10, line: 217, baseType: !26, size: 32, offset: 6976)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !9, file: !10, line: 218, baseType: !26, size: 32, offset: 7008)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !9, file: !10, line: 232, baseType: !63, size: 64, offset: 7040)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !9, file: !10, line: 233, baseType: !63, size: 64, offset: 7104)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !9, file: !10, line: 237, baseType: !318, size: 64, offset: 7168)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !9, file: !10, line: 241, baseType: !65, size: 8, offset: 7232)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !9, file: !10, line: 242, baseType: !65, size: 8, offset: 7240)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !9, file: !10, line: 243, baseType: !63, size: 64, offset: 7296)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !9, file: !10, line: 244, baseType: !318, size: 64, offset: 7360)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !9, file: !10, line: 245, baseType: !318, size: 64, offset: 7424)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !9, file: !10, line: 246, baseType: !318, size: 64, offset: 7488)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !9, file: !10, line: 247, baseType: !318, size: 64, offset: 7552)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !9, file: !10, line: 251, baseType: !409, size: 232, offset: 7616)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 232, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 29)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !9, file: !10, line: 256, baseType: !83, size: 32, offset: 7872)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !9, file: !10, line: 259, baseType: !57, size: 64, offset: 7936)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !9, file: !10, line: 260, baseType: !415, size: 64, offset: 8000)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !6, line: 894, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!26, !5, !338}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !9, file: !10, line: 264, baseType: !26, size: 32, offset: 8064)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !9, file: !10, line: 265, baseType: !63, size: 64, offset: 8128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !9, file: !10, line: 270, baseType: !65, size: 8, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !9, file: !10, line: 275, baseType: !65, size: 8, offset: 8200)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !9, file: !10, line: 277, baseType: !65, size: 8, offset: 8208)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !9, file: !10, line: 279, baseType: !176, size: 16, offset: 8224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !9, file: !10, line: 280, baseType: !176, size: 16, offset: 8240)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !9, file: !10, line: 287, baseType: !83, size: 32, offset: 8256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !9, file: !10, line: 292, baseType: !65, size: 8, offset: 8288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !9, file: !10, line: 299, baseType: !57, size: 64, offset: 8320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !9, file: !10, line: 300, baseType: !430, size: 64, offset: 8384)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !6, line: 950, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!57, !5, !434}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !51, line: 591, baseType: !67)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !9, file: !10, line: 301, baseType: !436, size: 64, offset: 8448)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !6, line: 952, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !5, !57}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !9, file: !10, line: 305, baseType: !63, size: 64, offset: 8512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !9, file: !10, line: 309, baseType: !63, size: 64, offset: 8576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !9, file: !10, line: 310, baseType: !63, size: 64, offset: 8640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !9, file: !10, line: 312, baseType: !63, size: 64, offset: 8704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !9, file: !10, line: 317, baseType: !65, size: 8, offset: 8768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !9, file: !10, line: 320, baseType: !83, size: 32, offset: 8800)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !9, file: !10, line: 321, baseType: !83, size: 32, offset: 8832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !9, file: !10, line: 326, baseType: !83, size: 32, offset: 8864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !9, file: !10, line: 331, baseType: !434, size: 64, offset: 8896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !9, file: !10, line: 337, baseType: !340, size: 256, offset: 8960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !9, file: !10, line: 341, baseType: !67, size: 64, offset: 9216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !9, file: !10, line: 344, baseType: !291, size: 64, offset: 9280)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !9, file: !10, line: 348, baseType: !83, size: 32, offset: 9344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !9, file: !10, line: 352, baseType: !63, size: 64, offset: 9408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !9, file: !10, line: 354, baseType: !455, size: 256, offset: 9472)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 256, elements: !462)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !77, !63, !459}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !51, line: 527, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!462 = !{!463}
!463 = !DISubrange(count: 4)
!464 = !{i32 7, !"Dwarf Version", i32 4}
!465 = !{i32 2, !"Debug Info Version", i32 3}
!466 = !{i32 1, !"wchar_size", i32 4}
!467 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!468 = distinct !DISubprogram(name: "png_create_read_struct", scope: !1, file: !1, line: 22, type: !469, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!469 = !DISubroutineType(types: !470)
!470 = !{!5, !50, !57, !46, !46}
!471 = !DILocalVariable(name: "user_png_ver", arg: 1, scope: !468, file: !1, line: 22, type: !50)
!472 = !DILocation(line: 22, column: 1, scope: !468)
!473 = !DILocalVariable(name: "error_ptr", arg: 2, scope: !468, file: !1, line: 22, type: !57)
!474 = !DILocalVariable(name: "error_fn", arg: 3, scope: !468, file: !1, line: 22, type: !46)
!475 = !DILocalVariable(name: "warn_fn", arg: 4, scope: !468, file: !1, line: 22, type: !46)
!476 = !DILocation(line: 28, column: 37, scope: !468)
!477 = !DILocation(line: 28, column: 51, scope: !468)
!478 = !DILocation(line: 28, column: 62, scope: !468)
!479 = !DILocation(line: 29, column: 8, scope: !468)
!480 = !DILocation(line: 28, column: 12, scope: !468)
!481 = !DILocation(line: 28, column: 4, scope: !468)
!482 = distinct !DISubprogram(name: "png_create_read_struct_2", scope: !1, file: !1, line: 35, type: !483, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!483 = !DISubroutineType(types: !484)
!484 = !{!5, !50, !57, !46, !46, !57, !430, !436}
!485 = !DILocalVariable(name: "user_png_ver", arg: 1, scope: !482, file: !1, line: 35, type: !50)
!486 = !DILocation(line: 35, column: 1, scope: !482)
!487 = !DILocalVariable(name: "error_ptr", arg: 2, scope: !482, file: !1, line: 35, type: !57)
!488 = !DILocalVariable(name: "error_fn", arg: 3, scope: !482, file: !1, line: 35, type: !46)
!489 = !DILocalVariable(name: "warn_fn", arg: 4, scope: !482, file: !1, line: 35, type: !46)
!490 = !DILocalVariable(name: "mem_ptr", arg: 5, scope: !482, file: !1, line: 35, type: !57)
!491 = !DILocalVariable(name: "malloc_fn", arg: 6, scope: !482, file: !1, line: 35, type: !430)
!492 = !DILocalVariable(name: "free_fn", arg: 7, scope: !482, file: !1, line: 35, type: !436)
!493 = !DILocalVariable(name: "png_ptr", scope: !482, file: !1, line: 45, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !5)
!495 = !DILocation(line: 45, column: 16, scope: !482)
!496 = !DILocalVariable(name: "png_cleanup_needed", scope: !482, file: !1, line: 46, type: !497)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !26)
!498 = !DILocation(line: 46, column: 17, scope: !482)
!499 = !DILocation(line: 58, column: 8, scope: !482)
!500 = !DILocation(line: 58, column: 19, scope: !482)
!501 = !DILocation(line: 57, column: 27, scope: !482)
!502 = !DILocation(line: 57, column: 14, scope: !482)
!503 = !DILocation(line: 57, column: 12, scope: !482)
!504 = !DILocation(line: 62, column: 8, scope: !505)
!505 = distinct !DILexicalBlock(scope: !482, file: !1, line: 62, column: 8)
!506 = !DILocation(line: 62, column: 16, scope: !505)
!507 = !DILocation(line: 62, column: 8, scope: !482)
!508 = !DILocation(line: 63, column: 7, scope: !505)
!509 = !DILocation(line: 67, column: 4, scope: !482)
