; ModuleID = 'blender/source/blender/editors/space_node/node_toolbar.c'
source_filename = "blender/source/blender/editors/space_node/node_toolbar.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ARegionType = type { %struct.ARegionType*, %struct.ARegionType*, i32, void (%struct.wmWindowManager*, %struct.ARegion*)*, void (%struct.wmWindowManager*, %struct.ARegion*)*, void (%struct.bContext*, %struct.ARegion*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.ARegion*, %struct.wmNotifier*)*, void (%struct.ARegion*)*, i8* (i8*)*, void ()*, void (%struct.wmKeyConfig*)*, void (%struct.wmWindow*, %struct.ScrArea*, %struct.ARegion*)*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, %struct.ListBase, i32, i32, i32, i32, i32, i16, i16, i16 }
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_node/node_toolbar.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 351, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !14, line: 1163, baseType: !5, size: 32, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!16 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!27 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!28 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!29 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!30 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!31 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!32 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!33 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!34 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!35 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!36 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!37 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!38 = !{i32 7, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!42 = distinct !DISubprogram(name: "node_toolbar_register", scope: !1, file: !1, line: 57, type: !43, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2460)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegionType", file: !47, line: 165, baseType: !48)
!47 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !47, line: 116, size: 1472, elements: !49)
!49 = !{!50, !52, !53, !55, !2317, !2318, !2322, !2434, !2438, !2442, !2443, !2444, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !47, line: 117, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !48, file: !47, line: 117, baseType: !51, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !48, file: !47, line: 119, baseType: !54, size: 32, offset: 128)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !48, file: !47, line: 122, baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59, !553}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !4, line: 128, size: 2816, elements: !61)
!61 = !{!62, !133, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2296, !2297, !2298, !2299, !2300, !2311, !2312, !2313, !2314, !2315, !2316}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !4, line: 129, baseType: !63, size: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !66)
!66 = !{!67, !69, !70, !72, !92, !96, !98, !99, !100, !101}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 118, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 118, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !65, file: !64, line: 119, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !65, file: !64, line: 120, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !75)
!75 = !{!76, !77, !79, !82, !87, !88, !89}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !64, line: 137, baseType: !63, size: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !74, file: !64, line: 138, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !74, file: !64, line: 139, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !64, line: 140, baseType: !83, size: 8192, offset: 1088)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !74, file: !64, line: 141, baseType: !83, size: 8192, offset: 9280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !64, line: 148, baseType: !73, size: 64, offset: 17472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !74, file: !64, line: 150, baseType: !90, size: 64, offset: 17536)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 121, baseType: !93, size: 528, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 66)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 126, baseType: !97, size: 16, offset: 784)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !65, file: !64, line: 127, baseType: !54, size: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !65, file: !64, line: 128, baseType: !54, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !65, file: !64, line: 128, baseType: !54, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !65, file: !64, line: 129, baseType: !102, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !105)
!105 = !{!106, !108, !109, !110, !111, !112, !116, !117, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !64, line: 63, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !64, line: 63, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 136)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !64, line: 65, baseType: !97, size: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !64, line: 66, baseType: !113, size: 512, offset: 160)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !104, file: !64, line: 67, baseType: !54, size: 32, offset: 672)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !64, line: 69, baseType: !118, size: 256, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !120)
!120 = !{!121, !122, !129, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !119, file: !64, line: 49, baseType: !68, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !119, file: !64, line: 58, baseType: !123, size: 128, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !124, line: 71, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !124, line: 69, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !125, file: !124, line: 70, baseType: !68, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !125, file: !124, line: 70, baseType: !68, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !64, line: 59, baseType: !54, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !119, file: !64, line: 59, baseType: !54, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !64, line: 70, baseType: !54, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !104, file: !64, line: 74, baseType: !54, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !60, file: !4, line: 131, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !4, line: 169, size: 2048, elements: !136)
!136 = !{!137, !138, !139, !140, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2255, !2258, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !4, line: 170, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !4, line: 170, baseType: !134, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !135, file: !4, line: 172, baseType: !68, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !135, file: !4, line: 174, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !143, line: 49, size: 1984, elements: !144)
!143 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145, !146, !147, !148, !149, !150, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !143, line: 50, baseType: !63, size: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !142, file: !143, line: 52, baseType: !123, size: 128, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !142, file: !143, line: 53, baseType: !123, size: 128, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !142, file: !143, line: 54, baseType: !123, size: 128, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !142, file: !143, line: 55, baseType: !123, size: 128, offset: 1344)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !142, file: !143, line: 57, baseType: !151, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !153, line: 1216, size: 39680, elements: !154)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !{!155, !156, !160, !163, !1223, !1224, !1225, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1595, !1809, !1812, !2052, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2074, !2075, !2076, !2077, !2078, !2086, !2152, !2159, !2160, !2167, !2168, !2174, !2175, !2176, !2177, !2178}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !153, line: 1217, baseType: !63, size: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !152, file: !153, line: 1218, baseType: !157, size: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !159, line: 45, flags: DIFlagFwdDecl)
!159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !152, file: !153, line: 1220, baseType: !161, size: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !159, line: 49, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !152, file: !153, line: 1221, baseType: !164, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !166, line: 52, size: 4224, elements: !167)
!166 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !238, !239, !242, !1218, !1219, !1220, !1221, !1222}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !166, line: 53, baseType: !63, size: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !165, file: !166, line: 54, baseType: !157, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !165, file: !166, line: 56, baseType: !97, size: 16, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !165, file: !166, line: 56, baseType: !97, size: 16, offset: 1040)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !165, file: !166, line: 57, baseType: !97, size: 16, offset: 1056)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !165, file: !166, line: 57, baseType: !97, size: 16, offset: 1072)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !165, file: !166, line: 59, baseType: !175, size: 32, offset: 1088)
!175 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !165, file: !166, line: 59, baseType: !175, size: 32, offset: 1120)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !165, file: !166, line: 59, baseType: !175, size: 32, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !165, file: !166, line: 60, baseType: !175, size: 32, offset: 1184)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !165, file: !166, line: 60, baseType: !175, size: 32, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !165, file: !166, line: 60, baseType: !175, size: 32, offset: 1248)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !165, file: !166, line: 61, baseType: !175, size: 32, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !165, file: !166, line: 61, baseType: !175, size: 32, offset: 1312)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !165, file: !166, line: 61, baseType: !175, size: 32, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !165, file: !166, line: 68, baseType: !175, size: 32, offset: 1376)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !165, file: !166, line: 68, baseType: !175, size: 32, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !165, file: !166, line: 68, baseType: !175, size: 32, offset: 1440)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !165, file: !166, line: 69, baseType: !175, size: 32, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !165, file: !166, line: 69, baseType: !175, size: 32, offset: 1504)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !165, file: !166, line: 74, baseType: !175, size: 32, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !165, file: !166, line: 79, baseType: !175, size: 32, offset: 1568)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !165, file: !166, line: 81, baseType: !97, size: 16, offset: 1600)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !165, file: !166, line: 91, baseType: !97, size: 16, offset: 1616)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !165, file: !166, line: 92, baseType: !97, size: 16, offset: 1632)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !165, file: !166, line: 93, baseType: !97, size: 16, offset: 1648)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !165, file: !166, line: 94, baseType: !97, size: 16, offset: 1664)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !165, file: !166, line: 94, baseType: !97, size: 16, offset: 1680)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !165, file: !166, line: 94, baseType: !97, size: 16, offset: 1696)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !165, file: !166, line: 94, baseType: !97, size: 16, offset: 1712)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !165, file: !166, line: 96, baseType: !175, size: 32, offset: 1728)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !165, file: !166, line: 96, baseType: !175, size: 32, offset: 1760)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !165, file: !166, line: 96, baseType: !175, size: 32, offset: 1792)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !165, file: !166, line: 96, baseType: !175, size: 32, offset: 1824)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !165, file: !166, line: 98, baseType: !175, size: 32, offset: 1856)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !165, file: !166, line: 98, baseType: !175, size: 32, offset: 1888)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !165, file: !166, line: 98, baseType: !175, size: 32, offset: 1920)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !165, file: !166, line: 98, baseType: !175, size: 32, offset: 1952)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !165, file: !166, line: 99, baseType: !175, size: 32, offset: 1984)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !165, file: !166, line: 99, baseType: !175, size: 32, offset: 2016)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !165, file: !166, line: 100, baseType: !175, size: 32, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !165, file: !166, line: 100, baseType: !175, size: 32, offset: 2080)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !165, file: !166, line: 103, baseType: !97, size: 16, offset: 2112)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !165, file: !166, line: 103, baseType: !97, size: 16, offset: 2128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !165, file: !166, line: 103, baseType: !97, size: 16, offset: 2144)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !165, file: !166, line: 103, baseType: !97, size: 16, offset: 2160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !165, file: !166, line: 106, baseType: !175, size: 32, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !165, file: !166, line: 106, baseType: !175, size: 32, offset: 2208)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !165, file: !166, line: 106, baseType: !175, size: 32, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !165, file: !166, line: 106, baseType: !175, size: 32, offset: 2272)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !165, file: !166, line: 107, baseType: !97, size: 16, offset: 2304)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !165, file: !166, line: 107, baseType: !97, size: 16, offset: 2320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !165, file: !166, line: 107, baseType: !97, size: 16, offset: 2336)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !165, file: !166, line: 107, baseType: !97, size: 16, offset: 2352)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !165, file: !166, line: 108, baseType: !175, size: 32, offset: 2368)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !165, file: !166, line: 108, baseType: !175, size: 32, offset: 2400)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !165, file: !166, line: 109, baseType: !175, size: 32, offset: 2432)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !165, file: !166, line: 109, baseType: !175, size: 32, offset: 2464)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !165, file: !166, line: 110, baseType: !175, size: 32, offset: 2496)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !165, file: !166, line: 110, baseType: !175, size: 32, offset: 2528)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !165, file: !166, line: 110, baseType: !175, size: 32, offset: 2560)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !165, file: !166, line: 111, baseType: !97, size: 16, offset: 2592)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !165, file: !166, line: 111, baseType: !97, size: 16, offset: 2608)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !165, file: !166, line: 112, baseType: !97, size: 16, offset: 2624)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !165, file: !166, line: 112, baseType: !97, size: 16, offset: 2640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !165, file: !166, line: 112, baseType: !97, size: 16, offset: 2656)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !165, file: !166, line: 115, baseType: !97, size: 16, offset: 2672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !165, file: !166, line: 118, baseType: !237, size: 64, offset: 2688)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !165, file: !166, line: 118, baseType: !237, size: 64, offset: 2752)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !165, file: !166, line: 121, baseType: !240, size: 64, offset: 2816)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !159, line: 46, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !165, file: !166, line: 122, baseType: !243, size: 1152, offset: 2880)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 1152, elements: !1216)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !159, line: 57, size: 2496, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !245, file: !159, line: 59, baseType: !97, size: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !245, file: !159, line: 59, baseType: !97, size: 16, offset: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !245, file: !159, line: 59, baseType: !97, size: 16, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !245, file: !159, line: 59, baseType: !97, size: 16, offset: 48)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !245, file: !159, line: 60, baseType: !161, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !245, file: !159, line: 61, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !159, line: 202, size: 3328, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !325, !924, !925, !1003, !1029, !1057, !1058, !1126, !1147, !1155, !1156}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !254, file: !159, line: 203, baseType: !63, size: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !254, file: !159, line: 204, baseType: !157, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !254, file: !159, line: 206, baseType: !175, size: 32, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !254, file: !159, line: 206, baseType: !175, size: 32, offset: 1056)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !254, file: !159, line: 207, baseType: !175, size: 32, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !254, file: !159, line: 207, baseType: !175, size: 32, offset: 1120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !254, file: !159, line: 207, baseType: !175, size: 32, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !254, file: !159, line: 207, baseType: !175, size: 32, offset: 1184)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !254, file: !159, line: 207, baseType: !175, size: 32, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !254, file: !159, line: 207, baseType: !175, size: 32, offset: 1248)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !254, file: !159, line: 208, baseType: !175, size: 32, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !254, file: !159, line: 208, baseType: !175, size: 32, offset: 1312)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !254, file: !159, line: 211, baseType: !175, size: 32, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !254, file: !159, line: 211, baseType: !175, size: 32, offset: 1376)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !254, file: !159, line: 211, baseType: !175, size: 32, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !254, file: !159, line: 211, baseType: !175, size: 32, offset: 1440)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !254, file: !159, line: 211, baseType: !175, size: 32, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !254, file: !159, line: 214, baseType: !175, size: 32, offset: 1504)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !254, file: !159, line: 214, baseType: !175, size: 32, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !254, file: !159, line: 217, baseType: !175, size: 32, offset: 1568)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !254, file: !159, line: 218, baseType: !175, size: 32, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !254, file: !159, line: 219, baseType: !175, size: 32, offset: 1632)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !254, file: !159, line: 220, baseType: !175, size: 32, offset: 1664)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !254, file: !159, line: 221, baseType: !175, size: 32, offset: 1696)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !254, file: !159, line: 222, baseType: !97, size: 16, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !254, file: !159, line: 222, baseType: !97, size: 16, offset: 1744)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !254, file: !159, line: 224, baseType: !97, size: 16, offset: 1760)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !254, file: !159, line: 224, baseType: !97, size: 16, offset: 1776)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !254, file: !159, line: 227, baseType: !97, size: 16, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !254, file: !159, line: 227, baseType: !97, size: 16, offset: 1808)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !254, file: !159, line: 229, baseType: !97, size: 16, offset: 1824)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !254, file: !159, line: 229, baseType: !97, size: 16, offset: 1840)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !159, line: 230, baseType: !97, size: 16, offset: 1856)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !254, file: !159, line: 230, baseType: !97, size: 16, offset: 1872)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !254, file: !159, line: 232, baseType: !175, size: 32, offset: 1888)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !254, file: !159, line: 232, baseType: !175, size: 32, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !254, file: !159, line: 232, baseType: !175, size: 32, offset: 1952)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !254, file: !159, line: 232, baseType: !175, size: 32, offset: 1984)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !254, file: !159, line: 233, baseType: !54, size: 32, offset: 2016)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !254, file: !159, line: 234, baseType: !54, size: 32, offset: 2048)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !254, file: !159, line: 235, baseType: !97, size: 16, offset: 2080)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !254, file: !159, line: 235, baseType: !97, size: 16, offset: 2096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !254, file: !159, line: 236, baseType: !97, size: 16, offset: 2112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !254, file: !159, line: 239, baseType: !97, size: 16, offset: 2128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !159, line: 240, baseType: !54, size: 32, offset: 2144)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !254, file: !159, line: 241, baseType: !54, size: 32, offset: 2176)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !254, file: !159, line: 241, baseType: !54, size: 32, offset: 2208)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !254, file: !159, line: 241, baseType: !54, size: 32, offset: 2240)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !254, file: !159, line: 243, baseType: !175, size: 32, offset: 2272)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !254, file: !159, line: 243, baseType: !175, size: 32, offset: 2304)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !254, file: !159, line: 244, baseType: !175, size: 32, offset: 2336)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !254, file: !159, line: 246, baseType: !308, size: 320, offset: 2368)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !309, line: 50, size: 320, elements: !310)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !308, file: !309, line: 51, baseType: !151, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !308, file: !309, line: 53, baseType: !54, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !308, file: !309, line: 54, baseType: !54, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !308, file: !309, line: 55, baseType: !54, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !308, file: !309, line: 55, baseType: !54, size: 32, offset: 160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !308, file: !309, line: 56, baseType: !84, size: 8, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !308, file: !309, line: 56, baseType: !84, size: 8, offset: 200)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !308, file: !309, line: 57, baseType: !84, size: 8, offset: 208)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !308, file: !309, line: 57, baseType: !84, size: 8, offset: 216)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !308, file: !309, line: 59, baseType: !97, size: 16, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !308, file: !309, line: 59, baseType: !97, size: 16, offset: 240)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !308, file: !309, line: 59, baseType: !97, size: 16, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !308, file: !309, line: 61, baseType: !97, size: 16, offset: 272)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !308, file: !309, line: 63, baseType: !54, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !254, file: !159, line: 248, baseType: !326, size: 64, offset: 2688)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !328, line: 328, size: 3456, elements: !329)
!328 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!329 = !{!330, !331, !332, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !902, !903, !904, !907, !911, !915, !919, !920, !921, !922, !923}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !327, file: !328, line: 329, baseType: !63, size: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !327, file: !328, line: 330, baseType: !157, size: 64, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !327, file: !328, line: 332, baseType: !333, size: 64, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !335, line: 283, size: 4096, elements: !336)
!335 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!336 = !{!337, !338, !339, !340, !344, !345, !349, !841, !849, !853, !859, !863, !864, !865, !866, !870, !871}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !335, line: 284, baseType: !54, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !334, file: !335, line: 285, baseType: !113, size: 512, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !334, file: !335, line: 287, baseType: !113, size: 512, offset: 544)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !334, file: !335, line: 288, baseType: !341, size: 2048, offset: 1056)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !334, file: !335, line: 289, baseType: !54, size: 32, offset: 3104)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !334, file: !335, line: 292, baseType: !346, size: 64, offset: 3136)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !326}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !334, file: !335, line: 293, baseType: !350, size: 64, offset: 3200)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !326, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !328, line: 167, size: 3712, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !328, line: 168, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !328, line: 168, baseType: !353, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !354, file: !328, line: 168, baseType: !353, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !354, file: !328, line: 170, baseType: !102, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !354, file: !328, line: 172, baseType: !361, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !335, line: 144, size: 6016, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !545, !546, !547, !705, !709, !713, !714, !721, !725, !729, !730, !731, !732, !736, !737, !741, !745, !749, !753, !757, !761, !765, !766, !773, !775, !784, !793}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !335, line: 145, baseType: !68, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !362, file: !335, line: 145, baseType: !68, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !362, file: !335, line: 146, baseType: !97, size: 16, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !362, file: !335, line: 148, baseType: !113, size: 512, offset: 144)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !335, line: 149, baseType: !54, size: 32, offset: 672)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !362, file: !335, line: 151, baseType: !113, size: 512, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !362, file: !335, line: 152, baseType: !341, size: 2048, offset: 1216)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !362, file: !335, line: 153, baseType: !54, size: 32, offset: 3264)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !362, file: !335, line: 155, baseType: !175, size: 32, offset: 3296)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !362, file: !335, line: 155, baseType: !175, size: 32, offset: 3328)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !362, file: !335, line: 155, baseType: !175, size: 32, offset: 3360)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !362, file: !335, line: 156, baseType: !175, size: 32, offset: 3392)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !362, file: !335, line: 156, baseType: !175, size: 32, offset: 3424)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !362, file: !335, line: 156, baseType: !175, size: 32, offset: 3456)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !362, file: !335, line: 157, baseType: !97, size: 16, offset: 3488)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !362, file: !335, line: 157, baseType: !97, size: 16, offset: 3504)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !362, file: !335, line: 157, baseType: !97, size: 16, offset: 3520)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !362, file: !335, line: 160, baseType: !382, size: 64, offset: 3584)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !335, line: 109, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !335, line: 98, size: 1408, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !544}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !384, file: !335, line: 99, baseType: !54, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !384, file: !335, line: 99, baseType: !54, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !384, file: !335, line: 100, baseType: !113, size: 512, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !384, file: !335, line: 101, baseType: !175, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !384, file: !335, line: 101, baseType: !175, size: 32, offset: 608)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !384, file: !335, line: 101, baseType: !175, size: 32, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !384, file: !335, line: 101, baseType: !175, size: 32, offset: 672)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !384, file: !335, line: 102, baseType: !175, size: 32, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !384, file: !335, line: 102, baseType: !175, size: 32, offset: 736)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !384, file: !335, line: 103, baseType: !54, size: 32, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !335, line: 104, baseType: !54, size: 32, offset: 800)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !384, file: !335, line: 107, baseType: !398, size: 64, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !328, line: 87, size: 2816, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !523}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !328, line: 88, baseType: !398, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !328, line: 88, baseType: !398, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !399, file: !328, line: 88, baseType: !398, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !399, file: !328, line: 90, baseType: !102, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !399, file: !328, line: 92, baseType: !113, size: 512, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !328, line: 94, baseType: !113, size: 512, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !399, file: !328, line: 99, baseType: !68, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !399, file: !328, line: 101, baseType: !97, size: 16, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !328, line: 101, baseType: !97, size: 16, offset: 1360)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !399, file: !328, line: 102, baseType: !97, size: 16, offset: 1376)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !399, file: !328, line: 103, baseType: !97, size: 16, offset: 1392)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !399, file: !328, line: 104, baseType: !413, size: 64, offset: 1408)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !335, line: 114, size: 1600, elements: !415)
!415 = !{!416, !417, !439, !443, !447, !451, !455, !459, !460, !464, !493, !494, !495}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !414, file: !335, line: 115, baseType: !113, size: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !414, file: !335, line: 117, baseType: !418, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !421, !424, !426, !426, !437}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !423, line: 44, flags: DIFlagFwdDecl)
!423 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !335, line: 73, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !423, line: 55, size: 192, elements: !428)
!428 = !{!429, !433, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !427, file: !423, line: 58, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !423, line: 56, size: 64, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !430, file: !423, line: 57, baseType: !68, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !423, line: 60, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !328, line: 335, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !427, file: !423, line: 61, baseType: !68, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !414, file: !335, line: 118, baseType: !440, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !421, !426, !426, !237}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !414, file: !335, line: 120, baseType: !444, size: 64, offset: 640)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !421, !424, !426}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !414, file: !335, line: 121, baseType: !448, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !421, !426, !237}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !414, file: !335, line: 122, baseType: !452, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !326, !398, !434}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !414, file: !335, line: 123, baseType: !456, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !326, !398, !353, !398, !437}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !414, file: !335, line: 124, baseType: !456, size: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !414, file: !335, line: 125, baseType: !461, size: 64, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !326, !398, !353, !398}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !414, file: !335, line: 128, baseType: !465, size: 256, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !423, line: 436, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !423, line: 430, size: 256, elements: !467)
!467 = !{!468, !469, !472, !488}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !423, line: 431, baseType: !68, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !466, file: !423, line: 432, baseType: !470, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !423, line: 417, baseType: !435)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !466, file: !423, line: 433, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !423, line: 408, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!54, !421, !426, !477, !479}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !423, line: 38, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !423, line: 348, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !423, line: 337, size: 256, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !481, file: !423, line: 339, baseType: !68, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !481, file: !423, line: 342, baseType: !477, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !481, file: !423, line: 345, baseType: !54, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !481, file: !423, line: 347, baseType: !54, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !481, file: !423, line: 347, baseType: !54, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !466, file: !423, line: 434, baseType: !489, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !423, line: 409, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !68}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !414, file: !335, line: 129, baseType: !465, size: 256, offset: 1280)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !414, file: !335, line: 132, baseType: !54, size: 32, offset: 1536)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !414, file: !335, line: 132, baseType: !54, size: 32, offset: 1568)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !399, file: !328, line: 105, baseType: !113, size: 512, offset: 1472)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !399, file: !328, line: 107, baseType: !175, size: 32, offset: 1984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !399, file: !328, line: 107, baseType: !175, size: 32, offset: 2016)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !399, file: !328, line: 109, baseType: !68, size: 64, offset: 2048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !399, file: !328, line: 112, baseType: !97, size: 16, offset: 2112)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !399, file: !328, line: 114, baseType: !97, size: 16, offset: 2128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !399, file: !328, line: 115, baseType: !54, size: 32, offset: 2144)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !399, file: !328, line: 117, baseType: !68, size: 64, offset: 2176)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !399, file: !328, line: 122, baseType: !54, size: 32, offset: 2240)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !399, file: !328, line: 124, baseType: !54, size: 32, offset: 2272)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !399, file: !328, line: 126, baseType: !398, size: 64, offset: 2304)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !399, file: !328, line: 128, baseType: !508, size: 64, offset: 2368)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !328, line: 298, size: 448, elements: !510)
!510 = !{!511, !512, !513, !516, !517, !520, !521, !522}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !328, line: 299, baseType: !508, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !509, file: !328, line: 299, baseType: !508, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !509, file: !328, line: 301, baseType: !514, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !328, line: 218, baseType: !354)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !509, file: !328, line: 301, baseType: !514, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !509, file: !328, line: 302, baseType: !518, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !328, line: 132, baseType: !399)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !509, file: !328, line: 302, baseType: !518, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !328, line: 304, baseType: !54, size: 32, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !509, file: !328, line: 305, baseType: !54, size: 32, offset: 416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !399, file: !328, line: 131, baseType: !524, size: 384, offset: 2432)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !328, line: 73, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !328, line: 62, size: 384, elements: !526)
!526 = !{!527, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !525, file: !328, line: 63, baseType: !528, size: 128)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 4)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !525, file: !328, line: 64, baseType: !175, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !525, file: !328, line: 64, baseType: !175, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !525, file: !328, line: 65, baseType: !68, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !525, file: !328, line: 66, baseType: !97, size: 16, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !525, file: !328, line: 67, baseType: !97, size: 16, offset: 272)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !525, file: !328, line: 68, baseType: !97, size: 16, offset: 288)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !525, file: !328, line: 69, baseType: !97, size: 16, offset: 304)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !525, file: !328, line: 70, baseType: !97, size: 16, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !525, file: !328, line: 71, baseType: !97, size: 16, offset: 336)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !525, file: !328, line: 72, baseType: !541, size: 32, offset: 352)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 2)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !384, file: !335, line: 108, baseType: !113, size: 512, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !362, file: !335, line: 160, baseType: !382, size: 64, offset: 3648)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !362, file: !335, line: 162, baseType: !113, size: 512, offset: 3712)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !362, file: !335, line: 165, baseType: !548, size: 64, offset: 4224)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !551, !553, !653, !326, !353, !701}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !143, line: 230, size: 3072, elements: !555)
!555 = !{!556, !557, !558, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !652}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !143, line: 231, baseType: !553, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !554, file: !143, line: 231, baseType: !553, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !554, file: !143, line: 233, baseType: !559, size: 1280, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !560, line: 71, baseType: !561)
!560 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !560, line: 40, size: 1280, elements: !562)
!562 = !{!563, !572, !573, !581, !582, !583, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !606}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !561, file: !560, line: 41, baseType: !564, size: 128)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !565, line: 95, baseType: !566)
!565 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !565, line: 92, size: 128, elements: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !566, file: !565, line: 93, baseType: !175, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !566, file: !565, line: 93, baseType: !175, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !566, file: !565, line: 94, baseType: !175, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !566, file: !565, line: 94, baseType: !175, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !561, file: !560, line: 41, baseType: !564, size: 128, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !561, file: !560, line: 42, baseType: !574, size: 128, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !565, line: 89, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !565, line: 86, size: 128, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !575, file: !565, line: 87, baseType: !54, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !575, file: !565, line: 87, baseType: !54, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !575, file: !565, line: 88, baseType: !54, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !575, file: !565, line: 88, baseType: !54, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !561, file: !560, line: 42, baseType: !574, size: 128, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !561, file: !560, line: 43, baseType: !574, size: 128, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !561, file: !560, line: 45, baseType: !584, size: 64, offset: 640)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 64, elements: !542)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !561, file: !560, line: 45, baseType: !584, size: 64, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !561, file: !560, line: 46, baseType: !175, size: 32, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !561, file: !560, line: 46, baseType: !175, size: 32, offset: 800)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !561, file: !560, line: 48, baseType: !97, size: 16, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !561, file: !560, line: 49, baseType: !97, size: 16, offset: 848)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !561, file: !560, line: 51, baseType: !97, size: 16, offset: 864)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !561, file: !560, line: 52, baseType: !97, size: 16, offset: 880)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !561, file: !560, line: 53, baseType: !97, size: 16, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !560, line: 55, baseType: !97, size: 16, offset: 912)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !561, file: !560, line: 56, baseType: !97, size: 16, offset: 928)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !561, file: !560, line: 58, baseType: !97, size: 16, offset: 944)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !561, file: !560, line: 58, baseType: !97, size: 16, offset: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !561, file: !560, line: 59, baseType: !97, size: 16, offset: 976)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !561, file: !560, line: 59, baseType: !97, size: 16, offset: 992)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !561, file: !560, line: 61, baseType: !97, size: 16, offset: 1008)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !561, file: !560, line: 63, baseType: !237, size: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !561, file: !560, line: 64, baseType: !54, size: 32, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !561, file: !560, line: 65, baseType: !54, size: 32, offset: 1120)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !561, file: !560, line: 68, baseType: !604, size: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !560, line: 68, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !561, file: !560, line: 69, baseType: !607, size: 64, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !609, line: 490, size: 768, elements: !610)
!609 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!610 = !{!611, !612, !613, !614, !616, !617, !618, !619, !620, !621, !622, !623}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !608, file: !609, line: 491, baseType: !607, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !608, file: !609, line: 491, baseType: !607, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !608, file: !609, line: 493, baseType: !134, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !608, file: !609, line: 495, baseType: !615, size: 64, offset: 192)
!615 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !608, file: !609, line: 496, baseType: !54, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !608, file: !609, line: 497, baseType: !68, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !608, file: !609, line: 499, baseType: !615, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !608, file: !609, line: 500, baseType: !615, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !608, file: !609, line: 502, baseType: !615, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !608, file: !609, line: 503, baseType: !615, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !608, file: !609, line: 504, baseType: !615, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !608, file: !609, line: 505, baseType: !54, size: 32, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !554, file: !143, line: 234, baseType: !574, size: 128, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !554, file: !143, line: 235, baseType: !574, size: 128, offset: 1536)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !554, file: !143, line: 236, baseType: !97, size: 16, offset: 1664)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !554, file: !143, line: 236, baseType: !97, size: 16, offset: 1680)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !554, file: !143, line: 238, baseType: !97, size: 16, offset: 1696)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !554, file: !143, line: 239, baseType: !97, size: 16, offset: 1712)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !554, file: !143, line: 240, baseType: !97, size: 16, offset: 1728)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !554, file: !143, line: 241, baseType: !97, size: 16, offset: 1744)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !554, file: !143, line: 243, baseType: !175, size: 32, offset: 1760)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !554, file: !143, line: 244, baseType: !97, size: 16, offset: 1792)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !554, file: !143, line: 244, baseType: !97, size: 16, offset: 1808)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !554, file: !143, line: 246, baseType: !97, size: 16, offset: 1824)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !554, file: !143, line: 247, baseType: !97, size: 16, offset: 1840)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !554, file: !143, line: 248, baseType: !97, size: 16, offset: 1856)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !554, file: !143, line: 249, baseType: !97, size: 16, offset: 1872)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !554, file: !143, line: 250, baseType: !97, size: 16, offset: 1888)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !554, file: !143, line: 251, baseType: !97, size: 16, offset: 1904)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !554, file: !143, line: 253, baseType: !51, size: 64, offset: 1920)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !554, file: !143, line: 255, baseType: !123, size: 128, offset: 1984)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !554, file: !143, line: 256, baseType: !123, size: 128, offset: 2112)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !554, file: !143, line: 257, baseType: !123, size: 128, offset: 2240)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !554, file: !143, line: 258, baseType: !123, size: 128, offset: 2368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !554, file: !143, line: 259, baseType: !123, size: 128, offset: 2496)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !554, file: !143, line: 260, baseType: !123, size: 128, offset: 2624)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !554, file: !143, line: 261, baseType: !123, size: 128, offset: 2752)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !554, file: !143, line: 263, baseType: !607, size: 64, offset: 2880)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !554, file: !143, line: 265, baseType: !651, size: 64, offset: 2944)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !554, file: !143, line: 266, baseType: !68, size: 64, offset: 3008)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !14, line: 925, size: 3200, elements: !655)
!655 = !{!656, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !14, line: 926, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !14, line: 91, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !14, line: 85, size: 448, elements: !660)
!660 = !{!661, !663, !664, !665, !666, !667}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !659, file: !14, line: 86, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !659, file: !14, line: 86, baseType: !662, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !659, file: !14, line: 87, baseType: !123, size: 128, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !659, file: !14, line: 88, baseType: !54, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !659, file: !14, line: 89, baseType: !175, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !659, file: !14, line: 90, baseType: !668, size: 128, offset: 320)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 8)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !654, file: !14, line: 926, baseType: !657, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !654, file: !14, line: 927, baseType: !123, size: 128, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !654, file: !14, line: 928, baseType: !54, size: 32, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !654, file: !14, line: 929, baseType: !175, size: 32, offset: 288)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !654, file: !14, line: 930, baseType: !668, size: 128, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !654, file: !14, line: 932, baseType: !559, size: 1280, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !654, file: !14, line: 934, baseType: !71, size: 64, offset: 1728)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !654, file: !14, line: 934, baseType: !71, size: 64, offset: 1792)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !654, file: !14, line: 935, baseType: !97, size: 16, offset: 1856)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !654, file: !14, line: 935, baseType: !97, size: 16, offset: 1872)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !654, file: !14, line: 936, baseType: !175, size: 32, offset: 1888)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !654, file: !14, line: 936, baseType: !175, size: 32, offset: 1920)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !654, file: !14, line: 938, baseType: !175, size: 32, offset: 1952)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !654, file: !14, line: 938, baseType: !175, size: 32, offset: 1984)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !654, file: !14, line: 939, baseType: !175, size: 32, offset: 2016)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !654, file: !14, line: 940, baseType: !584, size: 64, offset: 2048)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "treepath", scope: !654, file: !14, line: 947, baseType: !123, size: 128, offset: 2112)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !654, file: !14, line: 949, baseType: !326, size: 64, offset: 2240)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "edittree", scope: !654, file: !14, line: 949, baseType: !326, size: 64, offset: 2304)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tree_idname", scope: !654, file: !14, line: 952, baseType: !113, size: 512, offset: 2368)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "treetype", scope: !654, file: !14, line: 953, baseType: !54, size: 32, offset: 2880)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !654, file: !14, line: 954, baseType: !54, size: 32, offset: 2912)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "texfrom", scope: !654, file: !14, line: 956, baseType: !97, size: 16, offset: 2944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "shaderfrom", scope: !654, file: !14, line: 957, baseType: !97, size: 16, offset: 2960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !654, file: !14, line: 958, baseType: !97, size: 16, offset: 2976)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !654, file: !14, line: 959, baseType: !97, size: 16, offset: 2992)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "linkdrag", scope: !654, file: !14, line: 960, baseType: !123, size: 128, offset: 3008)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !654, file: !14, line: 962, baseType: !699, size: 64, offset: 3136)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !153, line: 61, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !328, line: 274, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !328, line: 271, size: 32, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !702, file: !328, line: 273, baseType: !5, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !362, file: !335, line: 168, baseType: !706, size: 64, offset: 4288)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !551, !326, !353}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !362, file: !335, line: 171, baseType: !710, size: 64, offset: 4352)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !424, !421, !426}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !362, file: !335, line: 173, baseType: !710, size: 64, offset: 4416)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !362, file: !335, line: 176, baseType: !715, size: 64, offset: 4480)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !653, !718, !353, !54, !54}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !720, line: 136, flags: DIFlagFwdDecl)
!720 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !362, file: !335, line: 179, baseType: !722, size: 64, offset: 4544)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !326, !353, !651, !54}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !362, file: !335, line: 181, baseType: !726, size: 64, offset: 4608)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!54, !353, !54, !54}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !362, file: !335, line: 183, baseType: !726, size: 64, offset: 4672)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !362, file: !335, line: 185, baseType: !726, size: 64, offset: 4736)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !362, file: !335, line: 188, baseType: !350, size: 64, offset: 4800)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !362, file: !335, line: 190, baseType: !733, size: 64, offset: 4864)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !326, !353, !71}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !362, file: !335, line: 193, baseType: !350, size: 64, offset: 4928)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !362, file: !335, line: 195, baseType: !738, size: 64, offset: 4992)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !353}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !362, file: !335, line: 197, baseType: !742, size: 64, offset: 5056)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !326, !353, !353}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !362, file: !335, line: 200, baseType: !746, size: 64, offset: 5120)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !551, !426}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !362, file: !335, line: 201, baseType: !750, size: 64, offset: 5184)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !426}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !362, file: !335, line: 202, baseType: !754, size: 64, offset: 5248)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !426, !353}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !362, file: !335, line: 205, baseType: !758, size: 64, offset: 5312)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!54, !361, !326}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !362, file: !335, line: 207, baseType: !762, size: 64, offset: 5376)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!54, !353, !326}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !362, file: !335, line: 210, baseType: !350, size: 64, offset: 5440)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !362, file: !335, line: 213, baseType: !767, size: 64, offset: 5504)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !335, line: 135, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!68, !771, !353, !701}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !335, line: 62, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !362, file: !335, line: 214, baseType: !774, size: 64, offset: 5568)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !335, line: 136, baseType: !490)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !362, file: !335, line: 215, baseType: !776, size: 64, offset: 5632)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !335, line: 137, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !68, !54, !353, !780, !782, !782}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !335, line: 63, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !362, file: !335, line: 217, baseType: !785, size: 64, offset: 5696)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !335, line: 138, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!54, !789, !353, !780, !791, !791}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !335, line: 64, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !335, line: 66, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !362, file: !335, line: 220, baseType: !465, size: 256, offset: 5760)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !354, file: !328, line: 173, baseType: !113, size: 512, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !328, line: 175, baseType: !113, size: 512, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !328, line: 176, baseType: !54, size: 32, offset: 1344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !328, line: 177, baseType: !97, size: 16, offset: 1376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !328, line: 177, baseType: !97, size: 16, offset: 1392)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !354, file: !328, line: 178, baseType: !97, size: 16, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !354, file: !328, line: 178, baseType: !97, size: 16, offset: 1424)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !354, file: !328, line: 179, baseType: !97, size: 16, offset: 1440)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !354, file: !328, line: 179, baseType: !97, size: 16, offset: 1456)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !354, file: !328, line: 180, baseType: !97, size: 16, offset: 1472)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !354, file: !328, line: 181, baseType: !97, size: 16, offset: 1488)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !354, file: !328, line: 182, baseType: !806, size: 96, offset: 1504)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 96, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 3)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !354, file: !328, line: 184, baseType: !123, size: 128, offset: 1600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !354, file: !328, line: 184, baseType: !123, size: 128, offset: 1728)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !354, file: !328, line: 185, baseType: !353, size: 64, offset: 1856)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !354, file: !328, line: 186, baseType: !71, size: 64, offset: 1920)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !354, file: !328, line: 187, baseType: !68, size: 64, offset: 1984)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !354, file: !328, line: 188, baseType: !353, size: 64, offset: 2048)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !354, file: !328, line: 189, baseType: !123, size: 128, offset: 2112)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !354, file: !328, line: 191, baseType: !175, size: 32, offset: 2240)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !354, file: !328, line: 191, baseType: !175, size: 32, offset: 2272)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !354, file: !328, line: 192, baseType: !175, size: 32, offset: 2304)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !354, file: !328, line: 192, baseType: !175, size: 32, offset: 2336)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !354, file: !328, line: 193, baseType: !175, size: 32, offset: 2368)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !354, file: !328, line: 194, baseType: !175, size: 32, offset: 2400)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !354, file: !328, line: 194, baseType: !175, size: 32, offset: 2432)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !354, file: !328, line: 196, baseType: !54, size: 32, offset: 2464)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !354, file: !328, line: 198, baseType: !113, size: 512, offset: 2496)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !354, file: !328, line: 199, baseType: !97, size: 16, offset: 3008)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !354, file: !328, line: 199, baseType: !97, size: 16, offset: 3024)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !354, file: !328, line: 200, baseType: !175, size: 32, offset: 3040)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !354, file: !328, line: 200, baseType: !175, size: 32, offset: 3072)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !354, file: !328, line: 202, baseType: !97, size: 16, offset: 3104)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !354, file: !328, line: 202, baseType: !97, size: 16, offset: 3120)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !354, file: !328, line: 203, baseType: !68, size: 64, offset: 3136)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !354, file: !328, line: 204, baseType: !564, size: 128, offset: 3200)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !354, file: !328, line: 205, baseType: !564, size: 128, offset: 3328)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !354, file: !328, line: 206, baseType: !564, size: 128, offset: 3456)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !354, file: !328, line: 215, baseType: !97, size: 16, offset: 3584)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !354, file: !328, line: 215, baseType: !97, size: 16, offset: 3600)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !354, file: !328, line: 216, baseType: !54, size: 32, offset: 3616)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !354, file: !328, line: 217, baseType: !839, size: 64, offset: 3648)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !328, line: 51, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !334, file: !335, line: 294, baseType: !842, size: 64, offset: 3264)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !151, !68, !845}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeClassCallback", file: !335, line: 282, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !68, !54, !437}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !334, file: !335, line: 296, baseType: !850, size: 64, offset: 3328)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!54, !551, !333}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "get_from_context", scope: !334, file: !335, line: 298, baseType: !854, size: 64, offset: 3392)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !551, !333, !857, !858, !858}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "localize", scope: !334, file: !335, line: 302, baseType: !860, size: 64, offset: 3456)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !326, !326}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "local_sync", scope: !334, file: !335, line: 303, baseType: !860, size: 64, offset: 3520)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "local_merge", scope: !334, file: !335, line: 304, baseType: !860, size: 64, offset: 3584)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !334, file: !335, line: 307, baseType: !346, size: 64, offset: 3648)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "validate_link", scope: !334, file: !335, line: 309, baseType: !867, size: 64, offset: 3712)
