; ModuleID = 'blender/source/blender/editors/space_nla/nla_buttons.c'
source_filename = "blender/source/blender/editors/space_nla/nla_buttons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.bContext = type opaque
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.bAnimContext = type { i8*, i16, i16, i16, i16, %struct.ScrArea*, %struct.SpaceLink*, %struct.ARegion*, %struct.bDopeSheet*, %struct.Scene*, %struct.Object*, %struct.ListBase*, %struct.ReportList* }
%struct.ScrArea = type { %struct.ScrArea*, %struct.ScrArea*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.bScreen*, %struct.rcti, i8, i8, i16, i16, i16, i16, i16, i16, i8, i8, %struct.SpaceType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase }
%struct.ScrVert = type { %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.vec2s, i16, i16 }
%struct.vec2s = type { i16, i16 }
%struct.bScreen = type { %struct.ID, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.Scene*, %struct.Scene*, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, %struct.wmTimer*, i8* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!917 = !DIEnumerator(name: "BUT", value: 512, isUnsigned: true)
!918 = !DIEnumerator(name: "ROW", value: 1024, isUnsigned: true)
!919 = !DIEnumerator(name: "TOG", value: 1536, isUnsigned: true)
!920 = !DIEnumerator(name: "NUM", value: 2560, isUnsigned: true)
!921 = !DIEnumerator(name: "TEX", value: 3072, isUnsigned: true)
!922 = !DIEnumerator(name: "TOGN", value: 4608, isUnsigned: true)
!923 = !DIEnumerator(name: "LABEL", value: 5120, isUnsigned: true)
!924 = !DIEnumerator(name: "MENU", value: 5632, isUnsigned: true)
!925 = !DIEnumerator(name: "ICONTOG", value: 6656, isUnsigned: true)
!926 = !DIEnumerator(name: "NUMSLI", value: 7168, isUnsigned: true)
!927 = !DIEnumerator(name: "COLOR", value: 7680, isUnsigned: true)
!928 = !DIEnumerator(name: "SCROLL", value: 9216, isUnsigned: true)
!929 = !DIEnumerator(name: "BLOCK", value: 9728, isUnsigned: true)
!930 = !DIEnumerator(name: "BUTM", value: 10240, isUnsigned: true)
!931 = !DIEnumerator(name: "SEPR", value: 10752, isUnsigned: true)
!932 = !DIEnumerator(name: "LINK", value: 11264, isUnsigned: true)
!933 = !DIEnumerator(name: "INLINK", value: 11776, isUnsigned: true)
!934 = !DIEnumerator(name: "KEYEVT", value: 12288, isUnsigned: true)
!935 = !DIEnumerator(name: "HSVCUBE", value: 13312, isUnsigned: true)
!936 = !DIEnumerator(name: "PULLDOWN", value: 13824, isUnsigned: true)
!937 = !DIEnumerator(name: "ROUNDBOX", value: 14336, isUnsigned: true)
!938 = !DIEnumerator(name: "BUT_COLORBAND", value: 15360, isUnsigned: true)
!939 = !DIEnumerator(name: "BUT_NORMAL", value: 15872, isUnsigned: true)
!940 = !DIEnumerator(name: "BUT_CURVE", value: 16384, isUnsigned: true)
!941 = !DIEnumerator(name: "ICONTOGN", value: 17408, isUnsigned: true)
!942 = !DIEnumerator(name: "LISTBOX", value: 17920, isUnsigned: true)
!943 = !DIEnumerator(name: "LISTROW", value: 18432, isUnsigned: true)
!944 = !DIEnumerator(name: "TOGBUT", value: 18944, isUnsigned: true)
!945 = !DIEnumerator(name: "OPTION", value: 19456, isUnsigned: true)
!946 = !DIEnumerator(name: "OPTIONN", value: 19968, isUnsigned: true)
!947 = !DIEnumerator(name: "TRACKPREVIEW", value: 20480, isUnsigned: true)
!948 = !DIEnumerator(name: "SEARCH_MENU", value: 20992, isUnsigned: true)
!949 = !DIEnumerator(name: "BUT_EXTRA", value: 21504, isUnsigned: true)
!950 = !DIEnumerator(name: "HSVCIRCLE", value: 22016, isUnsigned: true)
!951 = !DIEnumerator(name: "HOTKEYEVT", value: 23552, isUnsigned: true)
!952 = !DIEnumerator(name: "BUT_IMAGE", value: 24064, isUnsigned: true)
!953 = !DIEnumerator(name: "HISTOGRAM", value: 24576, isUnsigned: true)
!954 = !DIEnumerator(name: "WAVEFORM", value: 25088, isUnsigned: true)
!955 = !DIEnumerator(name: "VECTORSCOPE", value: 25600, isUnsigned: true)
!956 = !DIEnumerator(name: "PROGRESSBAR", value: 26112, isUnsigned: true)
!957 = !DIEnumerator(name: "SEARCH_MENU_UNLINK", value: 26624, isUnsigned: true)
!958 = !DIEnumerator(name: "NODESOCKET", value: 27136, isUnsigned: true)
!959 = !DIEnumerator(name: "SEPRLINE", value: 27648, isUnsigned: true)
!960 = !DIEnumerator(name: "GRIP", value: 28160, isUnsigned: true)
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !962, line: 141, baseType: !22, size: 32, elements: !963)
!962 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975}
!964 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!965 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!966 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!967 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!968 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!969 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!970 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!971 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!972 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!973 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!974 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!975 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!976 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !977, line: 351, baseType: !22, size: 32, elements: !978)
!977 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!978 = !{!979, !980, !981, !982, !983, !984}
!979 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!980 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!981 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!982 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!983 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!984 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!985 = !{!986, !999, !1008, !1067}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaTrack", file: !908, line: 682, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaTrack", file: !908, line: 673, size: 832, elements: !989)
!989 = !{!990, !992, !993, !1001, !1002, !1003}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !908, line: 674, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !988, file: !908, line: 674, baseType: !991, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !988, file: !908, line: 676, baseType: !994, size: 128, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !995, line: 71, baseType: !996)
!995 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !995, line: 69, size: 128, elements: !997)
!997 = !{!998, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !996, file: !995, line: 70, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !996, file: !995, line: 70, baseType: !999, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !988, file: !908, line: 678, baseType: !5, size: 32, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !988, file: !908, line: 679, baseType: !5, size: 32, offset: 288)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !908, line: 681, baseType: !1004, size: 512, offset: 320)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 512, elements: !1006)
!1005 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1006 = !{!1007}
!1007 = !DISubrange(count: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1010, line: 130, baseType: !1011)
!1010 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1010, line: 117, size: 960, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1017, !1035, !1039, !1041, !1042, !1043, !1044}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1011, file: !1010, line: 118, baseType: !999, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1011, file: !1010, line: 118, baseType: !999, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1011, file: !1010, line: 119, baseType: !1016, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1011, file: !1010, line: 120, baseType: !1018, size: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1010, line: 136, size: 17600, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1026, !1030, !1031, !1032}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1019, file: !1010, line: 137, baseType: !1009, size: 960)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1019, file: !1010, line: 138, baseType: !1008, size: 64, offset: 960)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1019, file: !1010, line: 139, baseType: !1024, size: 64, offset: 1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1010, line: 43, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1019, file: !1010, line: 140, baseType: !1027, size: 8192, offset: 1088)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 8192, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 1024)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1019, file: !1010, line: 141, baseType: !1027, size: 8192, offset: 9280)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1019, file: !1010, line: 148, baseType: !1018, size: 64, offset: 17472)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1019, file: !1010, line: 150, baseType: !1033, size: 64, offset: 17536)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1010, line: 45, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1011, file: !1010, line: 121, baseType: !1036, size: 528, offset: 256)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 528, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 66)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1011, file: !1010, line: 126, baseType: !1040, size: 16, offset: 784)
!1040 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1011, file: !1010, line: 127, baseType: !5, size: 32, offset: 800)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1011, file: !1010, line: 128, baseType: !5, size: 32, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1011, file: !1010, line: 128, baseType: !5, size: 32, offset: 864)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1011, file: !1010, line: 129, baseType: !1045, size: 64, offset: 896)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1010, line: 75, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1010, line: 62, size: 1024, elements: !1048)
!1048 = !{!1049, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1065, !1066}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1047, file: !1010, line: 63, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1047, file: !1010, line: 63, baseType: !1050, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1047, file: !1010, line: 64, baseType: !1005, size: 8, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1047, file: !1010, line: 64, baseType: !1005, size: 8, offset: 136)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1047, file: !1010, line: 65, baseType: !1040, size: 16, offset: 144)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !1010, line: 66, baseType: !1004, size: 512, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1047, file: !1010, line: 67, baseType: !5, size: 32, offset: 672)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1047, file: !1010, line: 69, baseType: !1058, size: 256, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1010, line: 60, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1010, line: 48, size: 256, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1059, file: !1010, line: 49, baseType: !999, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1059, file: !1010, line: 58, baseType: !994, size: 128, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1059, file: !1010, line: 59, baseType: !5, size: 32, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1059, file: !1010, line: 59, baseType: !5, size: 32, offset: 224)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1047, file: !1010, line: 70, baseType: !5, size: 32, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1047, file: !1010, line: 74, baseType: !5, size: 32, offset: 992)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !1069, line: 69, baseType: !1070)
!1069 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1071, line: 44, flags: DIFlagFwdDecl)
!1071 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1072 = !{i32 7, !"Dwarf Version", i32 4}
!1073 = !{i32 2, !"Debug Info Version", i32 3}
!1074 = !{i32 1, !"wchar_size", i32 4}
!1075 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1076 = distinct !DISubprogram(name: "nla_panel_context", scope: !1, file: !1, line: 83, type: !1077, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1094)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1079, !1080, !1082, !1082, !1082}
!1079 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !1071, line: 62, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1071, line: 55, size: 192, elements: !1085)
!1085 = !{!1086, !1090, !1093}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1084, file: !1071, line: 58, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1084, file: !1071, line: 56, size: 64, elements: !1088)
!1088 = !{!1089}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !1071, line: 57, baseType: !999, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1084, file: !1071, line: 60, baseType: !1091, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1071, line: 41, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1084, file: !1071, line: 61, baseType: !999, size: 64, offset: 128)
!1094 = !{}
!1095 = !DILocalVariable(name: "C", arg: 1, scope: !1076, file: !1, line: 83, type: !1080)
!1096 = !DILocation(line: 83, column: 40, scope: !1076)
!1097 = !DILocalVariable(name: "adt_ptr", arg: 2, scope: !1076, file: !1, line: 83, type: !1082)
!1098 = !DILocation(line: 83, column: 55, scope: !1076)
!1099 = !DILocalVariable(name: "nlt_ptr", arg: 3, scope: !1076, file: !1, line: 83, type: !1082)
!1100 = !DILocation(line: 83, column: 76, scope: !1076)
!1101 = !DILocalVariable(name: "strip_ptr", arg: 4, scope: !1076, file: !1, line: 83, type: !1082)
!1102 = !DILocation(line: 83, column: 97, scope: !1076)
!1103 = !DILocalVariable(name: "ac", scope: !1076, file: !1, line: 85, type: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimContext", file: !4, line: 89, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimContext", file: !4, line: 71, size: 640, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !2673, !2674, !2787, !2801, !2802, !2803, !2804}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1105, file: !4, line: 72, baseType: !999, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !1105, file: !4, line: 73, baseType: !1040, size: 16, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1105, file: !4, line: 75, baseType: !1040, size: 16, offset: 80)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1105, file: !4, line: 76, baseType: !1040, size: 16, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !1105, file: !4, line: 77, baseType: !1040, size: 16, offset: 112)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1105, file: !4, line: 78, baseType: !1113, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !1115, line: 203, size: 1280, elements: !1116)
!1115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1116 = !{!1117, !1118, !1119, !1137, !1138, !1139, !1140, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2669, !2670, !2671, !2672}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1114, file: !1115, line: 204, baseType: !1113, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1114, file: !1115, line: 204, baseType: !1113, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1114, file: !1115, line: 206, baseType: !1120, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !1115, line: 87, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !1115, line: 82, size: 256, elements: !1123)
!1123 = !{!1124, !1126, !1127, !1128, !1135, !1136}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1122, file: !1115, line: 83, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1122, file: !1115, line: 83, baseType: !1125, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !1122, file: !1115, line: 83, baseType: !1125, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1122, file: !1115, line: 84, baseType: !1129, size: 32, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !1130, line: 43, baseType: !1131)
!1130 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !1130, line: 41, size: 32, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1131, file: !1130, line: 42, baseType: !1040, size: 16)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1131, file: !1130, line: 42, baseType: !1040, size: 16, offset: 16)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1122, file: !1115, line: 86, baseType: !1040, size: 16, offset: 224)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !1122, file: !1115, line: 86, baseType: !1040, size: 16, offset: 240)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1114, file: !1115, line: 206, baseType: !1120, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1114, file: !1115, line: 206, baseType: !1120, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1114, file: !1115, line: 206, baseType: !1120, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1114, file: !1115, line: 207, baseType: !1141, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !1115, line: 80, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1115, line: 49, size: 1984, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2536}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1143, file: !1115, line: 50, baseType: !1009, size: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1143, file: !1115, line: 52, baseType: !994, size: 128, offset: 960)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1143, file: !1115, line: 53, baseType: !994, size: 128, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1143, file: !1115, line: 54, baseType: !994, size: 128, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1143, file: !1115, line: 55, baseType: !994, size: 128, offset: 1344)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1143, file: !1115, line: 57, baseType: !1151, size: 64, offset: 1472)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1153, line: 1216, size: 39680, elements: !1154)
!1153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1154 = !{!1155, !1156, !1226, !1230, !1233, !1234, !1235, !1247, !1248, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1264, !1341, !1777, !1991, !1994, !2282, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2304, !2305, !2306, !2307, !2308, !2316, !2383, !2390, !2391, !2398, !2399, !2405, !2406, !2407, !2408, !2409}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1152, file: !1153, line: 1217, baseType: !1009, size: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1152, file: !1153, line: 1218, baseType: !1157, size: 64, offset: 960)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !908, line: 838, size: 768, elements: !1159)
!1159 = !{!1160, !1175, !1176, !1186, !1187, !1219, !1220, !1221, !1222, !1223, !1224, !1225}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1158, file: !908, line: 840, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !1163, line: 499, baseType: !1164)
!1163 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1163, line: 486, size: 1600, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1164, file: !1163, line: 487, baseType: !1009, size: 960)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1164, file: !1163, line: 489, baseType: !994, size: 128, offset: 960)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1164, file: !1163, line: 490, baseType: !994, size: 128, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1164, file: !1163, line: 491, baseType: !994, size: 128, offset: 1216)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1164, file: !1163, line: 492, baseType: !994, size: 128, offset: 1344)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1164, file: !1163, line: 494, baseType: !5, size: 32, offset: 1472)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1164, file: !1163, line: 495, baseType: !5, size: 32, offset: 1504)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1164, file: !1163, line: 497, baseType: !5, size: 32, offset: 1536)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1164, file: !1163, line: 498, baseType: !5, size: 32, offset: 1568)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1158, file: !908, line: 844, baseType: !1161, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1158, file: !908, line: 848, baseType: !1177, size: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !908, line: 549, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !908, line: 544, size: 320, elements: !1180)
!1180 = !{!1181, !1183, !1184, !1185}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1179, file: !908, line: 545, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1179, file: !908, line: 545, baseType: !1182, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1179, file: !908, line: 547, baseType: !1161, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1179, file: !908, line: 548, baseType: !994, size: 128, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1158, file: !908, line: 851, baseType: !994, size: 128, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1158, file: !908, line: 853, baseType: !1188, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !908, line: 594, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !908, line: 561, size: 1664, elements: !1191)
!1191 = !{!1192, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1190, file: !908, line: 562, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1190, file: !908, line: 562, baseType: !1193, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1190, file: !908, line: 564, baseType: !994, size: 128, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1190, file: !908, line: 565, baseType: !1161, size: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1190, file: !908, line: 566, baseType: !1177, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1190, file: !908, line: 568, baseType: !994, size: 128, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1190, file: !908, line: 569, baseType: !994, size: 128, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1190, file: !908, line: 571, baseType: !1004, size: 512, offset: 640)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1190, file: !908, line: 573, baseType: !1202, size: 32, offset: 1152)
!1202 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1190, file: !908, line: 574, baseType: !1202, size: 32, offset: 1184)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1190, file: !908, line: 576, baseType: !1202, size: 32, offset: 1216)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1190, file: !908, line: 576, baseType: !1202, size: 32, offset: 1248)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1190, file: !908, line: 577, baseType: !1202, size: 32, offset: 1280)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1190, file: !908, line: 577, baseType: !1202, size: 32, offset: 1312)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1190, file: !908, line: 579, baseType: !1202, size: 32, offset: 1344)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1190, file: !908, line: 580, baseType: !1202, size: 32, offset: 1376)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1190, file: !908, line: 582, baseType: !1202, size: 32, offset: 1408)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1190, file: !908, line: 582, baseType: !1202, size: 32, offset: 1440)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1190, file: !908, line: 583, baseType: !1040, size: 16, offset: 1472)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1190, file: !908, line: 585, baseType: !1040, size: 16, offset: 1488)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1190, file: !908, line: 586, baseType: !1040, size: 16, offset: 1504)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1190, file: !908, line: 588, baseType: !1040, size: 16, offset: 1520)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1190, file: !908, line: 590, baseType: !999, size: 64, offset: 1536)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1190, file: !908, line: 592, baseType: !5, size: 32, offset: 1600)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1190, file: !908, line: 593, baseType: !5, size: 32, offset: 1632)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1158, file: !908, line: 858, baseType: !994, size: 128, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1158, file: !908, line: 859, baseType: !994, size: 128, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1158, file: !908, line: 862, baseType: !5, size: 32, offset: 640)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1158, file: !908, line: 863, baseType: !5, size: 32, offset: 672)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1158, file: !908, line: 866, baseType: !1040, size: 16, offset: 704)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1158, file: !908, line: 867, baseType: !1040, size: 16, offset: 720)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1158, file: !908, line: 868, baseType: !1202, size: 32, offset: 736)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1152, file: !1153, line: 1220, baseType: !1227, size: 64, offset: 1024)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1229, line: 49, flags: DIFlagFwdDecl)
!1229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1152, file: !1153, line: 1221, baseType: !1231, size: 64, offset: 1088)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1153, line: 52, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1152, file: !1153, line: 1223, baseType: !1151, size: 64, offset: 1152)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1152, file: !1153, line: 1225, baseType: !994, size: 128, offset: 1216)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1152, file: !1153, line: 1226, baseType: !1236, size: 64, offset: 1344)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1153, line: 69, size: 320, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1237, file: !1153, line: 70, baseType: !1236, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1237, file: !1153, line: 70, baseType: !1236, size: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1237, file: !1153, line: 71, baseType: !22, size: 32, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1237, file: !1153, line: 71, baseType: !22, size: 32, offset: 160)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1237, file: !1153, line: 72, baseType: !5, size: 32, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1237, file: !1153, line: 73, baseType: !1040, size: 16, offset: 224)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1237, file: !1153, line: 73, baseType: !1040, size: 16, offset: 240)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1237, file: !1153, line: 74, baseType: !1227, size: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1152, file: !1153, line: 1227, baseType: !1227, size: 64, offset: 1408)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1152, file: !1153, line: 1229, baseType: !1249, size: 96, offset: 1472)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 96, elements: !1250)
!1250 = !{!1251}
!1251 = !DISubrange(count: 3)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1152, file: !1153, line: 1230, baseType: !1249, size: 96, offset: 1568)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1152, file: !1153, line: 1231, baseType: !1249, size: 96, offset: 1664)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1152, file: !1153, line: 1231, baseType: !1249, size: 96, offset: 1760)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1152, file: !1153, line: 1233, baseType: !22, size: 32, offset: 1856)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1152, file: !1153, line: 1234, baseType: !5, size: 32, offset: 1888)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1152, file: !1153, line: 1235, baseType: !22, size: 32, offset: 1920)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1152, file: !1153, line: 1237, baseType: !1040, size: 16, offset: 1952)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1152, file: !1153, line: 1239, baseType: !1005, size: 8, offset: 1968)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1152, file: !1153, line: 1240, baseType: !1261, size: 8, offset: 1976)
!1261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 8, elements: !1262)
!1262 = !{!1263}
!1263 = !DISubrange(count: 1)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1152, file: !1153, line: 1242, baseType: !1265, size: 64, offset: 1984)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1267, line: 328, size: 3456, elements: !1268)
!1267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1268 = !{!1269, !1270, !1271, !1274, !1275, !1276, !1280, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1306, !1307, !1308, !1311, !1316, !1317, !1320, !1324, !1329, !1333, !1337, !1338, !1339, !1340}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1266, file: !1267, line: 329, baseType: !1009, size: 960)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1266, file: !1267, line: 330, baseType: !1157, size: 64, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1266, file: !1267, line: 332, baseType: !1272, size: 64, offset: 1024)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1267, line: 332, flags: DIFlagFwdDecl)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1266, file: !1267, line: 333, baseType: !1004, size: 512, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1266, file: !1267, line: 335, baseType: !1091, size: 64, offset: 1600)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1266, file: !1267, line: 337, baseType: !1277, size: 64, offset: 1664)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1279, line: 45, flags: DIFlagFwdDecl)
!1279 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1266, file: !1267, line: 338, baseType: !1281, size: 64, offset: 1728)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 64, elements: !1282)
!1282 = !{!1283}
!1283 = !DISubrange(count: 2)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1266, file: !1267, line: 340, baseType: !994, size: 128, offset: 1792)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1266, file: !1267, line: 340, baseType: !994, size: 128, offset: 1920)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1266, file: !1267, line: 342, baseType: !5, size: 32, offset: 2048)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1266, file: !1267, line: 342, baseType: !5, size: 32, offset: 2080)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1266, file: !1267, line: 343, baseType: !5, size: 32, offset: 2112)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1266, file: !1267, line: 345, baseType: !5, size: 32, offset: 2144)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1266, file: !1267, line: 346, baseType: !5, size: 32, offset: 2176)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1266, file: !1267, line: 347, baseType: !1040, size: 16, offset: 2208)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1266, file: !1267, line: 348, baseType: !1040, size: 16, offset: 2224)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1266, file: !1267, line: 349, baseType: !5, size: 32, offset: 2240)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1266, file: !1267, line: 351, baseType: !5, size: 32, offset: 2272)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1266, file: !1267, line: 353, baseType: !1040, size: 16, offset: 2304)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1266, file: !1267, line: 354, baseType: !1040, size: 16, offset: 2320)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1266, file: !1267, line: 355, baseType: !5, size: 32, offset: 2336)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1266, file: !1267, line: 357, baseType: !1299, size: 128, offset: 2368)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1130, line: 95, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1130, line: 92, size: 128, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1300, file: !1130, line: 93, baseType: !1202, size: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1300, file: !1130, line: 93, baseType: !1202, size: 32, offset: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1300, file: !1130, line: 94, baseType: !1202, size: 32, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1300, file: !1130, line: 94, baseType: !1202, size: 32, offset: 96)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1266, file: !1267, line: 363, baseType: !994, size: 128, offset: 2496)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1266, file: !1267, line: 363, baseType: !994, size: 128, offset: 2624)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1266, file: !1267, line: 368, baseType: !1309, size: 64, offset: 2752)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1267, line: 48, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1266, file: !1267, line: 372, baseType: !1312, size: 32, offset: 2816)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1267, line: 274, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1267, line: 271, size: 32, elements: !1314)
!1314 = !{!1315}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1313, file: !1267, line: 273, baseType: !22, size: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1266, file: !1267, line: 373, baseType: !5, size: 32, offset: 2848)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1266, file: !1267, line: 382, baseType: !1318, size: 64, offset: 2880)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1267, line: 46, flags: DIFlagFwdDecl)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1266, file: !1267, line: 385, baseType: !1321, size: 64, offset: 2944)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{null, !999, !1202}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1266, file: !1267, line: 386, baseType: !1325, size: 64, offset: 3008)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{null, !999, !1328}
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1266, file: !1267, line: 387, baseType: !1330, size: 64, offset: 3072)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!5, !999}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1266, file: !1267, line: 388, baseType: !1334, size: 64, offset: 3136)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{null, !999}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1266, file: !1267, line: 389, baseType: !999, size: 64, offset: 3200)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1266, file: !1267, line: 389, baseType: !999, size: 64, offset: 3264)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1266, file: !1267, line: 389, baseType: !999, size: 64, offset: 3328)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1266, file: !1267, line: 389, baseType: !999, size: 64, offset: 3392)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1152, file: !1153, line: 1244, baseType: !1342, size: 64, offset: 2048)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1344, line: 200, size: 17024, elements: !1345)
!1344 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1345 = !{!1346, !1348, !1349, !1350, !1770, !1771, !1772, !1773, !1774, !1775, !1776}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1343, file: !1344, line: 201, baseType: !1347, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1343, file: !1344, line: 202, baseType: !994, size: 128, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1343, file: !1344, line: 203, baseType: !994, size: 128, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1343, file: !1344, line: 206, baseType: !1351, size: 64, offset: 320)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1344, line: 190, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1344, line: 126, size: 2816, elements: !1354)
!1354 = !{!1355, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1454, !1457, !1458, !1459, !1742, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1769}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1353, file: !1344, line: 127, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1353, file: !1344, line: 127, baseType: !1356, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1353, file: !1344, line: 128, baseType: !999, size: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1353, file: !1344, line: 129, baseType: !999, size: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1353, file: !1344, line: 130, baseType: !1004, size: 512, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1353, file: !1344, line: 132, baseType: !5, size: 32, offset: 768)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1353, file: !1344, line: 132, baseType: !5, size: 32, offset: 800)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1353, file: !1344, line: 133, baseType: !5, size: 32, offset: 832)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1353, file: !1344, line: 134, baseType: !5, size: 32, offset: 864)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1353, file: !1344, line: 134, baseType: !5, size: 32, offset: 896)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1353, file: !1344, line: 134, baseType: !5, size: 32, offset: 928)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1353, file: !1344, line: 135, baseType: !5, size: 32, offset: 960)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1353, file: !1344, line: 135, baseType: !5, size: 32, offset: 992)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1353, file: !1344, line: 136, baseType: !5, size: 32, offset: 1024)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1353, file: !1344, line: 136, baseType: !5, size: 32, offset: 1056)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1353, file: !1344, line: 137, baseType: !5, size: 32, offset: 1088)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1353, file: !1344, line: 137, baseType: !5, size: 32, offset: 1120)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1353, file: !1344, line: 138, baseType: !1202, size: 32, offset: 1152)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1353, file: !1344, line: 139, baseType: !1202, size: 32, offset: 1184)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1353, file: !1344, line: 139, baseType: !1202, size: 32, offset: 1216)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1353, file: !1344, line: 141, baseType: !1040, size: 16, offset: 1248)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1353, file: !1344, line: 142, baseType: !1040, size: 16, offset: 1264)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1353, file: !1344, line: 143, baseType: !5, size: 32, offset: 1280)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1353, file: !1344, line: 144, baseType: !5, size: 32, offset: 1312)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1353, file: !1344, line: 146, baseType: !1381, size: 64, offset: 1344)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1344, line: 114, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1344, line: 99, size: 7232, elements: !1384)
!1384 = !{!1385, !1387, !1388, !1389, !1390, !1391, !1392, !1403, !1407, !1422, !1431, !1438, !1448}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1383, file: !1344, line: 100, baseType: !1386, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1383, file: !1344, line: 100, baseType: !1386, size: 64, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1383, file: !1344, line: 101, baseType: !5, size: 32, offset: 128)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1383, file: !1344, line: 101, baseType: !5, size: 32, offset: 160)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1383, file: !1344, line: 102, baseType: !5, size: 32, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1383, file: !1344, line: 102, baseType: !5, size: 32, offset: 224)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1383, file: !1344, line: 103, baseType: !1393, size: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1344, line: 59, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1344, line: 56, size: 2112, elements: !1396)
!1396 = !{!1397, !1401, !1402}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1395, file: !1344, line: 57, baseType: !1398, size: 2048)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 2048, elements: !1399)
!1399 = !{!1400}
!1400 = !DISubrange(count: 256)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1395, file: !1344, line: 58, baseType: !5, size: 32, offset: 2048)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1395, file: !1344, line: 58, baseType: !5, size: 32, offset: 2080)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1383, file: !1344, line: 106, baseType: !1404, size: 6144, offset: 320)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 6144, elements: !1405)
!1405 = !{!1406}
!1406 = !DISubrange(count: 768)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1383, file: !1344, line: 107, baseType: !1408, size: 64, offset: 6464)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1344, line: 97, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1344, line: 83, size: 8320, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1418, !1419, !1420, !1421}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1410, file: !1344, line: 84, baseType: !1404, size: 6144)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1410, file: !1344, line: 87, baseType: !1398, size: 2048, offset: 6144)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1410, file: !1344, line: 88, baseType: !1415, size: 64, offset: 8192)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1417, line: 41, flags: DIFlagFwdDecl)
!1417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1410, file: !1344, line: 90, baseType: !1040, size: 16, offset: 8256)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1410, file: !1344, line: 92, baseType: !1040, size: 16, offset: 8272)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1410, file: !1344, line: 93, baseType: !1040, size: 16, offset: 8288)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1410, file: !1344, line: 95, baseType: !1040, size: 16, offset: 8304)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1383, file: !1344, line: 108, baseType: !1423, size: 64, offset: 6528)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1344, line: 66, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1344, line: 61, size: 128, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1425, file: !1344, line: 62, baseType: !5, size: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1425, file: !1344, line: 63, baseType: !5, size: 32, offset: 32)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1425, file: !1344, line: 64, baseType: !5, size: 32, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1425, file: !1344, line: 65, baseType: !5, size: 32, offset: 96)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1383, file: !1344, line: 109, baseType: !1432, size: 64, offset: 6592)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1344, line: 71, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1344, line: 68, size: 64, elements: !1435)
!1435 = !{!1436, !1437}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1434, file: !1344, line: 69, baseType: !5, size: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1434, file: !1344, line: 70, baseType: !5, size: 32, offset: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1383, file: !1344, line: 110, baseType: !1439, size: 64, offset: 6656)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1344, line: 81, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1344, line: 73, size: 352, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446, !1447}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1441, file: !1344, line: 74, baseType: !1249, size: 96)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1441, file: !1344, line: 75, baseType: !1249, size: 96, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1441, file: !1344, line: 76, baseType: !1249, size: 96, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1441, file: !1344, line: 77, baseType: !5, size: 32, offset: 288)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1441, file: !1344, line: 78, baseType: !5, size: 32, offset: 320)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1383, file: !1344, line: 113, baseType: !1449, size: 512, offset: 6720)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1450, line: 182, baseType: !1451)
!1450 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1450, line: 180, size: 512, elements: !1452)
!1452 = !{!1453}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1451, file: !1450, line: 181, baseType: !1004, size: 512)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1353, file: !1344, line: 148, baseType: !1455, size: 64, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1229, line: 46, flags: DIFlagFwdDecl)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1353, file: !1344, line: 151, baseType: !1151, size: 64, offset: 1472)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1353, file: !1344, line: 152, baseType: !1227, size: 64, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1353, file: !1344, line: 153, baseType: !1460, size: 64, offset: 1600)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1462, line: 64, size: 19136, elements: !1463)
!1462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1463 = !{!1464, !1465, !1466, !1467, !1468, !1469, !1471, !1472, !1473, !1474, !1477, !1478, !1728, !1729, !1737, !1738, !1739, !1740, !1741}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1461, file: !1462, line: 65, baseType: !1009, size: 960)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1461, file: !1462, line: 66, baseType: !1157, size: 64, offset: 960)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1461, file: !1462, line: 68, baseType: !1027, size: 8192, offset: 1024)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1461, file: !1462, line: 70, baseType: !5, size: 32, offset: 9216)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1461, file: !1462, line: 71, baseType: !5, size: 32, offset: 9248)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1461, file: !1462, line: 72, baseType: !1470, size: 64, offset: 9280)
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1282)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1461, file: !1462, line: 74, baseType: !1202, size: 32, offset: 9344)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1461, file: !1462, line: 74, baseType: !1202, size: 32, offset: 9376)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1461, file: !1462, line: 76, baseType: !1415, size: 64, offset: 9408)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1461, file: !1462, line: 77, baseType: !1475, size: 64, offset: 9472)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64)
!1476 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1462, line: 77, flags: DIFlagFwdDecl)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1461, file: !1462, line: 78, baseType: !1277, size: 64, offset: 9536)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1461, file: !1462, line: 80, baseType: !1479, size: 2624, offset: 9600)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1279, line: 340, size: 2624, elements: !1480)
!1480 = !{!1481, !1509, !1527, !1528, !1529, !1547, !1605, !1606, !1708, !1709, !1710, !1711, !1717}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1479, file: !1279, line: 341, baseType: !1482, size: 576)
!1482 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1279, line: 251, baseType: !1483)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1279, line: 207, size: 576, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1483, file: !1279, line: 208, baseType: !5, size: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1483, file: !1279, line: 211, baseType: !1040, size: 16, offset: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1483, file: !1279, line: 212, baseType: !1040, size: 16, offset: 48)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1483, file: !1279, line: 213, baseType: !1202, size: 32, offset: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1483, file: !1279, line: 214, baseType: !1040, size: 16, offset: 96)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1483, file: !1279, line: 215, baseType: !1040, size: 16, offset: 112)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1483, file: !1279, line: 216, baseType: !1040, size: 16, offset: 128)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1483, file: !1279, line: 217, baseType: !1040, size: 16, offset: 144)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1483, file: !1279, line: 218, baseType: !1040, size: 16, offset: 160)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1483, file: !1279, line: 219, baseType: !1040, size: 16, offset: 176)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1483, file: !1279, line: 220, baseType: !1202, size: 32, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1483, file: !1279, line: 222, baseType: !1040, size: 16, offset: 224)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1483, file: !1279, line: 225, baseType: !1040, size: 16, offset: 240)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1483, file: !1279, line: 228, baseType: !5, size: 32, offset: 256)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1483, file: !1279, line: 229, baseType: !5, size: 32, offset: 288)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1483, file: !1279, line: 233, baseType: !5, size: 32, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1483, file: !1279, line: 236, baseType: !1040, size: 16, offset: 352)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1483, file: !1279, line: 236, baseType: !1040, size: 16, offset: 368)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1483, file: !1279, line: 241, baseType: !1202, size: 32, offset: 384)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1483, file: !1279, line: 244, baseType: !5, size: 32, offset: 416)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1483, file: !1279, line: 244, baseType: !5, size: 32, offset: 448)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1483, file: !1279, line: 245, baseType: !1202, size: 32, offset: 480)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1483, file: !1279, line: 248, baseType: !1202, size: 32, offset: 512)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1483, file: !1279, line: 250, baseType: !5, size: 32, offset: 544)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1479, file: !1279, line: 342, baseType: !1510, size: 448, offset: 576)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1279, line: 79, baseType: !1511)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1279, line: 61, size: 448, elements: !1512)
!1512 = !{!1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1511, file: !1279, line: 62, baseType: !999, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1511, file: !1279, line: 64, baseType: !1040, size: 16, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1511, file: !1279, line: 65, baseType: !1040, size: 16, offset: 80)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1511, file: !1279, line: 67, baseType: !1202, size: 32, offset: 96)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1511, file: !1279, line: 68, baseType: !1202, size: 32, offset: 128)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1511, file: !1279, line: 69, baseType: !1202, size: 32, offset: 160)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1511, file: !1279, line: 70, baseType: !1040, size: 16, offset: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1511, file: !1279, line: 71, baseType: !1040, size: 16, offset: 208)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1511, file: !1279, line: 72, baseType: !1281, size: 64, offset: 224)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1511, file: !1279, line: 75, baseType: !1202, size: 32, offset: 288)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1511, file: !1279, line: 75, baseType: !1202, size: 32, offset: 320)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1511, file: !1279, line: 75, baseType: !1202, size: 32, offset: 352)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1511, file: !1279, line: 78, baseType: !1202, size: 32, offset: 384)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1511, file: !1279, line: 78, baseType: !1202, size: 32, offset: 416)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1479, file: !1279, line: 343, baseType: !994, size: 128, offset: 1024)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1479, file: !1279, line: 344, baseType: !994, size: 128, offset: 1152)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1479, file: !1279, line: 345, baseType: !1530, size: 192, offset: 1280)
!1530 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1279, line: 278, baseType: !1531)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1279, line: 270, size: 192, elements: !1532)
!1532 = !{!1533, !1534, !1535, !1536, !1537}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1531, file: !1279, line: 271, baseType: !5, size: 32)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1531, file: !1279, line: 273, baseType: !1202, size: 32, offset: 32)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1531, file: !1279, line: 275, baseType: !5, size: 32, offset: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1531, file: !1279, line: 276, baseType: !5, size: 32, offset: 96)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1531, file: !1279, line: 277, baseType: !1538, size: 64, offset: 128)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1279, line: 55, size: 576, elements: !1540)
!1540 = !{!1541, !1542, !1543}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1539, file: !1279, line: 56, baseType: !5, size: 32)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1539, file: !1279, line: 57, baseType: !1202, size: 32, offset: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1539, file: !1279, line: 58, baseType: !1544, size: 512, offset: 64)
!1544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 512, elements: !1545)
!1545 = !{!1546, !1546}
!1546 = !DISubrange(count: 4)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1479, file: !1279, line: 346, baseType: !1548, size: 384, offset: 1472)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1279, line: 268, baseType: !1549)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1279, line: 253, size: 384, elements: !1550)
!1550 = !{!1551, !1552, !1553, !1554, !1555, !1599, !1600, !1601, !1602, !1603, !1604}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1549, file: !1279, line: 254, baseType: !5, size: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1549, file: !1279, line: 255, baseType: !5, size: 32, offset: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1549, file: !1279, line: 255, baseType: !5, size: 32, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1549, file: !1279, line: 258, baseType: !1202, size: 32, offset: 96)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1549, file: !1279, line: 259, baseType: !1556, size: 64, offset: 128)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64)
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1279, line: 164, baseType: !1558)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1279, line: 108, size: 1664, elements: !1559)
!1559 = !{!1560, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1558, file: !1279, line: 109, baseType: !1561, size: 64)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1558, file: !1279, line: 109, baseType: !1561, size: 64, offset: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1558, file: !1279, line: 111, baseType: !1004, size: 512, offset: 128)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1558, file: !1279, line: 119, baseType: !1281, size: 64, offset: 640)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1558, file: !1279, line: 119, baseType: !1281, size: 64, offset: 704)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1558, file: !1279, line: 125, baseType: !1281, size: 64, offset: 768)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1558, file: !1279, line: 125, baseType: !1281, size: 64, offset: 832)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1558, file: !1279, line: 127, baseType: !1281, size: 64, offset: 896)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1558, file: !1279, line: 130, baseType: !5, size: 32, offset: 960)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1558, file: !1279, line: 131, baseType: !5, size: 32, offset: 992)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1558, file: !1279, line: 132, baseType: !1572, size: 64, offset: 1024)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1279, line: 106, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1279, line: 81, size: 512, elements: !1575)
!1575 = !{!1576, !1577, !1580, !1581, !1582, !1583}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1574, file: !1279, line: 82, baseType: !1281, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1574, file: !1279, line: 97, baseType: !1578, size: 256, offset: 64)
!1578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 256, elements: !1579)
!1579 = !{!1546, !1283}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1574, file: !1279, line: 102, baseType: !1281, size: 64, offset: 320)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1574, file: !1279, line: 102, baseType: !1281, size: 64, offset: 384)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1574, file: !1279, line: 104, baseType: !5, size: 32, offset: 448)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1574, file: !1279, line: 105, baseType: !5, size: 32, offset: 480)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1558, file: !1279, line: 135, baseType: !1249, size: 96, offset: 1088)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1558, file: !1279, line: 136, baseType: !1202, size: 32, offset: 1184)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1558, file: !1279, line: 139, baseType: !5, size: 32, offset: 1216)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1558, file: !1279, line: 139, baseType: !5, size: 32, offset: 1248)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1558, file: !1279, line: 139, baseType: !5, size: 32, offset: 1280)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1558, file: !1279, line: 140, baseType: !1249, size: 96, offset: 1312)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1558, file: !1279, line: 143, baseType: !1040, size: 16, offset: 1408)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1558, file: !1279, line: 144, baseType: !1040, size: 16, offset: 1424)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1558, file: !1279, line: 145, baseType: !1040, size: 16, offset: 1440)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1558, file: !1279, line: 148, baseType: !1040, size: 16, offset: 1456)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1558, file: !1279, line: 149, baseType: !5, size: 32, offset: 1472)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1558, file: !1279, line: 150, baseType: !1202, size: 32, offset: 1504)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1558, file: !1279, line: 152, baseType: !1277, size: 64, offset: 1536)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1558, file: !1279, line: 163, baseType: !1202, size: 32, offset: 1600)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1558, file: !1279, line: 163, baseType: !1202, size: 32, offset: 1632)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1549, file: !1279, line: 261, baseType: !1202, size: 32, offset: 192)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1549, file: !1279, line: 261, baseType: !1202, size: 32, offset: 224)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1549, file: !1279, line: 261, baseType: !1202, size: 32, offset: 256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1549, file: !1279, line: 263, baseType: !5, size: 32, offset: 288)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1549, file: !1279, line: 266, baseType: !5, size: 32, offset: 320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1549, file: !1279, line: 267, baseType: !1202, size: 32, offset: 352)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1479, file: !1279, line: 347, baseType: !1556, size: 64, offset: 1856)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1479, file: !1279, line: 348, baseType: !1607, size: 64, offset: 1920)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1279, line: 205, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1279, line: 186, size: 1024, elements: !1610)
!1610 = !{!1611, !1613, !1614, !1615, !1617, !1618, !1619, !1627, !1628, !1629, !1706, !1707}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1609, file: !1279, line: 187, baseType: !1612, size: 64)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1609, file: !1279, line: 187, baseType: !1612, size: 64, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1609, file: !1279, line: 189, baseType: !1004, size: 512, offset: 128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1609, file: !1279, line: 191, baseType: !1616, size: 64, offset: 640)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1609, file: !1279, line: 193, baseType: !5, size: 32, offset: 704)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1609, file: !1279, line: 193, baseType: !5, size: 32, offset: 736)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1609, file: !1279, line: 195, baseType: !1620, size: 64, offset: 768)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1279, line: 184, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1279, line: 166, size: 320, elements: !1623)
!1623 = !{!1624, !1625, !1626}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1622, file: !1279, line: 180, baseType: !1578, size: 256)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1622, file: !1279, line: 182, baseType: !5, size: 32, offset: 256)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1622, file: !1279, line: 183, baseType: !5, size: 32, offset: 288)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1609, file: !1279, line: 196, baseType: !5, size: 32, offset: 832)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1609, file: !1279, line: 198, baseType: !5, size: 32, offset: 864)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1609, file: !1279, line: 200, baseType: !1630, size: 64, offset: 896)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1417, line: 77, size: 15424, elements: !1632)
!1632 = !{!1633, !1634, !1635, !1638, !1641, !1642, !1645, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1665, !1666, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1692, !1693, !1694, !1695, !1696, !1700}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1631, file: !1417, line: 78, baseType: !1009, size: 960)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1631, file: !1417, line: 80, baseType: !1027, size: 8192, offset: 960)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1631, file: !1417, line: 82, baseType: !1636, size: 64, offset: 9152)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64)
!1637 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1417, line: 43, flags: DIFlagFwdDecl)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1631, file: !1417, line: 83, baseType: !1639, size: 64, offset: 9216)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64)
!1640 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1010, line: 46, flags: DIFlagFwdDecl)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1631, file: !1417, line: 86, baseType: !1415, size: 64, offset: 9280)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1631, file: !1417, line: 87, baseType: !1643, size: 64, offset: 9344)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64)
!1644 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1417, line: 44, flags: DIFlagFwdDecl)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1631, file: !1417, line: 89, baseType: !1646, size: 512, offset: 9408)
!1646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1643, size: 512, elements: !1647)
!1647 = !{!1648}
!1648 = !DISubrange(count: 8)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1631, file: !1417, line: 90, baseType: !1040, size: 16, offset: 9920)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1631, file: !1417, line: 90, baseType: !1040, size: 16, offset: 9936)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1631, file: !1417, line: 92, baseType: !1040, size: 16, offset: 9952)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1631, file: !1417, line: 92, baseType: !1040, size: 16, offset: 9968)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1631, file: !1417, line: 93, baseType: !1040, size: 16, offset: 9984)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1631, file: !1417, line: 93, baseType: !1040, size: 16, offset: 10000)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1631, file: !1417, line: 94, baseType: !5, size: 32, offset: 10016)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1631, file: !1417, line: 97, baseType: !1040, size: 16, offset: 10048)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1631, file: !1417, line: 97, baseType: !1040, size: 16, offset: 10064)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1631, file: !1417, line: 98, baseType: !1040, size: 16, offset: 10080)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1631, file: !1417, line: 98, baseType: !1040, size: 16, offset: 10096)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1631, file: !1417, line: 99, baseType: !1040, size: 16, offset: 10112)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1631, file: !1417, line: 99, baseType: !1040, size: 16, offset: 10128)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1631, file: !1417, line: 100, baseType: !22, size: 32, offset: 10144)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1631, file: !1417, line: 101, baseType: !1664, size: 64, offset: 10176)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1631, file: !1417, line: 103, baseType: !1033, size: 64, offset: 10240)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1631, file: !1417, line: 104, baseType: !1667, size: 64, offset: 10304)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1010, line: 159, size: 448, elements: !1669)
!1669 = !{!1670, !1672, !1673, !1675, !1676, !1678}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1668, file: !1010, line: 161, baseType: !1671, size: 64)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !1282)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1668, file: !1010, line: 162, baseType: !1671, size: 64, offset: 64)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1668, file: !1010, line: 163, baseType: !1674, size: 32, offset: 128)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 32, elements: !1282)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1668, file: !1010, line: 164, baseType: !1674, size: 32, offset: 160)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1668, file: !1010, line: 165, baseType: !1677, size: 128, offset: 192)
!1677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1664, size: 128, elements: !1282)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1668, file: !1010, line: 166, baseType: !1679, size: 128, offset: 320)
!1679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1639, size: 128, elements: !1282)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1631, file: !1417, line: 107, baseType: !1202, size: 32, offset: 10368)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1631, file: !1417, line: 108, baseType: !5, size: 32, offset: 10400)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1631, file: !1417, line: 109, baseType: !1040, size: 16, offset: 10432)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1631, file: !1417, line: 110, baseType: !1040, size: 16, offset: 10448)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1631, file: !1417, line: 113, baseType: !5, size: 32, offset: 10464)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1631, file: !1417, line: 113, baseType: !5, size: 32, offset: 10496)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1631, file: !1417, line: 114, baseType: !1005, size: 8, offset: 10528)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1631, file: !1417, line: 114, baseType: !1005, size: 8, offset: 10536)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1631, file: !1417, line: 115, baseType: !1040, size: 16, offset: 10544)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1631, file: !1417, line: 116, baseType: !1690, size: 128, offset: 10560)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 128, elements: !1691)
!1691 = !{!1546}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1631, file: !1417, line: 119, baseType: !1202, size: 32, offset: 10688)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1631, file: !1417, line: 119, baseType: !1202, size: 32, offset: 10720)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1631, file: !1417, line: 122, baseType: !1449, size: 512, offset: 10752)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1631, file: !1417, line: 123, baseType: !1005, size: 8, offset: 11264)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1631, file: !1417, line: 125, baseType: !1697, size: 56, offset: 11272)
!1697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 56, elements: !1698)
!1698 = !{!1699}
!1699 = !DISubrange(count: 7)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1631, file: !1417, line: 126, baseType: !1701, size: 4096, offset: 11328)
!1701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1702, size: 4096, elements: !1647)
!1702 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1417, line: 69, baseType: !1703)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1417, line: 67, size: 512, elements: !1704)
!1704 = !{!1705}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1703, file: !1417, line: 68, baseType: !1004, size: 512)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1609, file: !1279, line: 201, baseType: !1202, size: 32, offset: 960)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1609, file: !1279, line: 204, baseType: !5, size: 32, offset: 992)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1479, file: !1279, line: 350, baseType: !994, size: 128, offset: 1984)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1479, file: !1279, line: 351, baseType: !5, size: 32, offset: 2112)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1479, file: !1279, line: 351, baseType: !5, size: 32, offset: 2144)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1479, file: !1279, line: 353, baseType: !1712, size: 64, offset: 2176)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1279, line: 297, baseType: !1714)
!1714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1279, line: 295, size: 2048, elements: !1715)
!1715 = !{!1716}
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1714, file: !1279, line: 296, baseType: !1398, size: 2048)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1479, file: !1279, line: 355, baseType: !1718, size: 384, offset: 2240)
!1718 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1279, line: 338, baseType: !1719)
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1279, line: 322, size: 384, elements: !1720)
!1720 = !{!1721, !1722, !1723, !1724, !1725, !1726, !1727}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1719, file: !1279, line: 323, baseType: !5, size: 32)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1719, file: !1279, line: 325, baseType: !1040, size: 16, offset: 32)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1719, file: !1279, line: 326, baseType: !1040, size: 16, offset: 48)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1719, file: !1279, line: 331, baseType: !994, size: 128, offset: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1719, file: !1279, line: 334, baseType: !994, size: 128, offset: 192)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1719, file: !1279, line: 335, baseType: !5, size: 32, offset: 320)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1719, file: !1279, line: 337, baseType: !5, size: 32, offset: 352)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1461, file: !1462, line: 81, baseType: !999, size: 64, offset: 12224)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1461, file: !1462, line: 85, baseType: !1730, size: 6208, offset: 12288)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1462, line: 55, size: 6208, elements: !1731)
!1731 = !{!1732, !1733, !1734, !1735, !1736}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1730, file: !1462, line: 56, baseType: !1404, size: 6144)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1730, file: !1462, line: 58, baseType: !1040, size: 16, offset: 6144)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1730, file: !1462, line: 59, baseType: !1040, size: 16, offset: 6160)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1730, file: !1462, line: 60, baseType: !1040, size: 16, offset: 6176)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1730, file: !1462, line: 61, baseType: !1040, size: 16, offset: 6192)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1461, file: !1462, line: 86, baseType: !5, size: 32, offset: 18496)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1461, file: !1462, line: 88, baseType: !5, size: 32, offset: 18528)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1461, file: !1462, line: 90, baseType: !5, size: 32, offset: 18560)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1461, file: !1462, line: 94, baseType: !5, size: 32, offset: 18592)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1461, file: !1462, line: 100, baseType: !1449, size: 512, offset: 18624)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1353, file: !1344, line: 154, baseType: !1743, size: 64, offset: 1664)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64)
!1744 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1069, line: 264, flags: DIFlagFwdDecl)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1353, file: !1344, line: 156, baseType: !1415, size: 64, offset: 1728)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1353, file: !1344, line: 158, baseType: !1202, size: 32, offset: 1792)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1353, file: !1344, line: 159, baseType: !1202, size: 32, offset: 1824)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1353, file: !1344, line: 162, baseType: !1356, size: 64, offset: 1856)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1353, file: !1344, line: 162, baseType: !1356, size: 64, offset: 1920)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1353, file: !1344, line: 162, baseType: !1356, size: 64, offset: 1984)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1353, file: !1344, line: 164, baseType: !994, size: 128, offset: 2048)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1353, file: !1344, line: 166, baseType: !1753, size: 64, offset: 2176)
!1753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1754, size: 64)
!1754 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1344, line: 51, flags: DIFlagFwdDecl)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1353, file: !1344, line: 167, baseType: !999, size: 64, offset: 2240)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1353, file: !1344, line: 168, baseType: !1202, size: 32, offset: 2304)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1353, file: !1344, line: 170, baseType: !1202, size: 32, offset: 2336)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1353, file: !1344, line: 170, baseType: !1202, size: 32, offset: 2368)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1353, file: !1344, line: 171, baseType: !1202, size: 32, offset: 2400)
