; ModuleID = 'libpng/pngget.c'
source_filename = "libpng/pngget.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "libpng/pngget.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6, !9, !10, !11, !13, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !7, line: 441, baseType: !8)
!7 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !7, line: 442, baseType: !10)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !7, line: 449, baseType: !12)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!19 = distinct !DISubprogram(name: "png_get_valid", scope: !1, file: !1, line: 20, type: !20, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{!6, !22, !475, !6}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_structp", file: !23, line: 850, baseType: !24)
!23 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !23, line: 849, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !28, line: 29, size: 9728, elements: !29)
!28 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !56, !62, !72, !73, !75, !85, !86, !87, !103, !104, !105, !106, !107, !108, !109, !110, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !187, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !210, !211, !212, !214, !223, !224, !229, !230, !231, !232, !233, !234, !235, !239, !240, !241, !242, !243, !252, !253, !254, !255, !260, !262, !390, !395, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !423, !424, !425, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !446, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !27, file: !28, line: 32, baseType: !31, size: 1600)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !32, line: 45, baseType: !33)
!32 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1600, elements: !54)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !32, line: 33, size: 1600, elements: !35)
!35 = !{!36, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !34, file: !32, line: 39, baseType: !37, size: 512)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !38, line: 31, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 512, elements: !41)
!40 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!41 = !{!42}
!42 = !DISubrange(count: 8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !34, file: !32, line: 40, baseType: !10, size: 32, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !34, file: !32, line: 41, baseType: !45, size: 1024, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !46, line: 8, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 5, size: 1024, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !47, file: !46, line: 7, baseType: !50, size: 1024)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, elements: !52)
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !{!53}
!53 = !DISubrange(count: 16)
!54 = !{!55}
!55 = !DISubrange(count: 1)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !27, file: !28, line: 33, baseType: !57, size: 64, offset: 1600)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !23, line: 913, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61, !10}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !27, file: !28, line: 35, baseType: !63, size: 64, offset: 1664)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !23, line: 861, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !69}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !23, line: 851, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !7, line: 537, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !27, file: !28, line: 37, baseType: !63, size: 64, offset: 1728)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !27, file: !28, line: 39, baseType: !74, size: 64, offset: 1792)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !7, line: 524, baseType: !4)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !27, file: !28, line: 40, baseType: !76, size: 64, offset: 1856)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !23, line: 862, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !67, !80, !82}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !7, line: 526, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !7, line: 454, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 46, baseType: !51)
!84 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !27, file: !28, line: 41, baseType: !76, size: 64, offset: 1920)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !27, file: !28, line: 42, baseType: !74, size: 64, offset: 1984)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !27, file: !28, line: 45, baseType: !88, size: 64, offset: 2048)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !23, line: 889, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !67, !92, !80}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !23, line: 842, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !23, line: 840, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !23, line: 832, size: 192, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !95, file: !23, line: 834, baseType: !6, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !95, file: !23, line: 835, baseType: !82, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !95, file: !23, line: 836, baseType: !11, size: 8, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !95, file: !23, line: 837, baseType: !11, size: 8, offset: 136)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !95, file: !23, line: 838, baseType: !11, size: 8, offset: 144)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !95, file: !23, line: 839, baseType: !11, size: 8, offset: 152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !27, file: !28, line: 49, baseType: !88, size: 64, offset: 2112)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !27, file: !28, line: 56, baseType: !74, size: 64, offset: 2176)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !27, file: !28, line: 57, baseType: !11, size: 8, offset: 2240)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !27, file: !28, line: 58, baseType: !11, size: 8, offset: 2248)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !27, file: !28, line: 62, baseType: !6, size: 32, offset: 2272)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !27, file: !28, line: 63, baseType: !6, size: 32, offset: 2304)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !27, file: !28, line: 64, baseType: !6, size: 32, offset: 2336)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !27, file: !28, line: 66, baseType: !111, size: 896, offset: 2368)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !112, line: 104, baseType: !113)
!112 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !112, line: 85, size: 896, elements: !114)
!114 = !{!115, !120, !122, !124, !125, !126, !127, !128, !133, !139, !144, !145, !146, !147}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !113, file: !112, line: 86, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !118, line: 374, baseType: !119)
!118 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !118, line: 365, baseType: !12)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !113, file: !112, line: 87, baseType: !121, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !118, line: 367, baseType: !8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !113, file: !112, line: 88, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !118, line: 368, baseType: !51)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !113, file: !112, line: 90, baseType: !116, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !113, file: !112, line: 91, baseType: !121, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !113, file: !112, line: 92, baseType: !123, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !113, file: !112, line: 94, baseType: !14, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !113, file: !112, line: 95, baseType: !129, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !112, line: 1714, size: 32, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !130, file: !112, line: 1714, baseType: !10, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !113, file: !112, line: 97, baseType: !134, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !112, line: 80, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !138, !121, !121}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !118, line: 383, baseType: !4)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !113, file: !112, line: 98, baseType: !140, size: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !112, line: 81, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !138, !138}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !113, file: !112, line: 99, baseType: !138, size: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !113, file: !112, line: 101, baseType: !10, size: 32, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !113, file: !112, line: 102, baseType: !123, size: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !113, file: !112, line: 103, baseType: !123, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !27, file: !28, line: 67, baseType: !80, size: 64, offset: 3264)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !27, file: !28, line: 68, baseType: !121, size: 32, offset: 3328)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !27, file: !28, line: 80, baseType: !6, size: 32, offset: 3360)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !27, file: !28, line: 83, baseType: !10, size: 32, offset: 3392)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !27, file: !28, line: 84, baseType: !10, size: 32, offset: 3424)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !27, file: !28, line: 85, baseType: !10, size: 32, offset: 3456)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !27, file: !28, line: 86, baseType: !10, size: 32, offset: 3488)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !27, file: !28, line: 87, baseType: !10, size: 32, offset: 3520)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !27, file: !28, line: 92, baseType: !10, size: 32, offset: 3552)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !27, file: !28, line: 93, baseType: !10, size: 32, offset: 3584)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !27, file: !28, line: 94, baseType: !10, size: 32, offset: 3616)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !27, file: !28, line: 95, baseType: !10, size: 32, offset: 3648)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !27, file: !28, line: 96, baseType: !10, size: 32, offset: 3680)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !27, file: !28, line: 100, baseType: !6, size: 32, offset: 3712)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !27, file: !28, line: 101, baseType: !6, size: 32, offset: 3744)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !27, file: !28, line: 102, baseType: !6, size: 32, offset: 3776)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !27, file: !28, line: 103, baseType: !6, size: 32, offset: 3808)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !27, file: !28, line: 104, baseType: !82, size: 64, offset: 3840)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !27, file: !28, line: 105, baseType: !6, size: 32, offset: 3904)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !27, file: !28, line: 106, baseType: !6, size: 32, offset: 3936)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !27, file: !28, line: 107, baseType: !6, size: 32, offset: 3968)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !27, file: !28, line: 108, baseType: !80, size: 64, offset: 4032)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !27, file: !28, line: 111, baseType: !80, size: 64, offset: 4096)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !27, file: !28, line: 114, baseType: !80, size: 64, offset: 4160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !27, file: !28, line: 115, baseType: !80, size: 64, offset: 4224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !27, file: !28, line: 116, baseType: !80, size: 64, offset: 4288)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !27, file: !28, line: 117, baseType: !80, size: 64, offset: 4352)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !27, file: !28, line: 118, baseType: !82, size: 64, offset: 4416)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !27, file: !28, line: 120, baseType: !6, size: 32, offset: 4480)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !27, file: !28, line: 121, baseType: !6, size: 32, offset: 4512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !27, file: !28, line: 122, baseType: !179, size: 64, offset: 4544)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !23, line: 559, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !23, line: 558, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !23, line: 553, size: 24, elements: !183)
!183 = !{!184, !185, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !182, file: !23, line: 555, baseType: !11, size: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !182, file: !23, line: 556, baseType: !11, size: 8, offset: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !182, file: !23, line: 557, baseType: !11, size: 8, offset: 16)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !27, file: !28, line: 123, baseType: !188, size: 16, offset: 4608)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !7, line: 447, baseType: !189)
!189 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !27, file: !28, line: 127, baseType: !10, size: 32, offset: 4640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !27, file: !28, line: 130, baseType: !188, size: 16, offset: 4672)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !27, file: !28, line: 131, baseType: !11, size: 8, offset: 4688)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !27, file: !28, line: 132, baseType: !11, size: 8, offset: 4696)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !27, file: !28, line: 133, baseType: !11, size: 8, offset: 4704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !27, file: !28, line: 134, baseType: !11, size: 8, offset: 4712)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !27, file: !28, line: 135, baseType: !11, size: 8, offset: 4720)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !27, file: !28, line: 136, baseType: !11, size: 8, offset: 4728)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !27, file: !28, line: 137, baseType: !11, size: 8, offset: 4736)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !27, file: !28, line: 138, baseType: !11, size: 8, offset: 4744)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !27, file: !28, line: 139, baseType: !11, size: 8, offset: 4752)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !27, file: !28, line: 140, baseType: !11, size: 8, offset: 4760)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !27, file: !28, line: 141, baseType: !11, size: 8, offset: 4768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !27, file: !28, line: 142, baseType: !11, size: 8, offset: 4776)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !27, file: !28, line: 143, baseType: !11, size: 8, offset: 4784)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !27, file: !28, line: 145, baseType: !11, size: 8, offset: 4792)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !27, file: !28, line: 147, baseType: !207, size: 40, offset: 4800)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 40, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 5)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !27, file: !28, line: 151, baseType: !188, size: 16, offset: 4848)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !27, file: !28, line: 156, baseType: !11, size: 8, offset: 4864)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !27, file: !28, line: 157, baseType: !213, size: 32, offset: 4896)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !7, line: 521, baseType: !9)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !27, file: !28, line: 158, baseType: !215, size: 80, offset: 4928)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !23, line: 570, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !23, line: 563, size: 80, elements: !217)
!217 = !{!218, !219, !220, !221, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !216, file: !23, line: 565, baseType: !11, size: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !216, file: !23, line: 566, baseType: !188, size: 16, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !216, file: !23, line: 567, baseType: !188, size: 16, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !216, file: !23, line: 568, baseType: !188, size: 16, offset: 48)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !216, file: !23, line: 569, baseType: !188, size: 16, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !27, file: !28, line: 160, baseType: !215, size: 80, offset: 5008)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !27, file: !28, line: 165, baseType: !225, size: 64, offset: 5120)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !23, line: 863, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !67}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !27, file: !28, line: 166, baseType: !6, size: 32, offset: 5184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !27, file: !28, line: 167, baseType: !6, size: 32, offset: 5216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !27, file: !28, line: 171, baseType: !10, size: 32, offset: 5248)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !27, file: !28, line: 172, baseType: !213, size: 32, offset: 5280)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !27, file: !28, line: 173, baseType: !213, size: 32, offset: 5312)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !27, file: !28, line: 175, baseType: !80, size: 64, offset: 5376)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !27, file: !28, line: 176, baseType: !236, size: 64, offset: 5440)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !7, line: 556, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !27, file: !28, line: 180, baseType: !80, size: 64, offset: 5504)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !27, file: !28, line: 181, baseType: !80, size: 64, offset: 5568)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !27, file: !28, line: 182, baseType: !236, size: 64, offset: 5632)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !27, file: !28, line: 183, baseType: !236, size: 64, offset: 5696)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !27, file: !28, line: 188, baseType: !244, size: 40, offset: 5760)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !23, line: 582, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !23, line: 575, size: 40, elements: !246)
!246 = !{!247, !248, !249, !250, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !245, file: !23, line: 577, baseType: !11, size: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !245, file: !23, line: 578, baseType: !11, size: 8, offset: 8)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !245, file: !23, line: 579, baseType: !11, size: 8, offset: 16)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !245, file: !23, line: 580, baseType: !11, size: 8, offset: 24)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !245, file: !23, line: 581, baseType: !11, size: 8, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !27, file: !28, line: 192, baseType: !244, size: 40, offset: 5800)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !27, file: !28, line: 197, baseType: !80, size: 64, offset: 5888)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !27, file: !28, line: 198, baseType: !215, size: 80, offset: 5952)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !27, file: !28, line: 201, baseType: !256, size: 64, offset: 6080)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !23, line: 864, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !67, !6, !10}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !27, file: !28, line: 202, baseType: !261, size: 64, offset: 6144)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !23, line: 866, baseType: !257)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !27, file: !28, line: 204, baseType: !263, size: 64, offset: 6208)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !23, line: 870, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !67, !267}
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !23, line: 723, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !23, line: 722, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !271, line: 56, size: 2496, elements: !272)
!271 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !290, !291, !292, !293, !294, !308, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !345, !346, !347, !348, !358, !359, !360, !361, !362, !363, !383, !384, !385, !386, !387}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !270, file: !271, line: 59, baseType: !6, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !270, file: !271, line: 60, baseType: !6, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !270, file: !271, line: 61, baseType: !6, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !270, file: !271, line: 62, baseType: !82, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !270, file: !271, line: 63, baseType: !179, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !270, file: !271, line: 64, baseType: !188, size: 16, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !270, file: !271, line: 65, baseType: !188, size: 16, offset: 272)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !270, file: !271, line: 66, baseType: !11, size: 8, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !270, file: !271, line: 67, baseType: !11, size: 8, offset: 296)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !270, file: !271, line: 69, baseType: !11, size: 8, offset: 304)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !270, file: !271, line: 70, baseType: !11, size: 8, offset: 312)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !270, file: !271, line: 71, baseType: !11, size: 8, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !270, file: !271, line: 74, baseType: !11, size: 8, offset: 328)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !270, file: !271, line: 75, baseType: !11, size: 8, offset: 336)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !270, file: !271, line: 76, baseType: !11, size: 8, offset: 344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !270, file: !271, line: 77, baseType: !289, size: 64, offset: 352)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !41)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !270, file: !271, line: 90, baseType: !213, size: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !270, file: !271, line: 96, baseType: !11, size: 8, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !270, file: !271, line: 108, baseType: !10, size: 32, offset: 480)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !270, file: !271, line: 109, baseType: !10, size: 32, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !270, file: !271, line: 110, baseType: !295, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !23, line: 654, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !23, line: 653, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !23, line: 637, size: 448, elements: !299)
!299 = !{!300, !301, !303, !304, !305, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !298, file: !23, line: 639, baseType: !10, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !298, file: !23, line: 644, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !7, line: 536, baseType: !14)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !298, file: !23, line: 645, baseType: !302, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !298, file: !23, line: 647, baseType: !82, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !298, file: !23, line: 648, baseType: !82, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !298, file: !23, line: 649, baseType: !302, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !298, file: !23, line: 651, baseType: !302, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !270, file: !271, line: 117, baseType: !309, size: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !23, line: 683, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !23, line: 675, size: 64, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !310, file: !23, line: 677, baseType: !188, size: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !310, file: !23, line: 678, baseType: !11, size: 8, offset: 16)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !310, file: !23, line: 679, baseType: !11, size: 8, offset: 24)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !310, file: !23, line: 680, baseType: !11, size: 8, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !310, file: !23, line: 681, baseType: !11, size: 8, offset: 40)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !310, file: !23, line: 682, baseType: !11, size: 8, offset: 48)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !270, file: !271, line: 127, baseType: !244, size: 40, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !270, file: !271, line: 141, baseType: !80, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !270, file: !271, line: 142, baseType: !215, size: 80, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !270, file: !271, line: 152, baseType: !215, size: 80, offset: 912)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !270, file: !271, line: 161, baseType: !9, size: 32, offset: 992)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !270, file: !271, line: 162, baseType: !9, size: 32, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !270, file: !271, line: 163, baseType: !11, size: 8, offset: 1056)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !270, file: !271, line: 171, baseType: !6, size: 32, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !270, file: !271, line: 172, baseType: !6, size: 32, offset: 1120)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !270, file: !271, line: 173, baseType: !11, size: 8, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !270, file: !271, line: 183, baseType: !329, size: 64, offset: 1216)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !7, line: 532, baseType: !238)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !270, file: !271, line: 193, baseType: !213, size: 32, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !270, file: !271, line: 194, baseType: !213, size: 32, offset: 1312)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !270, file: !271, line: 195, baseType: !213, size: 32, offset: 1344)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !270, file: !271, line: 196, baseType: !213, size: 32, offset: 1376)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !270, file: !271, line: 197, baseType: !213, size: 32, offset: 1408)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !270, file: !271, line: 198, baseType: !213, size: 32, offset: 1440)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !270, file: !271, line: 199, baseType: !213, size: 32, offset: 1472)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !270, file: !271, line: 200, baseType: !213, size: 32, offset: 1504)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !270, file: !271, line: 215, baseType: !302, size: 64, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !270, file: !271, line: 216, baseType: !9, size: 32, offset: 1600)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !270, file: !271, line: 217, baseType: !9, size: 32, offset: 1632)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !270, file: !271, line: 218, baseType: !302, size: 64, offset: 1664)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !270, file: !271, line: 219, baseType: !343, size: 64, offset: 1728)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !7, line: 559, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !270, file: !271, line: 220, baseType: !11, size: 8, offset: 1792)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !270, file: !271, line: 221, baseType: !11, size: 8, offset: 1800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !270, file: !271, line: 225, baseType: !6, size: 32, offset: 1824)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !270, file: !271, line: 230, baseType: !349, size: 64, offset: 1856)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !23, line: 707, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !23, line: 706, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !23, line: 695, size: 256, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !352, file: !23, line: 697, baseType: !207, size: 40)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !23, line: 698, baseType: !81, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !23, line: 699, baseType: !82, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !352, file: !23, line: 702, baseType: !11, size: 8, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !270, file: !271, line: 231, baseType: !10, size: 32, offset: 1920)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !270, file: !271, line: 236, baseType: !302, size: 64, offset: 1984)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !270, file: !271, line: 237, baseType: !80, size: 64, offset: 2048)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !270, file: !271, line: 238, baseType: !6, size: 32, offset: 2112)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !270, file: !271, line: 239, baseType: !11, size: 8, offset: 2144)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !270, file: !271, line: 244, baseType: !364, size: 64, offset: 2176)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !23, line: 615, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !23, line: 614, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !23, line: 608, size: 256, elements: !368)
!368 = !{!369, !370, !371, !382}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !23, line: 610, baseType: !302, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !367, file: !23, line: 611, baseType: !11, size: 8, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !367, file: !23, line: 612, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !23, line: 599, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !23, line: 598, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !23, line: 591, size: 80, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !375, file: !23, line: 593, baseType: !188, size: 16)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !375, file: !23, line: 594, baseType: !188, size: 16, offset: 16)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !375, file: !23, line: 595, baseType: !188, size: 16, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !375, file: !23, line: 596, baseType: !188, size: 16, offset: 48)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !375, file: !23, line: 597, baseType: !188, size: 16, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !367, file: !23, line: 613, baseType: !9, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !270, file: !271, line: 245, baseType: !6, size: 32, offset: 2240)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !270, file: !271, line: 256, baseType: !11, size: 8, offset: 2272)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !270, file: !271, line: 257, baseType: !302, size: 64, offset: 2304)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !270, file: !271, line: 258, baseType: !302, size: 64, offset: 2368)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !270, file: !271, line: 265, baseType: !388, size: 64, offset: 2432)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !7, line: 553, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !27, file: !28, line: 205, baseType: !391, size: 64, offset: 6272)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !23, line: 883, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !67, !80, !6, !10}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !27, file: !28, line: 206, baseType: !396, size: 64, offset: 6336)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !23, line: 871, baseType: !264)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !27, file: !28, line: 207, baseType: !80, size: 64, offset: 6400)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !27, file: !28, line: 208, baseType: !80, size: 64, offset: 6464)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !27, file: !28, line: 209, baseType: !80, size: 64, offset: 6528)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !27, file: !28, line: 210, baseType: !80, size: 64, offset: 6592)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !27, file: !28, line: 211, baseType: !6, size: 32, offset: 6656)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !27, file: !28, line: 212, baseType: !6, size: 32, offset: 6688)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !27, file: !28, line: 213, baseType: !82, size: 64, offset: 6720)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !27, file: !28, line: 214, baseType: !82, size: 64, offset: 6784)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !27, file: !28, line: 215, baseType: !82, size: 64, offset: 6848)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !27, file: !28, line: 216, baseType: !82, size: 64, offset: 6912)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !27, file: !28, line: 217, baseType: !10, size: 32, offset: 6976)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !27, file: !28, line: 218, baseType: !10, size: 32, offset: 7008)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !27, file: !28, line: 232, baseType: !80, size: 64, offset: 7040)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !27, file: !28, line: 233, baseType: !80, size: 64, offset: 7104)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !27, file: !28, line: 237, baseType: !329, size: 64, offset: 7168)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !27, file: !28, line: 241, baseType: !11, size: 8, offset: 7232)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !27, file: !28, line: 242, baseType: !11, size: 8, offset: 7240)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !27, file: !28, line: 243, baseType: !80, size: 64, offset: 7296)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !27, file: !28, line: 244, baseType: !329, size: 64, offset: 7360)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !27, file: !28, line: 245, baseType: !329, size: 64, offset: 7424)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !27, file: !28, line: 246, baseType: !329, size: 64, offset: 7488)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !27, file: !28, line: 247, baseType: !329, size: 64, offset: 7552)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !27, file: !28, line: 251, baseType: !420, size: 232, offset: 7616)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 232, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 29)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !27, file: !28, line: 256, baseType: !6, size: 32, offset: 7872)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !27, file: !28, line: 259, baseType: !74, size: 64, offset: 7936)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !27, file: !28, line: 260, baseType: !426, size: 64, offset: 8000)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !23, line: 894, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!10, !67, !349}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !27, file: !28, line: 264, baseType: !10, size: 32, offset: 8064)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !27, file: !28, line: 265, baseType: !80, size: 64, offset: 8128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !27, file: !28, line: 270, baseType: !11, size: 8, offset: 8192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !27, file: !28, line: 275, baseType: !11, size: 8, offset: 8200)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !27, file: !28, line: 277, baseType: !11, size: 8, offset: 8208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !27, file: !28, line: 279, baseType: !188, size: 16, offset: 8224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !27, file: !28, line: 280, baseType: !188, size: 16, offset: 8240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !27, file: !28, line: 287, baseType: !6, size: 32, offset: 8256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !27, file: !28, line: 292, baseType: !11, size: 8, offset: 8288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !27, file: !28, line: 299, baseType: !74, size: 64, offset: 8320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !27, file: !28, line: 300, baseType: !441, size: 64, offset: 8384)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !23, line: 950, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!74, !67, !445}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !7, line: 591, baseType: !82)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !27, file: !28, line: 301, baseType: !447, size: 64, offset: 8448)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !23, line: 952, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !67, !74}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !27, file: !28, line: 305, baseType: !80, size: 64, offset: 8512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !27, file: !28, line: 309, baseType: !80, size: 64, offset: 8576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !27, file: !28, line: 310, baseType: !80, size: 64, offset: 8640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !27, file: !28, line: 312, baseType: !80, size: 64, offset: 8704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !27, file: !28, line: 317, baseType: !11, size: 8, offset: 8768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !27, file: !28, line: 320, baseType: !6, size: 32, offset: 8800)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !27, file: !28, line: 321, baseType: !6, size: 32, offset: 8832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !27, file: !28, line: 326, baseType: !6, size: 32, offset: 8864)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !27, file: !28, line: 331, baseType: !445, size: 64, offset: 8896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !27, file: !28, line: 337, baseType: !351, size: 256, offset: 8960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !27, file: !28, line: 341, baseType: !82, size: 64, offset: 9216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !27, file: !28, line: 344, baseType: !302, size: 64, offset: 9280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !27, file: !28, line: 348, baseType: !6, size: 32, offset: 9344)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !27, file: !28, line: 352, baseType: !80, size: 64, offset: 9408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !27, file: !28, line: 354, baseType: !466, size: 256, offset: 9472)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 256, elements: !473)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !92, !80, !470}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !7, line: 527, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!473 = !{!474}
!474 = !DISubrange(count: 4)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_infop", file: !23, line: 724, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!478 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !19, file: !1, line: 20, type: !22)
!479 = !DILocation(line: 20, column: 33, scope: !19)
!480 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !19, file: !1, line: 20, type: !475)
!481 = !DILocation(line: 20, column: 58, scope: !19)
!482 = !DILocalVariable(name: "flag", arg: 3, scope: !19, file: !1, line: 21, type: !6)
!483 = !DILocation(line: 21, column: 17, scope: !19)
!484 = !DILocation(line: 23, column: 8, scope: !485)
!485 = distinct !DILexicalBlock(scope: !19, file: !1, line: 23, column: 8)
!486 = !DILocation(line: 23, column: 16, scope: !485)
!487 = !DILocation(line: 23, column: 24, scope: !485)
!488 = !DILocation(line: 23, column: 27, scope: !485)
!489 = !DILocation(line: 23, column: 36, scope: !485)
!490 = !DILocation(line: 23, column: 8, scope: !19)
!491 = !DILocation(line: 24, column: 14, scope: !485)
!492 = !DILocation(line: 24, column: 24, scope: !485)
!493 = !DILocation(line: 24, column: 32, scope: !485)
!494 = !DILocation(line: 24, column: 30, scope: !485)
!495 = !DILocation(line: 24, column: 7, scope: !485)
!496 = !DILocation(line: 26, column: 4, scope: !19)
!497 = !DILocation(line: 27, column: 1, scope: !19)
!498 = distinct !DISubprogram(name: "png_get_rowbytes", scope: !1, file: !1, line: 30, type: !499, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!499 = !DISubroutineType(types: !500)
!500 = !{!82, !22, !475}
!501 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !498, file: !1, line: 30, type: !22)
!502 = !DILocation(line: 30, column: 36, scope: !498)
!503 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !498, file: !1, line: 30, type: !475)
!504 = !DILocation(line: 30, column: 61, scope: !498)
!505 = !DILocation(line: 32, column: 8, scope: !506)
!506 = distinct !DILexicalBlock(scope: !498, file: !1, line: 32, column: 8)
!507 = !DILocation(line: 32, column: 16, scope: !506)
!508 = !DILocation(line: 32, column: 24, scope: !506)
!509 = !DILocation(line: 32, column: 27, scope: !506)
!510 = !DILocation(line: 32, column: 36, scope: !506)
!511 = !DILocation(line: 32, column: 8, scope: !498)
!512 = !DILocation(line: 33, column: 14, scope: !506)
!513 = !DILocation(line: 33, column: 24, scope: !506)
!514 = !DILocation(line: 33, column: 7, scope: !506)
!515 = !DILocation(line: 35, column: 4, scope: !498)
!516 = !DILocation(line: 36, column: 1, scope: !498)
!517 = distinct !DISubprogram(name: "png_get_rows", scope: !1, file: !1, line: 40, type: !518, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!518 = !DISubroutineType(types: !519)
!519 = !{!388, !22, !475}
!520 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !517, file: !1, line: 40, type: !22)
!521 = !DILocation(line: 40, column: 32, scope: !517)
!522 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !517, file: !1, line: 40, type: !475)
!523 = !DILocation(line: 40, column: 57, scope: !517)
!524 = !DILocation(line: 42, column: 8, scope: !525)
!525 = distinct !DILexicalBlock(scope: !517, file: !1, line: 42, column: 8)
!526 = !DILocation(line: 42, column: 16, scope: !525)
!527 = !DILocation(line: 42, column: 24, scope: !525)
!528 = !DILocation(line: 42, column: 27, scope: !525)
!529 = !DILocation(line: 42, column: 36, scope: !525)
!530 = !DILocation(line: 42, column: 8, scope: !517)
!531 = !DILocation(line: 43, column: 14, scope: !525)
!532 = !DILocation(line: 43, column: 24, scope: !525)
!533 = !DILocation(line: 43, column: 7, scope: !525)
!534 = !DILocation(line: 45, column: 4, scope: !517)
!535 = !DILocation(line: 46, column: 1, scope: !517)
!536 = distinct !DISubprogram(name: "png_get_image_width", scope: !1, file: !1, line: 52, type: !537, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!537 = !DISubroutineType(types: !538)
!538 = !{!6, !22, !475}
!539 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !536, file: !1, line: 52, type: !22)
!540 = !DILocation(line: 52, column: 39, scope: !536)
!541 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !536, file: !1, line: 52, type: !475)
!542 = !DILocation(line: 52, column: 64, scope: !536)
!543 = !DILocation(line: 54, column: 8, scope: !544)
!544 = distinct !DILexicalBlock(scope: !536, file: !1, line: 54, column: 8)
!545 = !DILocation(line: 54, column: 16, scope: !544)
!546 = !DILocation(line: 54, column: 24, scope: !544)
!547 = !DILocation(line: 54, column: 27, scope: !544)
!548 = !DILocation(line: 54, column: 36, scope: !544)
!549 = !DILocation(line: 54, column: 8, scope: !536)
!550 = !DILocation(line: 55, column: 14, scope: !544)
!551 = !DILocation(line: 55, column: 24, scope: !544)
!552 = !DILocation(line: 55, column: 7, scope: !544)
!553 = !DILocation(line: 57, column: 4, scope: !536)
!554 = !DILocation(line: 58, column: 1, scope: !536)
!555 = distinct !DISubprogram(name: "png_get_image_height", scope: !1, file: !1, line: 61, type: !537, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!556 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !555, file: !1, line: 61, type: !22)
!557 = !DILocation(line: 61, column: 40, scope: !555)
!558 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !555, file: !1, line: 61, type: !475)
!559 = !DILocation(line: 61, column: 65, scope: !555)
!560 = !DILocation(line: 63, column: 8, scope: !561)
!561 = distinct !DILexicalBlock(scope: !555, file: !1, line: 63, column: 8)
!562 = !DILocation(line: 63, column: 16, scope: !561)
!563 = !DILocation(line: 63, column: 24, scope: !561)
!564 = !DILocation(line: 63, column: 27, scope: !561)
!565 = !DILocation(line: 63, column: 36, scope: !561)
!566 = !DILocation(line: 63, column: 8, scope: !555)
!567 = !DILocation(line: 64, column: 14, scope: !561)
!568 = !DILocation(line: 64, column: 24, scope: !561)
!569 = !DILocation(line: 64, column: 7, scope: !561)
!570 = !DILocation(line: 66, column: 4, scope: !555)
!571 = !DILocation(line: 67, column: 1, scope: !555)
!572 = distinct !DISubprogram(name: "png_get_bit_depth", scope: !1, file: !1, line: 70, type: !573, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!573 = !DISubroutineType(types: !574)
!574 = !{!11, !22, !475}
!575 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !572, file: !1, line: 70, type: !22)
!576 = !DILocation(line: 70, column: 37, scope: !572)
!577 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !572, file: !1, line: 70, type: !475)
!578 = !DILocation(line: 70, column: 62, scope: !572)
!579 = !DILocation(line: 72, column: 8, scope: !580)
!580 = distinct !DILexicalBlock(scope: !572, file: !1, line: 72, column: 8)
!581 = !DILocation(line: 72, column: 16, scope: !580)
!582 = !DILocation(line: 72, column: 24, scope: !580)
!583 = !DILocation(line: 72, column: 27, scope: !580)
!584 = !DILocation(line: 72, column: 36, scope: !580)
!585 = !DILocation(line: 72, column: 8, scope: !572)
!586 = !DILocation(line: 73, column: 14, scope: !580)
!587 = !DILocation(line: 73, column: 24, scope: !580)
!588 = !DILocation(line: 73, column: 7, scope: !580)
!589 = !DILocation(line: 75, column: 4, scope: !572)
!590 = !DILocation(line: 76, column: 1, scope: !572)
!591 = distinct !DISubprogram(name: "png_get_color_type", scope: !1, file: !1, line: 79, type: !573, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!592 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !591, file: !1, line: 79, type: !22)
!593 = !DILocation(line: 79, column: 38, scope: !591)
!594 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !591, file: !1, line: 79, type: !475)
!595 = !DILocation(line: 79, column: 63, scope: !591)
!596 = !DILocation(line: 81, column: 8, scope: !597)
!597 = distinct !DILexicalBlock(scope: !591, file: !1, line: 81, column: 8)
!598 = !DILocation(line: 81, column: 16, scope: !597)
!599 = !DILocation(line: 81, column: 24, scope: !597)
!600 = !DILocation(line: 81, column: 27, scope: !597)
!601 = !DILocation(line: 81, column: 36, scope: !597)
!602 = !DILocation(line: 81, column: 8, scope: !591)
!603 = !DILocation(line: 82, column: 14, scope: !597)
!604 = !DILocation(line: 82, column: 24, scope: !597)
!605 = !DILocation(line: 82, column: 7, scope: !597)
!606 = !DILocation(line: 84, column: 4, scope: !591)
!607 = !DILocation(line: 85, column: 1, scope: !591)
!608 = distinct !DISubprogram(name: "png_get_filter_type", scope: !1, file: !1, line: 88, type: !573, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!609 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !608, file: !1, line: 88, type: !22)
!610 = !DILocation(line: 88, column: 39, scope: !608)
!611 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !608, file: !1, line: 88, type: !475)
!612 = !DILocation(line: 88, column: 64, scope: !608)
!613 = !DILocation(line: 90, column: 8, scope: !614)
!614 = distinct !DILexicalBlock(scope: !608, file: !1, line: 90, column: 8)
!615 = !DILocation(line: 90, column: 16, scope: !614)
!616 = !DILocation(line: 90, column: 24, scope: !614)
!617 = !DILocation(line: 90, column: 27, scope: !614)
!618 = !DILocation(line: 90, column: 36, scope: !614)
!619 = !DILocation(line: 90, column: 8, scope: !608)
!620 = !DILocation(line: 91, column: 14, scope: !614)
!621 = !DILocation(line: 91, column: 24, scope: !614)
!622 = !DILocation(line: 91, column: 7, scope: !614)
!623 = !DILocation(line: 93, column: 4, scope: !608)
!624 = !DILocation(line: 94, column: 1, scope: !608)
!625 = distinct !DISubprogram(name: "png_get_interlace_type", scope: !1, file: !1, line: 97, type: !573, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!626 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !625, file: !1, line: 97, type: !22)
!627 = !DILocation(line: 97, column: 42, scope: !625)
!628 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !625, file: !1, line: 97, type: !475)
!629 = !DILocation(line: 97, column: 67, scope: !625)
!630 = !DILocation(line: 99, column: 8, scope: !631)
!631 = distinct !DILexicalBlock(scope: !625, file: !1, line: 99, column: 8)
!632 = !DILocation(line: 99, column: 16, scope: !631)
!633 = !DILocation(line: 99, column: 24, scope: !631)
!634 = !DILocation(line: 99, column: 27, scope: !631)
!635 = !DILocation(line: 99, column: 36, scope: !631)
!636 = !DILocation(line: 99, column: 8, scope: !625)
!637 = !DILocation(line: 100, column: 14, scope: !631)
!638 = !DILocation(line: 100, column: 24, scope: !631)
!639 = !DILocation(line: 100, column: 7, scope: !631)
!640 = !DILocation(line: 102, column: 4, scope: !625)
!641 = !DILocation(line: 103, column: 1, scope: !625)
!642 = distinct !DISubprogram(name: "png_get_compression_type", scope: !1, file: !1, line: 106, type: !573, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!643 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !642, file: !1, line: 106, type: !22)
!644 = !DILocation(line: 106, column: 44, scope: !642)
!645 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !642, file: !1, line: 106, type: !475)
!646 = !DILocation(line: 106, column: 69, scope: !642)
!647 = !DILocation(line: 108, column: 8, scope: !648)
!648 = distinct !DILexicalBlock(scope: !642, file: !1, line: 108, column: 8)
!649 = !DILocation(line: 108, column: 16, scope: !648)
!650 = !DILocation(line: 108, column: 24, scope: !648)
!651 = !DILocation(line: 108, column: 27, scope: !648)
!652 = !DILocation(line: 108, column: 36, scope: !648)
!653 = !DILocation(line: 108, column: 8, scope: !642)
!654 = !DILocation(line: 109, column: 14, scope: !648)
!655 = !DILocation(line: 109, column: 24, scope: !648)
!656 = !DILocation(line: 109, column: 7, scope: !648)
!657 = !DILocation(line: 111, column: 4, scope: !642)
!658 = !DILocation(line: 112, column: 1, scope: !642)
!659 = distinct !DISubprogram(name: "png_get_x_pixels_per_meter", scope: !1, file: !1, line: 115, type: !537, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!660 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !659, file: !1, line: 115, type: !22)
!661 = !DILocation(line: 115, column: 46, scope: !659)
!662 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !659, file: !1, line: 115, type: !475)
!663 = !DILocation(line: 115, column: 71, scope: !659)
!664 = !DILocation(line: 118, column: 8, scope: !665)
!665 = distinct !DILexicalBlock(scope: !659, file: !1, line: 118, column: 8)
!666 = !DILocation(line: 118, column: 16, scope: !665)
!667 = !DILocation(line: 118, column: 24, scope: !665)
!668 = !DILocation(line: 118, column: 27, scope: !665)
!669 = !DILocation(line: 118, column: 36, scope: !665)
!670 = !DILocation(line: 118, column: 44, scope: !665)
!671 = !DILocation(line: 118, column: 48, scope: !665)
!672 = !DILocation(line: 118, column: 58, scope: !665)
!673 = !DILocation(line: 118, column: 64, scope: !665)
!674 = !DILocation(line: 118, column: 8, scope: !659)
!675 = !DILocation(line: 123, column: 14, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !1, line: 123, column: 14)
!677 = distinct !DILexicalBlock(scope: !665, file: !1, line: 119, column: 7)
!678 = !DILocation(line: 123, column: 24, scope: !676)
!679 = !DILocation(line: 123, column: 39, scope: !676)
!680 = !DILocation(line: 123, column: 14, scope: !677)
!681 = !DILocation(line: 124, column: 21, scope: !676)
!682 = !DILocation(line: 124, column: 31, scope: !676)
!683 = !DILocation(line: 124, column: 13, scope: !676)
!684 = !DILocation(line: 125, column: 7, scope: !677)
!685 = !DILocation(line: 128, column: 4, scope: !659)
!686 = !DILocation(line: 129, column: 1, scope: !659)
!687 = distinct !DISubprogram(name: "png_get_y_pixels_per_meter", scope: !1, file: !1, line: 132, type: !537, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!688 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !687, file: !1, line: 132, type: !22)
!689 = !DILocation(line: 132, column: 46, scope: !687)
!690 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !687, file: !1, line: 132, type: !475)
!691 = !DILocation(line: 132, column: 71, scope: !687)
!692 = !DILocation(line: 135, column: 8, scope: !693)
!693 = distinct !DILexicalBlock(scope: !687, file: !1, line: 135, column: 8)
!694 = !DILocation(line: 135, column: 16, scope: !693)
!695 = !DILocation(line: 135, column: 24, scope: !693)
!696 = !DILocation(line: 135, column: 27, scope: !693)
!697 = !DILocation(line: 135, column: 36, scope: !693)
!698 = !DILocation(line: 135, column: 44, scope: !693)
!699 = !DILocation(line: 135, column: 48, scope: !693)
!700 = !DILocation(line: 135, column: 58, scope: !693)
!701 = !DILocation(line: 135, column: 64, scope: !693)
!702 = !DILocation(line: 135, column: 8, scope: !687)
!703 = !DILocation(line: 140, column: 11, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !1, line: 140, column: 11)
!705 = distinct !DILexicalBlock(scope: !693, file: !1, line: 136, column: 4)
!706 = !DILocation(line: 140, column: 21, scope: !704)
!707 = !DILocation(line: 140, column: 36, scope: !704)
!708 = !DILocation(line: 140, column: 11, scope: !705)
!709 = !DILocation(line: 141, column: 18, scope: !704)
!710 = !DILocation(line: 141, column: 28, scope: !704)
!711 = !DILocation(line: 141, column: 10, scope: !704)
!712 = !DILocation(line: 142, column: 4, scope: !705)
!713 = !DILocation(line: 145, column: 4, scope: !687)
!714 = !DILocation(line: 146, column: 1, scope: !687)
!715 = distinct !DISubprogram(name: "png_get_pixels_per_meter", scope: !1, file: !1, line: 149, type: !537, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!716 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !715, file: !1, line: 149, type: !22)
!717 = !DILocation(line: 149, column: 44, scope: !715)
!718 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !715, file: !1, line: 149, type: !475)
!719 = !DILocation(line: 149, column: 69, scope: !715)
!720 = !DILocation(line: 152, column: 8, scope: !721)
!721 = distinct !DILexicalBlock(scope: !715, file: !1, line: 152, column: 8)
!722 = !DILocation(line: 152, column: 16, scope: !721)
!723 = !DILocation(line: 152, column: 24, scope: !721)
!724 = !DILocation(line: 152, column: 27, scope: !721)
!725 = !DILocation(line: 152, column: 36, scope: !721)
!726 = !DILocation(line: 152, column: 44, scope: !721)
!727 = !DILocation(line: 152, column: 48, scope: !721)
!728 = !DILocation(line: 152, column: 58, scope: !721)
!729 = !DILocation(line: 152, column: 64, scope: !721)
!730 = !DILocation(line: 152, column: 8, scope: !715)
!731 = !DILocation(line: 156, column: 11, scope: !732)
!732 = distinct !DILexicalBlock(scope: !733, file: !1, line: 156, column: 11)
!733 = distinct !DILexicalBlock(scope: !721, file: !1, line: 153, column: 4)
!734 = !DILocation(line: 156, column: 21, scope: !732)
!735 = !DILocation(line: 156, column: 36, scope: !732)
!736 = !DILocation(line: 156, column: 60, scope: !732)
!737 = !DILocation(line: 157, column: 11, scope: !732)
!738 = !DILocation(line: 157, column: 21, scope: !732)
!739 = !DILocation(line: 157, column: 42, scope: !732)
!740 = !DILocation(line: 157, column: 52, scope: !732)
!741 = !DILocation(line: 157, column: 39, scope: !732)
!742 = !DILocation(line: 156, column: 11, scope: !733)
!743 = !DILocation(line: 158, column: 18, scope: !732)
!744 = !DILocation(line: 158, column: 28, scope: !732)
!745 = !DILocation(line: 158, column: 10, scope: !732)
!746 = !DILocation(line: 159, column: 4, scope: !733)
!747 = !DILocation(line: 162, column: 4, scope: !715)
!748 = !DILocation(line: 163, column: 1, scope: !715)
!749 = distinct !DISubprogram(name: "png_get_pixel_aspect_ratio", scope: !1, file: !1, line: 167, type: !750, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!750 = !DISubroutineType(types: !751)
!751 = !{!5, !22, !475}
!752 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !749, file: !1, line: 167, type: !22)
!753 = !DILocation(line: 167, column: 46, scope: !749)
!754 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !749, file: !1, line: 167, type: !475)
!755 = !DILocation(line: 167, column: 71, scope: !749)
!756 = !DILocation(line: 170, column: 8, scope: !757)
!757 = distinct !DILexicalBlock(scope: !749, file: !1, line: 170, column: 8)
!758 = !DILocation(line: 170, column: 16, scope: !757)
!759 = !DILocation(line: 170, column: 24, scope: !757)
!760 = !DILocation(line: 170, column: 27, scope: !757)
!761 = !DILocation(line: 170, column: 36, scope: !757)
!762 = !DILocation(line: 170, column: 44, scope: !757)
!763 = !DILocation(line: 170, column: 48, scope: !757)
!764 = !DILocation(line: 170, column: 58, scope: !757)
!765 = !DILocation(line: 170, column: 64, scope: !757)
!766 = !DILocation(line: 170, column: 8, scope: !749)
!767 = !DILocation(line: 174, column: 11, scope: !768)
!768 = distinct !DILexicalBlock(scope: !769, file: !1, line: 174, column: 11)
!769 = distinct !DILexicalBlock(scope: !757, file: !1, line: 171, column: 4)
!770 = !DILocation(line: 174, column: 21, scope: !768)
!771 = !DILocation(line: 174, column: 39, scope: !768)
!772 = !DILocation(line: 174, column: 11, scope: !769)
!773 = !DILocation(line: 175, column: 33, scope: !768)
!774 = !DILocation(line: 175, column: 43, scope: !768)
!775 = !DILocation(line: 175, column: 26, scope: !768)
!776 = !DILocation(line: 176, column: 22, scope: !768)
!777 = !DILocation(line: 176, column: 32, scope: !768)
!778 = !DILocation(line: 176, column: 15, scope: !768)
!779 = !DILocation(line: 176, column: 14, scope: !768)
!780 = !DILocation(line: 175, column: 10, scope: !768)
!781 = !DILocation(line: 177, column: 4, scope: !769)
!782 = !DILocation(line: 180, column: 4, scope: !749)
!783 = !DILocation(line: 181, column: 1, scope: !749)
!784 = distinct !DISubprogram(name: "png_get_pixel_aspect_ratio_fixed", scope: !1, file: !1, line: 186, type: !785, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!785 = !DISubroutineType(types: !786)
!786 = !{!213, !22, !475}
!787 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !784, file: !1, line: 186, type: !22)
!788 = !DILocation(line: 186, column: 52, scope: !784)
!789 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !784, file: !1, line: 187, type: !475)
!790 = !DILocation(line: 187, column: 21, scope: !784)
!791 = !DILocation(line: 190, column: 8, scope: !792)
!792 = distinct !DILexicalBlock(scope: !784, file: !1, line: 190, column: 8)
!793 = !DILocation(line: 190, column: 16, scope: !792)
!794 = !DILocation(line: 190, column: 24, scope: !792)
!795 = !DILocation(line: 190, column: 27, scope: !792)
!796 = !DILocation(line: 190, column: 36, scope: !792)
!797 = !DILocation(line: 190, column: 44, scope: !792)
!798 = !DILocation(line: 190, column: 48, scope: !792)
!799 = !DILocation(line: 190, column: 58, scope: !792)
!800 = !DILocation(line: 190, column: 64, scope: !792)
!801 = !DILocation(line: 191, column: 8, scope: !792)
!802 = !DILocation(line: 191, column: 11, scope: !792)
!803 = !DILocation(line: 191, column: 21, scope: !792)
!804 = !DILocation(line: 191, column: 39, scope: !792)
!805 = !DILocation(line: 191, column: 43, scope: !792)
!806 = !DILocation(line: 191, column: 46, scope: !792)
!807 = !DILocation(line: 191, column: 56, scope: !792)
!808 = !DILocation(line: 191, column: 74, scope: !792)
!809 = !DILocation(line: 192, column: 8, scope: !792)
!810 = !DILocation(line: 192, column: 11, scope: !792)
!811 = !DILocation(line: 192, column: 21, scope: !792)
!812 = !DILocation(line: 192, column: 39, scope: !792)
!813 = !DILocation(line: 193, column: 8, scope: !792)
!814 = !DILocation(line: 193, column: 11, scope: !792)
!815 = !DILocation(line: 193, column: 21, scope: !792)
!816 = !DILocation(line: 193, column: 39, scope: !792)
!817 = !DILocation(line: 190, column: 8, scope: !784)
!818 = !DILocalVariable(name: "res", scope: !819, file: !1, line: 195, type: !213)
!819 = distinct !DILexicalBlock(scope: !792, file: !1, line: 194, column: 4)
!820 = !DILocation(line: 195, column: 23, scope: !819)
!821 = !DILocation(line: 202, column: 40, scope: !822)
!822 = distinct !DILexicalBlock(scope: !819, file: !1, line: 202, column: 11)
!823 = !DILocation(line: 202, column: 50, scope: !822)
!824 = !DILocation(line: 203, column: 23, scope: !822)
!825 = !DILocation(line: 203, column: 33, scope: !822)
!826 = !DILocation(line: 202, column: 11, scope: !822)
!827 = !DILocation(line: 202, column: 11, scope: !819)
!828 = !DILocation(line: 204, column: 17, scope: !822)
!829 = !DILocation(line: 204, column: 10, scope: !822)
!830 = !DILocation(line: 205, column: 4, scope: !819)
!831 = !DILocation(line: 208, column: 4, scope: !784)
!832 = !DILocation(line: 209, column: 1, scope: !784)
!833 = distinct !DISubprogram(name: "png_get_x_offset_microns", scope: !1, file: !1, line: 213, type: !834, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!834 = !DISubroutineType(types: !835)
!835 = !{!9, !22, !475}
!836 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !833, file: !1, line: 213, type: !22)
!837 = !DILocation(line: 213, column: 44, scope: !833)
!838 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !833, file: !1, line: 213, type: !475)
!839 = !DILocation(line: 213, column: 69, scope: !833)
!840 = !DILocation(line: 216, column: 8, scope: !841)
!841 = distinct !DILexicalBlock(scope: !833, file: !1, line: 216, column: 8)
!842 = !DILocation(line: 216, column: 16, scope: !841)
!843 = !DILocation(line: 216, column: 24, scope: !841)
!844 = !DILocation(line: 216, column: 27, scope: !841)
!845 = !DILocation(line: 216, column: 36, scope: !841)
!846 = !DILocation(line: 216, column: 44, scope: !841)
!847 = !DILocation(line: 216, column: 48, scope: !841)
!848 = !DILocation(line: 216, column: 58, scope: !841)
!849 = !DILocation(line: 216, column: 64, scope: !841)
!850 = !DILocation(line: 216, column: 8, scope: !833)
!851 = !DILocation(line: 220, column: 11, scope: !852)
!852 = distinct !DILexicalBlock(scope: !853, file: !1, line: 220, column: 11)
!853 = distinct !DILexicalBlock(scope: !841, file: !1, line: 217, column: 4)
!854 = !DILocation(line: 220, column: 21, scope: !852)
!855 = !DILocation(line: 220, column: 38, scope: !852)
!856 = !DILocation(line: 220, column: 11, scope: !853)
!857 = !DILocation(line: 221, column: 18, scope: !852)
!858 = !DILocation(line: 221, column: 28, scope: !852)
!859 = !DILocation(line: 221, column: 10, scope: !852)
!860 = !DILocation(line: 222, column: 4, scope: !853)
!861 = !DILocation(line: 225, column: 4, scope: !833)
!862 = !DILocation(line: 226, column: 1, scope: !833)
!863 = distinct !DISubprogram(name: "png_get_y_offset_microns", scope: !1, file: !1, line: 229, type: !834, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!864 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !863, file: !1, line: 229, type: !22)
!865 = !DILocation(line: 229, column: 44, scope: !863)
!866 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !863, file: !1, line: 229, type: !475)
!867 = !DILocation(line: 229, column: 69, scope: !863)
!868 = !DILocation(line: 232, column: 8, scope: !869)
!869 = distinct !DILexicalBlock(scope: !863, file: !1, line: 232, column: 8)
!870 = !DILocation(line: 232, column: 16, scope: !869)
!871 = !DILocation(line: 232, column: 24, scope: !869)
!872 = !DILocation(line: 232, column: 27, scope: !869)
!873 = !DILocation(line: 232, column: 36, scope: !869)
!874 = !DILocation(line: 232, column: 44, scope: !869)
!875 = !DILocation(line: 232, column: 48, scope: !869)
!876 = !DILocation(line: 232, column: 58, scope: !869)
!877 = !DILocation(line: 232, column: 64, scope: !869)
!878 = !DILocation(line: 232, column: 8, scope: !863)
!879 = !DILocation(line: 236, column: 11, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !1, line: 236, column: 11)
!881 = distinct !DILexicalBlock(scope: !869, file: !1, line: 233, column: 4)
!882 = !DILocation(line: 236, column: 21, scope: !880)
!883 = !DILocation(line: 236, column: 38, scope: !880)
!884 = !DILocation(line: 236, column: 11, scope: !881)
!885 = !DILocation(line: 237, column: 18, scope: !880)
!886 = !DILocation(line: 237, column: 28, scope: !880)
!887 = !DILocation(line: 237, column: 10, scope: !880)
!888 = !DILocation(line: 238, column: 4, scope: !881)
!889 = !DILocation(line: 241, column: 4, scope: !863)
!890 = !DILocation(line: 242, column: 1, scope: !863)
!891 = distinct !DISubprogram(name: "png_get_x_offset_pixels", scope: !1, file: !1, line: 245, type: !834, scopeLine: 246, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!892 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !891, file: !1, line: 245, type: !22)
!893 = !DILocation(line: 245, column: 43, scope: !891)
!894 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !891, file: !1, line: 245, type: !475)
!895 = !DILocation(line: 245, column: 68, scope: !891)
!896 = !DILocation(line: 248, column: 8, scope: !897)
!897 = distinct !DILexicalBlock(scope: !891, file: !1, line: 248, column: 8)
!898 = !DILocation(line: 248, column: 16, scope: !897)
!899 = !DILocation(line: 248, column: 24, scope: !897)
!900 = !DILocation(line: 248, column: 27, scope: !897)
!901 = !DILocation(line: 248, column: 36, scope: !897)
!902 = !DILocation(line: 248, column: 44, scope: !897)
!903 = !DILocation(line: 248, column: 48, scope: !897)
!904 = !DILocation(line: 248, column: 58, scope: !897)
!905 = !DILocation(line: 248, column: 64, scope: !897)
!906 = !DILocation(line: 248, column: 8, scope: !891)
!907 = !DILocation(line: 252, column: 11, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !1, line: 252, column: 11)
!909 = distinct !DILexicalBlock(scope: !897, file: !1, line: 249, column: 4)
!910 = !DILocation(line: 252, column: 21, scope: !908)
!911 = !DILocation(line: 252, column: 38, scope: !908)
!912 = !DILocation(line: 252, column: 11, scope: !909)
!913 = !DILocation(line: 253, column: 18, scope: !908)
!914 = !DILocation(line: 253, column: 28, scope: !908)
!915 = !DILocation(line: 253, column: 10, scope: !908)
!916 = !DILocation(line: 254, column: 4, scope: !909)
!917 = !DILocation(line: 257, column: 4, scope: !891)
!918 = !DILocation(line: 258, column: 1, scope: !891)
!919 = distinct !DISubprogram(name: "png_get_y_offset_pixels", scope: !1, file: !1, line: 261, type: !834, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!920 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !919, file: !1, line: 261, type: !22)
!921 = !DILocation(line: 261, column: 43, scope: !919)
!922 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !919, file: !1, line: 261, type: !475)
!923 = !DILocation(line: 261, column: 68, scope: !919)
!924 = !DILocation(line: 264, column: 8, scope: !925)
!925 = distinct !DILexicalBlock(scope: !919, file: !1, line: 264, column: 8)
!926 = !DILocation(line: 264, column: 16, scope: !925)
!927 = !DILocation(line: 264, column: 24, scope: !925)
!928 = !DILocation(line: 264, column: 27, scope: !925)
!929 = !DILocation(line: 264, column: 36, scope: !925)
!930 = !DILocation(line: 264, column: 44, scope: !925)
!931 = !DILocation(line: 264, column: 48, scope: !925)
!932 = !DILocation(line: 264, column: 58, scope: !925)
!933 = !DILocation(line: 264, column: 64, scope: !925)
!934 = !DILocation(line: 264, column: 8, scope: !919)
!935 = !DILocation(line: 268, column: 11, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !1, line: 268, column: 11)
!937 = distinct !DILexicalBlock(scope: !925, file: !1, line: 265, column: 4)
!938 = !DILocation(line: 268, column: 21, scope: !936)
!939 = !DILocation(line: 268, column: 38, scope: !936)
!940 = !DILocation(line: 268, column: 11, scope: !937)
!941 = !DILocation(line: 269, column: 18, scope: !936)
!942 = !DILocation(line: 269, column: 28, scope: !936)
!943 = !DILocation(line: 269, column: 10, scope: !936)
!944 = !DILocation(line: 270, column: 4, scope: !937)
!945 = !DILocation(line: 273, column: 4, scope: !919)
!946 = !DILocation(line: 274, column: 1, scope: !919)
!947 = distinct !DISubprogram(name: "png_get_pixels_per_inch", scope: !1, file: !1, line: 310, type: !537, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!948 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !947, file: !1, line: 310, type: !22)
!949 = !DILocation(line: 310, column: 43, scope: !947)
!950 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !947, file: !1, line: 310, type: !475)
!951 = !DILocation(line: 310, column: 68, scope: !947)
!952 = !DILocation(line: 312, column: 49, scope: !947)
!953 = !DILocation(line: 312, column: 58, scope: !947)
!954 = !DILocation(line: 312, column: 24, scope: !947)
!955 = !DILocation(line: 312, column: 11, scope: !947)
!956 = !DILocation(line: 312, column: 4, scope: !947)
!957 = distinct !DISubprogram(name: "ppi_from_ppm", scope: !1, file: !1, line: 278, type: !958, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!958 = !DISubroutineType(types: !959)
!959 = !{!6, !6}
!960 = !DILocalVariable(name: "ppm", arg: 1, scope: !957, file: !1, line: 278, type: !6)
!961 = !DILocation(line: 278, column: 26, scope: !957)
!962 = !DILocalVariable(name: "result", scope: !957, file: !1, line: 299, type: !213)
!963 = !DILocation(line: 299, column: 20, scope: !957)
!964 = !DILocation(line: 300, column: 8, scope: !965)
!965 = distinct !DILexicalBlock(scope: !957, file: !1, line: 300, column: 8)
!966 = !DILocation(line: 300, column: 12, scope: !965)
!967 = !DILocation(line: 300, column: 31, scope: !965)
!968 = !DILocation(line: 300, column: 66, scope: !965)
!969 = !DILocation(line: 300, column: 34, scope: !965)
!970 = !DILocation(line: 300, column: 8, scope: !957)
!971 = !DILocation(line: 302, column: 14, scope: !965)
!972 = !DILocation(line: 302, column: 7, scope: !965)
!973 = !DILocation(line: 305, column: 4, scope: !957)
!974 = !DILocation(line: 307, column: 1, scope: !957)
!975 = distinct !DISubprogram(name: "png_get_x_pixels_per_inch", scope: !1, file: !1, line: 316, type: !537, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!976 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !975, file: !1, line: 316, type: !22)
!977 = !DILocation(line: 316, column: 45, scope: !975)
!978 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !975, file: !1, line: 316, type: !475)
!979 = !DILocation(line: 316, column: 70, scope: !975)
!980 = !DILocation(line: 318, column: 51, scope: !975)
!981 = !DILocation(line: 318, column: 60, scope: !975)
!982 = !DILocation(line: 318, column: 24, scope: !975)
!983 = !DILocation(line: 318, column: 11, scope: !975)
!984 = !DILocation(line: 318, column: 4, scope: !975)
!985 = distinct !DISubprogram(name: "png_get_y_pixels_per_inch", scope: !1, file: !1, line: 322, type: !537, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!986 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !985, file: !1, line: 322, type: !22)
!987 = !DILocation(line: 322, column: 45, scope: !985)
!988 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !985, file: !1, line: 322, type: !475)
!989 = !DILocation(line: 322, column: 70, scope: !985)
!990 = !DILocation(line: 324, column: 51, scope: !985)
!991 = !DILocation(line: 324, column: 60, scope: !985)
!992 = !DILocation(line: 324, column: 24, scope: !985)
!993 = !DILocation(line: 324, column: 11, scope: !985)
!994 = !DILocation(line: 324, column: 4, scope: !985)
!995 = distinct !DISubprogram(name: "png_get_x_offset_inches_fixed", scope: !1, file: !1, line: 340, type: !996, scopeLine: 342, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!996 = !DISubroutineType(types: !997)
!997 = !{!213, !67, !475}
!998 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !995, file: !1, line: 340, type: !67)
!999 = !DILocation(line: 340, column: 43, scope: !995)
!1000 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !995, file: !1, line: 341, type: !475)
!1001 = !DILocation(line: 341, column: 21, scope: !995)
!1002 = !DILocation(line: 343, column: 41, scope: !995)
!1003 = !DILocation(line: 344, column: 33, scope: !995)
!1004 = !DILocation(line: 344, column: 42, scope: !995)
!1005 = !DILocation(line: 344, column: 8, scope: !995)
!1006 = !DILocation(line: 343, column: 11, scope: !995)
!1007 = !DILocation(line: 343, column: 4, scope: !995)
!1008 = distinct !DISubprogram(name: "png_fixed_inches_from_microns", scope: !1, file: !1, line: 329, type: !1009, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!213, !67, !9}
!1011 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1008, file: !1, line: 329, type: !67)
!1012 = !DILocation(line: 329, column: 43, scope: !1008)
!1013 = !DILocalVariable(name: "microns", arg: 2, scope: !1008, file: !1, line: 329, type: !9)
!1014 = !DILocation(line: 329, column: 63, scope: !1008)
!1015 = !DILocation(line: 336, column: 27, scope: !1008)
!1016 = !DILocation(line: 336, column: 36, scope: !1008)
!1017 = !DILocation(line: 336, column: 11, scope: !1008)
!1018 = !DILocation(line: 336, column: 4, scope: !1008)
!1019 = distinct !DISubprogram(name: "png_get_y_offset_inches_fixed", scope: !1, file: !1, line: 350, type: !996, scopeLine: 352, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1020 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1019, file: !1, line: 350, type: !67)
!1021 = !DILocation(line: 350, column: 43, scope: !1019)
!1022 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !1019, file: !1, line: 351, type: !475)
!1023 = !DILocation(line: 351, column: 21, scope: !1019)
!1024 = !DILocation(line: 353, column: 41, scope: !1019)
!1025 = !DILocation(line: 354, column: 33, scope: !1019)
!1026 = !DILocation(line: 354, column: 42, scope: !1019)
!1027 = !DILocation(line: 354, column: 8, scope: !1019)
!1028 = !DILocation(line: 353, column: 11, scope: !1019)
!1029 = !DILocation(line: 353, column: 4, scope: !1019)
!1030 = distinct !DISubprogram(name: "png_get_x_offset_inches", scope: !1, file: !1, line: 360, type: !750, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1031 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1030, file: !1, line: 360, type: !22)
!1032 = !DILocation(line: 360, column: 43, scope: !1030)
!1033 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !1030, file: !1, line: 360, type: !475)
!1034 = !DILocation(line: 360, column: 68, scope: !1030)
!1035 = !DILocation(line: 365, column: 44, scope: !1030)
!1036 = !DILocation(line: 365, column: 53, scope: !1030)
!1037 = !DILocation(line: 365, column: 19, scope: !1030)
!1038 = !DILocation(line: 365, column: 63, scope: !1030)
!1039 = !DILocation(line: 365, column: 11, scope: !1030)
!1040 = !DILocation(line: 365, column: 4, scope: !1030)
!1041 = distinct !DISubprogram(name: "png_get_y_offset_inches", scope: !1, file: !1, line: 371, type: !750, scopeLine: 372, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1042 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1041, file: !1, line: 371, type: !22)
!1043 = !DILocation(line: 371, column: 43, scope: !1041)
!1044 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !1041, file: !1, line: 371, type: !475)
!1045 = !DILocation(line: 371, column: 68, scope: !1041)
!1046 = !DILocation(line: 376, column: 44, scope: !1041)
!1047 = !DILocation(line: 376, column: 53, scope: !1041)
!1048 = !DILocation(line: 376, column: 19, scope: !1041)
!1049 = !DILocation(line: 376, column: 63, scope: !1041)
!1050 = !DILocation(line: 376, column: 11, scope: !1041)
!1051 = !DILocation(line: 376, column: 4, scope: !1041)
!1052 = distinct !DISubprogram(name: "png_get_pHYs_dpi", scope: !1, file: !1, line: 382, type: !1053, scopeLine: 384, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!6, !22, !475, !1055, !1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!1057 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1052, file: !1, line: 382, type: !22)
!1058 = !DILocation(line: 382, column: 36, scope: !1052)
!1059 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !1052, file: !1, line: 382, type: !475)
!1060 = !DILocation(line: 382, column: 61, scope: !1052)
!1061 = !DILocalVariable(name: "res_x", arg: 3, scope: !1052, file: !1, line: 383, type: !1055)
!1062 = !DILocation(line: 383, column: 18, scope: !1052)
!1063 = !DILocalVariable(name: "res_y", arg: 4, scope: !1052, file: !1, line: 383, type: !1055)
!1064 = !DILocation(line: 383, column: 38, scope: !1052)
!1065 = !DILocalVariable(name: "unit_type", arg: 5, scope: !1052, file: !1, line: 383, type: !1056)
!1066 = !DILocation(line: 383, column: 50, scope: !1052)
!1067 = !DILocalVariable(name: "retval", scope: !1052, file: !1, line: 385, type: !6)
!1068 = !DILocation(line: 385, column: 16, scope: !1052)
!1069 = !DILocation(line: 387, column: 8, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 387, column: 8)
!1071 = !DILocation(line: 387, column: 16, scope: !1070)
!1072 = !DILocation(line: 387, column: 24, scope: !1070)
!1073 = !DILocation(line: 387, column: 27, scope: !1070)
!1074 = !DILocation(line: 387, column: 36, scope: !1070)
!1075 = !DILocation(line: 387, column: 44, scope: !1070)
!1076 = !DILocation(line: 387, column: 48, scope: !1070)
!1077 = !DILocation(line: 387, column: 58, scope: !1070)
!1078 = !DILocation(line: 387, column: 64, scope: !1070)
!1079 = !DILocation(line: 387, column: 8, scope: !1052)
!1080 = !DILocation(line: 391, column: 11, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 391, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1070, file: !1, line: 388, column: 4)
!1083 = !DILocation(line: 391, column: 17, scope: !1081)
!1084 = !DILocation(line: 391, column: 11, scope: !1082)
!1085 = !DILocation(line: 393, column: 19, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1081, file: !1, line: 392, column: 7)
!1087 = !DILocation(line: 393, column: 29, scope: !1086)
!1088 = !DILocation(line: 393, column: 11, scope: !1086)
!1089 = !DILocation(line: 393, column: 17, scope: !1086)
!1090 = !DILocation(line: 394, column: 17, scope: !1086)
!1091 = !DILocation(line: 395, column: 7, scope: !1086)
!1092 = !DILocation(line: 397, column: 11, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 397, column: 11)
!1094 = !DILocation(line: 397, column: 17, scope: !1093)
!1095 = !DILocation(line: 397, column: 11, scope: !1082)
!1096 = !DILocation(line: 399, column: 19, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1093, file: !1, line: 398, column: 7)
!1098 = !DILocation(line: 399, column: 29, scope: !1097)
!1099 = !DILocation(line: 399, column: 11, scope: !1097)
!1100 = !DILocation(line: 399, column: 17, scope: !1097)
!1101 = !DILocation(line: 400, column: 17, scope: !1097)
!1102 = !DILocation(line: 401, column: 7, scope: !1097)
!1103 = !DILocation(line: 403, column: 11, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 403, column: 11)
!1105 = !DILocation(line: 403, column: 21, scope: !1104)
!1106 = !DILocation(line: 403, column: 11, scope: !1082)
!1107 = !DILocation(line: 405, column: 28, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1104, file: !1, line: 404, column: 7)
!1109 = !DILocation(line: 405, column: 38, scope: !1108)
!1110 = !DILocation(line: 405, column: 23, scope: !1108)
!1111 = !DILocation(line: 405, column: 11, scope: !1108)
!1112 = !DILocation(line: 405, column: 21, scope: !1108)
!1113 = !DILocation(line: 406, column: 17, scope: !1108)
!1114 = !DILocation(line: 408, column: 15, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1108, file: !1, line: 408, column: 14)
!1116 = !DILocation(line: 408, column: 14, scope: !1115)
!1117 = !DILocation(line: 408, column: 25, scope: !1115)
!1118 = !DILocation(line: 408, column: 14, scope: !1108)
!1119 = !DILocation(line: 410, column: 17, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !1, line: 410, column: 17)
!1121 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 409, column: 10)
!1122 = !DILocation(line: 410, column: 23, scope: !1120)
!1123 = !DILocation(line: 410, column: 17, scope: !1121)
!1124 = !DILocation(line: 410, column: 56, scope: !1120)
!1125 = !DILocation(line: 410, column: 55, scope: !1120)
!1126 = !DILocation(line: 410, column: 62, scope: !1120)
!1127 = !DILocation(line: 410, column: 70, scope: !1120)
!1128 = !DILocation(line: 410, column: 41, scope: !1120)
!1129 = !DILocation(line: 410, column: 33, scope: !1120)
!1130 = !DILocation(line: 410, column: 39, scope: !1120)
!1131 = !DILocation(line: 410, column: 32, scope: !1120)
!1132 = !DILocation(line: 411, column: 17, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1121, file: !1, line: 411, column: 17)
!1134 = !DILocation(line: 411, column: 23, scope: !1133)
!1135 = !DILocation(line: 411, column: 17, scope: !1121)
!1136 = !DILocation(line: 411, column: 56, scope: !1133)
!1137 = !DILocation(line: 411, column: 55, scope: !1133)
!1138 = !DILocation(line: 411, column: 62, scope: !1133)
!1139 = !DILocation(line: 411, column: 70, scope: !1133)
!1140 = !DILocation(line: 411, column: 41, scope: !1133)
!1141 = !DILocation(line: 411, column: 33, scope: !1133)
!1142 = !DILocation(line: 411, column: 39, scope: !1133)
!1143 = !DILocation(line: 411, column: 32, scope: !1133)
!1144 = !DILocation(line: 412, column: 10, scope: !1121)
!1145 = !DILocation(line: 413, column: 7, scope: !1108)
!1146 = !DILocation(line: 414, column: 4, scope: !1082)
!1147 = !DILocation(line: 416, column: 12, scope: !1052)
!1148 = !DILocation(line: 416, column: 4, scope: !1052)
!1149 = distinct !DISubprogram(name: "png_get_channels", scope: !1, file: !1, line: 426, type: !573, scopeLine: 427, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1150 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1149, file: !1, line: 426, type: !22)
!1151 = !DILocation(line: 426, column: 36, scope: !1149)
!1152 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !1149, file: !1, line: 426, type: !475)
!1153 = !DILocation(line: 426, column: 61, scope: !1149)
!1154 = !DILocation(line: 428, column: 8, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1149, file: !1, line: 428, column: 8)
!1156 = !DILocation(line: 428, column: 16, scope: !1155)
!1157 = !DILocation(line: 428, column: 24, scope: !1155)
!1158 = !DILocation(line: 428, column: 27, scope: !1155)
!1159 = !DILocation(line: 428, column: 36, scope: !1155)
!1160 = !DILocation(line: 428, column: 8, scope: !1149)
!1161 = !DILocation(line: 429, column: 14, scope: !1155)
!1162 = !DILocation(line: 429, column: 24, scope: !1155)
!1163 = !DILocation(line: 429, column: 7, scope: !1155)
!1164 = !DILocation(line: 431, column: 4, scope: !1149)
!1165 = !DILocation(line: 432, column: 1, scope: !1149)
