; ModuleID = 'blender/source/blender/editors/space_text/text_ops.c'
source_filename = "blender/source/blender/editors/space_text/text_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!1145 = !DIEnumerator(name: "ICON_BRUSH_PINCH", value: 798, isUnsigned: true)
!1146 = !DIEnumerator(name: "ICON_BRUSH_SCRAPE", value: 799, isUnsigned: true)
!1147 = !DIEnumerator(name: "ICON_BRUSH_SCULPT_DRAW", value: 800, isUnsigned: true)
!1148 = !DIEnumerator(name: "ICON_BRUSH_SMEAR", value: 801, isUnsigned: true)
!1149 = !DIEnumerator(name: "ICON_BRUSH_SMOOTH", value: 802, isUnsigned: true)
!1150 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!1151 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!1152 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!1153 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!1154 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!1155 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!1156 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!1157 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!1158 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!1159 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!1160 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!1161 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!1162 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!1163 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!1164 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!1165 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!1166 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!1167 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!1168 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!1169 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!1170 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!1171 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!1172 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!1173 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!1174 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!1175 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!1176 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!1177 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!1178 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!1179 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!1180 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!1181 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!1182 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!1183 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!1184 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!1185 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!1186 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!1187 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!1188 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!1189 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!1190 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!1191 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!1192 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!1193 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!1194 = !{!1195, !1196, !1199, !1200}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1197, line: 46, baseType: !1198)
!1197 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1198 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1199 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1200 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1201 = !{!1202, !0, !2770, !2775, !2778, !2790, !2792}
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "direction_items", scope: !1204, file: !3, line: 1365, type: !2761, isLocal: true, isDefinition: true)
!1204 = distinct !DISubprogram(name: "TEXT_OT_move_lines", scope: !3, file: !3, line: 1363, type: !1205, scopeLine: 1364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !2760)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{null, !1207}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !1209, line: 568, baseType: !1210)
!1209 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !1209, line: 508, size: 1536, elements: !1211)
!1211 = !{!1212, !1216, !1217, !1218, !1219, !2686, !2690, !2696, !2700, !2701, !2705, !2706, !2707, !2708, !2712, !2713, !2728, !2729, !2733, !2759}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1210, file: !1209, line: 509, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1215 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1210, file: !1209, line: 510, baseType: !1213, size: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1210, file: !1209, line: 511, baseType: !1213, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1210, file: !1209, line: 512, baseType: !1213, size: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1210, file: !1209, line: 518, baseType: !1220, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!1200, !1223, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !59, line: 44, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !99, line: 328, size: 1344, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1234, !1265, !1267, !1268, !1269, !1281, !2679, !2680, !2681, !2684, !2685}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1226, file: !99, line: 329, baseType: !1225, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1226, file: !99, line: 329, baseType: !1225, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1226, file: !99, line: 332, baseType: !1231, size: 512, offset: 128)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 512, elements: !1232)
!1232 = !{!1233}
!1233 = !DISubrange(count: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1226, file: !99, line: 333, baseType: !1235, size: 64, offset: 640)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1237, line: 75, baseType: !1238)
!1237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1237, line: 62, size: 1024, elements: !1239)
!1239 = !{!1240, !1242, !1243, !1244, !1245, !1247, !1248, !1249, !1263, !1264}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1238, file: !1237, line: 63, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1238, file: !1237, line: 63, baseType: !1241, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1238, file: !1237, line: 64, baseType: !1215, size: 8, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1238, file: !1237, line: 64, baseType: !1215, size: 8, offset: 136)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1238, file: !1237, line: 65, baseType: !1246, size: 16, offset: 144)
!1246 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1238, file: !1237, line: 66, baseType: !1231, size: 512, offset: 160)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1238, file: !1237, line: 67, baseType: !1200, size: 32, offset: 672)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1238, file: !1237, line: 69, baseType: !1250, size: 256, offset: 704)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1237, line: 60, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1237, line: 48, size: 256, elements: !1252)
!1252 = !{!1253, !1254, !1261, !1262}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1251, file: !1237, line: 49, baseType: !1195, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1251, file: !1237, line: 58, baseType: !1255, size: 128, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1256, line: 71, baseType: !1257)
!1256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1256, line: 69, size: 128, elements: !1258)
!1258 = !{!1259, !1260}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1257, file: !1256, line: 70, baseType: !1195, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1257, file: !1256, line: 70, baseType: !1195, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1251, file: !1237, line: 59, baseType: !1200, size: 32, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1251, file: !1237, line: 59, baseType: !1200, size: 32, offset: 224)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1238, file: !1237, line: 70, baseType: !1200, size: 32, offset: 960)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1238, file: !1237, line: 74, baseType: !1200, size: 32, offset: 992)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1226, file: !99, line: 336, baseType: !1266, size: 64, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1226, file: !99, line: 337, baseType: !1195, size: 64, offset: 768)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !1226, file: !99, line: 338, baseType: !1195, size: 64, offset: 832)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1226, file: !99, line: 340, baseType: !1270, size: 64, offset: 896)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !59, line: 55, size: 192, elements: !1272)
!1272 = !{!1273, !1277, !1280}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1271, file: !59, line: 58, baseType: !1274, size: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1271, file: !59, line: 56, size: 64, elements: !1275)
!1275 = !{!1276}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1274, file: !59, line: 57, baseType: !1195, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1271, file: !59, line: 60, baseType: !1278, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !59, line: 41, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1271, file: !59, line: 61, baseType: !1195, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !1226, file: !99, line: 341, baseType: !1282, size: 64, offset: 960)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !99, line: 106, size: 320, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1289, !1290}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1283, file: !99, line: 107, baseType: !1255, size: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1283, file: !99, line: 108, baseType: !1200, size: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1283, file: !99, line: 109, baseType: !1200, size: 32, offset: 160)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1283, file: !99, line: 110, baseType: !1200, size: 32, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1283, file: !99, line: 110, baseType: !1200, size: 32, offset: 224)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1283, file: !99, line: 111, baseType: !1291, size: 64, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1209, line: 490, size: 768, elements: !1293)
!1293 = !{!1294, !1295, !1296, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677, !2678}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1292, file: !1209, line: 491, baseType: !1291, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1292, file: !1209, line: 491, baseType: !1291, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1292, file: !1209, line: 493, baseType: !1297, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !99, line: 169, size: 2048, elements: !1299)
!1299 = !{!1300, !1301, !1302, !1303, !2588, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2645, !2648, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1298, file: !99, line: 170, baseType: !1297, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1298, file: !99, line: 170, baseType: !1297, size: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1298, file: !99, line: 172, baseType: !1195, size: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1298, file: !99, line: 174, baseType: !1304, size: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !119, line: 49, size: 1984, elements: !1306)
!1306 = !{!1307, !1343, !1344, !1345, !1346, !1347, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1305, file: !119, line: 50, baseType: !1308, size: 960)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1237, line: 130, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1237, line: 117, size: 960, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1315, !1334, !1338, !1339, !1340, !1341, !1342}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1309, file: !1237, line: 118, baseType: !1195, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1309, file: !1237, line: 118, baseType: !1195, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1309, file: !1237, line: 119, baseType: !1314, size: 64, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1309, file: !1237, line: 120, baseType: !1316, size: 64, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1237, line: 136, size: 17600, elements: !1318)
!1318 = !{!1319, !1320, !1322, !1325, !1329, !1330, !1331}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1317, file: !1237, line: 137, baseType: !1308, size: 960)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1317, file: !1237, line: 138, baseType: !1321, size: 64, offset: 960)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1317, file: !1237, line: 139, baseType: !1323, size: 64, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1237, line: 43, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1317, file: !1237, line: 140, baseType: !1326, size: 8192, offset: 1088)
!1326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 8192, elements: !1327)
!1327 = !{!1328}
!1328 = !DISubrange(count: 1024)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1317, file: !1237, line: 141, baseType: !1326, size: 8192, offset: 9280)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1317, file: !1237, line: 148, baseType: !1316, size: 64, offset: 17472)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1317, file: !1237, line: 150, baseType: !1332, size: 64, offset: 17536)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1237, line: 45, flags: DIFlagFwdDecl)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1309, file: !1237, line: 121, baseType: !1335, size: 528, offset: 256)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 528, elements: !1336)
!1336 = !{!1337}
!1337 = !DISubrange(count: 66)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1309, file: !1237, line: 126, baseType: !1246, size: 16, offset: 784)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1309, file: !1237, line: 127, baseType: !1200, size: 32, offset: 800)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1309, file: !1237, line: 128, baseType: !1200, size: 32, offset: 832)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1309, file: !1237, line: 128, baseType: !1200, size: 32, offset: 864)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1309, file: !1237, line: 129, baseType: !1235, size: 64, offset: 896)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1305, file: !119, line: 52, baseType: !1255, size: 128, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1305, file: !119, line: 53, baseType: !1255, size: 128, offset: 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1305, file: !119, line: 54, baseType: !1255, size: 128, offset: 1216)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1305, file: !119, line: 55, baseType: !1255, size: 128, offset: 1344)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1305, file: !119, line: 57, baseType: !1348, size: 64, offset: 1472)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1350, line: 1216, size: 39680, elements: !1351)
!1350 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1351 = !{!1352, !1353, !1357, !1361, !1364, !1365, !1366, !1378, !1379, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1395, !1473, !1908, !2123, !2126, !2442, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2464, !2465, !2466, !2467, !2468, !2476, !2543, !2550, !2551, !2558, !2559, !2564, !2565, !2566, !2567, !2568}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1349, file: !1350, line: 1217, baseType: !1308, size: 960)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1349, file: !1350, line: 1218, baseType: !1354, size: 64, offset: 960)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1356, line: 43, flags: DIFlagFwdDecl)
!1356 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1349, file: !1350, line: 1220, baseType: !1358, size: 64, offset: 1024)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1360, line: 44, flags: DIFlagFwdDecl)
!1360 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1349, file: !1350, line: 1221, baseType: !1362, size: 64, offset: 1088)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1350, line: 52, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1349, file: !1350, line: 1223, baseType: !1348, size: 64, offset: 1152)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1349, file: !1350, line: 1225, baseType: !1255, size: 128, offset: 1216)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1349, file: !1350, line: 1226, baseType: !1367, size: 64, offset: 1344)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1350, line: 69, size: 320, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1368, file: !1350, line: 70, baseType: !1367, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1368, file: !1350, line: 70, baseType: !1367, size: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1368, file: !1350, line: 71, baseType: !7, size: 32, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1368, file: !1350, line: 71, baseType: !7, size: 32, offset: 160)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1368, file: !1350, line: 72, baseType: !1200, size: 32, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1368, file: !1350, line: 73, baseType: !1246, size: 16, offset: 224)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1368, file: !1350, line: 73, baseType: !1246, size: 16, offset: 240)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1368, file: !1350, line: 74, baseType: !1358, size: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1349, file: !1350, line: 1227, baseType: !1358, size: 64, offset: 1408)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1349, file: !1350, line: 1229, baseType: !1380, size: 96, offset: 1472)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 96, elements: !1381)
!1381 = !{!1382}
!1382 = !DISubrange(count: 3)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1349, file: !1350, line: 1230, baseType: !1380, size: 96, offset: 1568)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1349, file: !1350, line: 1231, baseType: !1380, size: 96, offset: 1664)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1349, file: !1350, line: 1231, baseType: !1380, size: 96, offset: 1760)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1349, file: !1350, line: 1233, baseType: !7, size: 32, offset: 1856)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1349, file: !1350, line: 1234, baseType: !1200, size: 32, offset: 1888)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1349, file: !1350, line: 1235, baseType: !7, size: 32, offset: 1920)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1349, file: !1350, line: 1237, baseType: !1246, size: 16, offset: 1952)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1349, file: !1350, line: 1239, baseType: !1215, size: 8, offset: 1968)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1349, file: !1350, line: 1240, baseType: !1392, size: 8, offset: 1976)
!1392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 8, elements: !1393)
!1393 = !{!1394}
!1394 = !DISubrange(count: 1)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1349, file: !1350, line: 1242, baseType: !1396, size: 64, offset: 1984)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1398, line: 328, size: 3456, elements: !1399)
!1398 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1399 = !{!1400, !1401, !1402, !1405, !1406, !1407, !1411, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1438, !1439, !1440, !1443, !1448, !1449, !1452, !1456, !1461, !1465, !1469, !1470, !1471, !1472}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1397, file: !1398, line: 329, baseType: !1308, size: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1397, file: !1398, line: 330, baseType: !1354, size: 64, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1397, file: !1398, line: 332, baseType: !1403, size: 64, offset: 1024)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1398, line: 332, flags: DIFlagFwdDecl)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1397, file: !1398, line: 333, baseType: !1231, size: 512, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1397, file: !1398, line: 335, baseType: !1278, size: 64, offset: 1600)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1397, file: !1398, line: 337, baseType: !1408, size: 64, offset: 1664)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1410, line: 45, flags: DIFlagFwdDecl)
!1410 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1397, file: !1398, line: 338, baseType: !1412, size: 64, offset: 1728)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 64, elements: !1413)
!1413 = !{!1414}
!1414 = !DISubrange(count: 2)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1397, file: !1398, line: 340, baseType: !1255, size: 128, offset: 1792)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1397, file: !1398, line: 340, baseType: !1255, size: 128, offset: 1920)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1397, file: !1398, line: 342, baseType: !1200, size: 32, offset: 2048)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1397, file: !1398, line: 342, baseType: !1200, size: 32, offset: 2080)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1397, file: !1398, line: 343, baseType: !1200, size: 32, offset: 2112)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1397, file: !1398, line: 345, baseType: !1200, size: 32, offset: 2144)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1397, file: !1398, line: 346, baseType: !1200, size: 32, offset: 2176)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1397, file: !1398, line: 347, baseType: !1246, size: 16, offset: 2208)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1397, file: !1398, line: 348, baseType: !1246, size: 16, offset: 2224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1397, file: !1398, line: 349, baseType: !1200, size: 32, offset: 2240)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1397, file: !1398, line: 351, baseType: !1200, size: 32, offset: 2272)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1397, file: !1398, line: 353, baseType: !1246, size: 16, offset: 2304)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1397, file: !1398, line: 354, baseType: !1246, size: 16, offset: 2320)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1397, file: !1398, line: 355, baseType: !1200, size: 32, offset: 2336)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1397, file: !1398, line: 357, baseType: !1430, size: 128, offset: 2368)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1431, line: 95, baseType: !1432)
!1431 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1431, line: 92, size: 128, elements: !1433)
!1433 = !{!1434, !1435, !1436, !1437}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1432, file: !1431, line: 93, baseType: !1199, size: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1432, file: !1431, line: 93, baseType: !1199, size: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1432, file: !1431, line: 94, baseType: !1199, size: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1432, file: !1431, line: 94, baseType: !1199, size: 32, offset: 96)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1397, file: !1398, line: 363, baseType: !1255, size: 128, offset: 2496)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1397, file: !1398, line: 363, baseType: !1255, size: 128, offset: 2624)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1397, file: !1398, line: 368, baseType: !1441, size: 64, offset: 2752)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1398, line: 48, flags: DIFlagFwdDecl)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1397, file: !1398, line: 372, baseType: !1444, size: 32, offset: 2816)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1398, line: 274, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1398, line: 271, size: 32, elements: !1446)
!1446 = !{!1447}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1445, file: !1398, line: 273, baseType: !7, size: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1397, file: !1398, line: 373, baseType: !1200, size: 32, offset: 2848)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1397, file: !1398, line: 382, baseType: !1450, size: 64, offset: 2880)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1451 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1398, line: 46, flags: DIFlagFwdDecl)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1397, file: !1398, line: 385, baseType: !1453, size: 64, offset: 2944)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{null, !1195, !1199}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1397, file: !1398, line: 386, baseType: !1457, size: 64, offset: 3008)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{null, !1195, !1460}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1397, file: !1398, line: 387, baseType: !1462, size: 64, offset: 3072)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!1200, !1195}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1397, file: !1398, line: 388, baseType: !1466, size: 64, offset: 3136)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{null, !1195}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1397, file: !1398, line: 389, baseType: !1195, size: 64, offset: 3200)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1397, file: !1398, line: 389, baseType: !1195, size: 64, offset: 3264)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1397, file: !1398, line: 389, baseType: !1195, size: 64, offset: 3328)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1397, file: !1398, line: 389, baseType: !1195, size: 64, offset: 3392)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1349, file: !1350, line: 1244, baseType: !1474, size: 64, offset: 2048)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1476, line: 200, size: 17024, elements: !1477)
!1476 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1477 = !{!1478, !1480, !1481, !1482, !1901, !1902, !1903, !1904, !1905, !1906, !1907}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1475, file: !1476, line: 201, baseType: !1479, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1475, file: !1476, line: 202, baseType: !1255, size: 128, offset: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1475, file: !1476, line: 203, baseType: !1255, size: 128, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1475, file: !1476, line: 206, baseType: !1483, size: 64, offset: 320)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1476, line: 190, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1476, line: 126, size: 2816, elements: !1486)
!1486 = !{!1487, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1586, !1589, !1590, !1591, !1873, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1900}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1485, file: !1476, line: 127, baseType: !1488, size: 64)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1485, file: !1476, line: 127, baseType: !1488, size: 64, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1485, file: !1476, line: 128, baseType: !1195, size: 64, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1485, file: !1476, line: 129, baseType: !1195, size: 64, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1485, file: !1476, line: 130, baseType: !1231, size: 512, offset: 256)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1485, file: !1476, line: 132, baseType: !1200, size: 32, offset: 768)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1485, file: !1476, line: 132, baseType: !1200, size: 32, offset: 800)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1485, file: !1476, line: 133, baseType: !1200, size: 32, offset: 832)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1485, file: !1476, line: 134, baseType: !1200, size: 32, offset: 864)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1485, file: !1476, line: 134, baseType: !1200, size: 32, offset: 896)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1485, file: !1476, line: 134, baseType: !1200, size: 32, offset: 928)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1485, file: !1476, line: 135, baseType: !1200, size: 32, offset: 960)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1485, file: !1476, line: 135, baseType: !1200, size: 32, offset: 992)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1485, file: !1476, line: 136, baseType: !1200, size: 32, offset: 1024)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1485, file: !1476, line: 136, baseType: !1200, size: 32, offset: 1056)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1485, file: !1476, line: 137, baseType: !1200, size: 32, offset: 1088)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1485, file: !1476, line: 137, baseType: !1200, size: 32, offset: 1120)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1485, file: !1476, line: 138, baseType: !1199, size: 32, offset: 1152)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1485, file: !1476, line: 139, baseType: !1199, size: 32, offset: 1184)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1485, file: !1476, line: 139, baseType: !1199, size: 32, offset: 1216)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1485, file: !1476, line: 141, baseType: !1246, size: 16, offset: 1248)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1485, file: !1476, line: 142, baseType: !1246, size: 16, offset: 1264)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1485, file: !1476, line: 143, baseType: !1200, size: 32, offset: 1280)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1485, file: !1476, line: 144, baseType: !1200, size: 32, offset: 1312)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1485, file: !1476, line: 146, baseType: !1513, size: 64, offset: 1344)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1476, line: 114, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1476, line: 99, size: 7232, elements: !1516)
!1516 = !{!1517, !1519, !1520, !1521, !1522, !1523, !1524, !1535, !1539, !1554, !1563, !1570, !1580}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1515, file: !1476, line: 100, baseType: !1518, size: 64)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1515, file: !1476, line: 100, baseType: !1518, size: 64, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1515, file: !1476, line: 101, baseType: !1200, size: 32, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1515, file: !1476, line: 101, baseType: !1200, size: 32, offset: 160)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1515, file: !1476, line: 102, baseType: !1200, size: 32, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1515, file: !1476, line: 102, baseType: !1200, size: 32, offset: 224)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1515, file: !1476, line: 103, baseType: !1525, size: 64, offset: 256)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1476, line: 59, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1476, line: 56, size: 2112, elements: !1528)
!1528 = !{!1529, !1533, !1534}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1527, file: !1476, line: 57, baseType: !1530, size: 2048)
!1530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 2048, elements: !1531)
!1531 = !{!1532}
!1532 = !DISubrange(count: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1527, file: !1476, line: 58, baseType: !1200, size: 32, offset: 2048)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1527, file: !1476, line: 58, baseType: !1200, size: 32, offset: 2080)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1515, file: !1476, line: 106, baseType: !1536, size: 6144, offset: 320)
!1536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 6144, elements: !1537)
!1537 = !{!1538}
!1538 = !DISubrange(count: 768)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1515, file: !1476, line: 107, baseType: !1540, size: 64, offset: 6464)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1476, line: 97, baseType: !1542)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1476, line: 83, size: 8320, elements: !1543)
!1543 = !{!1544, !1545, !1546, !1550, !1551, !1552, !1553}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1542, file: !1476, line: 84, baseType: !1536, size: 6144)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1542, file: !1476, line: 87, baseType: !1530, size: 2048, offset: 6144)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1542, file: !1476, line: 88, baseType: !1547, size: 64, offset: 8192)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64)
!1548 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1549, line: 41, flags: DIFlagFwdDecl)
!1549 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1542, file: !1476, line: 90, baseType: !1246, size: 16, offset: 8256)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1542, file: !1476, line: 92, baseType: !1246, size: 16, offset: 8272)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1542, file: !1476, line: 93, baseType: !1246, size: 16, offset: 8288)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1542, file: !1476, line: 95, baseType: !1246, size: 16, offset: 8304)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1515, file: !1476, line: 108, baseType: !1555, size: 64, offset: 6528)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64)
!1556 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1476, line: 66, baseType: !1557)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1476, line: 61, size: 128, elements: !1558)
!1558 = !{!1559, !1560, !1561, !1562}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1557, file: !1476, line: 62, baseType: !1200, size: 32)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1557, file: !1476, line: 63, baseType: !1200, size: 32, offset: 32)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1557, file: !1476, line: 64, baseType: !1200, size: 32, offset: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1557, file: !1476, line: 65, baseType: !1200, size: 32, offset: 96)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1515, file: !1476, line: 109, baseType: !1564, size: 64, offset: 6592)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1476, line: 71, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1476, line: 68, size: 64, elements: !1567)
!1567 = !{!1568, !1569}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1566, file: !1476, line: 69, baseType: !1200, size: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1566, file: !1476, line: 70, baseType: !1200, size: 32, offset: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1515, file: !1476, line: 110, baseType: !1571, size: 64, offset: 6656)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1476, line: 81, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1476, line: 73, size: 352, elements: !1574)
!1574 = !{!1575, !1576, !1577, !1578, !1579}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1573, file: !1476, line: 74, baseType: !1380, size: 96)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1573, file: !1476, line: 75, baseType: !1380, size: 96, offset: 96)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1573, file: !1476, line: 76, baseType: !1380, size: 96, offset: 192)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1573, file: !1476, line: 77, baseType: !1200, size: 32, offset: 288)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1573, file: !1476, line: 78, baseType: !1200, size: 32, offset: 320)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1515, file: !1476, line: 113, baseType: !1581, size: 512, offset: 6720)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1582, line: 182, baseType: !1583)
!1582 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1582, line: 180, size: 512, elements: !1584)
!1584 = !{!1585}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1583, file: !1582, line: 181, baseType: !1231, size: 512)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1485, file: !1476, line: 148, baseType: !1587, size: 64, offset: 1408)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64)
!1588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1476, line: 49, flags: DIFlagFwdDecl)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1485, file: !1476, line: 151, baseType: !1348, size: 64, offset: 1472)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1485, file: !1476, line: 152, baseType: !1358, size: 64, offset: 1536)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1485, file: !1476, line: 153, baseType: !1592, size: 64, offset: 1600)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1356, line: 64, size: 19136, elements: !1594)
!1594 = !{!1595, !1596, !1597, !1598, !1599, !1600, !1602, !1603, !1604, !1605, !1608, !1609, !1859, !1860, !1868, !1869, !1870, !1871, !1872}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1593, file: !1356, line: 65, baseType: !1308, size: 960)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1593, file: !1356, line: 66, baseType: !1354, size: 64, offset: 960)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1593, file: !1356, line: 68, baseType: !1326, size: 8192, offset: 1024)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1593, file: !1356, line: 70, baseType: !1200, size: 32, offset: 9216)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1593, file: !1356, line: 71, baseType: !1200, size: 32, offset: 9248)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1593, file: !1356, line: 72, baseType: !1601, size: 64, offset: 9280)
!1601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 64, elements: !1413)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1593, file: !1356, line: 74, baseType: !1199, size: 32, offset: 9344)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1593, file: !1356, line: 74, baseType: !1199, size: 32, offset: 9376)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1593, file: !1356, line: 76, baseType: !1547, size: 64, offset: 9408)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1593, file: !1356, line: 77, baseType: !1606, size: 64, offset: 9472)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64)
!1607 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1356, line: 77, flags: DIFlagFwdDecl)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1593, file: !1356, line: 78, baseType: !1408, size: 64, offset: 9536)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1593, file: !1356, line: 80, baseType: !1610, size: 2624, offset: 9600)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1410, line: 340, size: 2624, elements: !1611)
!1611 = !{!1612, !1640, !1658, !1659, !1660, !1678, !1736, !1737, !1839, !1840, !1841, !1842, !1848}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1610, file: !1410, line: 341, baseType: !1613, size: 576)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1410, line: 251, baseType: !1614)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1410, line: 207, size: 576, elements: !1615)
!1615 = !{!1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1614, file: !1410, line: 208, baseType: !1200, size: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1614, file: !1410, line: 211, baseType: !1246, size: 16, offset: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1614, file: !1410, line: 212, baseType: !1246, size: 16, offset: 48)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1614, file: !1410, line: 213, baseType: !1199, size: 32, offset: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1614, file: !1410, line: 214, baseType: !1246, size: 16, offset: 96)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1614, file: !1410, line: 215, baseType: !1246, size: 16, offset: 112)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1614, file: !1410, line: 216, baseType: !1246, size: 16, offset: 128)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1614, file: !1410, line: 217, baseType: !1246, size: 16, offset: 144)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1614, file: !1410, line: 218, baseType: !1246, size: 16, offset: 160)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1614, file: !1410, line: 219, baseType: !1246, size: 16, offset: 176)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1614, file: !1410, line: 220, baseType: !1199, size: 32, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1614, file: !1410, line: 222, baseType: !1246, size: 16, offset: 224)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1614, file: !1410, line: 225, baseType: !1246, size: 16, offset: 240)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1614, file: !1410, line: 228, baseType: !1200, size: 32, offset: 256)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1614, file: !1410, line: 229, baseType: !1200, size: 32, offset: 288)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1614, file: !1410, line: 233, baseType: !1200, size: 32, offset: 320)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1614, file: !1410, line: 236, baseType: !1246, size: 16, offset: 352)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1614, file: !1410, line: 236, baseType: !1246, size: 16, offset: 368)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1614, file: !1410, line: 241, baseType: !1199, size: 32, offset: 384)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1614, file: !1410, line: 244, baseType: !1200, size: 32, offset: 416)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1614, file: !1410, line: 244, baseType: !1200, size: 32, offset: 448)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1614, file: !1410, line: 245, baseType: !1199, size: 32, offset: 480)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1614, file: !1410, line: 248, baseType: !1199, size: 32, offset: 512)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1614, file: !1410, line: 250, baseType: !1200, size: 32, offset: 544)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1610, file: !1410, line: 342, baseType: !1641, size: 448, offset: 576)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1410, line: 79, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1410, line: 61, size: 448, elements: !1643)
!1643 = !{!1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1642, file: !1410, line: 62, baseType: !1195, size: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1642, file: !1410, line: 64, baseType: !1246, size: 16, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1642, file: !1410, line: 65, baseType: !1246, size: 16, offset: 80)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1642, file: !1410, line: 67, baseType: !1199, size: 32, offset: 96)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1642, file: !1410, line: 68, baseType: !1199, size: 32, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1642, file: !1410, line: 69, baseType: !1199, size: 32, offset: 160)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1642, file: !1410, line: 70, baseType: !1246, size: 16, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1642, file: !1410, line: 71, baseType: !1246, size: 16, offset: 208)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1642, file: !1410, line: 72, baseType: !1412, size: 64, offset: 224)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1642, file: !1410, line: 75, baseType: !1199, size: 32, offset: 288)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1642, file: !1410, line: 75, baseType: !1199, size: 32, offset: 320)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1642, file: !1410, line: 75, baseType: !1199, size: 32, offset: 352)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1642, file: !1410, line: 78, baseType: !1199, size: 32, offset: 384)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1642, file: !1410, line: 78, baseType: !1199, size: 32, offset: 416)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1610, file: !1410, line: 343, baseType: !1255, size: 128, offset: 1024)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1610, file: !1410, line: 344, baseType: !1255, size: 128, offset: 1152)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1610, file: !1410, line: 345, baseType: !1661, size: 192, offset: 1280)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1410, line: 278, baseType: !1662)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1410, line: 270, size: 192, elements: !1663)
!1663 = !{!1664, !1665, !1666, !1667, !1668}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1662, file: !1410, line: 271, baseType: !1200, size: 32)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1662, file: !1410, line: 273, baseType: !1199, size: 32, offset: 32)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1662, file: !1410, line: 275, baseType: !1200, size: 32, offset: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1662, file: !1410, line: 276, baseType: !1200, size: 32, offset: 96)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1662, file: !1410, line: 277, baseType: !1669, size: 64, offset: 128)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1410, line: 55, size: 576, elements: !1671)
!1671 = !{!1672, !1673, !1674}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1670, file: !1410, line: 56, baseType: !1200, size: 32)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1670, file: !1410, line: 57, baseType: !1199, size: 32, offset: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1670, file: !1410, line: 58, baseType: !1675, size: 512, offset: 64)
!1675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 512, elements: !1676)
!1676 = !{!1677, !1677}
!1677 = !DISubrange(count: 4)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1610, file: !1410, line: 346, baseType: !1679, size: 384, offset: 1472)
!1679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1410, line: 268, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1410, line: 253, size: 384, elements: !1681)
!1681 = !{!1682, !1683, !1684, !1685, !1686, !1730, !1731, !1732, !1733, !1734, !1735}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1680, file: !1410, line: 254, baseType: !1200, size: 32)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1680, file: !1410, line: 255, baseType: !1200, size: 32, offset: 32)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1680, file: !1410, line: 255, baseType: !1200, size: 32, offset: 64)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1680, file: !1410, line: 258, baseType: !1199, size: 32, offset: 96)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1680, file: !1410, line: 259, baseType: !1687, size: 64, offset: 128)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1410, line: 164, baseType: !1689)
!1689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1410, line: 108, size: 1664, elements: !1690)
!1690 = !{!1691, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1689, file: !1410, line: 109, baseType: !1692, size: 64)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1689, file: !1410, line: 109, baseType: !1692, size: 64, offset: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1689, file: !1410, line: 111, baseType: !1231, size: 512, offset: 128)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1689, file: !1410, line: 119, baseType: !1412, size: 64, offset: 640)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1689, file: !1410, line: 119, baseType: !1412, size: 64, offset: 704)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1689, file: !1410, line: 125, baseType: !1412, size: 64, offset: 768)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1689, file: !1410, line: 125, baseType: !1412, size: 64, offset: 832)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1689, file: !1410, line: 127, baseType: !1412, size: 64, offset: 896)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1689, file: !1410, line: 130, baseType: !1200, size: 32, offset: 960)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1689, file: !1410, line: 131, baseType: !1200, size: 32, offset: 992)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1689, file: !1410, line: 132, baseType: !1703, size: 64, offset: 1024)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64)
!1704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1410, line: 106, baseType: !1705)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1410, line: 81, size: 512, elements: !1706)
!1706 = !{!1707, !1708, !1711, !1712, !1713, !1714}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1705, file: !1410, line: 82, baseType: !1412, size: 64)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1705, file: !1410, line: 97, baseType: !1709, size: 256, offset: 64)
!1709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 256, elements: !1710)
!1710 = !{!1677, !1414}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1705, file: !1410, line: 102, baseType: !1412, size: 64, offset: 320)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1705, file: !1410, line: 102, baseType: !1412, size: 64, offset: 384)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1705, file: !1410, line: 104, baseType: !1200, size: 32, offset: 448)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1705, file: !1410, line: 105, baseType: !1200, size: 32, offset: 480)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1689, file: !1410, line: 135, baseType: !1380, size: 96, offset: 1088)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1689, file: !1410, line: 136, baseType: !1199, size: 32, offset: 1184)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1689, file: !1410, line: 139, baseType: !1200, size: 32, offset: 1216)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1689, file: !1410, line: 139, baseType: !1200, size: 32, offset: 1248)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1689, file: !1410, line: 139, baseType: !1200, size: 32, offset: 1280)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1689, file: !1410, line: 140, baseType: !1380, size: 96, offset: 1312)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1689, file: !1410, line: 143, baseType: !1246, size: 16, offset: 1408)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1689, file: !1410, line: 144, baseType: !1246, size: 16, offset: 1424)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1689, file: !1410, line: 145, baseType: !1246, size: 16, offset: 1440)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1689, file: !1410, line: 148, baseType: !1246, size: 16, offset: 1456)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1689, file: !1410, line: 149, baseType: !1200, size: 32, offset: 1472)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1689, file: !1410, line: 150, baseType: !1199, size: 32, offset: 1504)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1689, file: !1410, line: 152, baseType: !1408, size: 64, offset: 1536)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1689, file: !1410, line: 163, baseType: !1199, size: 32, offset: 1600)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1689, file: !1410, line: 163, baseType: !1199, size: 32, offset: 1632)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1680, file: !1410, line: 261, baseType: !1199, size: 32, offset: 192)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1680, file: !1410, line: 261, baseType: !1199, size: 32, offset: 224)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1680, file: !1410, line: 261, baseType: !1199, size: 32, offset: 256)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1680, file: !1410, line: 263, baseType: !1200, size: 32, offset: 288)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1680, file: !1410, line: 266, baseType: !1200, size: 32, offset: 320)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1680, file: !1410, line: 267, baseType: !1199, size: 32, offset: 352)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1610, file: !1410, line: 347, baseType: !1687, size: 64, offset: 1856)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1610, file: !1410, line: 348, baseType: !1738, size: 64, offset: 1920)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64)
!1739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1410, line: 205, baseType: !1740)
!1740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1410, line: 186, size: 1024, elements: !1741)
!1741 = !{!1742, !1744, !1745, !1746, !1748, !1749, !1750, !1758, !1759, !1760, !1837, !1838}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1740, file: !1410, line: 187, baseType: !1743, size: 64)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1740, file: !1410, line: 187, baseType: !1743, size: 64, offset: 64)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1740, file: !1410, line: 189, baseType: !1231, size: 512, offset: 128)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1740, file: !1410, line: 191, baseType: !1747, size: 64, offset: 640)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1740, file: !1410, line: 193, baseType: !1200, size: 32, offset: 704)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1740, file: !1410, line: 193, baseType: !1200, size: 32, offset: 736)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1740, file: !1410, line: 195, baseType: !1751, size: 64, offset: 768)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64)
!1752 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1410, line: 184, baseType: !1753)
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1410, line: 166, size: 320, elements: !1754)
!1754 = !{!1755, !1756, !1757}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1753, file: !1410, line: 180, baseType: !1709, size: 256)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1753, file: !1410, line: 182, baseType: !1200, size: 32, offset: 256)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1753, file: !1410, line: 183, baseType: !1200, size: 32, offset: 288)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1740, file: !1410, line: 196, baseType: !1200, size: 32, offset: 832)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1740, file: !1410, line: 198, baseType: !1200, size: 32, offset: 864)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1740, file: !1410, line: 200, baseType: !1761, size: 64, offset: 896)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1549, line: 77, size: 15424, elements: !1763)
!1763 = !{!1764, !1765, !1766, !1769, !1772, !1773, !1776, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1796, !1797, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1823, !1824, !1825, !1826, !1827, !1831}
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1762, file: !1549, line: 78, baseType: !1308, size: 960)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1762, file: !1549, line: 80, baseType: !1326, size: 8192, offset: 960)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1762, file: !1549, line: 82, baseType: !1767, size: 64, offset: 9152)
!1767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1768, size: 64)
!1768 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1549, line: 43, flags: DIFlagFwdDecl)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1762, file: !1549, line: 83, baseType: !1770, size: 64, offset: 9216)
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64)
!1771 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1237, line: 46, flags: DIFlagFwdDecl)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1762, file: !1549, line: 86, baseType: !1547, size: 64, offset: 9280)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1762, file: !1549, line: 87, baseType: !1774, size: 64, offset: 9344)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64)
!1775 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1549, line: 44, flags: DIFlagFwdDecl)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1762, file: !1549, line: 89, baseType: !1777, size: 512, offset: 9408)
!1777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1774, size: 512, elements: !1778)
!1778 = !{!1779}
!1779 = !DISubrange(count: 8)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1762, file: !1549, line: 90, baseType: !1246, size: 16, offset: 9920)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1762, file: !1549, line: 90, baseType: !1246, size: 16, offset: 9936)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1762, file: !1549, line: 92, baseType: !1246, size: 16, offset: 9952)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1762, file: !1549, line: 92, baseType: !1246, size: 16, offset: 9968)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1762, file: !1549, line: 93, baseType: !1246, size: 16, offset: 9984)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1762, file: !1549, line: 93, baseType: !1246, size: 16, offset: 10000)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1762, file: !1549, line: 94, baseType: !1200, size: 32, offset: 10016)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1762, file: !1549, line: 97, baseType: !1246, size: 16, offset: 10048)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1762, file: !1549, line: 97, baseType: !1246, size: 16, offset: 10064)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1762, file: !1549, line: 98, baseType: !1246, size: 16, offset: 10080)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1762, file: !1549, line: 98, baseType: !1246, size: 16, offset: 10096)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1762, file: !1549, line: 99, baseType: !1246, size: 16, offset: 10112)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1762, file: !1549, line: 99, baseType: !1246, size: 16, offset: 10128)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1762, file: !1549, line: 100, baseType: !7, size: 32, offset: 10144)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1762, file: !1549, line: 101, baseType: !1795, size: 64, offset: 10176)
!1795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1762, file: !1549, line: 103, baseType: !1332, size: 64, offset: 10240)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1762, file: !1549, line: 104, baseType: !1798, size: 64, offset: 10304)
!1798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1799, size: 64)
!1799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1237, line: 159, size: 448, elements: !1800)
!1800 = !{!1801, !1803, !1804, !1806, !1807, !1809}
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1799, file: !1237, line: 161, baseType: !1802, size: 64)
!1802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1413)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1799, file: !1237, line: 162, baseType: !1802, size: 64, offset: 64)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1799, file: !1237, line: 163, baseType: !1805, size: 32, offset: 128)
!1805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 32, elements: !1413)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1799, file: !1237, line: 164, baseType: !1805, size: 32, offset: 160)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1799, file: !1237, line: 165, baseType: !1808, size: 128, offset: 192)
!1808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1795, size: 128, elements: !1413)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1799, file: !1237, line: 166, baseType: !1810, size: 128, offset: 320)
!1810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1770, size: 128, elements: !1413)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1762, file: !1549, line: 107, baseType: !1199, size: 32, offset: 10368)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1762, file: !1549, line: 108, baseType: !1200, size: 32, offset: 10400)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1762, file: !1549, line: 109, baseType: !1246, size: 16, offset: 10432)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1762, file: !1549, line: 110, baseType: !1246, size: 16, offset: 10448)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1762, file: !1549, line: 113, baseType: !1200, size: 32, offset: 10464)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1762, file: !1549, line: 113, baseType: !1200, size: 32, offset: 10496)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1762, file: !1549, line: 114, baseType: !1215, size: 8, offset: 10528)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1762, file: !1549, line: 114, baseType: !1215, size: 8, offset: 10536)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1762, file: !1549, line: 115, baseType: !1246, size: 16, offset: 10544)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1762, file: !1549, line: 116, baseType: !1821, size: 128, offset: 10560)
!1821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 128, elements: !1822)
!1822 = !{!1677}
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1762, file: !1549, line: 119, baseType: !1199, size: 32, offset: 10688)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1762, file: !1549, line: 119, baseType: !1199, size: 32, offset: 10720)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1762, file: !1549, line: 122, baseType: !1581, size: 512, offset: 10752)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1762, file: !1549, line: 123, baseType: !1215, size: 8, offset: 11264)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1762, file: !1549, line: 125, baseType: !1828, size: 56, offset: 11272)
!1828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 56, elements: !1829)
!1829 = !{!1830}
!1830 = !DISubrange(count: 7)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1762, file: !1549, line: 126, baseType: !1832, size: 4096, offset: 11328)
!1832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1833, size: 4096, elements: !1778)
!1833 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1549, line: 69, baseType: !1834)
!1834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1549, line: 67, size: 512, elements: !1835)
!1835 = !{!1836}
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1834, file: !1549, line: 68, baseType: !1231, size: 512)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1740, file: !1410, line: 201, baseType: !1199, size: 32, offset: 960)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1740, file: !1410, line: 204, baseType: !1200, size: 32, offset: 992)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1610, file: !1410, line: 350, baseType: !1255, size: 128, offset: 1984)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1610, file: !1410, line: 351, baseType: !1200, size: 32, offset: 2112)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1610, file: !1410, line: 351, baseType: !1200, size: 32, offset: 2144)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1610, file: !1410, line: 353, baseType: !1843, size: 64, offset: 2176)
!1843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1844, size: 64)
!1844 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1410, line: 297, baseType: !1845)
!1845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1410, line: 295, size: 2048, elements: !1846)
!1846 = !{!1847}
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1845, file: !1410, line: 296, baseType: !1530, size: 2048)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1610, file: !1410, line: 355, baseType: !1849, size: 384, offset: 2240)
!1849 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1410, line: 338, baseType: !1850)
!1850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1410, line: 322, size: 384, elements: !1851)
!1851 = !{!1852, !1853, !1854, !1855, !1856, !1857, !1858}
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1850, file: !1410, line: 323, baseType: !1200, size: 32)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1850, file: !1410, line: 325, baseType: !1246, size: 16, offset: 32)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1850, file: !1410, line: 326, baseType: !1246, size: 16, offset: 48)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1850, file: !1410, line: 331, baseType: !1255, size: 128, offset: 64)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1850, file: !1410, line: 334, baseType: !1255, size: 128, offset: 192)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1850, file: !1410, line: 335, baseType: !1200, size: 32, offset: 320)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1850, file: !1410, line: 337, baseType: !1200, size: 32, offset: 352)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1593, file: !1356, line: 81, baseType: !1195, size: 64, offset: 12224)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1593, file: !1356, line: 85, baseType: !1861, size: 6208, offset: 12288)
!1861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1356, line: 55, size: 6208, elements: !1862)
!1862 = !{!1863, !1864, !1865, !1866, !1867}
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1861, file: !1356, line: 56, baseType: !1536, size: 6144)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1861, file: !1356, line: 58, baseType: !1246, size: 16, offset: 6144)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1861, file: !1356, line: 59, baseType: !1246, size: 16, offset: 6160)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1861, file: !1356, line: 60, baseType: !1246, size: 16, offset: 6176)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1861, file: !1356, line: 61, baseType: !1246, size: 16, offset: 6192)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1593, file: !1356, line: 86, baseType: !1200, size: 32, offset: 18496)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1593, file: !1356, line: 88, baseType: !1200, size: 32, offset: 18528)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1593, file: !1356, line: 90, baseType: !1200, size: 32, offset: 18560)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1593, file: !1356, line: 94, baseType: !1200, size: 32, offset: 18592)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1593, file: !1356, line: 100, baseType: !1581, size: 512, offset: 18624)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1485, file: !1476, line: 154, baseType: !1874, size: 64, offset: 1664)
!1874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1875, size: 64)
!1875 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1360, line: 264, flags: DIFlagFwdDecl)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1485, file: !1476, line: 156, baseType: !1547, size: 64, offset: 1728)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1485, file: !1476, line: 158, baseType: !1199, size: 32, offset: 1792)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1485, file: !1476, line: 159, baseType: !1199, size: 32, offset: 1824)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1485, file: !1476, line: 162, baseType: !1488, size: 64, offset: 1856)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1485, file: !1476, line: 162, baseType: !1488, size: 64, offset: 1920)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1485, file: !1476, line: 162, baseType: !1488, size: 64, offset: 1984)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1485, file: !1476, line: 164, baseType: !1255, size: 128, offset: 2048)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1485, file: !1476, line: 166, baseType: !1884, size: 64, offset: 2176)
!1884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1885, size: 64)
!1885 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1476, line: 51, flags: DIFlagFwdDecl)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1485, file: !1476, line: 167, baseType: !1195, size: 64, offset: 2240)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1485, file: !1476, line: 168, baseType: !1199, size: 32, offset: 2304)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1485, file: !1476, line: 170, baseType: !1199, size: 32, offset: 2336)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1485, file: !1476, line: 170, baseType: !1199, size: 32, offset: 2368)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1485, file: !1476, line: 171, baseType: !1199, size: 32, offset: 2400)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1485, file: !1476, line: 173, baseType: !1195, size: 64, offset: 2432)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1485, file: !1476, line: 175, baseType: !1200, size: 32, offset: 2496)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1485, file: !1476, line: 176, baseType: !1200, size: 32, offset: 2528)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1485, file: !1476, line: 179, baseType: !1200, size: 32, offset: 2560)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1485, file: !1476, line: 180, baseType: !1199, size: 32, offset: 2592)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1485, file: !1476, line: 183, baseType: !1200, size: 32, offset: 2624)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1485, file: !1476, line: 185, baseType: !1215, size: 8, offset: 2656)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1485, file: !1476, line: 186, baseType: !1899, size: 24, offset: 2664)
!1899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 24, elements: !1381)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1485, file: !1476, line: 189, baseType: !1255, size: 128, offset: 2688)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !1475, file: !1476, line: 207, baseType: !1326, size: 8192, offset: 384)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !1475, file: !1476, line: 208, baseType: !1326, size: 8192, offset: 8576)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !1475, file: !1476, line: 210, baseType: !1200, size: 32, offset: 16768)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !1475, file: !1476, line: 210, baseType: !1200, size: 32, offset: 16800)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !1475, file: !1476, line: 211, baseType: !1200, size: 32, offset: 16832)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1475, file: !1476, line: 211, baseType: !1200, size: 32, offset: 16864)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !1475, file: !1476, line: 212, baseType: !1430, size: 128, offset: 16896)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1349, file: !1350, line: 1246, baseType: !1909, size: 64, offset: 2112)
!1909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1910, size: 64)
!1910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1350, line: 1067, size: 5184, elements: !1911)
!1911 = !{!1912, !1942, !1943, !1958, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1980, !1996, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2106}
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1910, file: !1350, line: 1068, baseType: !1913, size: 64)
!1913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1914, size: 64)
!1914 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1350, line: 934, baseType: !1915)
!1915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1350, line: 925, size: 576, elements: !1916)
!1916 = !{!1917, !1934, !1935, !1936, !1937, !1938, !1941}
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1915, file: !1350, line: 926, baseType: !1918, size: 320)
!1918 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1350, line: 830, baseType: !1919)
!1919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1350, line: 813, size: 320, elements: !1920)
!1920 = !{!1921, !1924, !1927, !1928, !1931, !1932, !1933}
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1919, file: !1350, line: 814, baseType: !1922, size: 64)
!1922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1923, size: 64)
!1923 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !1350, line: 51, flags: DIFlagFwdDecl)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1919, file: !1350, line: 815, baseType: !1925, size: 64, offset: 64)
!1925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1926, size: 64)
!1926 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !1350, line: 815, flags: DIFlagFwdDecl)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1919, file: !1350, line: 818, baseType: !1195, size: 64, offset: 128)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1919, file: !1350, line: 819, baseType: !1929, size: 32, offset: 192)
!1929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1930, size: 32, elements: !1822)
!1930 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1919, file: !1350, line: 822, baseType: !1200, size: 32, offset: 224)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1919, file: !1350, line: 826, baseType: !1200, size: 32, offset: 256)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1919, file: !1350, line: 829, baseType: !1200, size: 32, offset: 288)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1915, file: !1350, line: 928, baseType: !1246, size: 16, offset: 320)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1915, file: !1350, line: 928, baseType: !1246, size: 16, offset: 336)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1915, file: !1350, line: 929, baseType: !1200, size: 32, offset: 352)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1915, file: !1350, line: 930, baseType: !1795, size: 64, offset: 384)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1915, file: !1350, line: 931, baseType: !1939, size: 64, offset: 448)
!1939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1940, size: 64)
!1940 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !1350, line: 931, flags: DIFlagFwdDecl)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1915, file: !1350, line: 933, baseType: !1195, size: 64, offset: 512)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1910, file: !1350, line: 1069, baseType: !1913, size: 64, offset: 64)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1910, file: !1350, line: 1070, baseType: !1944, size: 64, offset: 128)
!1944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1945, size: 64)
!1945 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !1350, line: 916, baseType: !1946)
!1946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !1350, line: 891, size: 704, elements: !1947)
!1947 = !{!1948, !1949, !1950, !1952, !1953, !1954, !1955, !1956, !1957}
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1946, file: !1350, line: 892, baseType: !1918, size: 320)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1946, file: !1350, line: 896, baseType: !1200, size: 32, offset: 320)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1946, file: !1350, line: 900, baseType: !1951, size: 96, offset: 352)
!1951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 96, elements: !1381)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1946, file: !1350, line: 903, baseType: !1199, size: 32, offset: 448)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1946, file: !1350, line: 906, baseType: !1200, size: 32, offset: 480)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1946, file: !1350, line: 909, baseType: !1199, size: 32, offset: 512)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1946, file: !1350, line: 912, baseType: !1199, size: 32, offset: 544)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1946, file: !1350, line: 914, baseType: !1358, size: 64, offset: 576)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1946, file: !1350, line: 915, baseType: !1195, size: 64, offset: 640)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1910, file: !1350, line: 1071, baseType: !1959, size: 64, offset: 192)
!1959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1960, size: 64)
!1960 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !1350, line: 920, baseType: !1961)
!1961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !1350, line: 918, size: 320, elements: !1962)
!1962 = !{!1963}
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1961, file: !1350, line: 919, baseType: !1918, size: 320)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1910, file: !1350, line: 1075, baseType: !1199, size: 32, offset: 256)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1910, file: !1350, line: 1077, baseType: !1199, size: 32, offset: 288)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1910, file: !1350, line: 1078, baseType: !1199, size: 32, offset: 320)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1910, file: !1350, line: 1079, baseType: !1246, size: 16, offset: 352)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1910, file: !1350, line: 1082, baseType: !1246, size: 16, offset: 368)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1910, file: !1350, line: 1085, baseType: !1215, size: 8, offset: 384)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1910, file: !1350, line: 1086, baseType: !1215, size: 8, offset: 392)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1910, file: !1350, line: 1087, baseType: !1215, size: 8, offset: 400)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1910, file: !1350, line: 1088, baseType: !1215, size: 8, offset: 408)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1910, file: !1350, line: 1090, baseType: !1199, size: 32, offset: 416)
