; ModuleID = 'zlib/inflate.c'
source_filename = "zlib/inflate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.code = type { i8, i8, i16 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque
%struct.inflate_state = type { i32, i32, i32, i32, i32, i32, i64, i64, %struct.gz_header_s*, i32, i32, i32, i32, i8*, i64, i32, i32, i32, i32, %struct.code*, %struct.code*, i32, i32, i32, i32, i32, i32, %struct.code*, [320 x i16], [288 x i16], [1444 x %struct.code], i32, i32, i32 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c"1.2.6\00", align 1
@inflate.order = internal constant [19 x i16] [i16 16, i16 17, i16 18, i16 0, i16 8, i16 7, i16 9, i16 6, i16 10, i16 5, i16 11, i16 4, i16 12, i16 3, i16 13, i16 2, i16 14, i16 1, i16 15], align 16, !dbg !0
@.str.1 = private unnamed_addr constant [23 x i8] c"incorrect header check\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"unknown compression method\00", align 1
@.str.3 = private unnamed_addr constant [20 x i8] c"invalid window size\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"unknown header flags set\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "order", scope: !2, file: !3, line: 629, type: !187, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "inflate", scope: !3, file: !3, line: 609, type: !4, scopeLine: 612, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !177)
!3 = !DIFile(filename: "zlib/inflate.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !8, line: 106, baseType: !9)
!8 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !8, line: 104, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !8, line: 85, size: 896, elements: !12)
!12 = !{!13, !19, !22, !25, !26, !27, !28, !31, !34, !41, !46, !47, !48, !49}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !11, file: !8, line: 86, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !16, line: 374, baseType: !17)
!16 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !16, line: 365, baseType: !18)
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !11, file: !8, line: 87, baseType: !20, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !16, line: 367, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !11, file: !8, line: 88, baseType: !23, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !16, line: 368, baseType: !24)
!24 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !11, file: !8, line: 90, baseType: !14, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !11, file: !8, line: 91, baseType: !20, size: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !11, file: !8, line: 92, baseType: !23, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !11, file: !8, line: 94, baseType: !29, size: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !11, file: !8, line: 95, baseType: !32, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !8, line: 83, flags: DIFlagFwdDecl)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !11, file: !8, line: 97, baseType: !35, size: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !8, line: 80, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !39, !20, !20}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !16, line: 383, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !11, file: !8, line: 98, baseType: !42, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !8, line: 81, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !39, !39}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !11, file: !8, line: 99, baseType: !39, size: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !11, file: !8, line: 101, baseType: !6, size: 32, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !11, file: !8, line: 102, baseType: !23, size: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !11, file: !8, line: 103, baseType: !23, size: 64, offset: 832)
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !51, retainedTypes: !93, globals: !171, splitDebugInlining: false, nameTableKind: None)
!51 = !{!52, !87}
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 20, baseType: !21, size: 32, elements: !54)
!53 = !DIFile(filename: "zlib/inflate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!55 = !DIEnumerator(name: "HEAD", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "FLAGS", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "TIME", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "OS", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "EXLEN", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "EXTRA", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "NAME", value: 6, isUnsigned: true)
!62 = !DIEnumerator(name: "COMMENT", value: 7, isUnsigned: true)
!63 = !DIEnumerator(name: "HCRC", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "DICTID", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DICT", value: 10, isUnsigned: true)
!66 = !DIEnumerator(name: "TYPE", value: 11, isUnsigned: true)
!67 = !DIEnumerator(name: "TYPEDO", value: 12, isUnsigned: true)
!68 = !DIEnumerator(name: "STORED", value: 13, isUnsigned: true)
!69 = !DIEnumerator(name: "COPY_", value: 14, isUnsigned: true)
!70 = !DIEnumerator(name: "COPY", value: 15, isUnsigned: true)
!71 = !DIEnumerator(name: "TABLE", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "LENLENS", value: 17, isUnsigned: true)
!73 = !DIEnumerator(name: "CODELENS", value: 18, isUnsigned: true)
!74 = !DIEnumerator(name: "LEN_", value: 19, isUnsigned: true)
!75 = !DIEnumerator(name: "LEN", value: 20, isUnsigned: true)
!76 = !DIEnumerator(name: "LENEXT", value: 21, isUnsigned: true)
!77 = !DIEnumerator(name: "DIST", value: 22, isUnsigned: true)
!78 = !DIEnumerator(name: "DISTEXT", value: 23, isUnsigned: true)
!79 = !DIEnumerator(name: "MATCH", value: 24, isUnsigned: true)
!80 = !DIEnumerator(name: "LIT", value: 25, isUnsigned: true)
!81 = !DIEnumerator(name: "CHECK", value: 26, isUnsigned: true)
!82 = !DIEnumerator(name: "LENGTH", value: 27, isUnsigned: true)
!83 = !DIEnumerator(name: "DONE", value: 28, isUnsigned: true)
!84 = !DIEnumerator(name: "BAD", value: 29, isUnsigned: true)
!85 = !DIEnumerator(name: "MEM", value: 30, isUnsigned: true)
!86 = !DIEnumerator(name: "SYNC", value: 31, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 54, baseType: !21, size: 32, elements: !89)
!88 = !DIFile(filename: "zlib/inftrees.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "CODES", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "LENS", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "DISTS", value: 2, isUnsigned: true)
!93 = !{!94, !21, !39, !6, !35, !42, !32, !24, !18, !29, !145, !137, !14, !130, !170}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inflate_state", file: !53, line: 81, size: 57216, elements: !96)
!96 = !{!97, !99, !100, !101, !102, !103, !104, !105, !106, !125, !126, !127, !128, !129, !131, !132, !133, !134, !135, !136, !146, !147, !148, !149, !150, !151, !152, !153, !155, !159, !163, !167, !168, !169}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !95, file: !53, line: 82, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "inflate_mode", file: !53, line: 53, baseType: !52)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !95, file: !53, line: 83, baseType: !6, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !95, file: !53, line: 84, baseType: !6, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !95, file: !53, line: 85, baseType: !6, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !95, file: !53, line: 86, baseType: !6, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !95, file: !53, line: 87, baseType: !21, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !95, file: !53, line: 88, baseType: !24, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !95, file: !53, line: 89, baseType: !24, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !95, file: !53, line: 90, baseType: !107, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !8, line: 129, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !8, line: 127, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !8, line: 112, size: 640, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !110, file: !8, line: 113, baseType: !6, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !110, file: !8, line: 114, baseType: !23, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !110, file: !8, line: 115, baseType: !6, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !110, file: !8, line: 116, baseType: !6, size: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !110, file: !8, line: 117, baseType: !14, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !110, file: !8, line: 118, baseType: !20, size: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !110, file: !8, line: 119, baseType: !20, size: 32, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !8, line: 120, baseType: !14, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !110, file: !8, line: 121, baseType: !20, size: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !110, file: !8, line: 122, baseType: !14, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !110, file: !8, line: 123, baseType: !20, size: 32, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !110, file: !8, line: 124, baseType: !6, size: 32, offset: 544)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !110, file: !8, line: 125, baseType: !6, size: 32, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "wbits", scope: !95, file: !53, line: 92, baseType: !21, size: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wsize", scope: !95, file: !53, line: 93, baseType: !21, size: 32, offset: 416)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "whave", scope: !95, file: !53, line: 94, baseType: !21, size: 32, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "wnext", scope: !95, file: !53, line: 95, baseType: !21, size: 32, offset: 480)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !95, file: !53, line: 96, baseType: !130, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "hold", scope: !95, file: !53, line: 98, baseType: !24, size: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !95, file: !53, line: 99, baseType: !21, size: 32, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !95, file: !53, line: 101, baseType: !21, size: 32, offset: 672)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !95, file: !53, line: 102, baseType: !21, size: 32, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !95, file: !53, line: 104, baseType: !21, size: 32, offset: 736)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lencode", scope: !95, file: !53, line: 106, baseType: !137, size: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "code", file: !88, line: 28, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 24, size: 32, elements: !141)
!141 = !{!142, !143, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !140, file: !88, line: 25, baseType: !18, size: 8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !140, file: !88, line: 26, baseType: !18, size: 8, offset: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !140, file: !88, line: 27, baseType: !145, size: 16, offset: 16)
!145 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "distcode", scope: !95, file: !53, line: 107, baseType: !137, size: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lenbits", scope: !95, file: !53, line: 108, baseType: !21, size: 32, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "distbits", scope: !95, file: !53, line: 109, baseType: !21, size: 32, offset: 928)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ncode", scope: !95, file: !53, line: 111, baseType: !21, size: 32, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nlen", scope: !95, file: !53, line: 112, baseType: !21, size: 32, offset: 992)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ndist", scope: !95, file: !53, line: 113, baseType: !21, size: 32, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !95, file: !53, line: 114, baseType: !21, size: 32, offset: 1056)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !53, line: 115, baseType: !154, size: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !95, file: !53, line: 116, baseType: !156, size: 5120, offset: 1152)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 5120, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !95, file: !53, line: 117, baseType: !160, size: 4608, offset: 6272)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 4608, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !95, file: !53, line: 118, baseType: !164, size: 46208, offset: 10880)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 46208, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 1444)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sane", scope: !95, file: !53, line: 119, baseType: !6, size: 32, offset: 57088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !95, file: !53, line: 120, baseType: !6, size: 32, offset: 57120)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "was", scope: !95, file: !53, line: 121, baseType: !21, size: 32, offset: 57152)
!170 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!171 = !{!0, !172, !182}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "lenfix", scope: !174, file: !178, line: 10, type: !179, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "fixedtables", scope: !3, file: !3, line: 260, type: !175, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !50, retainedNodes: !177)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !94}
!177 = !{}
!178 = !DIFile(filename: "zlib/inffixed.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 16384, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 512)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "distfix", scope: !174, file: !178, line: 87, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1024, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 32)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 304, elements: !189)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!189 = !{!190}
!190 = !DISubrange(count: 19)
!191 = !{i32 7, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{i32 1, !"wchar_size", i32 4}
!194 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!195 = distinct !DISubprogram(name: "inflateResetKeep", scope: !3, file: !3, line: 103, type: !196, scopeLine: 105, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !177)
!196 = !DISubroutineType(types: !197)
!197 = !{!6, !7}
!198 = !DILocalVariable(name: "strm", arg: 1, scope: !195, file: !3, line: 104, type: !7)
!199 = !DILocation(line: 104, column: 11, scope: !195)
!200 = !DILocalVariable(name: "state", scope: !195, file: !3, line: 106, type: !94)
!201 = !DILocation(line: 106, column: 31, scope: !195)
!202 = !DILocation(line: 108, column: 9, scope: !203)
!203 = distinct !DILexicalBlock(scope: !195, file: !3, line: 108, column: 9)
!204 = !DILocation(line: 108, column: 14, scope: !203)
!205 = !DILocation(line: 108, column: 24, scope: !203)
!206 = !DILocation(line: 108, column: 27, scope: !203)
!207 = !DILocation(line: 108, column: 33, scope: !203)
!208 = !DILocation(line: 108, column: 39, scope: !203)
!209 = !DILocation(line: 108, column: 9, scope: !195)
!210 = !DILocation(line: 108, column: 50, scope: !203)
!211 = !DILocation(line: 109, column: 41, scope: !195)
!212 = !DILocation(line: 109, column: 47, scope: !195)
!213 = !DILocation(line: 109, column: 13, scope: !195)
!214 = !DILocation(line: 109, column: 11, scope: !195)
!215 = !DILocation(line: 110, column: 40, scope: !195)
!216 = !DILocation(line: 110, column: 47, scope: !195)
!217 = !DILocation(line: 110, column: 53, scope: !195)
!218 = !DILocation(line: 110, column: 22, scope: !195)
!219 = !DILocation(line: 110, column: 28, scope: !195)
!220 = !DILocation(line: 110, column: 38, scope: !195)
!221 = !DILocation(line: 110, column: 5, scope: !195)
!222 = !DILocation(line: 110, column: 11, scope: !195)
!223 = !DILocation(line: 110, column: 20, scope: !195)
!224 = !DILocation(line: 111, column: 5, scope: !195)
!225 = !DILocation(line: 111, column: 11, scope: !195)
!226 = !DILocation(line: 111, column: 15, scope: !195)
!227 = !DILocation(line: 112, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !195, file: !3, line: 112, column: 9)
!229 = !DILocation(line: 112, column: 16, scope: !228)
!230 = !DILocation(line: 112, column: 9, scope: !195)
!231 = !DILocation(line: 113, column: 23, scope: !228)
