; ModuleID = 'blender/source/creator/creator.c'
source_filename = "blender/source/creator/creator.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!345 = !DILocation(line: 1453, column: 14, scope: !74)
!346 = !DILocation(line: 1453, column: 2, scope: !74)
!347 = !DILocation(line: 1454, column: 14, scope: !74)
!348 = !DILocation(line: 1454, column: 2, scope: !74)
!349 = !DILocation(line: 1456, column: 14, scope: !74)
!350 = !DILocation(line: 1456, column: 2, scope: !74)
!351 = !DILocation(line: 1458, column: 14, scope: !74)
!352 = !DILocation(line: 1458, column: 2, scope: !74)
!353 = !DILocation(line: 1461, column: 14, scope: !74)
!354 = !DILocation(line: 1461, column: 2, scope: !74)
!355 = !DILocation(line: 1462, column: 14, scope: !74)
!356 = !DILocation(line: 1462, column: 2, scope: !74)
!357 = !DILocation(line: 1463, column: 14, scope: !74)
!358 = !DILocation(line: 1463, column: 2, scope: !74)
!359 = !DILocation(line: 1466, column: 14, scope: !74)
!360 = !DILocation(line: 1466, column: 2, scope: !74)
!361 = !DILocation(line: 1467, column: 14, scope: !74)
!362 = !DILocation(line: 1467, column: 2, scope: !74)
!363 = !DILocation(line: 1468, column: 14, scope: !74)
!364 = !DILocation(line: 1468, column: 2, scope: !74)
!365 = !DILocation(line: 1469, column: 14, scope: !74)
!366 = !DILocation(line: 1469, column: 2, scope: !74)
!367 = !DILocation(line: 1470, column: 14, scope: !74)
!368 = !DILocation(line: 1470, column: 2, scope: !74)
!369 = !DILocation(line: 1471, column: 14, scope: !74)
!370 = !DILocation(line: 1471, column: 121, scope: !74)
!371 = !DILocation(line: 1471, column: 2, scope: !74)
!372 = !DILocation(line: 1472, column: 14, scope: !74)
!373 = !DILocation(line: 1472, column: 149, scope: !74)
!374 = !DILocation(line: 1472, column: 2, scope: !74)
!375 = !DILocation(line: 1475, column: 18, scope: !74)
!376 = !DILocation(line: 1475, column: 97, scope: !74)
!377 = !DILocation(line: 1475, column: 2, scope: !74)
!378 = !DILocation(line: 1476, column: 18, scope: !74)
!379 = !DILocation(line: 1476, column: 2, scope: !74)
!380 = !DILocation(line: 1477, column: 18, scope: !74)
!381 = !DILocation(line: 1477, column: 2, scope: !74)
!382 = !DILocation(line: 1478, column: 18, scope: !74)
!383 = !DILocation(line: 1478, column: 2, scope: !74)
!384 = !DILocation(line: 1481, column: 14, scope: !74)
!385 = !DILocation(line: 1481, column: 62, scope: !74)
!386 = !DILocation(line: 1481, column: 2, scope: !74)
!387 = !DILocation(line: 1482, column: 14, scope: !74)
!388 = !DILocation(line: 1482, column: 170, scope: !74)
!389 = !DILocation(line: 1482, column: 2, scope: !74)
!390 = !DILocation(line: 1483, column: 14, scope: !74)
!391 = !DILocation(line: 1483, column: 113, scope: !74)
!392 = !DILocation(line: 1483, column: 2, scope: !74)
!393 = !DILocation(line: 1484, column: 14, scope: !74)
!394 = !DILocation(line: 1484, column: 104, scope: !74)
!395 = !DILocation(line: 1484, column: 2, scope: !74)
!396 = !DILocation(line: 1485, column: 14, scope: !74)
!397 = !DILocation(line: 1485, column: 131, scope: !74)
!398 = !DILocation(line: 1485, column: 2, scope: !74)
!399 = !DILocation(line: 1486, column: 14, scope: !74)
!400 = !DILocation(line: 1486, column: 125, scope: !74)
!401 = !DILocation(line: 1486, column: 2, scope: !74)
!402 = !DILocation(line: 1487, column: 14, scope: !74)
!403 = !DILocation(line: 1487, column: 137, scope: !74)
!404 = !DILocation(line: 1487, column: 2, scope: !74)
!405 = !DILocation(line: 1488, column: 14, scope: !74)
!406 = !DILocation(line: 1488, column: 106, scope: !74)
!407 = !DILocation(line: 1488, column: 2, scope: !74)
!408 = !DILocation(line: 1489, column: 14, scope: !74)
!409 = !DILocation(line: 1489, column: 113, scope: !74)
!410 = !DILocation(line: 1489, column: 2, scope: !74)
!411 = !DILocation(line: 1490, column: 14, scope: !74)
!412 = !DILocation(line: 1490, column: 114, scope: !74)
!413 = !DILocation(line: 1490, column: 2, scope: !74)
!414 = !DILocation(line: 1491, column: 14, scope: !74)
!415 = !DILocation(line: 1491, column: 101, scope: !74)
!416 = !DILocation(line: 1491, column: 2, scope: !74)
!417 = !DILocation(line: 1493, column: 14, scope: !74)
!418 = !DILocation(line: 1493, column: 70, scope: !74)
!419 = !DILocation(line: 1493, column: 2, scope: !74)
!420 = !DILocation(line: 1494, column: 14, scope: !74)
!421 = !DILocation(line: 1494, column: 133, scope: !74)
!422 = !DILocation(line: 1494, column: 2, scope: !74)
!423 = !DILocation(line: 1496, column: 14, scope: !74)
!424 = !DILocation(line: 1496, column: 74, scope: !74)
!425 = !DILocation(line: 1496, column: 2, scope: !74)
!426 = !DILocation(line: 1497, column: 14, scope: !74)
!427 = !DILocation(line: 1497, column: 2, scope: !74)
!428 = !DILocation(line: 1498, column: 14, scope: !74)
!429 = !DILocation(line: 1498, column: 134, scope: !74)
!430 = !DILocation(line: 1498, column: 2, scope: !74)
!431 = !DILocation(line: 1500, column: 1, scope: !74)
!432 = distinct !DISubprogram(name: "blender_crash_handler", scope: !3, file: !3, line: 587, type: !69, scopeLine: 588, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!433 = !DILocalVariable(name: "signum", arg: 1, scope: !432, file: !3, line: 587, type: !62)
!434 = !DILocation(line: 587, column: 39, scope: !432)
!435 = !DILocalVariable(name: "fp", scope: !432, file: !3, line: 609, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !438, line: 7, baseType: !439)
!438 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !440, line: 49, size: 1728, elements: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!441 = !{!442, !443, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !458, !460, !461, !462, !465, !467, !469, !473, !476, !478, !481, !484, !485, !486, !490, !491}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !439, file: !440, line: 51, baseType: !62, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !439, file: !440, line: 54, baseType: !444, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !439, file: !440, line: 55, baseType: !444, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !439, file: !440, line: 56, baseType: !444, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !439, file: !440, line: 57, baseType: !444, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !439, file: !440, line: 58, baseType: !444, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !439, file: !440, line: 59, baseType: !444, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !439, file: !440, line: 60, baseType: !444, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !439, file: !440, line: 61, baseType: !444, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !439, file: !440, line: 64, baseType: !444, size: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !439, file: !440, line: 65, baseType: !444, size: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !439, file: !440, line: 66, baseType: !444, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !439, file: !440, line: 68, baseType: !456, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !440, line: 36, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !439, file: !440, line: 70, baseType: !459, size: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !439, file: !440, line: 72, baseType: !62, size: 32, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !439, file: !440, line: 73, baseType: !62, size: 32, offset: 928)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !439, file: !440, line: 74, baseType: !463, size: 64, offset: 960)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !464, line: 152, baseType: !65)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !439, file: !440, line: 77, baseType: !466, size: 16, offset: 1024)
!466 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !439, file: !440, line: 78, baseType: !468, size: 8, offset: 1040)
!468 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !439, file: !440, line: 79, baseType: !470, size: 8, offset: 1048)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 1)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !439, file: !440, line: 81, baseType: !474, size: 64, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !440, line: 43, baseType: null)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !439, file: !440, line: 89, baseType: !477, size: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !464, line: 153, baseType: !65)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !439, file: !440, line: 91, baseType: !479, size: 64, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !440, line: 37, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !439, file: !440, line: 92, baseType: !482, size: 64, offset: 1280)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !440, line: 38, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !439, file: !440, line: 93, baseType: !459, size: 64, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !439, file: !440, line: 94, baseType: !57, size: 64, offset: 1408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !439, file: !440, line: 95, baseType: !487, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !488, line: 46, baseType: !489)
!488 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!489 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !439, file: !440, line: 96, baseType: !62, size: 32, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !439, file: !440, line: 98, baseType: !492, size: 160, offset: 1568)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 20)
!495 = !DILocation(line: 609, column: 8, scope: !432)
!496 = !DILocalVariable(name: "header", scope: !432, file: !3, line: 610, type: !497)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 4096, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 512)
!500 = !DILocation(line: 610, column: 7, scope: !432)
!501 = !DILocalVariable(name: "wm", scope: !432, file: !3, line: 611, type: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmWindowManager", file: !25, line: 160, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !25, line: 128, size: 2816, elements: !505)
!505 = !{!506, !575, !619, !620, !621, !622, !623, !624, !625, !626, !637, !638, !639, !640, !641, !652, !653, !654, !655, !656, !657}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !504, file: !25, line: 129, baseType: !507, size: 960)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !508, line: 130, baseType: !509)
!508 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !508, line: 117, size: 960, elements: !510)
!510 = !{!511, !512, !513, !515, !534, !538, !540, !541, !542, !543}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !508, line: 118, baseType: !57, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !509, file: !508, line: 118, baseType: !57, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !509, file: !508, line: 119, baseType: !514, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !509, file: !508, line: 120, baseType: !516, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !508, line: 136, size: 17600, elements: !518)
!518 = !{!519, !520, !522, !525, !529, !530, !531}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !517, file: !508, line: 137, baseType: !507, size: 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !517, file: !508, line: 138, baseType: !521, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !517, file: !508, line: 139, baseType: !523, size: 64, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !508, line: 43, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !517, file: !508, line: 140, baseType: !526, size: 8192, offset: 1088)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8192, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 1024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !517, file: !508, line: 141, baseType: !526, size: 8192, offset: 9280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !517, file: !508, line: 148, baseType: !516, size: 64, offset: 17472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !517, file: !508, line: 150, baseType: !532, size: 64, offset: 17536)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !508, line: 45, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !508, line: 121, baseType: !535, size: 528, offset: 256)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 528, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 66)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !508, line: 126, baseType: !539, size: 16, offset: 784)
!539 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !509, file: !508, line: 127, baseType: !62, size: 32, offset: 800)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !509, file: !508, line: 128, baseType: !62, size: 32, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !509, file: !508, line: 128, baseType: !62, size: 32, offset: 864)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !509, file: !508, line: 129, baseType: !544, size: 64, offset: 896)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !508, line: 75, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !508, line: 62, size: 1024, elements: !547)
!547 = !{!548, !550, !551, !552, !553, !554, !558, !559, !573, !574}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !508, line: 63, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !546, file: !508, line: 63, baseType: !549, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !546, file: !508, line: 64, baseType: !56, size: 8, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !546, file: !508, line: 64, baseType: !56, size: 8, offset: 136)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !508, line: 65, baseType: !539, size: 16, offset: 144)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !546, file: !508, line: 66, baseType: !555, size: 512, offset: 160)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 512, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !546, file: !508, line: 67, baseType: !62, size: 32, offset: 672)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !508, line: 69, baseType: !560, size: 256, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !508, line: 60, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !508, line: 48, size: 256, elements: !562)
!562 = !{!563, !564, !571, !572}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !561, file: !508, line: 49, baseType: !57, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !561, file: !508, line: 58, baseType: !565, size: 128, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !566, line: 71, baseType: !567)
!566 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !566, line: 69, size: 128, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !567, file: !566, line: 70, baseType: !57, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !567, file: !566, line: 70, baseType: !57, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !561, file: !508, line: 59, baseType: !62, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !561, file: !508, line: 59, baseType: !62, size: 32, offset: 224)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, file: !508, line: 70, baseType: !62, size: 32, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !546, file: !508, line: 74, baseType: !62, size: 32, offset: 992)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !504, file: !25, line: 131, baseType: !576, size: 64, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !25, line: 169, size: 2048, elements: !578)
!578 = !{!579, !580, !581, !582, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !608, !611, !612, !613, !614, !615, !616, !617, !618}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !577, file: !25, line: 170, baseType: !576, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !577, file: !25, line: 170, baseType: !576, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !577, file: !25, line: 172, baseType: !57, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !577, file: !25, line: 174, baseType: !583, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !79, line: 41, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !577, file: !25, line: 175, baseType: !583, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !577, file: !25, line: 176, baseType: !555, size: 512, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !577, file: !25, line: 178, baseType: !539, size: 16, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !577, file: !25, line: 178, baseType: !539, size: 16, offset: 848)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !577, file: !25, line: 178, baseType: !539, size: 16, offset: 864)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !577, file: !25, line: 178, baseType: !539, size: 16, offset: 880)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !577, file: !25, line: 179, baseType: !539, size: 16, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !577, file: !25, line: 180, baseType: !539, size: 16, offset: 912)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !577, file: !25, line: 181, baseType: !539, size: 16, offset: 928)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !577, file: !25, line: 182, baseType: !539, size: 16, offset: 944)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !577, file: !25, line: 183, baseType: !539, size: 16, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !577, file: !25, line: 184, baseType: !539, size: 16, offset: 976)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !577, file: !25, line: 185, baseType: !539, size: 16, offset: 992)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !577, file: !25, line: 186, baseType: !539, size: 16, offset: 1008)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !577, file: !25, line: 188, baseType: !62, size: 32, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !577, file: !25, line: 190, baseType: !539, size: 16, offset: 1056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !577, file: !25, line: 191, baseType: !539, size: 16, offset: 1072)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !577, file: !25, line: 194, baseType: !603, size: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !25, line: 43, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !577, file: !25, line: 196, baseType: !606, size: 64, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !25, line: 55, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !577, file: !25, line: 198, baseType: !609, size: 64, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !25, line: 44, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !577, file: !25, line: 200, baseType: !62, size: 32, offset: 1280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !577, file: !25, line: 200, baseType: !62, size: 32, offset: 1312)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !577, file: !25, line: 201, baseType: !57, size: 64, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !577, file: !25, line: 203, baseType: !565, size: 128, offset: 1408)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !577, file: !25, line: 204, baseType: !565, size: 128, offset: 1536)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !577, file: !25, line: 205, baseType: !565, size: 128, offset: 1664)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !577, file: !25, line: 207, baseType: !565, size: 128, offset: 1792)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !577, file: !25, line: 208, baseType: !565, size: 128, offset: 1920)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "winactive", scope: !504, file: !25, line: 131, baseType: !576, size: 64, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !504, file: !25, line: 132, baseType: !565, size: 128, offset: 1088)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !504, file: !25, line: 134, baseType: !62, size: 32, offset: 1216)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "file_saved", scope: !504, file: !25, line: 135, baseType: !539, size: 16, offset: 1248)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "op_undo_depth", scope: !504, file: !25, line: 136, baseType: !539, size: 16, offset: 1264)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "operators", scope: !504, file: !25, line: 138, baseType: !565, size: 128, offset: 1280)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !504, file: !25, line: 140, baseType: !565, size: 128, offset: 1408)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !504, file: !25, line: 142, baseType: !627, size: 320, offset: 1536)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !25, line: 106, size: 320, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !627, file: !25, line: 107, baseType: !565, size: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !627, file: !25, line: 108, baseType: !62, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !627, file: !25, line: 109, baseType: !62, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !627, file: !25, line: 110, baseType: !62, size: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !627, file: !25, line: 110, baseType: !62, size: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !627, file: !25, line: 111, baseType: !635, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !25, line: 56, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !504, file: !25, line: 144, baseType: !565, size: 128, offset: 1856)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursors", scope: !504, file: !25, line: 146, baseType: !565, size: 128, offset: 1984)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "drags", scope: !504, file: !25, line: 148, baseType: !565, size: 128, offset: 2112)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigs", scope: !504, file: !25, line: 150, baseType: !565, size: 128, offset: 2240)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "defaultconf", scope: !504, file: !25, line: 151, baseType: !642, size: 64, offset: 2368)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !25, line: 310, size: 1344, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !25, line: 311, baseType: !642, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !643, file: !25, line: 311, baseType: !642, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !643, file: !25, line: 313, baseType: !555, size: 512, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !643, file: !25, line: 314, baseType: !555, size: 512, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !643, file: !25, line: 316, baseType: !565, size: 128, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !643, file: !25, line: 317, baseType: !62, size: 32, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !643, file: !25, line: 317, baseType: !62, size: 32, offset: 1312)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "addonconf", scope: !504, file: !25, line: 152, baseType: !642, size: 64, offset: 2432)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "userconf", scope: !504, file: !25, line: 153, baseType: !642, size: 64, offset: 2496)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "timers", scope: !504, file: !25, line: 155, baseType: !565, size: 128, offset: 2560)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "autosavetimer", scope: !504, file: !25, line: 156, baseType: !635, size: 64, offset: 2688)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "is_interface_locked", scope: !504, file: !25, line: 158, baseType: !56, size: 8, offset: 2752)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !504, file: !25, line: 159, baseType: !658, size: 56, offset: 2760)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 56, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 7)
!661 = !DILocation(line: 611, column: 19, scope: !432)
!662 = !DILocation(line: 611, column: 26, scope: !432)
!663 = !DILocation(line: 611, column: 32, scope: !432)
!664 = !DILocation(line: 611, column: 35, scope: !432)
!665 = !DILocation(line: 611, column: 24, scope: !432)
!666 = !DILocalVariable(name: "fname", scope: !432, file: !3, line: 613, type: !526)
!667 = !DILocation(line: 613, column: 7, scope: !432)
!668 = !DILocation(line: 615, column: 9, scope: !669)
!669 = distinct !DILexicalBlock(scope: !432, file: !3, line: 615, column: 6)
!670 = !DILocation(line: 615, column: 15, scope: !669)
!671 = !DILocation(line: 615, column: 7, scope: !669)
!672 = !DILocation(line: 615, column: 6, scope: !432)
!673 = !DILocation(line: 616, column: 20, scope: !674)
!674 = distinct !DILexicalBlock(scope: !669, file: !3, line: 615, column: 24)
!675 = !DILocation(line: 616, column: 42, scope: !674)
!676 = !DILocation(line: 616, column: 3, scope: !674)
!677 = !DILocation(line: 617, column: 2, scope: !674)
!678 = !DILocation(line: 619, column: 20, scope: !679)
!679 = distinct !DILexicalBlock(scope: !669, file: !3, line: 618, column: 7)
!680 = !DILocation(line: 619, column: 42, scope: !679)
!681 = !DILocation(line: 619, column: 83, scope: !679)
!682 = !DILocation(line: 619, column: 89, scope: !679)
!683 = !DILocation(line: 619, column: 81, scope: !679)
!684 = !DILocation(line: 619, column: 63, scope: !679)
!685 = !DILocation(line: 619, column: 3, scope: !679)
!686 = !DILocation(line: 620, column: 25, scope: !679)
!687 = !DILocation(line: 620, column: 3, scope: !679)
!688 = !DILocation(line: 623, column: 26, scope: !432)
!689 = !DILocation(line: 623, column: 2, scope: !432)
!690 = !DILocation(line: 624, column: 9, scope: !432)
!691 = !DILocation(line: 624, column: 2, scope: !432)
!692 = !DILocation(line: 627, column: 15, scope: !432)
!693 = !DILocation(line: 627, column: 2, scope: !432)
!694 = !DILocation(line: 634, column: 2, scope: !432)
!695 = !DILocation(line: 634, column: 8, scope: !432)
!696 = !DILocation(line: 635, column: 17, scope: !432)
!697 = !DILocation(line: 635, column: 7, scope: !432)
!698 = !DILocation(line: 635, column: 5, scope: !432)
!699 = !DILocation(line: 636, column: 6, scope: !700)
!700 = distinct !DILexicalBlock(scope: !432, file: !3, line: 636, column: 6)
!701 = !DILocation(line: 636, column: 9, scope: !700)
!702 = !DILocation(line: 636, column: 6, scope: !432)
!703 = !DILocation(line: 637, column: 11, scope: !704)
!704 = distinct !DILexicalBlock(scope: !700, file: !3, line: 636, column: 18)
!705 = !DILocation(line: 638, column: 11, scope: !704)
!706 = !DILocation(line: 638, column: 18, scope: !704)
!707 = !DILocation(line: 638, column: 35, scope: !704)
!708 = !DILocation(line: 638, column: 26, scope: !704)
!709 = !DILocation(line: 637, column: 3, scope: !704)
!710 = !DILocation(line: 639, column: 2, scope: !704)
!711 = !DILocation(line: 641, column: 7, scope: !712)
!712 = distinct !DILexicalBlock(scope: !713, file: !3, line: 641, column: 7)
!713 = distinct !DILexicalBlock(scope: !700, file: !3, line: 640, column: 7)
!714 = !DILocation(line: 641, column: 7, scope: !713)
!715 = !DILocation(line: 642, column: 29, scope: !716)
!716 = distinct !DILexicalBlock(scope: !712, file: !3, line: 641, column: 11)
!717 = !DILocation(line: 642, column: 34, scope: !716)
!718 = !DILocation(line: 642, column: 38, scope: !716)
!719 = !DILocation(line: 642, column: 47, scope: !716)
!720 = !DILocation(line: 642, column: 4, scope: !716)
!721 = !DILocation(line: 643, column: 3, scope: !716)
!722 = !DILocation(line: 645, column: 35, scope: !713)
!723 = !DILocation(line: 645, column: 3, scope: !713)
!724 = !DILocation(line: 647, column: 10, scope: !713)
!725 = !DILocation(line: 647, column: 3, scope: !713)
!726 = !DILocation(line: 651, column: 2, scope: !432)
!727 = !DILocation(line: 654, column: 9, scope: !432)
!728 = !DILocation(line: 654, column: 2, scope: !432)
!729 = !DILocation(line: 656, column: 7, scope: !432)
!730 = !DILocation(line: 656, column: 17, scope: !432)
!731 = !DILocation(line: 656, column: 2, scope: !432)
!732 = !DILocation(line: 660, column: 1, scope: !432)
!733 = distinct !DISubprogram(name: "load_file", scope: !3, file: !3, line: 1273, type: !734, scopeLine: 1274, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!734 = !DISubroutineType(types: !735)
!735 = !{!62, !62, !53, !57}
!736 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !733, file: !3, line: 1273, type: !62)
!737 = !DILocation(line: 1273, column: 26, scope: !733)
!738 = !DILocalVariable(name: "argv", arg: 2, scope: !733, file: !3, line: 1273, type: !53)
!739 = !DILocation(line: 1273, column: 53, scope: !733)
!740 = !DILocalVariable(name: "data", arg: 3, scope: !733, file: !3, line: 1273, type: !57)
!741 = !DILocation(line: 1273, column: 65, scope: !733)
!742 = !DILocalVariable(name: "C", scope: !733, file: !3, line: 1275, type: !77)
!743 = !DILocation(line: 1275, column: 12, scope: !733)
!744 = !DILocation(line: 1275, column: 16, scope: !733)
!745 = !DILocalVariable(name: "filename", scope: !733, file: !3, line: 1278, type: !526)
!746 = !DILocation(line: 1278, column: 7, scope: !733)
!747 = !DILocation(line: 1281, column: 6, scope: !748)
!748 = distinct !DILexicalBlock(scope: !733, file: !3, line: 1281, column: 6)
!749 = !DILocation(line: 1281, column: 17, scope: !748)
!750 = !DILocation(line: 1281, column: 6, scope: !733)
!751 = !DILocation(line: 1282, column: 11, scope: !752)
!752 = distinct !DILexicalBlock(scope: !748, file: !3, line: 1281, column: 25)
!753 = !DILocation(line: 1282, column: 62, scope: !752)
!754 = !DILocation(line: 1282, column: 3, scope: !752)
!755 = !DILocation(line: 1283, column: 2, scope: !752)
!756 = !DILocation(line: 1285, column: 14, scope: !733)
!757 = !DILocation(line: 1285, column: 24, scope: !733)
!758 = !DILocation(line: 1285, column: 2, scope: !733)
!759 = !DILocation(line: 1286, column: 15, scope: !733)
!760 = !DILocation(line: 1286, column: 2, scope: !733)
!761 = !DILocation(line: 1288, column: 8, scope: !762)
!762 = distinct !DILexicalBlock(scope: !733, file: !3, line: 1288, column: 6)
!763 = !DILocation(line: 1288, column: 6, scope: !762)
!764 = !DILocation(line: 1288, column: 6, scope: !733)
!765 = !DILocalVariable(name: "retval", scope: !766, file: !3, line: 1289, type: !62)
!766 = distinct !DILexicalBlock(scope: !762, file: !3, line: 1288, column: 20)
!767 = !DILocation(line: 1289, column: 7, scope: !766)
!768 = !DILocation(line: 1291, column: 35, scope: !766)
!769 = !DILocation(line: 1291, column: 21, scope: !766)
!770 = !DILocation(line: 1291, column: 3, scope: !766)
!771 = !DILocation(line: 1293, column: 26, scope: !766)
!772 = !DILocation(line: 1293, column: 29, scope: !766)
!773 = !DILocation(line: 1293, column: 12, scope: !766)
!774 = !DILocation(line: 1293, column: 10, scope: !766)
!775 = !DILocation(line: 1297, column: 7, scope: !776)
!776 = distinct !DILexicalBlock(scope: !766, file: !3, line: 1297, column: 7)
!777 = !DILocation(line: 1297, column: 14, scope: !776)
!778 = !DILocation(line: 1297, column: 7, scope: !766)
!779 = !DILocalVariable(name: "wm", scope: !780, file: !3, line: 1298, type: !502)
!780 = distinct !DILexicalBlock(scope: !776, file: !3, line: 1297, column: 37)
!781 = !DILocation(line: 1298, column: 21, scope: !780)
!782 = !DILocation(line: 1298, column: 41, scope: !780)
!783 = !DILocation(line: 1298, column: 26, scope: !780)
!784 = !DILocalVariable(name: "bmain", scope: !780, file: !3, line: 1299, type: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "Main", file: !787, line: 104, baseType: !788)
!787 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !787, line: 53, size: 15232, elements: !789)
!789 = !{!790, !792, !793, !794, !795, !796, !797, !798, !802, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !846, !852}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !787, line: 54, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !788, file: !787, line: 54, baseType: !791, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !788, file: !787, line: 55, baseType: !526, size: 8192, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !788, file: !787, line: 56, baseType: !539, size: 16, offset: 8320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !788, file: !787, line: 56, baseType: !539, size: 16, offset: 8336)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !788, file: !787, line: 57, baseType: !539, size: 16, offset: 8352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !788, file: !787, line: 57, baseType: !539, size: 16, offset: 8368)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !788, file: !787, line: 58, baseType: !799, size: 64, offset: 8384)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !800, line: 27, baseType: !801)
!800 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !464, line: 45, baseType: !489)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !788, file: !787, line: 59, baseType: !803, size: 128, offset: 8448)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 16)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !788, file: !787, line: 60, baseType: !539, size: 16, offset: 8576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !788, file: !787, line: 62, baseType: !516, size: 64, offset: 8640)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !788, file: !787, line: 63, baseType: !565, size: 128, offset: 8704)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !788, file: !787, line: 64, baseType: !565, size: 128, offset: 8832)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !788, file: !787, line: 65, baseType: !565, size: 128, offset: 8960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !788, file: !787, line: 66, baseType: !565, size: 128, offset: 9088)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !788, file: !787, line: 67, baseType: !565, size: 128, offset: 9216)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !788, file: !787, line: 68, baseType: !565, size: 128, offset: 9344)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !788, file: !787, line: 69, baseType: !565, size: 128, offset: 9472)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !788, file: !787, line: 70, baseType: !565, size: 128, offset: 9600)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !788, file: !787, line: 71, baseType: !565, size: 128, offset: 9728)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !788, file: !787, line: 72, baseType: !565, size: 128, offset: 9856)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !788, file: !787, line: 73, baseType: !565, size: 128, offset: 9984)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !788, file: !787, line: 74, baseType: !565, size: 128, offset: 10112)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !788, file: !787, line: 75, baseType: !565, size: 128, offset: 10240)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !788, file: !787, line: 76, baseType: !565, size: 128, offset: 10368)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !788, file: !787, line: 77, baseType: !565, size: 128, offset: 10496)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !788, file: !787, line: 78, baseType: !565, size: 128, offset: 10624)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !788, file: !787, line: 79, baseType: !565, size: 128, offset: 10752)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !788, file: !787, line: 80, baseType: !565, size: 128, offset: 10880)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !788, file: !787, line: 81, baseType: !565, size: 128, offset: 11008)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !788, file: !787, line: 82, baseType: !565, size: 128, offset: 11136)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !788, file: !787, line: 83, baseType: !565, size: 128, offset: 11264)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !788, file: !787, line: 84, baseType: !565, size: 128, offset: 11392)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !788, file: !787, line: 85, baseType: !565, size: 128, offset: 11520)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !788, file: !787, line: 86, baseType: !565, size: 128, offset: 11648)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !788, file: !787, line: 87, baseType: !565, size: 128, offset: 11776)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !788, file: !787, line: 88, baseType: !565, size: 128, offset: 11904)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !788, file: !787, line: 89, baseType: !565, size: 128, offset: 12032)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !788, file: !787, line: 90, baseType: !565, size: 128, offset: 12160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !788, file: !787, line: 91, baseType: !565, size: 128, offset: 12288)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !788, file: !787, line: 92, baseType: !565, size: 128, offset: 12416)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !788, file: !787, line: 93, baseType: !565, size: 128, offset: 12544)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !788, file: !787, line: 94, baseType: !565, size: 128, offset: 12672)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !788, file: !787, line: 95, baseType: !565, size: 128, offset: 12800)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !788, file: !787, line: 96, baseType: !565, size: 128, offset: 12928)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !788, file: !787, line: 98, baseType: !843, size: 2048, offset: 13056)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 2048, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !788, file: !787, line: 101, baseType: !847, size: 64, offset: 15104)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !849, line: 58, size: 32, elements: !850)
!849 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !848, file: !849, line: 59, baseType: !62, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !788, file: !787, line: 103, baseType: !853, size: 64, offset: 15168)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !787, line: 51, flags: DIFlagFwdDecl)
!855 = !DILocation(line: 1299, column: 10, scope: !780)
!856 = !DILocation(line: 1299, column: 32, scope: !780)
!857 = !DILocation(line: 1299, column: 18, scope: !780)
!858 = !DILocation(line: 1302, column: 8, scope: !859)
!859 = distinct !DILexicalBlock(scope: !780, file: !3, line: 1302, column: 8)
!860 = !DILocation(line: 1302, column: 11, scope: !859)
!861 = !DILocation(line: 1302, column: 19, scope: !859)
!862 = !DILocation(line: 1302, column: 45, scope: !859)
!863 = !DILocation(line: 1302, column: 52, scope: !859)
!864 = !DILocation(line: 1302, column: 22, scope: !859)
!865 = !DILocation(line: 1302, column: 8, scope: !780)
!866 = !DILocation(line: 1306, column: 23, scope: !867)
!867 = distinct !DILexicalBlock(scope: !859, file: !3, line: 1302, column: 57)
!868 = !DILocation(line: 1306, column: 26, scope: !867)
!869 = !DILocation(line: 1306, column: 33, scope: !867)
!870 = !DILocation(line: 1306, column: 40, scope: !867)
!871 = !DILocation(line: 1306, column: 5, scope: !867)
!872 = !DILocation(line: 1307, column: 20, scope: !867)
!873 = !DILocation(line: 1307, column: 5, scope: !867)
!874 = !DILocation(line: 1308, column: 4, scope: !867)
!875 = !DILocation(line: 1310, column: 23, scope: !780)
!876 = !DILocation(line: 1310, column: 4, scope: !780)
!877 = !DILocation(line: 1311, column: 13, scope: !780)
!878 = !DILocation(line: 1311, column: 4, scope: !780)
!879 = !DILocation(line: 1312, column: 20, scope: !780)
!880 = !DILocation(line: 1313, column: 23, scope: !881)
!881 = distinct !DILexicalBlock(scope: !780, file: !3, line: 1313, column: 8)
!882 = !DILocation(line: 1313, column: 8, scope: !881)
!883 = !DILocation(line: 1313, column: 26, scope: !881)
!884 = !DILocation(line: 1313, column: 8, scope: !780)
!885 = !DILocation(line: 1313, column: 54, scope: !881)
!886 = !DILocation(line: 1313, column: 57, scope: !881)
!887 = !DILocation(line: 1313, column: 35, scope: !881)
!888 = !DILocation(line: 1316, column: 20, scope: !780)
!889 = !DILocation(line: 1316, column: 4, scope: !780)
!890 = !DILocation(line: 1317, column: 26, scope: !780)
!891 = !DILocation(line: 1317, column: 4, scope: !780)
!892 = !DILocation(line: 1318, column: 28, scope: !780)
!893 = !DILocation(line: 1318, column: 35, scope: !780)
!894 = !DILocation(line: 1318, column: 45, scope: !780)
!895 = !DILocation(line: 1318, column: 67, scope: !780)
!896 = !DILocation(line: 1318, column: 52, scope: !780)
!897 = !DILocation(line: 1318, column: 4, scope: !780)
!898 = !DILocation(line: 1319, column: 3, scope: !780)
!899 = !DILocation(line: 1322, column: 4, scope: !900)
!900 = distinct !DILexicalBlock(scope: !776, file: !3, line: 1320, column: 8)
!901 = !DILocation(line: 1331, column: 35, scope: !766)
!902 = !DILocation(line: 1331, column: 21, scope: !766)
!903 = !DILocation(line: 1331, column: 3, scope: !766)
!904 = !DILocation(line: 1336, column: 2, scope: !766)
!905 = !DILocalVariable(name: "reports", scope: !906, file: !3, line: 1340, type: !907)
!906 = distinct !DILexicalBlock(scope: !762, file: !3, line: 1337, column: 7)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !25, line: 112, baseType: !627)
!908 = !DILocation(line: 1340, column: 14, scope: !906)
!909 = !DILocation(line: 1341, column: 3, scope: !906)
!910 = !DILocation(line: 1342, column: 25, scope: !906)
!911 = !DILocation(line: 1342, column: 3, scope: !906)
!912 = !DILocation(line: 1343, column: 16, scope: !906)
!913 = !DILocation(line: 1343, column: 19, scope: !906)
!914 = !DILocation(line: 1343, column: 3, scope: !906)
!915 = !DILocation(line: 1344, column: 3, scope: !906)
!916 = !DILocation(line: 1347, column: 16, scope: !733)
!917 = !DILocation(line: 1349, column: 2, scope: !733)
!918 = !DILocation(line: 1350, column: 1, scope: !733)
!919 = distinct !DISubprogram(name: "end_arguments", scope: !3, file: !3, line: 402, type: !734, scopeLine: 403, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!920 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !919, file: !3, line: 402, type: !62)
!921 = !DILocation(line: 402, column: 30, scope: !919)
!922 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !919, file: !3, line: 402, type: !53)
!923 = !DILocation(line: 402, column: 57, scope: !919)
!924 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !919, file: !3, line: 402, type: !57)
!925 = !DILocation(line: 402, column: 77, scope: !919)
!926 = !DILocation(line: 404, column: 2, scope: !919)
!927 = distinct !DISubprogram(name: "print_help", scope: !3, file: !3, line: 253, type: !734, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!928 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !927, file: !3, line: 253, type: !62)
!929 = !DILocation(line: 253, column: 27, scope: !927)
!930 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !927, file: !3, line: 253, type: !53)
!931 = !DILocation(line: 253, column: 54, scope: !927)
!932 = !DILocalVariable(name: "data", arg: 3, scope: !927, file: !3, line: 253, type: !57)
!933 = !DILocation(line: 253, column: 74, scope: !927)
!934 = !DILocalVariable(name: "ba", scope: !927, file: !3, line: 255, type: !58)
!935 = !DILocation(line: 255, column: 9, scope: !927)
!936 = !DILocation(line: 255, column: 23, scope: !927)
!937 = !DILocation(line: 255, column: 14, scope: !927)
!938 = !DILocation(line: 257, column: 2, scope: !927)
!939 = !DILocation(line: 258, column: 2, scope: !927)
!940 = !DILocation(line: 260, column: 2, scope: !927)
!941 = !DILocation(line: 261, column: 22, scope: !927)
!942 = !DILocation(line: 261, column: 2, scope: !927)
!943 = !DILocation(line: 262, column: 22, scope: !927)
!944 = !DILocation(line: 262, column: 2, scope: !927)
!945 = !DILocation(line: 263, column: 22, scope: !927)
!946 = !DILocation(line: 263, column: 2, scope: !927)
!947 = !DILocation(line: 264, column: 22, scope: !927)
!948 = !DILocation(line: 264, column: 2, scope: !927)
!949 = !DILocation(line: 265, column: 22, scope: !927)
!950 = !DILocation(line: 265, column: 2, scope: !927)
!951 = !DILocation(line: 266, column: 22, scope: !927)
!952 = !DILocation(line: 266, column: 2, scope: !927)
!953 = !DILocation(line: 267, column: 22, scope: !927)
!954 = !DILocation(line: 267, column: 2, scope: !927)
!955 = !DILocation(line: 268, column: 22, scope: !927)
!956 = !DILocation(line: 268, column: 2, scope: !927)
!957 = !DILocation(line: 269, column: 22, scope: !927)
!958 = !DILocation(line: 269, column: 2, scope: !927)
!959 = !DILocation(line: 270, column: 22, scope: !927)
!960 = !DILocation(line: 270, column: 2, scope: !927)
!961 = !DILocation(line: 272, column: 2, scope: !927)
!962 = !DILocation(line: 273, column: 2, scope: !927)
!963 = !DILocation(line: 274, column: 22, scope: !927)
!964 = !DILocation(line: 274, column: 2, scope: !927)
!965 = !DILocation(line: 275, column: 22, scope: !927)
!966 = !DILocation(line: 275, column: 2, scope: !927)
!967 = !DILocation(line: 277, column: 2, scope: !927)
!968 = !DILocation(line: 278, column: 2, scope: !927)
!969 = !DILocation(line: 279, column: 22, scope: !927)
!970 = !DILocation(line: 279, column: 2, scope: !927)
!971 = !DILocation(line: 281, column: 2, scope: !927)
!972 = !DILocation(line: 282, column: 2, scope: !927)
!973 = !DILocation(line: 283, column: 22, scope: !927)
!974 = !DILocation(line: 283, column: 2, scope: !927)
!975 = !DILocation(line: 284, column: 22, scope: !927)
!976 = !DILocation(line: 284, column: 2, scope: !927)
!977 = !DILocation(line: 285, column: 22, scope: !927)
!978 = !DILocation(line: 285, column: 2, scope: !927)
!979 = !DILocation(line: 286, column: 22, scope: !927)
!980 = !DILocation(line: 286, column: 2, scope: !927)
!981 = !DILocation(line: 287, column: 22, scope: !927)
!982 = !DILocation(line: 287, column: 2, scope: !927)
!983 = !DILocation(line: 290, column: 2, scope: !927)
!984 = !DILocation(line: 291, column: 2, scope: !927)
!985 = !DILocation(line: 292, column: 22, scope: !927)
!986 = !DILocation(line: 292, column: 2, scope: !927)
!987 = !DILocation(line: 294, column: 2, scope: !927)
!988 = !DILocation(line: 295, column: 2, scope: !927)
!989 = !DILocation(line: 296, column: 22, scope: !927)
!990 = !DILocation(line: 296, column: 2, scope: !927)
!991 = !DILocation(line: 297, column: 22, scope: !927)
!992 = !DILocation(line: 297, column: 2, scope: !927)
!993 = !DILocation(line: 299, column: 2, scope: !927)
!994 = !DILocation(line: 301, column: 22, scope: !927)
!995 = !DILocation(line: 301, column: 2, scope: !927)
!996 = !DILocation(line: 302, column: 22, scope: !927)
!997 = !DILocation(line: 302, column: 2, scope: !927)
!998 = !DILocation(line: 303, column: 22, scope: !927)
!999 = !DILocation(line: 303, column: 2, scope: !927)
!1000 = !DILocation(line: 304, column: 22, scope: !927)
!1001 = !DILocation(line: 304, column: 2, scope: !927)
!1002 = !DILocation(line: 307, column: 2, scope: !927)
!1003 = !DILocation(line: 308, column: 2, scope: !927)
!1004 = !DILocation(line: 309, column: 22, scope: !927)
!1005 = !DILocation(line: 309, column: 2, scope: !927)
!1006 = !DILocation(line: 310, column: 22, scope: !927)
!1007 = !DILocation(line: 310, column: 2, scope: !927)
!1008 = !DILocation(line: 312, column: 2, scope: !927)
!1009 = !DILocation(line: 313, column: 22, scope: !927)
!1010 = !DILocation(line: 313, column: 2, scope: !927)
!1011 = !DILocation(line: 317, column: 22, scope: !927)
!1012 = !DILocation(line: 317, column: 2, scope: !927)
!1013 = !DILocation(line: 324, column: 22, scope: !927)
!1014 = !DILocation(line: 324, column: 2, scope: !927)
!1015 = !DILocation(line: 325, column: 22, scope: !927)
!1016 = !DILocation(line: 325, column: 2, scope: !927)
!1017 = !DILocation(line: 326, column: 22, scope: !927)
!1018 = !DILocation(line: 326, column: 2, scope: !927)
!1019 = !DILocation(line: 327, column: 22, scope: !927)
!1020 = !DILocation(line: 327, column: 2, scope: !927)
!1021 = !DILocation(line: 329, column: 22, scope: !927)
!1022 = !DILocation(line: 329, column: 2, scope: !927)
!1023 = !DILocation(line: 330, column: 22, scope: !927)
!1024 = !DILocation(line: 330, column: 2, scope: !927)
!1025 = !DILocation(line: 332, column: 2, scope: !927)
!1026 = !DILocation(line: 333, column: 22, scope: !927)
!1027 = !DILocation(line: 333, column: 2, scope: !927)
!1028 = !DILocation(line: 334, column: 22, scope: !927)
!1029 = !DILocation(line: 334, column: 2, scope: !927)
!1030 = !DILocation(line: 336, column: 2, scope: !927)
!1031 = !DILocation(line: 337, column: 2, scope: !927)
!1032 = !DILocation(line: 338, column: 22, scope: !927)
!1033 = !DILocation(line: 338, column: 2, scope: !927)
!1034 = !DILocation(line: 339, column: 2, scope: !927)
!1035 = !DILocation(line: 340, column: 22, scope: !927)
!1036 = !DILocation(line: 340, column: 2, scope: !927)
!1037 = !DILocation(line: 341, column: 22, scope: !927)
!1038 = !DILocation(line: 341, column: 2, scope: !927)
!1039 = !DILocation(line: 342, column: 22, scope: !927)
!1040 = !DILocation(line: 342, column: 2, scope: !927)
!1041 = !DILocation(line: 343, column: 22, scope: !927)
!1042 = !DILocation(line: 343, column: 2, scope: !927)
!1043 = !DILocation(line: 344, column: 2, scope: !927)
!1044 = !DILocation(line: 345, column: 22, scope: !927)
!1045 = !DILocation(line: 345, column: 2, scope: !927)
!1046 = !DILocation(line: 346, column: 22, scope: !927)
!1047 = !DILocation(line: 346, column: 2, scope: !927)
!1048 = !DILocation(line: 347, column: 22, scope: !927)
!1049 = !DILocation(line: 347, column: 2, scope: !927)
!1050 = !DILocation(line: 348, column: 22, scope: !927)
!1051 = !DILocation(line: 348, column: 2, scope: !927)
!1052 = !DILocation(line: 350, column: 2, scope: !927)
!1053 = !DILocation(line: 352, column: 22, scope: !927)
!1054 = !DILocation(line: 352, column: 2, scope: !927)
!1055 = !DILocation(line: 358, column: 22, scope: !927)
!1056 = !DILocation(line: 358, column: 2, scope: !927)
!1057 = !DILocation(line: 360, column: 22, scope: !927)
!1058 = !DILocation(line: 360, column: 2, scope: !927)
!1059 = !DILocation(line: 362, column: 2, scope: !927)
!1060 = !DILocation(line: 363, column: 24, scope: !927)
!1061 = !DILocation(line: 363, column: 2, scope: !927)
!1062 = !DILocation(line: 365, column: 2, scope: !927)
!1063 = !DILocation(line: 366, column: 2, scope: !927)
!1064 = !DILocation(line: 367, column: 2, scope: !927)
!1065 = !DILocation(line: 368, column: 2, scope: !927)
!1066 = !DILocation(line: 369, column: 2, scope: !927)
!1067 = !DILocation(line: 370, column: 2, scope: !927)
!1068 = !DILocation(line: 372, column: 2, scope: !927)
!1069 = !DILocation(line: 373, column: 2, scope: !927)
!1070 = !DILocation(line: 374, column: 2, scope: !927)
!1071 = !DILocation(line: 375, column: 2, scope: !927)
!1072 = !DILocation(line: 376, column: 2, scope: !927)
!1073 = !DILocation(line: 377, column: 2, scope: !927)
!1074 = !DILocation(line: 378, column: 2, scope: !927)
!1075 = !DILocation(line: 380, column: 2, scope: !927)
!1076 = !DILocation(line: 381, column: 2, scope: !927)
!1077 = !DILocation(line: 382, column: 2, scope: !927)
!1078 = !DILocation(line: 383, column: 2, scope: !927)
!1079 = !DILocation(line: 384, column: 2, scope: !927)
!1080 = !DILocation(line: 385, column: 2, scope: !927)
!1081 = !DILocation(line: 386, column: 2, scope: !927)
!1082 = !DILocation(line: 390, column: 2, scope: !927)
!1083 = !DILocation(line: 395, column: 2, scope: !927)
!1084 = !DILocation(line: 397, column: 2, scope: !927)
!1085 = distinct !DISubprogram(name: "print_version", scope: !3, file: !3, line: 232, type: !734, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1086 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1085, file: !3, line: 232, type: !62)
!1087 = !DILocation(line: 232, column: 30, scope: !1085)
!1088 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1085, file: !3, line: 232, type: !53)
!1089 = !DILocation(line: 232, column: 57, scope: !1085)
!1090 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1085, file: !3, line: 232, type: !57)
!1091 = !DILocation(line: 232, column: 77, scope: !1085)
!1092 = !DILocation(line: 234, column: 2, scope: !1085)
!1093 = !DILocation(line: 248, column: 2, scope: !1085)
!1094 = distinct !DISubprogram(name: "enable_python", scope: !3, file: !3, line: 407, type: !734, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1095 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1094, file: !3, line: 407, type: !62)
!1096 = !DILocation(line: 407, column: 30, scope: !1094)
!1097 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1094, file: !3, line: 407, type: !53)
!1098 = !DILocation(line: 407, column: 57, scope: !1094)
!1099 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1094, file: !3, line: 407, type: !57)
!1100 = !DILocation(line: 407, column: 77, scope: !1094)
!1101 = !DILocation(line: 409, column: 6, scope: !1094)
!1102 = !DILocation(line: 410, column: 6, scope: !1094)
!1103 = !DILocation(line: 411, column: 2, scope: !1094)
!1104 = distinct !DISubprogram(name: "disable_python", scope: !3, file: !3, line: 414, type: !734, scopeLine: 415, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1105 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1104, file: !3, line: 414, type: !62)
!1106 = !DILocation(line: 414, column: 31, scope: !1104)
!1107 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1104, file: !3, line: 414, type: !53)
!1108 = !DILocation(line: 414, column: 58, scope: !1104)
!1109 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1104, file: !3, line: 414, type: !57)
!1110 = !DILocation(line: 414, column: 78, scope: !1104)
!1111 = !DILocation(line: 416, column: 6, scope: !1104)
!1112 = !DILocation(line: 417, column: 6, scope: !1104)
!1113 = !DILocation(line: 418, column: 2, scope: !1104)
!1114 = distinct !DISubprogram(name: "disable_crash_handler", scope: !3, file: !3, line: 421, type: !734, scopeLine: 422, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1115 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1114, file: !3, line: 421, type: !62)
!1116 = !DILocation(line: 421, column: 38, scope: !1114)
!1117 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1114, file: !3, line: 421, type: !53)
!1118 = !DILocation(line: 421, column: 65, scope: !1114)
!1119 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1114, file: !3, line: 421, type: !57)
!1120 = !DILocation(line: 421, column: 85, scope: !1114)
!1121 = !DILocation(line: 423, column: 20, scope: !1114)
!1122 = !DILocation(line: 424, column: 2, scope: !1114)
!1123 = distinct !DISubprogram(name: "background_mode", scope: !3, file: !3, line: 427, type: !734, scopeLine: 428, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1124 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1123, file: !3, line: 427, type: !62)
!1125 = !DILocation(line: 427, column: 32, scope: !1123)
!1126 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1123, file: !3, line: 427, type: !53)
!1127 = !DILocation(line: 427, column: 59, scope: !1123)
!1128 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1123, file: !3, line: 427, type: !57)
!1129 = !DILocation(line: 427, column: 79, scope: !1123)
!1130 = !DILocation(line: 429, column: 15, scope: !1123)
!1131 = !DILocation(line: 430, column: 2, scope: !1123)
!1132 = distinct !DISubprogram(name: "playback_mode", scope: !3, file: !3, line: 691, type: !734, scopeLine: 692, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1133 = !DILocalVariable(name: "argc", arg: 1, scope: !1132, file: !3, line: 691, type: !62)
!1134 = !DILocation(line: 691, column: 30, scope: !1132)
!1135 = !DILocalVariable(name: "argv", arg: 2, scope: !1132, file: !3, line: 691, type: !53)
!1136 = !DILocation(line: 691, column: 49, scope: !1132)
!1137 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1132, file: !3, line: 691, type: !57)
!1138 = !DILocation(line: 691, column: 61, scope: !1132)
!1139 = !DILocation(line: 694, column: 8, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 694, column: 6)
!1141 = !DILocation(line: 694, column: 6, scope: !1140)
!1142 = !DILocation(line: 694, column: 19, scope: !1140)
!1143 = !DILocation(line: 694, column: 6, scope: !1132)
!1144 = !DILocation(line: 700, column: 20, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 694, column: 25)
!1146 = !DILocation(line: 700, column: 26, scope: !1145)
!1147 = !DILocation(line: 700, column: 3, scope: !1145)
!1148 = !DILocation(line: 701, column: 3, scope: !1145)
!1149 = !DILocation(line: 704, column: 2, scope: !1132)
!1150 = distinct !DISubprogram(name: "debug_mode", scope: !3, file: !3, line: 433, type: !734, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1151 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1150, file: !3, line: 433, type: !62)
!1152 = !DILocation(line: 433, column: 27, scope: !1150)
!1153 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1150, file: !3, line: 433, type: !53)
!1154 = !DILocation(line: 433, column: 54, scope: !1150)
!1155 = !DILocalVariable(name: "data", arg: 3, scope: !1150, file: !3, line: 433, type: !57)
!1156 = !DILocation(line: 433, column: 74, scope: !1150)
!1157 = !DILocation(line: 435, column: 10, scope: !1150)
!1158 = !DILocation(line: 436, column: 2, scope: !1150)
!1159 = !DILocation(line: 437, column: 2, scope: !1150)
!1160 = !DILocation(line: 446, column: 16, scope: !1150)
!1161 = !DILocation(line: 446, column: 2, scope: !1150)
!1162 = !DILocation(line: 447, column: 2, scope: !1150)
!1163 = distinct !DISubprogram(name: "debug_mode_generic", scope: !3, file: !3, line: 450, type: !734, scopeLine: 451, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1164 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1163, file: !3, line: 450, type: !62)
!1165 = !DILocation(line: 450, column: 35, scope: !1163)
!1166 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1163, file: !3, line: 450, type: !53)
!1167 = !DILocation(line: 450, column: 62, scope: !1163)
!1168 = !DILocalVariable(name: "data", arg: 3, scope: !1163, file: !3, line: 450, type: !57)
!1169 = !DILocation(line: 450, column: 82, scope: !1163)
!1170 = !DILocation(line: 452, column: 13, scope: !1163)
!1171 = !DILocation(line: 452, column: 10, scope: !1163)
!1172 = !DILocation(line: 453, column: 2, scope: !1163)
!1173 = distinct !DISubprogram(name: "set_fpe", scope: !3, file: !3, line: 493, type: !734, scopeLine: 494, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1174 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1173, file: !3, line: 493, type: !62)
!1175 = !DILocation(line: 493, column: 24, scope: !1173)
!1176 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1173, file: !3, line: 493, type: !53)
!1177 = !DILocation(line: 493, column: 51, scope: !1173)
!1178 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1173, file: !3, line: 493, type: !57)
!1179 = !DILocation(line: 493, column: 71, scope: !1173)
!1180 = !DILocation(line: 517, column: 2, scope: !1173)
!1181 = distinct !DISubprogram(name: "debug_mode_memory", scope: !3, file: !3, line: 474, type: !734, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1182 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1181, file: !3, line: 474, type: !62)
!1183 = !DILocation(line: 474, column: 34, scope: !1181)
!1184 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1181, file: !3, line: 474, type: !53)
!1185 = !DILocation(line: 474, column: 61, scope: !1181)
!1186 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1181, file: !3, line: 474, type: !57)
!1187 = !DILocation(line: 474, column: 81, scope: !1181)
!1188 = !DILocation(line: 476, column: 2, scope: !1181)
!1189 = !DILocation(line: 477, column: 2, scope: !1181)
!1190 = distinct !DISubprogram(name: "set_debug_value", scope: !3, file: !3, line: 480, type: !734, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1191 = !DILocalVariable(name: "argc", arg: 1, scope: !1190, file: !3, line: 480, type: !62)
!1192 = !DILocation(line: 480, column: 32, scope: !1190)
!1193 = !DILocalVariable(name: "argv", arg: 2, scope: !1190, file: !3, line: 480, type: !53)
!1194 = !DILocation(line: 480, column: 51, scope: !1190)
!1195 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1190, file: !3, line: 480, type: !57)
!1196 = !DILocation(line: 480, column: 63, scope: !1190)
!1197 = !DILocation(line: 482, column: 6, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 482, column: 6)
!1199 = !DILocation(line: 482, column: 11, scope: !1198)
!1200 = !DILocation(line: 482, column: 6, scope: !1190)
!1201 = !DILocation(line: 483, column: 24, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 482, column: 16)
!1203 = !DILocation(line: 483, column: 19, scope: !1202)
!1204 = !DILocation(line: 483, column: 17, scope: !1202)
!1205 = !DILocation(line: 485, column: 3, scope: !1202)
!1206 = !DILocation(line: 488, column: 3, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 487, column: 7)
!1208 = !DILocation(line: 489, column: 3, scope: !1207)
!1209 = !DILocation(line: 491, column: 1, scope: !1190)
!1210 = distinct !DISubprogram(name: "set_verbosity", scope: !3, file: !3, line: 906, type: !734, scopeLine: 907, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1211 = !DILocalVariable(name: "argc", arg: 1, scope: !1210, file: !3, line: 906, type: !62)
!1212 = !DILocation(line: 906, column: 30, scope: !1210)
!1213 = !DILocalVariable(name: "argv", arg: 2, scope: !1210, file: !3, line: 906, type: !53)
!1214 = !DILocation(line: 906, column: 49, scope: !1210)
!1215 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1210, file: !3, line: 906, type: !57)
!1216 = !DILocation(line: 906, column: 61, scope: !1210)
!1217 = !DILocation(line: 908, column: 6, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 908, column: 6)
!1219 = !DILocation(line: 908, column: 11, scope: !1218)
!1220 = !DILocation(line: 908, column: 6, scope: !1210)
!1221 = !DILocalVariable(name: "level", scope: !1222, file: !3, line: 909, type: !62)
!1222 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 908, column: 16)
!1223 = !DILocation(line: 909, column: 7, scope: !1222)
!1224 = !DILocation(line: 909, column: 20, scope: !1222)
!1225 = !DILocation(line: 909, column: 15, scope: !1222)
!1226 = !DILocation(line: 916, column: 9, scope: !1222)
!1227 = !DILocation(line: 919, column: 3, scope: !1222)
!1228 = !DILocation(line: 922, column: 3, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 921, column: 7)
!1230 = !DILocation(line: 923, column: 3, scope: !1229)
!1231 = !DILocation(line: 925, column: 1, scope: !1210)
!1232 = distinct !DISubprogram(name: "set_factory_startup", scope: !3, file: !3, line: 663, type: !734, scopeLine: 664, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1233 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1232, file: !3, line: 663, type: !62)
!1234 = !DILocation(line: 663, column: 36, scope: !1232)
!1235 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1232, file: !3, line: 663, type: !53)
!1236 = !DILocation(line: 663, column: 63, scope: !1232)
!1237 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1232, file: !3, line: 663, type: !57)
!1238 = !DILocation(line: 663, column: 83, scope: !1232)
!1239 = !DILocation(line: 665, column: 20, scope: !1232)
!1240 = !DILocation(line: 666, column: 2, scope: !1232)
!1241 = distinct !DISubprogram(name: "set_env", scope: !3, file: !3, line: 669, type: !734, scopeLine: 670, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1242 = !DILocalVariable(name: "argc", arg: 1, scope: !1241, file: !3, line: 669, type: !62)
!1243 = !DILocation(line: 669, column: 24, scope: !1241)
!1244 = !DILocalVariable(name: "argv", arg: 2, scope: !1241, file: !3, line: 669, type: !53)
!1245 = !DILocation(line: 669, column: 43, scope: !1241)
!1246 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1241, file: !3, line: 669, type: !57)
!1247 = !DILocation(line: 669, column: 55, scope: !1241)
!1248 = !DILocalVariable(name: "env", scope: !1241, file: !3, line: 673, type: !555)
!1249 = !DILocation(line: 673, column: 7, scope: !1241)
!1250 = !DILocalVariable(name: "ch_dst", scope: !1241, file: !3, line: 674, type: !444)
!1251 = !DILocation(line: 674, column: 8, scope: !1241)
!1252 = !DILocation(line: 674, column: 17, scope: !1241)
!1253 = !DILocation(line: 674, column: 21, scope: !1241)
!1254 = !DILocalVariable(name: "ch_src", scope: !1241, file: !3, line: 675, type: !54)
!1255 = !DILocation(line: 675, column: 14, scope: !1241)
!1256 = !DILocation(line: 675, column: 23, scope: !1241)
!1257 = !DILocation(line: 675, column: 31, scope: !1241)
!1258 = !DILocation(line: 677, column: 6, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1241, file: !3, line: 677, column: 6)
!1260 = !DILocation(line: 677, column: 11, scope: !1259)
!1261 = !DILocation(line: 677, column: 6, scope: !1241)
!1262 = !DILocation(line: 678, column: 40, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1259, file: !3, line: 677, column: 16)
!1264 = !DILocation(line: 678, column: 3, scope: !1263)
!1265 = !DILocation(line: 679, column: 3, scope: !1263)
!1266 = !DILocation(line: 682, column: 2, scope: !1241)
!1267 = !DILocation(line: 682, column: 10, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !3, line: 682, column: 2)
!1269 = distinct !DILexicalBlock(scope: !1241, file: !3, line: 682, column: 2)
!1270 = !DILocation(line: 682, column: 9, scope: !1268)
!1271 = !DILocation(line: 682, column: 2, scope: !1269)
!1272 = !DILocation(line: 683, column: 15, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1268, file: !3, line: 682, column: 38)
!1274 = !DILocation(line: 683, column: 14, scope: !1273)
!1275 = !DILocation(line: 683, column: 22, scope: !1273)
!1276 = !DILocation(line: 683, column: 13, scope: !1273)
!1277 = !DILocation(line: 683, column: 40, scope: !1273)
!1278 = !DILocation(line: 683, column: 39, scope: !1273)
!1279 = !DILocation(line: 683, column: 38, scope: !1273)
!1280 = !DILocation(line: 683, column: 48, scope: !1273)
!1281 = !DILocation(line: 683, column: 4, scope: !1273)
!1282 = !DILocation(line: 683, column: 11, scope: !1273)
!1283 = !DILocation(line: 684, column: 2, scope: !1273)
!1284 = !DILocation(line: 682, column: 24, scope: !1268)
!1285 = !DILocation(line: 682, column: 34, scope: !1268)
!1286 = !DILocation(line: 682, column: 2, scope: !1268)
!1287 = distinct !{!1287, !1271, !1288}
!1288 = !DILocation(line: 684, column: 2, scope: !1269)
!1289 = !DILocation(line: 686, column: 3, scope: !1241)
!1290 = !DILocation(line: 686, column: 10, scope: !1241)
!1291 = !DILocation(line: 687, column: 13, scope: !1241)
!1292 = !DILocation(line: 687, column: 18, scope: !1241)
!1293 = !DILocation(line: 687, column: 2, scope: !1241)
!1294 = !DILocation(line: 688, column: 2, scope: !1241)
!1295 = distinct !DISubprogram(name: "prefsize", scope: !3, file: !3, line: 707, type: !734, scopeLine: 708, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1296 = !DILocalVariable(name: "argc", arg: 1, scope: !1295, file: !3, line: 707, type: !62)
!1297 = !DILocation(line: 707, column: 25, scope: !1295)
!1298 = !DILocalVariable(name: "argv", arg: 2, scope: !1295, file: !3, line: 707, type: !53)
!1299 = !DILocation(line: 707, column: 44, scope: !1295)
!1300 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1295, file: !3, line: 707, type: !57)
!1301 = !DILocation(line: 707, column: 56, scope: !1295)
!1302 = !DILocalVariable(name: "stax", scope: !1295, file: !3, line: 709, type: !62)
!1303 = !DILocation(line: 709, column: 6, scope: !1295)
!1304 = !DILocalVariable(name: "stay", scope: !1295, file: !3, line: 709, type: !62)
!1305 = !DILocation(line: 709, column: 12, scope: !1295)
!1306 = !DILocalVariable(name: "sizx", scope: !1295, file: !3, line: 709, type: !62)
!1307 = !DILocation(line: 709, column: 18, scope: !1295)
!1308 = !DILocalVariable(name: "sizy", scope: !1295, file: !3, line: 709, type: !62)
!1309 = !DILocation(line: 709, column: 24, scope: !1295)
!1310 = !DILocation(line: 711, column: 6, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1295, file: !3, line: 711, column: 6)
!1312 = !DILocation(line: 711, column: 11, scope: !1311)
!1313 = !DILocation(line: 711, column: 6, scope: !1295)
!1314 = !DILocation(line: 712, column: 11, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1311, file: !3, line: 711, column: 16)
!1316 = !DILocation(line: 712, column: 3, scope: !1315)
!1317 = !DILocation(line: 713, column: 3, scope: !1315)
!1318 = !DILocation(line: 716, column: 14, scope: !1295)
!1319 = !DILocation(line: 716, column: 9, scope: !1295)
!1320 = !DILocation(line: 716, column: 7, scope: !1295)
!1321 = !DILocation(line: 717, column: 14, scope: !1295)
!1322 = !DILocation(line: 717, column: 9, scope: !1295)
!1323 = !DILocation(line: 717, column: 7, scope: !1295)
!1324 = !DILocation(line: 718, column: 14, scope: !1295)
!1325 = !DILocation(line: 718, column: 9, scope: !1295)
!1326 = !DILocation(line: 718, column: 7, scope: !1295)
!1327 = !DILocation(line: 719, column: 14, scope: !1295)
!1328 = !DILocation(line: 719, column: 9, scope: !1295)
!1329 = !DILocation(line: 719, column: 7, scope: !1295)
!1330 = !DILocation(line: 721, column: 25, scope: !1295)
!1331 = !DILocation(line: 721, column: 31, scope: !1295)
!1332 = !DILocation(line: 721, column: 37, scope: !1295)
!1333 = !DILocation(line: 721, column: 43, scope: !1295)
!1334 = !DILocation(line: 721, column: 2, scope: !1295)
!1335 = !DILocation(line: 723, column: 2, scope: !1295)
!1336 = distinct !DISubprogram(name: "with_borders", scope: !3, file: !3, line: 732, type: !734, scopeLine: 733, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1337 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1336, file: !3, line: 732, type: !62)
!1338 = !DILocation(line: 732, column: 29, scope: !1336)
!1339 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1336, file: !3, line: 732, type: !53)
!1340 = !DILocation(line: 732, column: 56, scope: !1336)
!1341 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1336, file: !3, line: 732, type: !57)
!1342 = !DILocation(line: 732, column: 76, scope: !1336)
!1343 = !DILocation(line: 734, column: 2, scope: !1336)
!1344 = !DILocation(line: 735, column: 2, scope: !1336)
!1345 = distinct !DISubprogram(name: "without_borders", scope: !3, file: !3, line: 738, type: !734, scopeLine: 739, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1346 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1345, file: !3, line: 738, type: !62)
!1347 = !DILocation(line: 738, column: 32, scope: !1345)
!1348 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1345, file: !3, line: 738, type: !53)
!1349 = !DILocation(line: 738, column: 59, scope: !1345)
!1350 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1345, file: !3, line: 738, type: !57)
!1351 = !DILocation(line: 738, column: 79, scope: !1345)
!1352 = !DILocation(line: 740, column: 2, scope: !1345)
!1353 = !DILocation(line: 741, column: 2, scope: !1345)
!1354 = distinct !DISubprogram(name: "start_with_console", scope: !3, file: !3, line: 745, type: !734, scopeLine: 746, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1355 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1354, file: !3, line: 745, type: !62)
!1356 = !DILocation(line: 745, column: 35, scope: !1354)
!1357 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1354, file: !3, line: 745, type: !53)
!1358 = !DILocation(line: 745, column: 62, scope: !1354)
!1359 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1354, file: !3, line: 745, type: !57)
!1360 = !DILocation(line: 745, column: 82, scope: !1354)
!1361 = !DILocation(line: 747, column: 24, scope: !1354)
!1362 = !DILocation(line: 748, column: 2, scope: !1354)
!1363 = distinct !DISubprogram(name: "register_extension", scope: !3, file: !3, line: 751, type: !734, scopeLine: 752, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1364 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1363, file: !3, line: 751, type: !62)
!1365 = !DILocation(line: 751, column: 35, scope: !1363)
!1366 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1363, file: !3, line: 751, type: !53)
!1367 = !DILocation(line: 751, column: 62, scope: !1363)
!1368 = !DILocalVariable(name: "data", arg: 3, scope: !1363, file: !3, line: 751, type: !57)
!1369 = !DILocation(line: 751, column: 82, scope: !1363)
!1370 = !DILocation(line: 758, column: 8, scope: !1363)
!1371 = !DILocation(line: 760, column: 2, scope: !1363)
!1372 = distinct !DISubprogram(name: "native_pixels", scope: !3, file: !3, line: 726, type: !734, scopeLine: 727, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1373 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1372, file: !3, line: 726, type: !62)
!1374 = !DILocation(line: 726, column: 30, scope: !1372)
!1375 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1372, file: !3, line: 726, type: !53)
!1376 = !DILocation(line: 726, column: 57, scope: !1372)
!1377 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1372, file: !3, line: 726, type: !57)
!1378 = !DILocation(line: 726, column: 77, scope: !1372)
!1379 = !DILocation(line: 728, column: 2, scope: !1372)
!1380 = !DILocation(line: 729, column: 2, scope: !1372)
!1381 = distinct !DISubprogram(name: "no_joystick", scope: !3, file: !3, line: 763, type: !734, scopeLine: 764, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1382 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1381, file: !3, line: 763, type: !62)
!1383 = !DILocation(line: 763, column: 28, scope: !1381)
!1384 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1381, file: !3, line: 763, type: !53)
!1385 = !DILocation(line: 763, column: 55, scope: !1381)
!1386 = !DILocalVariable(name: "data", arg: 3, scope: !1381, file: !3, line: 763, type: !57)
!1387 = !DILocation(line: 763, column: 75, scope: !1381)
!1388 = !DILocation(line: 766, column: 8, scope: !1381)
!1389 = !DILocation(line: 778, column: 2, scope: !1381)
!1390 = distinct !DISubprogram(name: "no_glsl", scope: !3, file: !3, line: 781, type: !734, scopeLine: 782, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1391 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1390, file: !3, line: 781, type: !62)
!1392 = !DILocation(line: 781, column: 24, scope: !1390)
!1393 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1390, file: !3, line: 781, type: !53)
!1394 = !DILocation(line: 781, column: 51, scope: !1390)
!1395 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1390, file: !3, line: 781, type: !57)
!1396 = !DILocation(line: 781, column: 71, scope: !1390)
!1397 = !DILocation(line: 783, column: 2, scope: !1390)
!1398 = !DILocation(line: 784, column: 2, scope: !1390)
!1399 = distinct !DISubprogram(name: "no_audio", scope: !3, file: !3, line: 787, type: !734, scopeLine: 788, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1400 = !DILocalVariable(name: "UNUSED_argc", arg: 1, scope: !1399, file: !3, line: 787, type: !62)
!1401 = !DILocation(line: 787, column: 25, scope: !1399)
!1402 = !DILocalVariable(name: "UNUSED_argv", arg: 2, scope: !1399, file: !3, line: 787, type: !53)
!1403 = !DILocation(line: 787, column: 52, scope: !1399)
!1404 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1399, file: !3, line: 787, type: !57)
!1405 = !DILocation(line: 787, column: 72, scope: !1399)
!1406 = !DILocation(line: 789, column: 2, scope: !1399)
!1407 = !DILocation(line: 790, column: 2, scope: !1399)
!1408 = distinct !DISubprogram(name: "set_audio", scope: !3, file: !3, line: 793, type: !734, scopeLine: 794, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1409 = !DILocalVariable(name: "argc", arg: 1, scope: !1408, file: !3, line: 793, type: !62)
!1410 = !DILocation(line: 793, column: 26, scope: !1408)
!1411 = !DILocalVariable(name: "argv", arg: 2, scope: !1408, file: !3, line: 793, type: !53)
!1412 = !DILocation(line: 793, column: 45, scope: !1408)
!1413 = !DILocalVariable(name: "UNUSED_data", arg: 3, scope: !1408, file: !3, line: 793, type: !57)
!1414 = !DILocation(line: 793, column: 57, scope: !1408)
!1415 = !DILocation(line: 795, column: 6, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1408, file: !3, line: 795, column: 6)
!1417 = !DILocation(line: 795, column: 11, scope: !1416)
!1418 = !DILocation(line: 795, column: 6, scope: !1408)
!1419 = !DILocation(line: 796, column: 11, scope: !1420)
!1420 = distinct !DILexicalBlock(scope: !1416, file: !3, line: 795, column: 16)
!1421 = !DILocation(line: 796, column: 3, scope: !1420)
!1422 = !DILocation(line: 797, column: 3, scope: !1420)
!1423 = !DILocation(line: 800, column: 43, scope: !1408)
!1424 = !DILocation(line: 800, column: 21, scope: !1408)
!1425 = !DILocation(line: 800, column: 2, scope: !1408)
!1426 = !DILocation(line: 801, column: 2, scope: !1408)
!1427 = distinct !DISubprogram(name: "set_ge_parameters", scope: !3, file: !3, line: 954, type: !734, scopeLine: 955, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1428 = !DILocalVariable(name: "argc", arg: 1, scope: !1427, file: !3, line: 954, type: !62)
!1429 = !DILocation(line: 954, column: 34, scope: !1427)
!1430 = !DILocalVariable(name: "argv", arg: 2, scope: !1427, file: !3, line: 954, type: !53)
!1431 = !DILocation(line: 954, column: 53, scope: !1427)
!1432 = !DILocalVariable(name: "data", arg: 3, scope: !1427, file: !3, line: 954, type: !57)
!1433 = !DILocation(line: 954, column: 65, scope: !1427)
!1434 = !DILocalVariable(name: "a", scope: !1427, file: !3, line: 956, type: !62)
!1435 = !DILocation(line: 956, column: 6, scope: !1427)
!1436 = !DILocation(line: 960, column: 8, scope: !1427)
!1437 = !DILocation(line: 972, column: 6, scope: !1438)
!1438 = distinct !DILexicalBlock(scope: !1427, file: !3, line: 972, column: 6)
!1439 = !DILocation(line: 972, column: 11, scope: !1438)
!1440 = !DILocation(line: 972, column: 6, scope: !1427)
!1441 = !DILocalVariable(name: "paramname", scope: !1442, file: !3, line: 973, type: !54)
!1442 = distinct !DILexicalBlock(scope: !1438, file: !3, line: 972, column: 17)
!1443 = !DILocation(line: 973, column: 15, scope: !1442)
!1444 = !DILocation(line: 973, column: 27, scope: !1442)
!1445 = !DILocation(line: 973, column: 32, scope: !1442)
!1446 = !DILocation(line: 975, column: 7, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1442, file: !3, line: 975, column: 7)
!1448 = !DILocation(line: 975, column: 9, scope: !1447)
!1449 = !DILocation(line: 975, column: 15, scope: !1447)
!1450 = !DILocation(line: 975, column: 13, scope: !1447)
!1451 = !DILocation(line: 975, column: 20, scope: !1447)
!1452 = !DILocation(line: 975, column: 26, scope: !1447)
!1453 = !DILocation(line: 975, column: 31, scope: !1447)
!1454 = !DILocation(line: 975, column: 33, scope: !1447)
!1455 = !DILocation(line: 975, column: 24, scope: !1447)
!1456 = !DILocation(line: 975, column: 39, scope: !1447)
!1457 = !DILocation(line: 975, column: 7, scope: !1442)
!1458 = !DILocation(line: 976, column: 5, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1447, file: !3, line: 975, column: 48)
!1460 = !DILocation(line: 977, column: 8, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !1459, file: !3, line: 977, column: 8)
!1462 = !DILocation(line: 977, column: 10, scope: !1461)
!1463 = !DILocation(line: 977, column: 16, scope: !1461)
!1464 = !DILocation(line: 977, column: 14, scope: !1461)
!1465 = !DILocation(line: 977, column: 8, scope: !1459)
!1466 = !DILocation(line: 978, column: 6, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1461, file: !3, line: 977, column: 22)
!1468 = !DILocation(line: 983, column: 4, scope: !1467)
!1469 = !DILocation(line: 985, column: 64, scope: !1470)
!1470 = distinct !DILexicalBlock(scope: !1461, file: !3, line: 984, column: 9)
!1471 = !DILocation(line: 985, column: 5, scope: !1470)
!1472 = !DILocation(line: 986, column: 5, scope: !1470)
!1473 = !DILocation(line: 990, column: 3, scope: !1459)
!1474 = !DILocation(line: 996, column: 16, scope: !1475)
!1475 = distinct !DILexicalBlock(scope: !1476, file: !3, line: 996, column: 8)
!1476 = distinct !DILexicalBlock(scope: !1447, file: !3, line: 991, column: 8)
!1477 = !DILocation(line: 996, column: 21, scope: !1475)
!1478 = !DILocation(line: 996, column: 9, scope: !1475)
!1479 = !DILocation(line: 996, column: 8, scope: !1476)
!1480 = !DILocation(line: 997, column: 5, scope: !1481)
!1481 = distinct !DILexicalBlock(scope: !1475, file: !3, line: 996, column: 38)
!1482 = !DILocation(line: 998, column: 4, scope: !1481)
!1483 = !DILocation(line: 1000, column: 16, scope: !1484)
!1484 = distinct !DILexicalBlock(scope: !1476, file: !3, line: 1000, column: 8)
!1485 = !DILocation(line: 1000, column: 21, scope: !1484)
!1486 = !DILocation(line: 1000, column: 9, scope: !1484)
!1487 = !DILocation(line: 1000, column: 8, scope: !1476)
!1488 = !DILocation(line: 1001, column: 5, scope: !1489)
!1489 = distinct !DILexicalBlock(scope: !1484, file: !3, line: 1000, column: 42)
!1490 = !DILocation(line: 1002, column: 4, scope: !1489)
!1491 = !DILocation(line: 1006, column: 2, scope: !1442)
!1492 = !DILocation(line: 1008, column: 9, scope: !1427)
!1493 = !DILocation(line: 1008, column: 2, scope: !1427)
!1494 = !DILocation(line: 1009, column: 1, scope: !1427)
!1495 = distinct !DISubprogram(name: "render_frame", scope: !3, file: !3, line: 1011, type: !734, scopeLine: 1012, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !82)
!1496 = !DILocalVariable(name: "argc", arg: 1, scope: !1495, file: !3, line: 1011, type: !62)
!1497 = !DILocation(line: 1011, column: 29, scope: !1495)
!1498 = !DILocalVariable(name: "argv", arg: 2, scope: !1495, file: !3, line: 1011, type: !53)
!1499 = !DILocation(line: 1011, column: 48, scope: !1495)
!1500 = !DILocalVariable(name: "data", arg: 3, scope: !1495, file: !3, line: 1011, type: !57)
!1501 = !DILocation(line: 1011, column: 60, scope: !1495)
!1502 = !DILocalVariable(name: "C", scope: !1495, file: !3, line: 1013, type: !77)
!1503 = !DILocation(line: 1013, column: 12, scope: !1495)
!1504 = !DILocation(line: 1013, column: 16, scope: !1495)
!1505 = !DILocalVariable(name: "scene", scope: !1495, file: !3, line: 1014, type: !1506)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64)
!1507 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !1508, line: 1299, baseType: !1509)
!1508 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1508, line: 1216, size: 39680, elements: !1510)
!1510 = !{!1511, !1512, !1515, !2835, !2916, !2917, !2918, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2945, !3159, !3162, !3404, !3416, !3417, !3418, !3419, !3420, !3421, !3422, !3423, !3426, !3427, !3428, !3429, !3430, !3438, !3504, !3511, !3512, !3519, !3522, !3523, !3524, !3525, !3526, !3527}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1509, file: !1508, line: 1217, baseType: !507, size: 960)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1509, file: !1508, line: 1218, baseType: !1513, size: 64, offset: 960)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1508, line: 58, flags: DIFlagFwdDecl)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1509, file: !1508, line: 1220, baseType: !1516, size: 64, offset: 1024)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1518, line: 115, size: 11392, elements: !1519)
!1518 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1519 = !{!1520, !1521, !1522, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1540, !1552, !1566, !1567, !1611, !1612, !1615, !1616, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729, !2730, !2731, !2732, !2733, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2756, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2786, !2789, !2790, !2791, !2792, !2793, !2794, !2798, !2801, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2813, !2816, !2819, !2820, !2823, !2824}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1517, file: !1518, line: 116, baseType: !507, size: 960)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1517, file: !1518, line: 117, baseType: !1513, size: 64, offset: 960)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1517, file: !1518, line: 119, baseType: !1523, size: 64, offset: 1024)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64)
!1524 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1518, line: 57, flags: DIFlagFwdDecl)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1517, file: !1518, line: 121, baseType: !539, size: 16, offset: 1088)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1517, file: !1518, line: 121, baseType: !539, size: 16, offset: 1104)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1517, file: !1518, line: 122, baseType: !62, size: 32, offset: 1120)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1517, file: !1518, line: 122, baseType: !62, size: 32, offset: 1152)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1517, file: !1518, line: 122, baseType: !62, size: 32, offset: 1184)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1517, file: !1518, line: 123, baseType: !555, size: 512, offset: 1216)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1517, file: !1518, line: 124, baseType: !1516, size: 64, offset: 1728)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1517, file: !1518, line: 124, baseType: !1516, size: 64, offset: 1792)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1517, file: !1518, line: 127, baseType: !1516, size: 64, offset: 1856)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1517, file: !1518, line: 127, baseType: !1516, size: 64, offset: 1920)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1517, file: !1518, line: 127, baseType: !1516, size: 64, offset: 1984)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1517, file: !1518, line: 128, baseType: !1537, size: 64, offset: 2048)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64)
!1538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1539, line: 46, flags: DIFlagFwdDecl)
!1539 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1517, file: !1518, line: 130, baseType: !1541, size: 64, offset: 2112)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1518, line: 97, size: 832, elements: !1543)
!1543 = !{!1544, !1550, !1551}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1542, file: !1518, line: 98, baseType: !1545, size: 768)
