; ModuleID = 'blender/source/blender/editors/render/render_shading.c'
source_filename = "blender/source/blender/editors/render/render_shading.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "slot_move", scope: !2, file: !3, line: 1366, type: !3420, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "TEXTURE_OT_slot_move", scope: !3, file: !3, line: 1364, type: !4, scopeLine: 1365, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2822, retainedNodes: !3419)
!3 = !DIFile(filename: "blender/source/blender/editors/render/render_shading.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !2748, !2752, !2758, !2762, !2763, !2767, !2768, !2769, !2770, !2774, !2775, !2790, !2791, !2795, !2821}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 40, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_animsys.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !86, !2741, !2742, !2743, !2746, !2747}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !75, line: 55, size: 192, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !81, !85}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 58, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !75, line: 56, size: 64, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !75, line: 57, baseType: !56, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 60, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !84, line: 335, flags: DIFlagFwdDecl)
!84 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !75, line: 61, baseType: !56, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !88, file: !28, line: 107, baseType: !58, size: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !88, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !88, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !88, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !88, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !88, file: !28, line: 111, baseType: !96, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !98)
!98 = !{!99, !100, !101, !2732, !2733, !2734, !2735, !2736, !2737, !2738, !2739, !2740}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !8, line: 491, baseType: !96, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !97, file: !8, line: 491, baseType: !96, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !97, file: !8, line: 493, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !104)
!104 = !{!105, !106, !107, !108, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2707, !2710, !2724, !2725, !2726, !2727, !2728, !2729, !2730, !2731}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !28, line: 170, baseType: !102, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !103, file: !28, line: 170, baseType: !102, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !103, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !103, file: !28, line: 174, baseType: !109, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !111, line: 49, size: 1984, elements: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = !{!113, !149, !150, !151, !152, !153, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 50, baseType: !114, size: 960)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !116)
!116 = !{!117, !118, !119, !121, !140, !144, !145, !146, !147, !148}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !39, line: 118, baseType: !56, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !115, file: !39, line: 119, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !115, file: !39, line: 120, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !124)
!124 = !{!125, !126, !128, !131, !135, !136, !137}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !39, line: 137, baseType: !114, size: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !123, file: !39, line: 138, baseType: !127, size: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !123, file: !39, line: 139, baseType: !129, size: 64, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !39, line: 140, baseType: !132, size: 8192, offset: 1088)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !123, file: !39, line: 141, baseType: !132, size: 8192, offset: 9280)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !123, file: !39, line: 148, baseType: !122, size: 64, offset: 17472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !123, file: !39, line: 150, baseType: !138, size: 64, offset: 17536)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !39, line: 121, baseType: !141, size: 528, offset: 256)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 66)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !115, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !115, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !115, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !115, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !115, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !110, file: !111, line: 52, baseType: !58, size: 128, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !110, file: !111, line: 53, baseType: !58, size: 128, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !110, file: !111, line: 54, baseType: !58, size: 128, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !110, file: !111, line: 55, baseType: !58, size: 128, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !110, file: !111, line: 57, baseType: !154, size: 64, offset: 1472)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !156, line: 1216, size: 39680, elements: !157)
!156 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!157 = !{!158, !159, !163, !1495, !1576, !1577, !1578, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1949, !2266, !2269, !2509, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2531, !2532, !2533, !2534, !2535, !2543, !2609, !2616, !2617, !2624, !2625, !2626, !2627, !2628, !2629, !2630}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !155, file: !156, line: 1217, baseType: !114, size: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !155, file: !156, line: 1218, baseType: !160, size: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !162, line: 48, flags: DIFlagFwdDecl)
!162 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !155, file: !156, line: 1220, baseType: !164, size: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !166, line: 115, size: 11392, elements: !167)
!166 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!167 = !{!168, !169, !170, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !489, !499, !513, !514, !554, !555, !558, !559, !575, !576, !577, !578, !579, !580, !581, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1423, !1426, !1427, !1428, !1429, !1430, !1431, !1434, !1456, !1459, !1460, !1466, !1467, !1468, !1469, !1470, !1471, !1473, !1476, !1479, !1480, !1483, !1484}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !166, line: 116, baseType: !114, size: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !165, file: !166, line: 117, baseType: !160, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !165, file: !166, line: 119, baseType: !171, size: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !173, line: 155, size: 1856, elements: !174)
!173 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!174 = !{!175, !178, !181, !184, !187, !188, !189, !195, !198, !200, !204, !437, !438, !439, !441, !444, !447, !448, !449, !450, !451, !455, !456, !457, !459, !460, !464, !465, !468, !471, !472, !473, !474}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !172, file: !173, line: 157, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !173, line: 157, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !172, file: !173, line: 158, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !173, line: 49, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !172, file: !173, line: 159, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !173, line: 159, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !172, file: !173, line: 160, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !173, line: 160, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !172, file: !173, line: 161, baseType: !22, size: 32, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !172, file: !173, line: 161, baseType: !22, size: 32, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !172, file: !173, line: 162, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 96, elements: !193)
!192 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!193 = !{!194}
!194 = !DISubrange(count: 3)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !172, file: !173, line: 163, baseType: !196, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !173, line: 163, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !172, file: !173, line: 164, baseType: !199, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !172, file: !173, line: 167, baseType: !201, size: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !173, line: 44, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !172, file: !173, line: 170, baseType: !205, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !207, line: 186, size: 8064, elements: !208)
!207 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !222, !223, !224, !225, !286, !290, !294, !295, !296, !297, !298, !299, !300, !301, !392, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !206, file: !207, line: 187, baseType: !22, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !206, file: !207, line: 187, baseType: !22, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !206, file: !207, line: 187, baseType: !22, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !206, file: !207, line: 187, baseType: !22, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !206, file: !207, line: 188, baseType: !22, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !206, file: !207, line: 188, baseType: !22, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !206, file: !207, line: 188, baseType: !22, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !206, file: !207, line: 193, baseType: !14, size: 8, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !206, file: !207, line: 197, baseType: !14, size: 8, offset: 232)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !206, file: !207, line: 201, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !221, line: 75, flags: DIFlagFwdDecl)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !206, file: !207, line: 201, baseType: !219, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !206, file: !207, line: 201, baseType: !219, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !206, file: !207, line: 201, baseType: !219, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !206, file: !207, line: 208, baseType: !226, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !207, line: 103, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !207, line: 90, size: 448, elements: !230)
!230 = !{!231, !240, !245, !246, !247}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !229, file: !207, line: 91, baseType: !232, size: 128)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !207, line: 82, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !207, line: 64, size: 128, elements: !234)
!234 = !{!235, !236, !237, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !207, line: 65, baseType: !56, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !233, file: !207, line: 66, baseType: !22, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !233, file: !207, line: 73, baseType: !14, size: 8, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !233, file: !207, line: 74, baseType: !14, size: 8, offset: 104)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !233, file: !207, line: 80, baseType: !14, size: 8, offset: 112)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !229, file: !207, line: 92, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !207, line: 180, size: 16, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !242, file: !207, line: 181, baseType: !48, size: 16)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !229, file: !207, line: 94, baseType: !191, size: 96, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !229, file: !207, line: 95, baseType: !191, size: 96, offset: 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !229, file: !207, line: 102, baseType: !248, size: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !207, line: 110, size: 640, elements: !250)
!250 = !{!251, !252, !253, !255, !256, !279, !285}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !249, file: !207, line: 111, baseType: !232, size: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !249, file: !207, line: 112, baseType: !241, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !249, file: !207, line: 114, baseType: !254, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !249, file: !207, line: 114, baseType: !254, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !249, file: !207, line: 118, baseType: !257, size: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !207, line: 125, size: 576, elements: !259)
!259 = !{!260, !261, !262, !263, !275, !276, !277, !278}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !258, file: !207, line: 126, baseType: !232, size: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !258, file: !207, line: 129, baseType: !254, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !258, file: !207, line: 130, baseType: !248, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !258, file: !207, line: 131, baseType: !264, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !207, line: 164, size: 448, elements: !266)
!266 = !{!267, !268, !269, !272, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !265, file: !207, line: 165, baseType: !232, size: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !265, file: !207, line: 166, baseType: !241, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !265, file: !207, line: 172, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !207, line: 140, baseType: !258)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !207, line: 174, baseType: !22, size: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !265, file: !207, line: 175, baseType: !191, size: 96, offset: 288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !265, file: !207, line: 176, baseType: !48, size: 16, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !258, file: !207, line: 135, baseType: !257, size: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !258, file: !207, line: 135, baseType: !257, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !207, line: 139, baseType: !257, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !258, file: !207, line: 139, baseType: !257, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !249, file: !207, line: 122, baseType: !280, size: 128, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !207, line: 108, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !207, line: 106, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !207, line: 107, baseType: !248, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !281, file: !207, line: 107, baseType: !248, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !249, file: !207, line: 122, baseType: !280, size: 128, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !206, file: !207, line: 209, baseType: !287, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !207, line: 123, baseType: !249)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !206, file: !207, line: 210, baseType: !291, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !207, line: 178, baseType: !265)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !206, file: !207, line: 213, baseType: !22, size: 32, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !206, file: !207, line: 214, baseType: !22, size: 32, offset: 736)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !206, file: !207, line: 215, baseType: !22, size: 32, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !206, file: !207, line: 218, baseType: !219, size: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !206, file: !207, line: 218, baseType: !219, size: 64, offset: 896)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !206, file: !207, line: 218, baseType: !219, size: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !206, file: !207, line: 220, baseType: !22, size: 32, offset: 1024)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !206, file: !207, line: 221, baseType: !302, size: 64, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !304, line: 190, size: 10496, elements: !305)
!304 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = !{!306, !371, !372, !378, !381, !382, !391}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !303, file: !304, line: 191, baseType: !307, size: 5120)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 5120, elements: !369)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !304, line: 147, size: 320, elements: !309)
!309 = !{!310, !311, !324, !354, !355}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !308, file: !304, line: 148, baseType: !12, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !308, file: !304, line: 149, baseType: !312, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !304, line: 112, baseType: !313)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !304, line: 94, baseType: !314, size: 32, elements: !315)
!314 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323}
!316 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!317 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!318 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!319 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!320 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!321 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!322 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!323 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !308, file: !304, line: 150, baseType: !325, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !304, line: 142, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !304, line: 138, size: 32, elements: !327)
!327 = !{!328, !336, !344}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !326, file: !304, line: 139, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !304, line: 122, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !304, line: 116, baseType: !314, size: 32, elements: !331)
!331 = !{!332, !333, !334, !335}
!332 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!335 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !326, file: !304, line: 140, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !304, line: 136, baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !304, line: 131, baseType: !314, size: 32, elements: !339)
!339 = !{!340, !341, !342, !343}
!340 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!341 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!342 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!343 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !326, file: !304, line: 141, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !304, line: 130, baseType: !346)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !304, line: 123, baseType: !314, size: 32, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353}
!348 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!349 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!350 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!351 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!352 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!353 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !308, file: !304, line: 152, baseType: !22, size: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !304, line: 162, baseType: !356, size: 128, offset: 192)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !308, file: !304, line: 155, size: 128, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !364}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !356, file: !304, line: 156, baseType: !22, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !356, file: !304, line: 157, baseType: !192, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !356, file: !304, line: 158, baseType: !56, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !356, file: !304, line: 159, baseType: !191, size: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !356, file: !304, line: 160, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !356, file: !304, line: 161, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !367, line: 48, baseType: !368)
!367 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !162, line: 51, flags: DIFlagFwdDecl)
!369 = !{!370}
!370 = !DISubrange(count: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !303, file: !304, line: 192, baseType: !307, size: 5120, offset: 5120)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !303, file: !304, line: 193, baseType: !373, size: 64, offset: 10240)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !376, !302}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !207, line: 246, baseType: !206)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !303, file: !304, line: 194, baseType: !379, size: 64, offset: 10304)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !304, line: 194, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !304, line: 195, baseType: !22, size: 32, offset: 10368)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !303, file: !304, line: 196, baseType: !383, size: 32, offset: 10400)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !304, line: 188, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 182, baseType: !314, size: 32, elements: !385)
!385 = !{!386, !387, !388, !389, !390}
!386 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!389 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!390 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !304, line: 197, baseType: !22, size: 32, offset: 10432)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !206, file: !207, line: 223, baseType: !393, size: 1600, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !394, line: 73, baseType: !395)
!394 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !394, line: 64, size: 1600, elements: !396)
!396 = !{!397, !412, !416, !417, !418, !419, !420}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !395, file: !394, line: 65, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !394, line: 53, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !394, line: 42, size: 832, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !394, line: 43, baseType: !22, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !400, file: !394, line: 44, baseType: !22, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !394, line: 45, baseType: !22, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !400, file: !394, line: 46, baseType: !22, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !400, file: !394, line: 47, baseType: !22, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !400, file: !394, line: 48, baseType: !22, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !400, file: !394, line: 49, baseType: !22, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !400, file: !394, line: 50, baseType: !22, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !394, line: 51, baseType: !33, size: 512, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !400, file: !394, line: 52, baseType: !56, size: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !395, file: !394, line: 66, baseType: !413, size: 1312, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1312, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 41)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !395, file: !394, line: 69, baseType: !22, size: 32, offset: 1376)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !395, file: !394, line: 69, baseType: !22, size: 32, offset: 1408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !395, file: !394, line: 70, baseType: !22, size: 32, offset: 1440)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !395, file: !394, line: 71, baseType: !219, size: 64, offset: 1472)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !395, file: !394, line: 72, baseType: !421, size: 64, offset: 1536)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !394, line: 59, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !394, line: 57, size: 8192, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !423, file: !394, line: 58, baseType: !132, size: 8192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !206, file: !207, line: 223, baseType: !393, size: 1600, offset: 2752)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !206, file: !207, line: 223, baseType: !393, size: 1600, offset: 4352)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !206, file: !207, line: 223, baseType: !393, size: 1600, offset: 5952)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !206, file: !207, line: 233, baseType: !48, size: 16, offset: 7552)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !206, file: !207, line: 236, baseType: !22, size: 32, offset: 7584)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !206, file: !207, line: 238, baseType: !22, size: 32, offset: 7616)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !206, file: !207, line: 238, baseType: !22, size: 32, offset: 7648)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !206, file: !207, line: 239, baseType: !58, size: 128, offset: 7680)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !206, file: !207, line: 241, baseType: !292, size: 64, offset: 7808)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !206, file: !207, line: 243, baseType: !58, size: 128, offset: 7872)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !206, file: !207, line: 245, baseType: !56, size: 64, offset: 8000)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !172, file: !173, line: 171, baseType: !22, size: 32, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !172, file: !173, line: 172, baseType: !22, size: 32, offset: 672)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !172, file: !173, line: 173, baseType: !440, size: 8, offset: 704)
!440 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !172, file: !173, line: 175, baseType: !442, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !173, line: 175, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !172, file: !173, line: 178, baseType: !445, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !173, line: 55, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !172, file: !173, line: 179, baseType: !440, size: 8, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !172, file: !173, line: 182, baseType: !440, size: 8, offset: 904)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !172, file: !173, line: 183, baseType: !190, size: 64, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !172, file: !173, line: 184, baseType: !190, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !172, file: !173, line: 185, baseType: !452, size: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 288, elements: !454)
!454 = !{!194, !194}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !172, file: !173, line: 188, baseType: !440, size: 8, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !172, file: !173, line: 191, baseType: !314, size: 32, offset: 1184)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !172, file: !173, line: 191, baseType: !458, size: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !172, file: !173, line: 191, baseType: !314, size: 32, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !172, file: !173, line: 192, baseType: !461, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !463, line: 47, flags: DIFlagFwdDecl)
!463 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !172, file: !173, line: 195, baseType: !190, size: 64, offset: 1408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !172, file: !173, line: 197, baseType: !466, size: 64, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !173, line: 197, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !172, file: !173, line: 198, baseType: !469, size: 64, offset: 1536)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !173, line: 59, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !172, file: !173, line: 201, baseType: !440, size: 8, offset: 1600)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !172, file: !173, line: 202, baseType: !191, size: 96, offset: 1632)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !172, file: !173, line: 204, baseType: !191, size: 96, offset: 1728)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !172, file: !173, line: 205, baseType: !22, size: 32, offset: 1824)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !166, line: 121, baseType: !48, size: 16, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !165, file: !166, line: 121, baseType: !48, size: 16, offset: 1104)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !165, file: !166, line: 122, baseType: !22, size: 32, offset: 1120)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !165, file: !166, line: 122, baseType: !22, size: 32, offset: 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !165, file: !166, line: 122, baseType: !22, size: 32, offset: 1184)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !165, file: !166, line: 123, baseType: !33, size: 512, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !165, file: !166, line: 124, baseType: !164, size: 64, offset: 1728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !165, file: !166, line: 124, baseType: !164, size: 64, offset: 1792)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !165, file: !166, line: 127, baseType: !164, size: 64, offset: 1856)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !165, file: !166, line: 127, baseType: !164, size: 64, offset: 1920)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !165, file: !166, line: 127, baseType: !164, size: 64, offset: 1984)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !165, file: !166, line: 128, baseType: !487, size: 64, offset: 2048)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !162, line: 44, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !165, file: !166, line: 130, baseType: !490, size: 64, offset: 2112)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !166, line: 97, size: 832, elements: !492)
!492 = !{!493, !497, !498}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !491, file: !166, line: 98, baseType: !494, size: 768)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 768, elements: !495)
!495 = !{!496, !194}
!496 = !DISubrange(count: 8)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !491, file: !166, line: 99, baseType: !22, size: 32, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !491, file: !166, line: 99, baseType: !22, size: 32, offset: 800)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !165, file: !166, line: 131, baseType: !500, size: 64, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !502, line: 486, size: 1600, elements: !503)
!502 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !501, file: !502, line: 487, baseType: !114, size: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !501, file: !502, line: 489, baseType: !58, size: 128, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !501, file: !502, line: 490, baseType: !58, size: 128, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !501, file: !502, line: 491, baseType: !58, size: 128, offset: 1216)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !501, file: !502, line: 492, baseType: !58, size: 128, offset: 1344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !502, line: 494, baseType: !22, size: 32, offset: 1472)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !501, file: !502, line: 495, baseType: !22, size: 32, offset: 1504)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !501, file: !502, line: 497, baseType: !22, size: 32, offset: 1536)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !501, file: !502, line: 498, baseType: !22, size: 32, offset: 1568)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !165, file: !166, line: 132, baseType: !500, size: 64, offset: 2240)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !165, file: !166, line: 133, baseType: !515, size: 64, offset: 2304)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !502, line: 334, size: 1728, elements: !517)
!517 = !{!518, !519, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !553}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !516, file: !502, line: 335, baseType: !58, size: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !516, file: !502, line: 336, baseType: !520, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !516, file: !502, line: 338, baseType: !48, size: 16, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !516, file: !502, line: 338, baseType: !48, size: 16, offset: 208)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !516, file: !502, line: 339, baseType: !314, size: 32, offset: 224)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !516, file: !502, line: 340, baseType: !22, size: 32, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !516, file: !502, line: 342, baseType: !192, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !516, file: !502, line: 343, baseType: !191, size: 96, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !516, file: !502, line: 344, baseType: !191, size: 96, offset: 416)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !516, file: !502, line: 347, baseType: !58, size: 128, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !516, file: !502, line: 349, baseType: !22, size: 32, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !516, file: !502, line: 350, baseType: !22, size: 32, offset: 672)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !516, file: !502, line: 351, baseType: !56, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !516, file: !502, line: 352, baseType: !56, size: 64, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !516, file: !502, line: 354, baseType: !534, size: 384, offset: 832)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !502, line: 116, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !502, line: 94, size: 384, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !535, file: !502, line: 96, baseType: !22, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !535, file: !502, line: 96, baseType: !22, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !535, file: !502, line: 97, baseType: !22, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !535, file: !502, line: 97, baseType: !22, size: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !535, file: !502, line: 99, baseType: !48, size: 16, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !535, file: !502, line: 100, baseType: !48, size: 16, offset: 144)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !535, file: !502, line: 102, baseType: !48, size: 16, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !535, file: !502, line: 105, baseType: !48, size: 16, offset: 176)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !535, file: !502, line: 108, baseType: !48, size: 16, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !535, file: !502, line: 109, baseType: !48, size: 16, offset: 208)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !535, file: !502, line: 111, baseType: !48, size: 16, offset: 224)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !535, file: !502, line: 112, baseType: !48, size: 16, offset: 240)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !535, file: !502, line: 114, baseType: !22, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !535, file: !502, line: 114, baseType: !22, size: 32, offset: 288)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !535, file: !502, line: 115, baseType: !22, size: 32, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !535, file: !502, line: 115, baseType: !22, size: 32, offset: 352)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !516, file: !502, line: 355, baseType: !33, size: 512, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !166, line: 134, baseType: !56, size: 64, offset: 2368)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !165, file: !166, line: 136, baseType: !556, size: 64, offset: 2432)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !156, line: 61, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !165, file: !166, line: 138, baseType: !534, size: 384, offset: 2496)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !165, file: !166, line: 139, baseType: !560, size: 64, offset: 2880)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !502, line: 80, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !502, line: 72, size: 192, elements: !563)
!563 = !{!564, !571, !572, !573, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !562, file: !502, line: 73, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !502, line: 59, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !502, line: 56, size: 128, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !567, file: !502, line: 57, baseType: !191, size: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !502, line: 58, baseType: !22, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !562, file: !502, line: 74, baseType: !22, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !562, file: !502, line: 76, baseType: !22, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !562, file: !502, line: 77, baseType: !22, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !502, line: 79, baseType: !22, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !165, file: !166, line: 141, baseType: !58, size: 128, offset: 2944)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !165, file: !166, line: 142, baseType: !58, size: 128, offset: 3072)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !165, file: !166, line: 143, baseType: !58, size: 128, offset: 3200)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !165, file: !166, line: 144, baseType: !58, size: 128, offset: 3328)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !165, file: !166, line: 146, baseType: !22, size: 32, offset: 3456)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !165, file: !166, line: 147, baseType: !22, size: 32, offset: 3488)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !165, file: !166, line: 150, baseType: !582, size: 64, offset: 3520)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !585, line: 93, size: 7552, elements: !586)
!585 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !635, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !704, !705, !706, !707, !708, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1336}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !584, file: !585, line: 94, baseType: !114, size: 960)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !584, file: !585, line: 95, baseType: !160, size: 64, offset: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !584, file: !585, line: 97, baseType: !48, size: 16, offset: 1024)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !585, line: 97, baseType: !48, size: 16, offset: 1040)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !584, file: !585, line: 99, baseType: !192, size: 32, offset: 1056)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !584, file: !585, line: 99, baseType: !192, size: 32, offset: 1088)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !584, file: !585, line: 99, baseType: !192, size: 32, offset: 1120)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !584, file: !585, line: 100, baseType: !192, size: 32, offset: 1152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !584, file: !585, line: 100, baseType: !192, size: 32, offset: 1184)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !584, file: !585, line: 100, baseType: !192, size: 32, offset: 1216)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !584, file: !585, line: 101, baseType: !192, size: 32, offset: 1248)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !584, file: !585, line: 101, baseType: !192, size: 32, offset: 1280)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !584, file: !585, line: 101, baseType: !192, size: 32, offset: 1312)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !584, file: !585, line: 102, baseType: !192, size: 32, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !584, file: !585, line: 102, baseType: !192, size: 32, offset: 1376)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !584, file: !585, line: 102, baseType: !192, size: 32, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !584, file: !585, line: 103, baseType: !192, size: 32, offset: 1440)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !584, file: !585, line: 103, baseType: !192, size: 32, offset: 1472)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !584, file: !585, line: 103, baseType: !192, size: 32, offset: 1504)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !584, file: !585, line: 103, baseType: !192, size: 32, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !584, file: !585, line: 103, baseType: !192, size: 32, offset: 1568)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !584, file: !585, line: 104, baseType: !192, size: 32, offset: 1600)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !584, file: !585, line: 104, baseType: !192, size: 32, offset: 1632)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !584, file: !585, line: 104, baseType: !192, size: 32, offset: 1664)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !584, file: !585, line: 104, baseType: !192, size: 32, offset: 1696)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !584, file: !585, line: 104, baseType: !192, size: 32, offset: 1728)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !584, file: !585, line: 105, baseType: !192, size: 32, offset: 1760)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !584, file: !585, line: 108, baseType: !615, size: 704, offset: 1792)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !585, line: 53, size: 704, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !615, file: !585, line: 54, baseType: !192, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !615, file: !585, line: 55, baseType: !192, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !615, file: !585, line: 56, baseType: !192, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !615, file: !585, line: 57, baseType: !192, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !615, file: !585, line: 59, baseType: !191, size: 96, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !615, file: !585, line: 60, baseType: !191, size: 96, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !615, file: !585, line: 61, baseType: !191, size: 96, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !615, file: !585, line: 63, baseType: !192, size: 32, offset: 416)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !615, file: !585, line: 64, baseType: !192, size: 32, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !615, file: !585, line: 65, baseType: !192, size: 32, offset: 480)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !615, file: !585, line: 67, baseType: !48, size: 16, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !615, file: !585, line: 68, baseType: !48, size: 16, offset: 528)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !615, file: !585, line: 69, baseType: !48, size: 16, offset: 544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !615, file: !585, line: 70, baseType: !48, size: 16, offset: 560)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !615, file: !585, line: 72, baseType: !192, size: 32, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !615, file: !585, line: 73, baseType: !192, size: 32, offset: 608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !615, file: !585, line: 74, baseType: !192, size: 32, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !615, file: !585, line: 75, baseType: !192, size: 32, offset: 672)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !584, file: !585, line: 109, baseType: !636, size: 128, offset: 2496)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !585, line: 79, size: 128, elements: !637)
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !636, file: !585, line: 80, baseType: !22, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !636, file: !585, line: 81, baseType: !22, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !636, file: !585, line: 82, baseType: !22, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !636, file: !585, line: 83, baseType: !22, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !584, file: !585, line: 111, baseType: !192, size: 32, offset: 2624)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !584, file: !585, line: 111, baseType: !192, size: 32, offset: 2656)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !584, file: !585, line: 112, baseType: !192, size: 32, offset: 2688)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !584, file: !585, line: 112, baseType: !192, size: 32, offset: 2720)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !584, file: !585, line: 113, baseType: !192, size: 32, offset: 2752)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !584, file: !585, line: 114, baseType: !192, size: 32, offset: 2784)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !584, file: !585, line: 114, baseType: !192, size: 32, offset: 2816)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !584, file: !585, line: 115, baseType: !48, size: 16, offset: 2848)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !584, file: !585, line: 115, baseType: !48, size: 16, offset: 2864)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !584, file: !585, line: 116, baseType: !48, size: 16, offset: 2880)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !584, file: !585, line: 117, baseType: !14, size: 8, offset: 2896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !584, file: !585, line: 117, baseType: !14, size: 8, offset: 2904)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !584, file: !585, line: 119, baseType: !192, size: 32, offset: 2912)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !584, file: !585, line: 119, baseType: !192, size: 32, offset: 2944)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !584, file: !585, line: 120, baseType: !48, size: 16, offset: 2976)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !584, file: !585, line: 120, baseType: !48, size: 16, offset: 2992)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !584, file: !585, line: 121, baseType: !192, size: 32, offset: 3008)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !584, file: !585, line: 121, baseType: !192, size: 32, offset: 3040)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !584, file: !585, line: 122, baseType: !192, size: 32, offset: 3072)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !584, file: !585, line: 123, baseType: !192, size: 32, offset: 3104)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !584, file: !585, line: 124, baseType: !48, size: 16, offset: 3136)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !584, file: !585, line: 125, baseType: !48, size: 16, offset: 3152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !584, file: !585, line: 127, baseType: !22, size: 32, offset: 3168)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !584, file: !585, line: 127, baseType: !22, size: 32, offset: 3200)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !584, file: !585, line: 128, baseType: !22, size: 32, offset: 3232)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !584, file: !585, line: 128, baseType: !22, size: 32, offset: 3264)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !584, file: !585, line: 129, baseType: !48, size: 16, offset: 3296)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !584, file: !585, line: 129, baseType: !48, size: 16, offset: 3312)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !584, file: !585, line: 129, baseType: !48, size: 16, offset: 3328)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !584, file: !585, line: 129, baseType: !48, size: 16, offset: 3344)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !584, file: !585, line: 130, baseType: !192, size: 32, offset: 3360)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !584, file: !585, line: 130, baseType: !192, size: 32, offset: 3392)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !584, file: !585, line: 130, baseType: !192, size: 32, offset: 3424)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !584, file: !585, line: 130, baseType: !192, size: 32, offset: 3456)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !584, file: !585, line: 131, baseType: !192, size: 32, offset: 3488)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !584, file: !585, line: 131, baseType: !192, size: 32, offset: 3520)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !584, file: !585, line: 131, baseType: !192, size: 32, offset: 3552)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !584, file: !585, line: 131, baseType: !192, size: 32, offset: 3584)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !584, file: !585, line: 132, baseType: !192, size: 32, offset: 3616)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !584, file: !585, line: 132, baseType: !192, size: 32, offset: 3648)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !584, file: !585, line: 133, baseType: !33, size: 512, offset: 3680)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !584, file: !585, line: 135, baseType: !192, size: 32, offset: 4192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !584, file: !585, line: 136, baseType: !192, size: 32, offset: 4224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !584, file: !585, line: 137, baseType: !192, size: 32, offset: 4256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !584, file: !585, line: 138, baseType: !22, size: 32, offset: 4288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !584, file: !585, line: 141, baseType: !14, size: 8, offset: 4320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !584, file: !585, line: 141, baseType: !14, size: 8, offset: 4328)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !584, file: !585, line: 141, baseType: !14, size: 8, offset: 4336)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !584, file: !585, line: 141, baseType: !14, size: 8, offset: 4344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !584, file: !585, line: 142, baseType: !48, size: 16, offset: 4352)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !584, file: !585, line: 142, baseType: !48, size: 16, offset: 4368)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !584, file: !585, line: 142, baseType: !48, size: 16, offset: 4384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !584, file: !585, line: 145, baseType: !14, size: 8, offset: 4400)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !584, file: !585, line: 145, baseType: !14, size: 8, offset: 4408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !584, file: !585, line: 148, baseType: !48, size: 16, offset: 4416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !584, file: !585, line: 148, baseType: !48, size: 16, offset: 4432)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !584, file: !585, line: 149, baseType: !192, size: 32, offset: 4448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !584, file: !585, line: 149, baseType: !192, size: 32, offset: 4480)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !584, file: !585, line: 152, baseType: !701, size: 128, offset: 4512)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 4)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !584, file: !585, line: 153, baseType: !192, size: 32, offset: 4640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !584, file: !585, line: 154, baseType: !192, size: 32, offset: 4672)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !584, file: !585, line: 157, baseType: !48, size: 16, offset: 4704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !584, file: !585, line: 157, baseType: !48, size: 16, offset: 4720)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !584, file: !585, line: 160, baseType: !709, size: 64, offset: 4736)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !711, line: 113, size: 6208, elements: !712)
!711 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!712 = !{!713, !714, !715, !716, !717, !718, !722}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !710, file: !711, line: 114, baseType: !48, size: 16)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !710, file: !711, line: 114, baseType: !48, size: 16, offset: 16)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !710, file: !711, line: 115, baseType: !14, size: 8, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !710, file: !711, line: 115, baseType: !14, size: 8, offset: 40)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !710, file: !711, line: 116, baseType: !14, size: 8, offset: 48)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !710, file: !711, line: 117, baseType: !719, size: 8, offset: 56)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 1)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !710, file: !711, line: 119, baseType: !723, size: 6144, offset: 64)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 6144, elements: !733)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !711, line: 109, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !711, line: 106, size: 192, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !725, file: !711, line: 107, baseType: !192, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !725, file: !711, line: 107, baseType: !192, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !725, file: !711, line: 107, baseType: !192, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !725, file: !711, line: 107, baseType: !192, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !725, file: !711, line: 107, baseType: !192, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !725, file: !711, line: 108, baseType: !22, size: 32, offset: 160)
!733 = !{!734}
!734 = !DISubrange(count: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !584, file: !585, line: 161, baseType: !709, size: 64, offset: 4800)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !584, file: !585, line: 162, baseType: !14, size: 8, offset: 4864)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !584, file: !585, line: 162, baseType: !14, size: 8, offset: 4872)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !584, file: !585, line: 163, baseType: !14, size: 8, offset: 4880)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !584, file: !585, line: 163, baseType: !14, size: 8, offset: 4888)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !584, file: !585, line: 164, baseType: !48, size: 16, offset: 4896)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !584, file: !585, line: 164, baseType: !48, size: 16, offset: 4912)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !584, file: !585, line: 165, baseType: !192, size: 32, offset: 4928)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !584, file: !585, line: 165, baseType: !192, size: 32, offset: 4960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !584, file: !585, line: 167, baseType: !745, size: 1152, offset: 4992)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 1152, elements: !1294)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !711, line: 57, size: 2496, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !747, file: !711, line: 59, baseType: !48, size: 16)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !747, file: !711, line: 59, baseType: !48, size: 16, offset: 16)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !747, file: !711, line: 59, baseType: !48, size: 16, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !747, file: !711, line: 59, baseType: !48, size: 16, offset: 48)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !747, file: !711, line: 60, baseType: !164, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !747, file: !711, line: 61, baseType: !755, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !711, line: 202, size: 3328, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !827, !901, !902, !1042, !1043, !1135, !1136, !1204, !1225, !1233, !1234}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !756, file: !711, line: 203, baseType: !114, size: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !756, file: !711, line: 204, baseType: !160, size: 64, offset: 960)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !756, file: !711, line: 206, baseType: !192, size: 32, offset: 1024)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !756, file: !711, line: 206, baseType: !192, size: 32, offset: 1056)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !756, file: !711, line: 207, baseType: !192, size: 32, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !756, file: !711, line: 207, baseType: !192, size: 32, offset: 1120)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !756, file: !711, line: 207, baseType: !192, size: 32, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !756, file: !711, line: 207, baseType: !192, size: 32, offset: 1184)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !756, file: !711, line: 207, baseType: !192, size: 32, offset: 1216)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !756, file: !711, line: 207, baseType: !192, size: 32, offset: 1248)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !756, file: !711, line: 208, baseType: !192, size: 32, offset: 1280)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !756, file: !711, line: 208, baseType: !192, size: 32, offset: 1312)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !756, file: !711, line: 211, baseType: !192, size: 32, offset: 1344)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !756, file: !711, line: 211, baseType: !192, size: 32, offset: 1376)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !756, file: !711, line: 211, baseType: !192, size: 32, offset: 1408)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !756, file: !711, line: 211, baseType: !192, size: 32, offset: 1440)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !756, file: !711, line: 211, baseType: !192, size: 32, offset: 1472)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !756, file: !711, line: 214, baseType: !192, size: 32, offset: 1504)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !756, file: !711, line: 214, baseType: !192, size: 32, offset: 1536)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !756, file: !711, line: 217, baseType: !192, size: 32, offset: 1568)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !756, file: !711, line: 218, baseType: !192, size: 32, offset: 1600)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !756, file: !711, line: 219, baseType: !192, size: 32, offset: 1632)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !756, file: !711, line: 220, baseType: !192, size: 32, offset: 1664)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !756, file: !711, line: 221, baseType: !192, size: 32, offset: 1696)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !756, file: !711, line: 222, baseType: !48, size: 16, offset: 1728)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !756, file: !711, line: 222, baseType: !48, size: 16, offset: 1744)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !756, file: !711, line: 224, baseType: !48, size: 16, offset: 1760)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !756, file: !711, line: 224, baseType: !48, size: 16, offset: 1776)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !756, file: !711, line: 227, baseType: !48, size: 16, offset: 1792)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !756, file: !711, line: 227, baseType: !48, size: 16, offset: 1808)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !756, file: !711, line: 229, baseType: !48, size: 16, offset: 1824)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !756, file: !711, line: 229, baseType: !48, size: 16, offset: 1840)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !711, line: 230, baseType: !48, size: 16, offset: 1856)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !756, file: !711, line: 230, baseType: !48, size: 16, offset: 1872)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !756, file: !711, line: 232, baseType: !192, size: 32, offset: 1888)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !756, file: !711, line: 232, baseType: !192, size: 32, offset: 1920)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !756, file: !711, line: 232, baseType: !192, size: 32, offset: 1952)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !756, file: !711, line: 232, baseType: !192, size: 32, offset: 1984)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !756, file: !711, line: 233, baseType: !22, size: 32, offset: 2016)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !756, file: !711, line: 234, baseType: !22, size: 32, offset: 2048)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !756, file: !711, line: 235, baseType: !48, size: 16, offset: 2080)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !756, file: !711, line: 235, baseType: !48, size: 16, offset: 2096)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !756, file: !711, line: 236, baseType: !48, size: 16, offset: 2112)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !756, file: !711, line: 239, baseType: !48, size: 16, offset: 2128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !756, file: !711, line: 240, baseType: !22, size: 32, offset: 2144)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !756, file: !711, line: 241, baseType: !22, size: 32, offset: 2176)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !756, file: !711, line: 241, baseType: !22, size: 32, offset: 2208)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !756, file: !711, line: 241, baseType: !22, size: 32, offset: 2240)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !756, file: !711, line: 243, baseType: !192, size: 32, offset: 2272)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !756, file: !711, line: 243, baseType: !192, size: 32, offset: 2304)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !756, file: !711, line: 244, baseType: !192, size: 32, offset: 2336)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !756, file: !711, line: 246, baseType: !810, size: 320, offset: 2368)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !811, line: 50, size: 320, elements: !812)
!811 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !810, file: !811, line: 51, baseType: !154, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !810, file: !811, line: 53, baseType: !22, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !810, file: !811, line: 54, baseType: !22, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !810, file: !811, line: 55, baseType: !22, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !810, file: !811, line: 55, baseType: !22, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !810, file: !811, line: 56, baseType: !14, size: 8, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !810, file: !811, line: 56, baseType: !14, size: 8, offset: 200)
