; ModuleID = 'blender/source/blender/modifiers/intern/MOD_armature.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_armature.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!53 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eArmature_DeformFlag", file: !61, line: 152, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67}
!63 = !DIEnumerator(name: "ARM_DEF_VGROUP", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "ARM_DEF_ENVELOPE", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "ARM_DEF_QUATERNION", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "ARM_DEF_B_BONE_REST", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "ARM_DEF_INVERT_VGROUP", value: 16, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 76, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!71 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!112 = !{!113, !747, !986}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ArmatureModifierData", file: !115, line: 535, baseType: !116)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArmatureModifierData", file: !115, line: 527, size: 1600, elements: !117)
!117 = !{!118, !141, !143, !144, !145, !984, !985}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !116, file: !115, line: 528, baseType: !119, size: 896)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !115, line: 110, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !115, line: 99, size: 896, elements: !121)
!121 = !{!122, !124, !125, !127, !128, !129, !130, !135, !139}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !115, line: 100, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !115, line: 100, baseType: !123, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !115, line: 102, baseType: !126, size: 32, offset: 128)
!126 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !120, file: !115, line: 102, baseType: !126, size: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !120, file: !115, line: 103, baseType: !126, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !120, file: !115, line: 103, baseType: !126, size: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !115, line: 104, baseType: !131, size: 512, offset: 256)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 512, elements: !133)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !{!134}
!134 = !DISubrange(count: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !120, file: !115, line: 107, baseType: !136, size: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !138, line: 40, flags: DIFlagFwdDecl)
!138 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !120, file: !115, line: 109, baseType: !140, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !116, file: !115, line: 530, baseType: !142, size: 16, offset: 896)
!142 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !116, file: !115, line: 530, baseType: !142, size: 16, offset: 912)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !116, file: !115, line: 531, baseType: !126, size: 32, offset: 928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !116, file: !115, line: 532, baseType: !146, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !148, line: 115, size: 11392, elements: !149)
!148 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!149 = !{!150, !216, !219, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !237, !249, !263, !264, !307, !308, !311, !312, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !353, !354, !355, !356, !357, !358, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !418, !419, !420, !421, !422, !423, !424, !425, !426, !429, !432, !435, !436, !437, !438, !439, !442, !445, !931, !932, !938, !939, !940, !941, !942, !943, !945, !948, !951, !953, !972, !973}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !148, line: 116, baseType: !151, size: 960)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !152, line: 130, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !152, line: 117, size: 960, elements: !154)
!154 = !{!155, !157, !158, !160, !179, !183, !184, !185, !186, !187}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !152, line: 118, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !152, line: 118, baseType: !156, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !153, file: !152, line: 119, baseType: !159, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !153, file: !152, line: 120, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !152, line: 136, size: 17600, elements: !163)
!163 = !{!164, !165, !167, !170, !174, !175, !176}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !152, line: 137, baseType: !151, size: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !162, file: !152, line: 138, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !162, file: !152, line: 139, baseType: !168, size: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !152, line: 43, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !152, line: 140, baseType: !171, size: 8192, offset: 1088)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8192, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !162, file: !152, line: 141, baseType: !171, size: 8192, offset: 9280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !162, file: !152, line: 148, baseType: !161, size: 64, offset: 17472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !162, file: !152, line: 150, baseType: !177, size: 64, offset: 17536)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !152, line: 45, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !152, line: 121, baseType: !180, size: 528, offset: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 528, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 66)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !152, line: 126, baseType: !142, size: 16, offset: 784)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !153, file: !152, line: 127, baseType: !126, size: 32, offset: 800)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !153, file: !152, line: 128, baseType: !126, size: 32, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !153, file: !152, line: 128, baseType: !126, size: 32, offset: 864)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !153, file: !152, line: 129, baseType: !188, size: 64, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !152, line: 75, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !152, line: 62, size: 1024, elements: !191)
!191 = !{!192, !194, !195, !196, !197, !198, !199, !200, !214, !215}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !152, line: 63, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !152, line: 63, baseType: !193, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !152, line: 64, baseType: !132, size: 8, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !190, file: !152, line: 64, baseType: !132, size: 8, offset: 136)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !152, line: 65, baseType: !142, size: 16, offset: 144)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !152, line: 66, baseType: !131, size: 512, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !190, file: !152, line: 67, baseType: !126, size: 32, offset: 672)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !152, line: 69, baseType: !201, size: 256, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !152, line: 60, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !152, line: 48, size: 256, elements: !203)
!203 = !{!204, !205, !212, !213}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !202, file: !152, line: 49, baseType: !156, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !202, file: !152, line: 58, baseType: !206, size: 128, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !207, line: 71, baseType: !208)
!207 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !207, line: 69, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !208, file: !207, line: 70, baseType: !156, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !208, file: !207, line: 70, baseType: !156, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !202, file: !152, line: 59, baseType: !126, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !202, file: !152, line: 59, baseType: !126, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !190, file: !152, line: 70, baseType: !126, size: 32, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !190, file: !152, line: 74, baseType: !126, size: 32, offset: 992)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !147, file: !148, line: 117, baseType: !217, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !61, line: 37, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !147, file: !148, line: 119, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !148, line: 57, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !148, line: 121, baseType: !142, size: 16, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !147, file: !148, line: 121, baseType: !142, size: 16, offset: 1104)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !147, file: !148, line: 122, baseType: !126, size: 32, offset: 1120)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !147, file: !148, line: 122, baseType: !126, size: 32, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !147, file: !148, line: 122, baseType: !126, size: 32, offset: 1184)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !147, file: !148, line: 123, baseType: !131, size: 512, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !148, line: 124, baseType: !146, size: 64, offset: 1728)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !147, file: !148, line: 124, baseType: !146, size: 64, offset: 1792)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !147, file: !148, line: 127, baseType: !146, size: 64, offset: 1856)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !147, file: !148, line: 127, baseType: !146, size: 64, offset: 1920)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !147, file: !148, line: 127, baseType: !146, size: 64, offset: 1984)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !147, file: !148, line: 128, baseType: !234, size: 64, offset: 2048)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !236, line: 46, flags: DIFlagFwdDecl)
!236 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !147, file: !148, line: 130, baseType: !238, size: 64, offset: 2112)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !148, line: 97, size: 832, elements: !240)
!240 = !{!241, !247, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !239, file: !148, line: 98, baseType: !242, size: 768)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 768, elements: !244)
!243 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!244 = !{!245, !246}
!245 = !DISubrange(count: 8)
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !148, line: 99, baseType: !126, size: 32, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !239, file: !148, line: 99, baseType: !126, size: 32, offset: 800)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !147, file: !148, line: 131, baseType: !250, size: 64, offset: 2176)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !252, line: 486, size: 1600, elements: !253)
!252 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !251, file: !252, line: 487, baseType: !151, size: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !251, file: !252, line: 489, baseType: !206, size: 128, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !251, file: !252, line: 490, baseType: !206, size: 128, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !251, file: !252, line: 491, baseType: !206, size: 128, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !251, file: !252, line: 492, baseType: !206, size: 128, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !252, line: 494, baseType: !126, size: 32, offset: 1472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !251, file: !252, line: 495, baseType: !126, size: 32, offset: 1504)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !251, file: !252, line: 497, baseType: !126, size: 32, offset: 1536)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !251, file: !252, line: 498, baseType: !126, size: 32, offset: 1568)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !147, file: !148, line: 132, baseType: !250, size: 64, offset: 2240)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !147, file: !148, line: 133, baseType: !265, size: 64, offset: 2304)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !252, line: 334, size: 1728, elements: !267)
!267 = !{!268, !269, !272, !273, !274, !275, !276, !277, !280, !281, !282, !283, !284, !285, !286, !306}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !266, file: !252, line: 335, baseType: !206, size: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !266, file: !252, line: 336, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !252, line: 47, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !252, line: 338, baseType: !142, size: 16, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !266, file: !252, line: 338, baseType: !142, size: 16, offset: 208)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !266, file: !252, line: 339, baseType: !7, size: 32, offset: 224)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !266, file: !252, line: 340, baseType: !126, size: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !266, file: !252, line: 342, baseType: !243, size: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !266, file: !252, line: 343, baseType: !278, size: 96, offset: 320)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 96, elements: !279)
!279 = !{!246}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !266, file: !252, line: 344, baseType: !278, size: 96, offset: 416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !266, file: !252, line: 347, baseType: !206, size: 128, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !266, file: !252, line: 349, baseType: !126, size: 32, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !266, file: !252, line: 350, baseType: !126, size: 32, offset: 672)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !266, file: !252, line: 351, baseType: !156, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !266, file: !252, line: 352, baseType: !156, size: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !266, file: !252, line: 354, baseType: !287, size: 384, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !252, line: 116, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !252, line: 94, size: 384, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !288, file: !252, line: 96, baseType: !126, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !288, file: !252, line: 96, baseType: !126, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !288, file: !252, line: 97, baseType: !126, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !288, file: !252, line: 97, baseType: !126, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !288, file: !252, line: 99, baseType: !142, size: 16, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !288, file: !252, line: 100, baseType: !142, size: 16, offset: 144)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !288, file: !252, line: 102, baseType: !142, size: 16, offset: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !288, file: !252, line: 105, baseType: !142, size: 16, offset: 176)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !288, file: !252, line: 108, baseType: !142, size: 16, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !288, file: !252, line: 109, baseType: !142, size: 16, offset: 208)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !288, file: !252, line: 111, baseType: !142, size: 16, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !288, file: !252, line: 112, baseType: !142, size: 16, offset: 240)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !288, file: !252, line: 114, baseType: !126, size: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !288, file: !252, line: 114, baseType: !126, size: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !288, file: !252, line: 115, baseType: !126, size: 32, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !288, file: !252, line: 115, baseType: !126, size: 32, offset: 352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !266, file: !252, line: 355, baseType: !131, size: 512, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !148, line: 134, baseType: !156, size: 64, offset: 2368)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !147, file: !148, line: 136, baseType: !309, size: 64, offset: 2432)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !148, line: 58, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !147, file: !148, line: 138, baseType: !287, size: 384, offset: 2496)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !147, file: !148, line: 139, baseType: !313, size: 64, offset: 2880)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !252, line: 80, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !252, line: 72, size: 192, elements: !316)
!316 = !{!317, !324, !325, !326, !327}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !315, file: !252, line: 73, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !252, line: 59, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !252, line: 56, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !320, file: !252, line: 57, baseType: !278, size: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !252, line: 58, baseType: !126, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !315, file: !252, line: 74, baseType: !126, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !315, file: !252, line: 76, baseType: !126, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !315, file: !252, line: 77, baseType: !126, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !252, line: 79, baseType: !126, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !147, file: !148, line: 141, baseType: !206, size: 128, offset: 2944)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !147, file: !148, line: 142, baseType: !206, size: 128, offset: 3072)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !147, file: !148, line: 143, baseType: !206, size: 128, offset: 3200)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !147, file: !148, line: 144, baseType: !206, size: 128, offset: 3328)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !147, file: !148, line: 146, baseType: !126, size: 32, offset: 3456)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !147, file: !148, line: 147, baseType: !126, size: 32, offset: 3488)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !147, file: !148, line: 150, baseType: !335, size: 64, offset: 3520)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !148, line: 50, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !147, file: !148, line: 151, baseType: !140, size: 64, offset: 3584)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !147, file: !148, line: 152, baseType: !126, size: 32, offset: 3648)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !147, file: !148, line: 153, baseType: !126, size: 32, offset: 3680)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !147, file: !148, line: 156, baseType: !278, size: 96, offset: 3712)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !147, file: !148, line: 156, baseType: !278, size: 96, offset: 3808)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !147, file: !148, line: 156, baseType: !278, size: 96, offset: 3904)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !147, file: !148, line: 157, baseType: !278, size: 96, offset: 4000)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !147, file: !148, line: 158, baseType: !278, size: 96, offset: 4096)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !147, file: !148, line: 159, baseType: !278, size: 96, offset: 4192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !147, file: !148, line: 160, baseType: !278, size: 96, offset: 4288)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !147, file: !148, line: 160, baseType: !278, size: 96, offset: 4384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !147, file: !148, line: 161, baseType: !350, size: 128, offset: 4480)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 128, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 4)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !147, file: !148, line: 161, baseType: !350, size: 128, offset: 4608)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !147, file: !148, line: 162, baseType: !278, size: 96, offset: 4736)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !147, file: !148, line: 162, baseType: !278, size: 96, offset: 4832)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !147, file: !148, line: 163, baseType: !243, size: 32, offset: 4928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !147, file: !148, line: 163, baseType: !243, size: 32, offset: 4960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !147, file: !148, line: 164, baseType: !359, size: 512, offset: 4992)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 512, elements: !360)
!360 = !{!352, !352}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !147, file: !148, line: 165, baseType: !359, size: 512, offset: 5504)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !147, file: !148, line: 166, baseType: !359, size: 512, offset: 6016)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !147, file: !148, line: 167, baseType: !359, size: 512, offset: 6528)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !147, file: !148, line: 176, baseType: !359, size: 512, offset: 7040)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !147, file: !148, line: 178, baseType: !7, size: 32, offset: 7552)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !148, line: 180, baseType: !142, size: 16, offset: 7584)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !147, file: !148, line: 181, baseType: !142, size: 16, offset: 7600)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !147, file: !148, line: 183, baseType: !142, size: 16, offset: 7616)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !147, file: !148, line: 183, baseType: !142, size: 16, offset: 7632)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !147, file: !148, line: 184, baseType: !142, size: 16, offset: 7648)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !147, file: !148, line: 184, baseType: !142, size: 16, offset: 7664)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !147, file: !148, line: 185, baseType: !142, size: 16, offset: 7680)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !147, file: !148, line: 186, baseType: !142, size: 16, offset: 7696)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !147, file: !148, line: 187, baseType: !142, size: 16, offset: 7712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !147, file: !148, line: 188, baseType: !132, size: 8, offset: 7728)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !147, file: !148, line: 189, baseType: !132, size: 8, offset: 7736)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !147, file: !148, line: 192, baseType: !126, size: 32, offset: 7744)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !147, file: !148, line: 192, baseType: !126, size: 32, offset: 7776)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !147, file: !148, line: 192, baseType: !126, size: 32, offset: 7808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !147, file: !148, line: 192, baseType: !126, size: 32, offset: 7840)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !147, file: !148, line: 194, baseType: !126, size: 32, offset: 7872)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !147, file: !148, line: 202, baseType: !243, size: 32, offset: 7904)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !147, file: !148, line: 202, baseType: !243, size: 32, offset: 7936)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !147, file: !148, line: 202, baseType: !243, size: 32, offset: 7968)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !147, file: !148, line: 211, baseType: !243, size: 32, offset: 8000)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !147, file: !148, line: 212, baseType: !243, size: 32, offset: 8032)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !147, file: !148, line: 213, baseType: !243, size: 32, offset: 8064)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !147, file: !148, line: 214, baseType: !243, size: 32, offset: 8096)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !147, file: !148, line: 215, baseType: !243, size: 32, offset: 8128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !147, file: !148, line: 216, baseType: !243, size: 32, offset: 8160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !147, file: !148, line: 219, baseType: !243, size: 32, offset: 8192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !147, file: !148, line: 220, baseType: !243, size: 32, offset: 8224)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !147, file: !148, line: 221, baseType: !243, size: 32, offset: 8256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !147, file: !148, line: 224, baseType: !395, size: 16, offset: 8288)
!395 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !147, file: !148, line: 224, baseType: !395, size: 16, offset: 8304)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !147, file: !148, line: 226, baseType: !142, size: 16, offset: 8320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !147, file: !148, line: 228, baseType: !132, size: 8, offset: 8336)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !147, file: !148, line: 229, baseType: !132, size: 8, offset: 8344)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !147, file: !148, line: 231, baseType: !142, size: 16, offset: 8352)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !147, file: !148, line: 232, baseType: !132, size: 8, offset: 8368)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !147, file: !148, line: 233, baseType: !132, size: 8, offset: 8376)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !147, file: !148, line: 234, baseType: !243, size: 32, offset: 8384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !147, file: !148, line: 235, baseType: !243, size: 32, offset: 8416)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !147, file: !148, line: 237, baseType: !206, size: 128, offset: 8448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !147, file: !148, line: 238, baseType: !206, size: 128, offset: 8576)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !147, file: !148, line: 239, baseType: !206, size: 128, offset: 8704)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !147, file: !148, line: 240, baseType: !206, size: 128, offset: 8832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !147, file: !148, line: 242, baseType: !243, size: 32, offset: 8960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !147, file: !148, line: 244, baseType: !142, size: 16, offset: 8992)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !147, file: !148, line: 245, baseType: !395, size: 16, offset: 9008)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !147, file: !148, line: 246, baseType: !350, size: 128, offset: 9024)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !147, file: !148, line: 248, baseType: !126, size: 32, offset: 9152)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !147, file: !148, line: 249, baseType: !126, size: 32, offset: 9184)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !147, file: !148, line: 251, baseType: !416, size: 64, offset: 9216)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !148, line: 251, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !147, file: !148, line: 253, baseType: !132, size: 8, offset: 9280)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !147, file: !148, line: 254, baseType: !132, size: 8, offset: 9288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !147, file: !148, line: 255, baseType: !142, size: 16, offset: 9296)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !147, file: !148, line: 256, baseType: !278, size: 96, offset: 9312)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !147, file: !148, line: 258, baseType: !206, size: 128, offset: 9408)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !147, file: !148, line: 259, baseType: !206, size: 128, offset: 9536)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !147, file: !148, line: 260, baseType: !206, size: 128, offset: 9664)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !147, file: !148, line: 261, baseType: !206, size: 128, offset: 9792)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !147, file: !148, line: 263, baseType: !427, size: 64, offset: 9920)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !148, line: 52, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !147, file: !148, line: 264, baseType: !430, size: 64, offset: 9984)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !148, line: 53, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !147, file: !148, line: 265, baseType: !433, size: 64, offset: 10048)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !252, line: 46, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !147, file: !148, line: 267, baseType: !132, size: 8, offset: 10112)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !147, file: !148, line: 268, baseType: !132, size: 8, offset: 10120)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !147, file: !148, line: 269, baseType: !142, size: 16, offset: 10128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !147, file: !148, line: 270, baseType: !243, size: 32, offset: 10144)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !147, file: !148, line: 272, baseType: !440, size: 64, offset: 10176)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !148, line: 54, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !147, file: !148, line: 275, baseType: !443, size: 64, offset: 10240)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !148, line: 275, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !147, file: !148, line: 277, baseType: !446, size: 64, offset: 10304)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !448)
!448 = !{!449, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !500, !503, !505, !506, !508, !509, !510, !511, !517, !522, !523, !527, !528, !529, !530, !531, !544, !556, !570, !574, !578, !582, !591, !603, !607, !611, !615, !619, !623, !624, !625, !626, !627, !628, !632, !633, !634, !635, !639, !640, !641, !642, !643, !648, !649, !650, !651, !652, !656, !657, !658, !659, !660, !667, !678, !683, !689, !699, !705, !716, !723, !730, !734, !739, !743, !748, !749, !750, !757, !763, !764, !765, !770, !771, !780, !888, !892, !900, !904, !908, !912, !920, !930}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !447, file: !28, line: 180, baseType: !450, size: 1600)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !69, line: 73, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !69, line: 64, size: 1600, elements: !452)
!452 = !{!453, !468, !472, !473, !474, !475, !478}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !451, file: !69, line: 65, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !69, line: 53, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !69, line: 42, size: 832, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !456, file: !69, line: 43, baseType: !126, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !456, file: !69, line: 44, baseType: !126, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !456, file: !69, line: 45, baseType: !126, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !456, file: !69, line: 46, baseType: !126, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !456, file: !69, line: 47, baseType: !126, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !456, file: !69, line: 48, baseType: !126, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !456, file: !69, line: 49, baseType: !126, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !456, file: !69, line: 50, baseType: !126, size: 32, offset: 224)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !69, line: 51, baseType: !131, size: 512, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !456, file: !69, line: 52, baseType: !156, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !451, file: !69, line: 66, baseType: !469, size: 1312, offset: 64)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1312, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 41)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !451, file: !69, line: 69, baseType: !126, size: 32, offset: 1376)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !451, file: !69, line: 69, baseType: !126, size: 32, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !451, file: !69, line: 70, baseType: !126, size: 32, offset: 1440)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !451, file: !69, line: 71, baseType: !476, size: 64, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !69, line: 71, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !451, file: !69, line: 72, baseType: !479, size: 64, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !69, line: 59, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !69, line: 57, size: 8192, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !481, file: !69, line: 58, baseType: !171, size: 8192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !447, file: !28, line: 180, baseType: !450, size: 1600, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !447, file: !28, line: 180, baseType: !450, size: 1600, offset: 3200)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !447, file: !28, line: 180, baseType: !450, size: 1600, offset: 4800)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !447, file: !28, line: 180, baseType: !450, size: 1600, offset: 6400)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !447, file: !28, line: 181, baseType: !126, size: 32, offset: 8000)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !447, file: !28, line: 181, baseType: !126, size: 32, offset: 8032)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !447, file: !28, line: 181, baseType: !126, size: 32, offset: 8064)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !447, file: !28, line: 181, baseType: !126, size: 32, offset: 8096)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !447, file: !28, line: 181, baseType: !126, size: 32, offset: 8128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !447, file: !28, line: 182, baseType: !126, size: 32, offset: 8160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !447, file: !28, line: 183, baseType: !126, size: 32, offset: 8192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !447, file: !28, line: 184, baseType: !496, size: 64, offset: 8256)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !497, line: 124, baseType: !498)
!497 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !497, line: 124, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !447, file: !28, line: 185, baseType: !501, size: 64, offset: 8320)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !447, file: !28, line: 186, baseType: !504, size: 32, offset: 8384)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !447, file: !28, line: 187, baseType: !243, size: 32, offset: 8416)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !447, file: !28, line: 188, baseType: !507, size: 32, offset: 8448)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !447, file: !28, line: 189, baseType: !126, size: 32, offset: 8480)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !447, file: !28, line: 190, baseType: !335, size: 64, offset: 8512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !447, file: !28, line: 193, baseType: !132, size: 8, offset: 8576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !447, file: !28, line: 196, baseType: !512, size: 64, offset: 8640)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !447)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !447, file: !28, line: 199, baseType: !518, size: 64, offset: 8704)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !515, !521}
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !447, file: !28, line: 202, baseType: !512, size: 64, offset: 8768)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !447, file: !28, line: 207, baseType: !524, size: 64, offset: 8832)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!126, !515}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !447, file: !28, line: 208, baseType: !524, size: 64, offset: 8896)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !447, file: !28, line: 209, baseType: !524, size: 64, offset: 8960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !447, file: !28, line: 210, baseType: !524, size: 64, offset: 9024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !447, file: !28, line: 211, baseType: !524, size: 64, offset: 9088)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !447, file: !28, line: 218, baseType: !532, size: 64, offset: 9152)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !515, !126, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !537, line: 65, size: 160, elements: !538)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !{!539, !540, !542, !543}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !536, file: !537, line: 66, baseType: !278, size: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !536, file: !537, line: 67, baseType: !541, size: 48, offset: 96)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 48, elements: !279)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !537, line: 68, baseType: !132, size: 8, offset: 144)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !536, file: !537, line: 68, baseType: !132, size: 8, offset: 152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !447, file: !28, line: 219, baseType: !545, size: 64, offset: 9216)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !515, !126, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !537, line: 48, size: 96, elements: !550)
!550 = !{!551, !552, !553, !554, !555}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !549, file: !537, line: 49, baseType: !7, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !549, file: !537, line: 49, baseType: !7, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !549, file: !537, line: 50, baseType: !132, size: 8, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !549, file: !537, line: 50, baseType: !132, size: 8, offset: 72)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !549, file: !537, line: 51, baseType: !142, size: 16, offset: 80)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !447, file: !28, line: 220, baseType: !557, size: 64, offset: 9280)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !515, !126, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !537, line: 42, size: 160, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !561, file: !537, line: 43, baseType: !7, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !561, file: !537, line: 43, baseType: !7, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !561, file: !537, line: 43, baseType: !7, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !561, file: !537, line: 43, baseType: !7, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !561, file: !537, line: 44, baseType: !142, size: 16, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !561, file: !537, line: 45, baseType: !132, size: 8, offset: 144)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !537, line: 45, baseType: !132, size: 8, offset: 152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !447, file: !28, line: 227, baseType: !571, size: 64, offset: 9344)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!535, !515}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !447, file: !28, line: 228, baseType: !575, size: 64, offset: 9408)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!548, !515}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !447, file: !28, line: 229, baseType: !579, size: 64, offset: 9472)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!560, !515}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !447, file: !28, line: 230, baseType: !583, size: 64, offset: 9536)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!586, !515}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !537, line: 88, size: 64, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !587, file: !537, line: 89, baseType: !7, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !587, file: !537, line: 90, baseType: !7, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !447, file: !28, line: 231, baseType: !592, size: 64, offset: 9600)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !515}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !537, line: 79, size: 96, elements: !597)
!597 = !{!598, !599, !600, !601, !602}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !596, file: !537, line: 81, baseType: !126, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !596, file: !537, line: 82, baseType: !126, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !596, file: !537, line: 83, baseType: !142, size: 16, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !596, file: !537, line: 84, baseType: !132, size: 8, offset: 80)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !596, file: !537, line: 84, baseType: !132, size: 8, offset: 88)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !447, file: !28, line: 236, baseType: !604, size: 64, offset: 9664)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !515, !535}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !447, file: !28, line: 237, baseType: !608, size: 64, offset: 9728)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !515, !548}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !447, file: !28, line: 238, baseType: !612, size: 64, offset: 9792)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !515, !560}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !447, file: !28, line: 239, baseType: !616, size: 64, offset: 9856)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !515, !586}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !447, file: !28, line: 240, baseType: !620, size: 64, offset: 9920)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !515, !595}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !447, file: !28, line: 245, baseType: !571, size: 64, offset: 9984)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !447, file: !28, line: 246, baseType: !575, size: 64, offset: 10048)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !447, file: !28, line: 247, baseType: !579, size: 64, offset: 10112)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !447, file: !28, line: 248, baseType: !583, size: 64, offset: 10176)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !447, file: !28, line: 249, baseType: !592, size: 64, offset: 10240)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !447, file: !28, line: 255, baseType: !629, size: 64, offset: 10304)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!156, !515, !126, !126}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !447, file: !28, line: 256, baseType: !629, size: 64, offset: 10368)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !447, file: !28, line: 257, baseType: !629, size: 64, offset: 10432)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !447, file: !28, line: 258, baseType: !629, size: 64, offset: 10496)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !447, file: !28, line: 264, baseType: !636, size: 64, offset: 10560)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!156, !515, !126}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !447, file: !28, line: 265, baseType: !636, size: 64, offset: 10624)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !447, file: !28, line: 266, baseType: !636, size: 64, offset: 10688)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !447, file: !28, line: 267, baseType: !636, size: 64, offset: 10752)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !447, file: !28, line: 268, baseType: !636, size: 64, offset: 10816)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !447, file: !28, line: 272, baseType: !644, size: 64, offset: 10880)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!647, !515}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !447, file: !28, line: 273, baseType: !644, size: 64, offset: 10944)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !447, file: !28, line: 274, baseType: !644, size: 64, offset: 11008)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !447, file: !28, line: 275, baseType: !644, size: 64, offset: 11072)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !447, file: !28, line: 276, baseType: !644, size: 64, offset: 11136)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !447, file: !28, line: 279, baseType: !653, size: 64, offset: 11200)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !515, !126, !647, !126}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !447, file: !28, line: 280, baseType: !653, size: 64, offset: 11264)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !447, file: !28, line: 281, baseType: !653, size: 64, offset: 11328)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !447, file: !28, line: 284, baseType: !524, size: 64, offset: 11392)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !447, file: !28, line: 285, baseType: !524, size: 64, offset: 11456)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !447, file: !28, line: 286, baseType: !661, size: 64, offset: 11520)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!664, !515}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !447, file: !28, line: 287, baseType: !668, size: 64, offset: 11584)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!671, !515}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !674)
!674 = !{!675, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !673, file: !28, line: 118, baseType: !676, size: 128)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !351)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !673, file: !28, line: 119, baseType: !676, size: 128, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !447, file: !28, line: 288, baseType: !679, size: 64, offset: 11648)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!682, !515}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !447, file: !28, line: 289, baseType: !684, size: 64, offset: 11712)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !515, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !447, file: !28, line: 290, baseType: !690, size: 64, offset: 11776)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!693, !515}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !695, file: !28, line: 124, baseType: !142, size: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !695, file: !28, line: 125, baseType: !132, size: 8, offset: 16)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !447, file: !28, line: 291, baseType: !700, size: 64, offset: 11840)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !515}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !447, file: !28, line: 299, baseType: !706, size: 64, offset: 11904)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !515, !709, !156, !715}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !156, !126, !712, !712, !713}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !447, file: !28, line: 309, baseType: !717, size: 64, offset: 11968)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !515, !720, !156}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !156, !126, !712, !712}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !447, file: !28, line: 317, baseType: !724, size: 64, offset: 12032)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !515, !727, !156, !715}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !156, !126, !126, !712, !712}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !447, file: !28, line: 327, baseType: !731, size: 64, offset: 12096)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !515, !720, !156, !715}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !447, file: !28, line: 337, baseType: !735, size: 64, offset: 12160)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !515, !738, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !447, file: !28, line: 344, baseType: !740, size: 64, offset: 12224)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !515, !126, !738}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !447, file: !28, line: 347, baseType: !744, size: 64, offset: 12288)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !515, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !447, file: !28, line: 350, baseType: !740, size: 64, offset: 12352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !447, file: !28, line: 351, baseType: !740, size: 64, offset: 12416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !447, file: !28, line: 355, baseType: !751, size: 64, offset: 12480)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!754, !146, !515}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !447, file: !28, line: 359, baseType: !758, size: 64, offset: 12544)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!761, !146, !515}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !447, file: !28, line: 364, baseType: !512, size: 64, offset: 12608)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !447, file: !28, line: 367, baseType: !512, size: 64, offset: 12672)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !447, file: !28, line: 373, baseType: !766, size: 64, offset: 12736)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !515, !769, !769}
!769 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !447, file: !28, line: 376, baseType: !512, size: 64, offset: 12800)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !447, file: !28, line: 385, baseType: !772, size: 64, offset: 12864)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !515, !775, !769, !776}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!126, !126, !156}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !447, file: !28, line: 391, baseType: !781, size: 64, offset: 12928)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !515, !784, !883, !156, !887}
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!788, !789, !882, !126}
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !537, line: 160, size: 384, elements: !791)
!791 = !{!792, !796, !877, !878, !879, !880, !881}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !790, file: !537, line: 161, baseType: !793, size: 256)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 256, elements: !794)
!794 = !{!352, !795}
!795 = !DISubrange(count: 2)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !790, file: !537, line: 162, baseType: !797, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !138, line: 77, size: 15424, elements: !799)
!799 = !{!800, !801, !802, !805, !808, !811, !814, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !866, !867, !871}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !798, file: !138, line: 78, baseType: !151, size: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !138, line: 80, baseType: !171, size: 8192, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !798, file: !138, line: 82, baseType: !803, size: 64, offset: 9152)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !138, line: 43, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !798, file: !138, line: 83, baseType: !806, size: 64, offset: 9216)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !152, line: 46, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !798, file: !138, line: 86, baseType: !809, size: 64, offset: 9280)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !138, line: 41, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !798, file: !138, line: 87, baseType: !812, size: 64, offset: 9344)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !138, line: 44, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !798, file: !138, line: 89, baseType: !815, size: 512, offset: 9408)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 512, elements: !816)
!816 = !{!245}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !798, file: !138, line: 90, baseType: !142, size: 16, offset: 9920)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !798, file: !138, line: 90, baseType: !142, size: 16, offset: 9936)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !798, file: !138, line: 92, baseType: !142, size: 16, offset: 9952)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !798, file: !138, line: 92, baseType: !142, size: 16, offset: 9968)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !798, file: !138, line: 93, baseType: !142, size: 16, offset: 9984)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !798, file: !138, line: 93, baseType: !142, size: 16, offset: 10000)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !798, file: !138, line: 94, baseType: !126, size: 32, offset: 10016)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !798, file: !138, line: 97, baseType: !142, size: 16, offset: 10048)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !798, file: !138, line: 97, baseType: !142, size: 16, offset: 10064)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !798, file: !138, line: 98, baseType: !142, size: 16, offset: 10080)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !798, file: !138, line: 98, baseType: !142, size: 16, offset: 10096)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !798, file: !138, line: 99, baseType: !142, size: 16, offset: 10112)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !798, file: !138, line: 99, baseType: !142, size: 16, offset: 10128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !798, file: !138, line: 100, baseType: !7, size: 32, offset: 10144)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !798, file: !138, line: 101, baseType: !704, size: 64, offset: 10176)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !798, file: !138, line: 103, baseType: !177, size: 64, offset: 10240)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !798, file: !138, line: 104, baseType: !834, size: 64, offset: 10304)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !152, line: 159, size: 448, elements: !836)
!836 = !{!837, !840, !841, !843, !844, !846}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !835, file: !152, line: 161, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !839)
!839 = !{!795}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !835, file: !152, line: 162, baseType: !838, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !835, file: !152, line: 163, baseType: !842, size: 32, offset: 128)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !839)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !835, file: !152, line: 164, baseType: !842, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !835, file: !152, line: 165, baseType: !845, size: 128, offset: 192)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 128, elements: !839)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !835, file: !152, line: 166, baseType: !847, size: 128, offset: 320)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 128, elements: !839)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !798, file: !138, line: 107, baseType: !243, size: 32, offset: 10368)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !798, file: !138, line: 108, baseType: !126, size: 32, offset: 10400)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !798, file: !138, line: 109, baseType: !142, size: 16, offset: 10432)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !798, file: !138, line: 110, baseType: !142, size: 16, offset: 10448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !798, file: !138, line: 113, baseType: !126, size: 32, offset: 10464)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !798, file: !138, line: 113, baseType: !126, size: 32, offset: 10496)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !798, file: !138, line: 114, baseType: !132, size: 8, offset: 10528)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !798, file: !138, line: 114, baseType: !132, size: 8, offset: 10536)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !798, file: !138, line: 115, baseType: !142, size: 16, offset: 10544)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !798, file: !138, line: 116, baseType: !350, size: 128, offset: 10560)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !798, file: !138, line: 119, baseType: !243, size: 32, offset: 10688)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !798, file: !138, line: 119, baseType: !243, size: 32, offset: 10720)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !798, file: !138, line: 122, baseType: !861, size: 512, offset: 10752)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !862, line: 182, baseType: !863)
!862 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !862, line: 180, size: 512, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !863, file: !862, line: 181, baseType: !131, size: 512)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !798, file: !138, line: 123, baseType: !132, size: 8, offset: 11264)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !798, file: !138, line: 125, baseType: !868, size: 56, offset: 11272)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 56, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 7)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !798, file: !138, line: 126, baseType: !872, size: 4096, offset: 11328)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 4096, elements: !816)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !138, line: 69, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !138, line: 67, size: 512, elements: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !138, line: 68, baseType: !131, size: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !790, file: !537, line: 163, baseType: !132, size: 8, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !790, file: !537, line: 163, baseType: !132, size: 8, offset: 328)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !790, file: !537, line: 164, baseType: !142, size: 16, offset: 336)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !790, file: !537, line: 164, baseType: !142, size: 16, offset: 352)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !790, file: !537, line: 164, baseType: !142, size: 16, offset: 368)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!126, !156, !126, !126}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !447, file: !28, line: 400, baseType: !889, size: 64, offset: 12992)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !515, !776}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !447, file: !28, line: 415, baseType: !893, size: 64, offset: 13056)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !515, !896, !776, !883, !156, !887}
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!788, !156, !126}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !447, file: !28, line: 425, baseType: !901, size: 64, offset: 13120)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !515, !896, !883, !156, !887}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !447, file: !28, line: 435, baseType: !905, size: 64, offset: 13184)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !515, !776, !896, !156}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !447, file: !28, line: 444, baseType: !909, size: 64, offset: 13248)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !515, !896, !156}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !447, file: !28, line: 455, baseType: !913, size: 64, offset: 13312)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !515, !896, !916, !156}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !156, !126, !243}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !447, file: !28, line: 464, baseType: !921, size: 64, offset: 13376)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !515, !924, !927, !156}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !156, !126, !156}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!769, !156, !126}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !447, file: !28, line: 470, baseType: !512, size: 64, offset: 13440)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !147, file: !148, line: 277, baseType: !446, size: 64, offset: 10368)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !147, file: !148, line: 278, baseType: !933, size: 64, offset: 10432)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !934, line: 27, baseType: !935)
!934 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !936, line: 45, baseType: !937)
!936 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!937 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !147, file: !148, line: 279, baseType: !933, size: 64, offset: 10496)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !148, line: 280, baseType: !7, size: 32, offset: 10560)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !147, file: !148, line: 281, baseType: !7, size: 32, offset: 10592)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !147, file: !148, line: 283, baseType: !206, size: 128, offset: 10624)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !147, file: !148, line: 284, baseType: !206, size: 128, offset: 10752)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !147, file: !148, line: 285, baseType: !944, size: 64, offset: 10880)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !147, file: !148, line: 287, baseType: !946, size: 64, offset: 10944)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !148, line: 59, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !147, file: !148, line: 288, baseType: !949, size: 64, offset: 11008)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !148, line: 288, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !147, file: !148, line: 290, baseType: !952, size: 64, offset: 11072)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 64, elements: !839)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !147, file: !148, line: 291, baseType: !954, size: 64, offset: 11136)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !138, line: 65, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !138, line: 50, size: 320, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !956, file: !138, line: 51, baseType: !136, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !956, file: !138, line: 53, baseType: !126, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !956, file: !138, line: 54, baseType: !126, size: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !956, file: !138, line: 55, baseType: !126, size: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !956, file: !138, line: 55, baseType: !126, size: 32, offset: 160)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !956, file: !138, line: 56, baseType: !132, size: 8, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !956, file: !138, line: 56, baseType: !132, size: 8, offset: 200)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !956, file: !138, line: 57, baseType: !132, size: 8, offset: 208)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !956, file: !138, line: 57, baseType: !132, size: 8, offset: 216)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !956, file: !138, line: 59, baseType: !142, size: 16, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !956, file: !138, line: 59, baseType: !142, size: 16, offset: 240)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !956, file: !138, line: 59, baseType: !142, size: 16, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !956, file: !138, line: 61, baseType: !142, size: 16, offset: 272)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !956, file: !138, line: 63, baseType: !126, size: 32, offset: 288)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !147, file: !148, line: 293, baseType: !206, size: 128, offset: 11200)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !147, file: !148, line: 294, baseType: !974, size: 64, offset: 11328)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !148, line: 113, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !148, line: 108, size: 256, elements: !977)
!977 = !{!978, !980, !981, !982, !983}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !976, file: !148, line: 109, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !976, file: !148, line: 109, baseType: !979, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !976, file: !148, line: 110, baseType: !146, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !976, file: !148, line: 111, baseType: !126, size: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !976, file: !148, line: 112, baseType: !243, size: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "prevCos", scope: !116, file: !115, line: 533, baseType: !738, size: 64, offset: 1024)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !116, file: !115, line: 534, baseType: !131, size: 512, offset: 1088)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !988, line: 133, baseType: !989)
!988 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !988, line: 58, size: 11008, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !998, !999, !1005, !1006, !1016, !1017, !1023, !1031, !1032, !1033, !1046, !1047, !1048, !1060, !1068, !1070, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !989, file: !988, line: 59, baseType: !151, size: 960)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !989, file: !988, line: 60, baseType: !217, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !989, file: !988, line: 62, baseType: !238, size: 64, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !989, file: !988, line: 64, baseType: !234, size: 64, offset: 1088)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !989, file: !988, line: 65, baseType: !996, size: 64, offset: 1152)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !988, line: 42, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !989, file: !988, line: 66, baseType: !335, size: 64, offset: 1216)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !989, file: !988, line: 67, baseType: !1000, size: 64, offset: 1280)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !537, line: 154, size: 64, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1001, file: !537, line: 155, baseType: !126, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !537, line: 156, baseType: !126, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !989, file: !988, line: 71, baseType: !595, size: 64, offset: 1344)
