; ModuleID = 'blender/source/blender/blenkernel/intern/mask_evaluate.c'
source_filename = "blender/source/blender/blenkernel/intern/mask_evaluate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MaskSpline = type { %struct.MaskSpline*, %struct.MaskSpline*, i16, i8, i8, i32, %struct.MaskSplinePoint*, %struct.MaskParent, %struct.MaskSplinePoint* }
%struct.MaskParent = type { i32, i32, %struct.ID*, [64 x i8], [64 x i8], [2 x float], [4 x [2 x float]] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.MaskSplinePoint = type { %struct.BezTriple, i32, i32, %struct.MaskSplinePointUW*, %struct.MaskParent }
%struct.BezTriple = type { [3 x [3 x float]], float, float, float, i8, i8, i8, i8, i8, i8, i8, i8, float, float, float, [4 x i8] }
%struct.MaskSplinePointUW = type { float, float, i32 }
%struct.FeatherEdgesBucket = type { i32, [2 x i32]*, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/mask_evaluate.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 155, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "MASK_SPLINE_CYCLIC", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "MASK_SPLINE_NOFILL", value: 4, isUnsigned: true)
!9 = !DIEnumerator(name: "MASK_SPLINE_NOINTERSECT", value: 8, isUnsigned: true)
!10 = !{!11, !12, !13, !14}
!11 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!19 = distinct !DISubprogram(name: "BKE_mask_spline_resolution", scope: !1, file: !1, line: 50, type: !20, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!20 = !DISubroutineType(types: !21)
!21 = !{!5, !22, !13, !13}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpline", file: !4, line: 100, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpline", file: !4, line: 88, size: 1792, elements: !25)
!25 = !{!26, !28, !29, !31, !33, !34, !35, !160, !161}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !4, line: 89, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !24, file: !4, line: 89, baseType: !27, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !24, file: !4, line: 91, baseType: !30, size: 16, offset: 128)
!30 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "offset_mode", scope: !24, file: !4, line: 92, baseType: !32, size: 8, offset: 144)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "weight_interp", scope: !24, file: !4, line: 93, baseType: !32, size: 8, offset: 152)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tot_point", scope: !24, file: !4, line: 95, baseType: !13, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !24, file: !4, line: 96, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePoint", file: !4, line: 86, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePoint", file: !4, line: 80, size: 2176, elements: !39)
!39 = !{!40, !67, !68, !69, !77}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !38, file: !4, line: 81, baseType: !41, size: 576)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !42, line: 133, baseType: !43)
!42 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !42, line: 117, size: 576, elements: !44)
!44 = !{!45, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !43, file: !42, line: 118, baseType: !46, size: 288)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 288, elements: !47)
!47 = !{!48, !48}
!48 = !DISubrange(count: 3)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !43, file: !42, line: 119, baseType: !11, size: 32, offset: 288)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !43, file: !42, line: 119, baseType: !11, size: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !43, file: !42, line: 119, baseType: !11, size: 32, offset: 352)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !43, file: !42, line: 121, baseType: !32, size: 8, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !43, file: !42, line: 123, baseType: !32, size: 8, offset: 392)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !43, file: !42, line: 123, baseType: !32, size: 8, offset: 400)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !43, file: !42, line: 124, baseType: !32, size: 8, offset: 408)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !43, file: !42, line: 124, baseType: !32, size: 8, offset: 416)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !43, file: !42, line: 124, baseType: !32, size: 8, offset: 424)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !43, file: !42, line: 126, baseType: !32, size: 8, offset: 432)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !43, file: !42, line: 128, baseType: !32, size: 8, offset: 440)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !43, file: !42, line: 129, baseType: !11, size: 32, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !43, file: !42, line: 130, baseType: !11, size: 32, offset: 480)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !43, file: !42, line: 130, baseType: !11, size: 32, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !43, file: !42, line: 132, baseType: !64, size: 32, offset: 544)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 4)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !38, file: !4, line: 82, baseType: !13, size: 32, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tot_uw", scope: !38, file: !4, line: 83, baseType: !13, size: 32, offset: 608)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "uw", scope: !38, file: !4, line: 84, baseType: !70, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePointUW", file: !4, line: 78, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePointUW", file: !4, line: 75, size: 96, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !72, file: !4, line: 76, baseType: !11, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !72, file: !4, line: 76, baseType: !11, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !4, line: 77, baseType: !13, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !38, file: !4, line: 85, baseType: !78, size: 1472, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskParent", file: !4, line: 73, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskParent", file: !4, line: 59, size: 1472, elements: !80)
!80 = !{!81, !82, !83, !151, !152, !153, !157}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "id_type", scope: !79, file: !4, line: 61, baseType: !13, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !4, line: 62, baseType: !13, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !79, file: !4, line: 63, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !86, line: 130, baseType: !87)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !86, line: 117, size: 960, elements: !88)
!88 = !{!89, !90, !91, !93, !111, !115, !116, !117, !118, !119}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !86, line: 118, baseType: !12, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !86, line: 118, baseType: !12, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !87, file: !86, line: 119, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !87, file: !86, line: 120, baseType: !94, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !86, line: 136, size: 17600, elements: !96)
!96 = !{!97, !98, !99, !102, !106, !107, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !95, file: !86, line: 137, baseType: !85, size: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !95, file: !86, line: 138, baseType: !84, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !95, file: !86, line: 139, baseType: !100, size: 64, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !86, line: 43, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !86, line: 140, baseType: !103, size: 8192, offset: 1088)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8192, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !95, file: !86, line: 141, baseType: !103, size: 8192, offset: 9280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !95, file: !86, line: 148, baseType: !94, size: 64, offset: 17472)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !95, file: !86, line: 150, baseType: !109, size: 64, offset: 17536)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !86, line: 45, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !86, line: 121, baseType: !112, size: 528, offset: 256)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 528, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 66)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !86, line: 126, baseType: !30, size: 16, offset: 784)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !87, file: !86, line: 127, baseType: !13, size: 32, offset: 800)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !87, file: !86, line: 128, baseType: !13, size: 32, offset: 832)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !87, file: !86, line: 128, baseType: !13, size: 32, offset: 864)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !87, file: !86, line: 129, baseType: !120, size: 64, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !86, line: 75, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !86, line: 62, size: 1024, elements: !123)
!123 = !{!124, !126, !127, !128, !129, !130, !134, !135, !149, !150}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !86, line: 63, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !86, line: 63, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !122, file: !86, line: 64, baseType: !32, size: 8, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !122, file: !86, line: 64, baseType: !32, size: 8, offset: 136)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !86, line: 65, baseType: !30, size: 16, offset: 144)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !86, line: 66, baseType: !131, size: 512, offset: 160)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !122, file: !86, line: 67, baseType: !13, size: 32, offset: 672)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !122, file: !86, line: 69, baseType: !136, size: 256, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !86, line: 60, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !86, line: 48, size: 256, elements: !138)
!138 = !{!139, !140, !147, !148}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !137, file: !86, line: 49, baseType: !12, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !137, file: !86, line: 58, baseType: !141, size: 128, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !142, line: 71, baseType: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !142, line: 69, size: 128, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !143, file: !142, line: 70, baseType: !12, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !143, file: !142, line: 70, baseType: !12, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !137, file: !86, line: 59, baseType: !13, size: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !137, file: !86, line: 59, baseType: !13, size: 32, offset: 224)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, file: !86, line: 70, baseType: !13, size: 32, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !122, file: !86, line: 74, baseType: !13, size: 32, offset: 992)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !79, file: !4, line: 65, baseType: !131, size: 512, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sub_parent", scope: !79, file: !4, line: 67, baseType: !131, size: 512, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "parent_orig", scope: !79, file: !4, line: 69, baseType: !154, size: 64, offset: 1152)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 2)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "parent_corners_orig", scope: !79, file: !4, line: 72, baseType: !158, size: 256, offset: 1216)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !159)
!159 = !{!66, !156}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !24, file: !4, line: 97, baseType: !78, size: 1472, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "points_deform", scope: !24, file: !4, line: 99, baseType: !36, size: 64, offset: 1728)
!162 = !{}
!163 = !DILocalVariable(name: "spline", arg: 1, scope: !19, file: !1, line: 50, type: !22)
!164 = !DILocation(line: 50, column: 53, scope: !19)
!165 = !DILocalVariable(name: "width", arg: 2, scope: !19, file: !1, line: 50, type: !13)
!166 = !DILocation(line: 50, column: 65, scope: !19)
!167 = !DILocalVariable(name: "height", arg: 3, scope: !19, file: !1, line: 50, type: !13)
!168 = !DILocation(line: 50, column: 76, scope: !19)
!169 = !DILocalVariable(name: "max_segment", scope: !19, file: !1, line: 52, type: !11)
!170 = !DILocation(line: 52, column: 8, scope: !19)
!171 = !DILocalVariable(name: "i", scope: !19, file: !1, line: 53, type: !5)
!172 = !DILocation(line: 53, column: 15, scope: !19)
!173 = !DILocalVariable(name: "resol", scope: !19, file: !1, line: 53, type: !5)
!174 = !DILocation(line: 53, column: 18, scope: !19)
!175 = !DILocation(line: 55, column: 6, scope: !176)
!176 = distinct !DILexicalBlock(scope: !19, file: !1, line: 55, column: 6)
!177 = !DILocation(line: 55, column: 12, scope: !176)
!178 = !DILocation(line: 55, column: 17, scope: !176)
!179 = !DILocation(line: 55, column: 20, scope: !176)
!180 = !DILocation(line: 55, column: 27, scope: !176)
!181 = !DILocation(line: 55, column: 6, scope: !19)
!182 = !DILocation(line: 56, column: 38, scope: !183)
!183 = distinct !DILexicalBlock(scope: !176, file: !1, line: 55, column: 33)
!184 = !DILocation(line: 56, column: 45, scope: !183)
!185 = !DILocation(line: 56, column: 31, scope: !183)
!186 = !DILocation(line: 56, column: 24, scope: !183)
!187 = !DILocation(line: 56, column: 22, scope: !183)
!188 = !DILocation(line: 56, column: 15, scope: !183)
!189 = !DILocation(line: 57, column: 2, scope: !183)
!190 = !DILocation(line: 59, column: 9, scope: !191)
!191 = distinct !DILexicalBlock(scope: !19, file: !1, line: 59, column: 2)
!192 = !DILocation(line: 59, column: 7, scope: !191)
!193 = !DILocation(line: 59, column: 14, scope: !194)
!194 = distinct !DILexicalBlock(scope: !191, file: !1, line: 59, column: 2)
!195 = !DILocation(line: 59, column: 18, scope: !194)
!196 = !DILocation(line: 59, column: 26, scope: !194)
!197 = !DILocation(line: 59, column: 16, scope: !194)
!198 = !DILocation(line: 59, column: 2, scope: !191)
!199 = !DILocalVariable(name: "point", scope: !200, file: !1, line: 60, type: !36)
!200 = distinct !DILexicalBlock(scope: !194, file: !1, line: 59, column: 42)
!201 = !DILocation(line: 60, column: 20, scope: !200)
!202 = !DILocation(line: 60, column: 29, scope: !200)
!203 = !DILocation(line: 60, column: 37, scope: !200)
!204 = !DILocation(line: 60, column: 44, scope: !200)
!205 = !DILocalVariable(name: "bezt_curr", scope: !200, file: !1, line: 61, type: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!207 = !DILocation(line: 61, column: 14, scope: !200)
!208 = !DILocalVariable(name: "bezt_next", scope: !200, file: !1, line: 61, type: !206)
!209 = !DILocation(line: 61, column: 26, scope: !200)
!210 = !DILocalVariable(name: "a", scope: !200, file: !1, line: 62, type: !11)
!211 = !DILocation(line: 62, column: 9, scope: !200)
!212 = !DILocalVariable(name: "b", scope: !200, file: !1, line: 62, type: !11)
!213 = !DILocation(line: 62, column: 12, scope: !200)
!214 = !DILocalVariable(name: "c", scope: !200, file: !1, line: 62, type: !11)
!215 = !DILocation(line: 62, column: 15, scope: !200)
!216 = !DILocalVariable(name: "len", scope: !200, file: !1, line: 62, type: !11)
!217 = !DILocation(line: 62, column: 18, scope: !200)
!218 = !DILocalVariable(name: "cur_resol", scope: !200, file: !1, line: 63, type: !5)
!219 = !DILocation(line: 63, column: 16, scope: !200)
!220 = !DILocation(line: 65, column: 16, scope: !200)
!221 = !DILocation(line: 65, column: 23, scope: !200)
!222 = !DILocation(line: 65, column: 13, scope: !200)
!223 = !DILocation(line: 66, column: 47, scope: !200)
!224 = !DILocation(line: 66, column: 55, scope: !200)
!225 = !DILocation(line: 66, column: 63, scope: !200)
!226 = !DILocation(line: 66, column: 71, scope: !200)
!227 = !DILocation(line: 66, column: 15, scope: !200)
!228 = !DILocation(line: 66, column: 13, scope: !200)
!229 = !DILocation(line: 68, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !200, file: !1, line: 68, column: 7)
!231 = !DILocation(line: 68, column: 17, scope: !230)
!232 = !DILocation(line: 68, column: 7, scope: !200)
!233 = !DILocation(line: 69, column: 4, scope: !234)
!234 = distinct !DILexicalBlock(scope: !230, file: !1, line: 68, column: 26)
!235 = !DILocation(line: 72, column: 16, scope: !200)
!236 = !DILocation(line: 72, column: 27, scope: !200)
!237 = !DILocation(line: 72, column: 35, scope: !200)
!238 = !DILocation(line: 72, column: 46, scope: !200)
!239 = !DILocation(line: 72, column: 7, scope: !200)
!240 = !DILocation(line: 72, column: 5, scope: !200)
!241 = !DILocation(line: 73, column: 16, scope: !200)
!242 = !DILocation(line: 73, column: 27, scope: !200)
!243 = !DILocation(line: 73, column: 35, scope: !200)
!244 = !DILocation(line: 73, column: 46, scope: !200)
!245 = !DILocation(line: 73, column: 7, scope: !200)
!246 = !DILocation(line: 73, column: 5, scope: !200)
!247 = !DILocation(line: 74, column: 16, scope: !200)
!248 = !DILocation(line: 74, column: 27, scope: !200)
!249 = !DILocation(line: 74, column: 35, scope: !200)
!250 = !DILocation(line: 74, column: 46, scope: !200)
!251 = !DILocation(line: 74, column: 7, scope: !200)
!252 = !DILocation(line: 74, column: 5, scope: !200)
!253 = !DILocation(line: 76, column: 9, scope: !200)
!254 = !DILocation(line: 76, column: 13, scope: !200)
!255 = !DILocation(line: 76, column: 11, scope: !200)
!256 = !DILocation(line: 76, column: 17, scope: !200)
!257 = !DILocation(line: 76, column: 15, scope: !200)
!258 = !DILocation(line: 76, column: 7, scope: !200)
!259 = !DILocation(line: 77, column: 15, scope: !200)
!260 = !DILocation(line: 77, column: 21, scope: !200)
!261 = !DILocation(line: 77, column: 19, scope: !200)
!262 = !DILocation(line: 77, column: 13, scope: !200)
!263 = !DILocation(line: 79, column: 11, scope: !200)
!264 = !DILocation(line: 79, column: 9, scope: !200)
!265 = !DILocation(line: 81, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !200, file: !1, line: 81, column: 7)
!267 = !DILocation(line: 81, column: 13, scope: !266)
!268 = !DILocation(line: 81, column: 7, scope: !200)
!269 = !DILocation(line: 82, column: 4, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !1, line: 81, column: 32)
!271 = !DILocation(line: 84, column: 2, scope: !200)
!272 = !DILocation(line: 59, column: 38, scope: !194)
!273 = !DILocation(line: 59, column: 2, scope: !194)
!274 = distinct !{!274, !198, !275}
!275 = !DILocation(line: 84, column: 2, scope: !191)
!276 = !DILocation(line: 86, column: 9, scope: !19)
!277 = !DILocation(line: 86, column: 2, scope: !19)
!278 = distinct !DISubprogram(name: "max_ii", scope: !279, file: !279, line: 215, type: !280, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!279 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!280 = !DISubroutineType(types: !281)
!281 = !{!13, !13, !13}
!282 = !DILocalVariable(name: "a", arg: 1, scope: !278, file: !279, line: 215, type: !13)
!283 = !DILocation(line: 215, column: 24, scope: !278)
!284 = !DILocalVariable(name: "b", arg: 2, scope: !278, file: !279, line: 215, type: !13)
!285 = !DILocation(line: 215, column: 31, scope: !278)
!286 = !DILocation(line: 217, column: 10, scope: !278)
!287 = !DILocation(line: 217, column: 14, scope: !278)
!288 = !DILocation(line: 217, column: 12, scope: !278)
!289 = !DILocation(line: 217, column: 9, scope: !278)
!290 = !DILocation(line: 217, column: 19, scope: !278)
!291 = !DILocation(line: 217, column: 23, scope: !278)
!292 = !DILocation(line: 217, column: 2, scope: !278)
!293 = distinct !DISubprogram(name: "len_v3v3", scope: !294, file: !294, line: 759, type: !295, scopeLine: 760, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!294 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!295 = !DISubroutineType(types: !296)
!296 = !{!11, !297, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!299 = !DILocalVariable(name: "a", arg: 1, scope: !293, file: !294, line: 759, type: !297)
!300 = !DILocation(line: 759, column: 36, scope: !293)
!301 = !DILocalVariable(name: "b", arg: 2, scope: !293, file: !294, line: 759, type: !297)
!302 = !DILocation(line: 759, column: 54, scope: !293)
!303 = !DILocalVariable(name: "d", scope: !293, file: !294, line: 761, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 96, elements: !305)
!305 = !{!48}
!306 = !DILocation(line: 761, column: 8, scope: !293)
!307 = !DILocation(line: 763, column: 14, scope: !293)
!308 = !DILocation(line: 763, column: 17, scope: !293)
!309 = !DILocation(line: 763, column: 20, scope: !293)
!310 = !DILocation(line: 763, column: 2, scope: !293)
!311 = !DILocation(line: 764, column: 16, scope: !293)
!312 = !DILocation(line: 764, column: 9, scope: !293)
!313 = !DILocation(line: 764, column: 2, scope: !293)
!314 = distinct !DISubprogram(name: "BKE_mask_spline_feather_resolution", scope: !1, file: !1, line: 89, type: !20, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!315 = !DILocalVariable(name: "spline", arg: 1, scope: !314, file: !1, line: 89, type: !22)
!316 = !DILocation(line: 89, column: 61, scope: !314)
!317 = !DILocalVariable(name: "width", arg: 2, scope: !314, file: !1, line: 89, type: !13)
!318 = !DILocation(line: 89, column: 73, scope: !314)
!319 = !DILocalVariable(name: "height", arg: 3, scope: !314, file: !1, line: 89, type: !13)
!320 = !DILocation(line: 89, column: 84, scope: !314)
!321 = !DILocalVariable(name: "max_segment", scope: !314, file: !1, line: 91, type: !298)
!322 = !DILocation(line: 91, column: 14, scope: !314)
!323 = !DILocalVariable(name: "resol", scope: !314, file: !1, line: 92, type: !5)
!324 = !DILocation(line: 92, column: 15, scope: !314)
!325 = !DILocation(line: 92, column: 50, scope: !314)
!326 = !DILocation(line: 92, column: 58, scope: !314)
!327 = !DILocation(line: 92, column: 65, scope: !314)
!328 = !DILocation(line: 92, column: 23, scope: !314)
!329 = !DILocalVariable(name: "max_jump", scope: !314, file: !1, line: 93, type: !11)
!330 = !DILocation(line: 93, column: 8, scope: !314)
!331 = !DILocalVariable(name: "i", scope: !314, file: !1, line: 94, type: !13)
!332 = !DILocation(line: 94, column: 6, scope: !314)
!333 = !DILocation(line: 97, column: 6, scope: !334)
!334 = distinct !DILexicalBlock(scope: !314, file: !1, line: 97, column: 6)
!335 = !DILocation(line: 97, column: 12, scope: !334)
!336 = !DILocation(line: 97, column: 6, scope: !314)
!337 = !DILocation(line: 98, column: 3, scope: !338)
!338 = distinct !DILexicalBlock(scope: !334, file: !1, line: 97, column: 31)
!339 = !DILocation(line: 101, column: 9, scope: !340)
!340 = distinct !DILexicalBlock(scope: !314, file: !1, line: 101, column: 2)
!341 = !DILocation(line: 101, column: 7, scope: !340)
!342 = !DILocation(line: 101, column: 14, scope: !343)
!343 = distinct !DILexicalBlock(scope: !340, file: !1, line: 101, column: 2)
!344 = !DILocation(line: 101, column: 18, scope: !343)
!345 = !DILocation(line: 101, column: 26, scope: !343)
!346 = !DILocation(line: 101, column: 16, scope: !343)
!347 = !DILocation(line: 101, column: 2, scope: !340)
!348 = !DILocalVariable(name: "point", scope: !349, file: !1, line: 102, type: !36)
!349 = distinct !DILexicalBlock(scope: !343, file: !1, line: 101, column: 42)
!350 = !DILocation(line: 102, column: 20, scope: !349)
!351 = !DILocation(line: 102, column: 29, scope: !349)
!352 = !DILocation(line: 102, column: 37, scope: !349)
!353 = !DILocation(line: 102, column: 44, scope: !349)
!354 = !DILocalVariable(name: "prev_u", scope: !349, file: !1, line: 103, type: !11)
!355 = !DILocation(line: 103, column: 9, scope: !349)
!356 = !DILocalVariable(name: "prev_w", scope: !349, file: !1, line: 103, type: !11)
!357 = !DILocation(line: 103, column: 17, scope: !349)
!358 = !DILocalVariable(name: "j", scope: !349, file: !1, line: 104, type: !13)
!359 = !DILocation(line: 104, column: 7, scope: !349)
!360 = !DILocation(line: 106, column: 10, scope: !349)
!361 = !DILocation(line: 107, column: 12, scope: !349)
!362 = !DILocation(line: 107, column: 19, scope: !349)
!363 = !DILocation(line: 107, column: 24, scope: !349)
!364 = !DILocation(line: 107, column: 10, scope: !349)
!365 = !DILocation(line: 109, column: 10, scope: !366)
!366 = distinct !DILexicalBlock(scope: !349, file: !1, line: 109, column: 3)
!367 = !DILocation(line: 109, column: 8, scope: !366)
!368 = !DILocation(line: 109, column: 15, scope: !369)
!369 = distinct !DILexicalBlock(scope: !366, file: !1, line: 109, column: 3)
!370 = !DILocation(line: 109, column: 19, scope: !369)
!371 = !DILocation(line: 109, column: 26, scope: !369)
!372 = !DILocation(line: 109, column: 17, scope: !369)
!373 = !DILocation(line: 109, column: 3, scope: !366)
!374 = !DILocalVariable(name: "w_diff", scope: !375, file: !1, line: 110, type: !298)
!375 = distinct !DILexicalBlock(scope: !369, file: !1, line: 109, column: 39)
!376 = !DILocation(line: 110, column: 16, scope: !375)
!377 = !DILocation(line: 110, column: 26, scope: !375)
!378 = !DILocation(line: 110, column: 33, scope: !375)
!379 = !DILocation(line: 110, column: 36, scope: !375)
!380 = !DILocation(line: 110, column: 39, scope: !375)
!381 = !DILocation(line: 110, column: 43, scope: !375)
!382 = !DILocation(line: 110, column: 41, scope: !375)
!383 = !DILocalVariable(name: "u_diff", scope: !375, file: !1, line: 111, type: !298)
!384 = !DILocation(line: 111, column: 16, scope: !375)
!385 = !DILocation(line: 111, column: 26, scope: !375)
!386 = !DILocation(line: 111, column: 33, scope: !375)
!387 = !DILocation(line: 111, column: 36, scope: !375)
!388 = !DILocation(line: 111, column: 39, scope: !375)
!389 = !DILocation(line: 111, column: 43, scope: !375)
!390 = !DILocation(line: 111, column: 41, scope: !375)
!391 = !DILocation(line: 115, column: 8, scope: !392)
!392 = distinct !DILexicalBlock(scope: !375, file: !1, line: 115, column: 8)
!393 = !DILocation(line: 115, column: 15, scope: !392)
!394 = !DILocation(line: 115, column: 8, scope: !375)
!395 = !DILocalVariable(name: "jump", scope: !396, file: !1, line: 116, type: !11)
!396 = distinct !DILexicalBlock(scope: !392, file: !1, line: 115, column: 30)
!397 = !DILocation(line: 116, column: 11, scope: !396)
!398 = !DILocation(line: 116, column: 24, scope: !396)
!399 = !DILocation(line: 116, column: 33, scope: !396)
!400 = !DILocation(line: 116, column: 31, scope: !396)
!401 = !DILocation(line: 116, column: 18, scope: !396)
!402 = !DILocation(line: 118, column: 23, scope: !396)
!403 = !DILocation(line: 118, column: 33, scope: !396)
!404 = !DILocation(line: 118, column: 16, scope: !396)
!405 = !DILocation(line: 118, column: 14, scope: !396)
!406 = !DILocation(line: 119, column: 4, scope: !396)
!407 = !DILocation(line: 121, column: 13, scope: !375)
!408 = !DILocation(line: 121, column: 20, scope: !375)
!409 = !DILocation(line: 121, column: 23, scope: !375)
!410 = !DILocation(line: 121, column: 26, scope: !375)
!411 = !DILocation(line: 121, column: 11, scope: !375)
!412 = !DILocation(line: 122, column: 13, scope: !375)
!413 = !DILocation(line: 122, column: 20, scope: !375)
!414 = !DILocation(line: 122, column: 23, scope: !375)
!415 = !DILocation(line: 122, column: 26, scope: !375)
!416 = !DILocation(line: 122, column: 11, scope: !375)
!417 = !DILocation(line: 123, column: 3, scope: !375)
!418 = !DILocation(line: 109, column: 35, scope: !369)
!419 = !DILocation(line: 109, column: 3, scope: !369)
!420 = distinct !{!420, !373, !421}
!421 = !DILocation(line: 123, column: 3, scope: !366)
!422 = !DILocation(line: 124, column: 2, scope: !349)
!423 = !DILocation(line: 101, column: 38, scope: !343)
!424 = !DILocation(line: 101, column: 2, scope: !343)
!425 = distinct !{!425, !347, !426}
!426 = !DILocation(line: 124, column: 2, scope: !340)
!427 = !DILocation(line: 126, column: 11, scope: !314)
!428 = !DILocation(line: 126, column: 20, scope: !314)
!429 = !DILocation(line: 126, column: 8, scope: !314)
!430 = !DILocation(line: 128, column: 9, scope: !314)
!431 = !DILocation(line: 128, column: 2, scope: !314)
!432 = !DILocation(line: 129, column: 1, scope: !314)
!433 = distinct !DISubprogram(name: "max_ff", scope: !279, file: !279, line: 206, type: !434, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!434 = !DISubroutineType(types: !435)
!435 = !{!11, !11, !11}
!436 = !DILocalVariable(name: "a", arg: 1, scope: !433, file: !279, line: 206, type: !11)
!437 = !DILocation(line: 206, column: 28, scope: !433)
!438 = !DILocalVariable(name: "b", arg: 2, scope: !433, file: !279, line: 206, type: !11)
!439 = !DILocation(line: 206, column: 37, scope: !433)
!440 = !DILocation(line: 208, column: 10, scope: !433)
!441 = !DILocation(line: 208, column: 14, scope: !433)
!442 = !DILocation(line: 208, column: 12, scope: !433)
!443 = !DILocation(line: 208, column: 9, scope: !433)
!444 = !DILocation(line: 208, column: 19, scope: !433)
!445 = !DILocation(line: 208, column: 23, scope: !433)
!446 = !DILocation(line: 208, column: 2, scope: !433)
!447 = distinct !DISubprogram(name: "BKE_mask_spline_differentiate_calc_total", scope: !1, file: !1, line: 131, type: !448, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!448 = !DISubroutineType(types: !449)
!449 = !{!13, !450, !452}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!453 = !DILocalVariable(name: "spline", arg: 1, scope: !447, file: !1, line: 131, type: !450)
!454 = !DILocation(line: 131, column: 64, scope: !447)
!455 = !DILocalVariable(name: "resol", arg: 2, scope: !447, file: !1, line: 131, type: !452)
!456 = !DILocation(line: 131, column: 91, scope: !447)
!457 = !DILocation(line: 133, column: 6, scope: !458)
!458 = distinct !DILexicalBlock(scope: !447, file: !1, line: 133, column: 6)
!459 = !DILocation(line: 133, column: 14, scope: !458)
!460 = !DILocation(line: 133, column: 19, scope: !458)
!461 = !DILocation(line: 133, column: 6, scope: !447)
!462 = !DILocation(line: 134, column: 10, scope: !463)
!463 = distinct !DILexicalBlock(scope: !458, file: !1, line: 133, column: 41)
!464 = !DILocation(line: 134, column: 18, scope: !463)
!465 = !DILocation(line: 134, column: 30, scope: !463)
!466 = !DILocation(line: 134, column: 28, scope: !463)
!467 = !DILocation(line: 134, column: 3, scope: !463)
!468 = !DILocation(line: 137, column: 12, scope: !469)
!469 = distinct !DILexicalBlock(scope: !458, file: !1, line: 136, column: 7)
!470 = !DILocation(line: 137, column: 20, scope: !469)
!471 = !DILocation(line: 137, column: 30, scope: !469)
!472 = !DILocation(line: 137, column: 37, scope: !469)
!473 = !DILocation(line: 137, column: 35, scope: !469)
!474 = !DILocation(line: 137, column: 44, scope: !469)
!475 = !DILocation(line: 137, column: 3, scope: !469)
!476 = !DILocation(line: 139, column: 1, scope: !447)
!477 = distinct !DISubprogram(name: "BKE_mask_spline_differentiate_with_resolution", scope: !1, file: !1, line: 141, type: !478, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!478 = !DISubroutineType(types: !479)
!479 = !{!480, !22, !481, !452}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!482 = !DILocalVariable(name: "spline", arg: 1, scope: !477, file: !1, line: 141, type: !22)
!483 = !DILocation(line: 141, column: 67, scope: !477)
!484 = !DILocalVariable(name: "tot_diff_point", arg: 2, scope: !477, file: !1, line: 142, type: !481)
!485 = !DILocation(line: 142, column: 69, scope: !477)
!486 = !DILocalVariable(name: "resol", arg: 3, scope: !477, file: !1, line: 143, type: !452)
!487 = !DILocation(line: 143, column: 74, scope: !477)
!488 = !DILocalVariable(name: "points_array", scope: !477, file: !1, line: 146, type: !36)
!489 = !DILocation(line: 146, column: 19, scope: !477)
!490 = !DILocation(line: 146, column: 62, scope: !477)
!491 = !DILocation(line: 146, column: 34, scope: !477)
!492 = !DILocalVariable(name: "point_curr", scope: !477, file: !1, line: 148, type: !36)
!493 = !DILocation(line: 148, column: 19, scope: !477)
!494 = !DILocalVariable(name: "point_prev", scope: !477, file: !1, line: 148, type: !36)
!495 = !DILocation(line: 148, column: 32, scope: !477)
!496 = !DILocalVariable(name: "diff_points", scope: !477, file: !1, line: 149, type: !480)
!497 = !DILocation(line: 149, column: 10, scope: !477)
!498 = !DILocalVariable(name: "fp", scope: !477, file: !1, line: 149, type: !480)
!499 = !DILocation(line: 149, column: 29, scope: !477)
!500 = !DILocalVariable(name: "tot", scope: !477, file: !1, line: 150, type: !501)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!502 = !DILocation(line: 150, column: 12, scope: !477)
!503 = !DILocation(line: 150, column: 59, scope: !477)
!504 = !DILocation(line: 150, column: 67, scope: !477)
!505 = !DILocation(line: 150, column: 18, scope: !477)
!506 = !DILocalVariable(name: "a", scope: !477, file: !1, line: 151, type: !13)
!507 = !DILocation(line: 151, column: 6, scope: !477)
!508 = !DILocation(line: 153, column: 6, scope: !509)
!509 = distinct !DILexicalBlock(scope: !477, file: !1, line: 153, column: 6)
!510 = !DILocation(line: 153, column: 14, scope: !509)
!511 = !DILocation(line: 153, column: 24, scope: !509)
!512 = !DILocation(line: 153, column: 6, scope: !477)
!513 = !DILocation(line: 155, column: 4, scope: !514)
!514 = distinct !DILexicalBlock(scope: !509, file: !1, line: 153, column: 30)
!515 = !DILocation(line: 155, column: 19, scope: !514)
!516 = !DILocation(line: 156, column: 3, scope: !514)
!517 = !DILocation(line: 160, column: 20, scope: !477)
!518 = !DILocation(line: 160, column: 3, scope: !477)
!519 = !DILocation(line: 160, column: 18, scope: !477)
!520 = !DILocation(line: 161, column: 21, scope: !477)
!521 = !DILocation(line: 161, column: 34, scope: !477)
!522 = !DILocation(line: 161, column: 38, scope: !477)
!523 = !DILocation(line: 161, column: 33, scope: !477)
!524 = !DILocation(line: 161, column: 43, scope: !477)
!525 = !DILocation(line: 161, column: 19, scope: !477)
!526 = !DILocation(line: 161, column: 14, scope: !477)
!527 = !DILocation(line: 163, column: 6, scope: !477)
!528 = !DILocation(line: 163, column: 14, scope: !477)
!529 = !DILocation(line: 163, column: 24, scope: !477)
!530 = !DILocation(line: 163, column: 4, scope: !477)
!531 = !DILocation(line: 164, column: 6, scope: !532)
!532 = distinct !DILexicalBlock(scope: !477, file: !1, line: 164, column: 6)
!533 = !DILocation(line: 164, column: 14, scope: !532)
!534 = !DILocation(line: 164, column: 19, scope: !532)
!535 = !DILocation(line: 164, column: 6, scope: !477)
!536 = !DILocation(line: 165, column: 4, scope: !532)
!537 = !DILocation(line: 165, column: 3, scope: !532)
!538 = !DILocation(line: 167, column: 15, scope: !477)
!539 = !DILocation(line: 167, column: 13, scope: !477)
!540 = !DILocation(line: 168, column: 15, scope: !477)
!541 = !DILocation(line: 168, column: 26, scope: !477)
!542 = !DILocation(line: 168, column: 13, scope: !477)
!543 = !DILocation(line: 170, column: 2, scope: !477)
!544 = !DILocation(line: 170, column: 10, scope: !477)
!545 = !DILocalVariable(name: "bezt_prev", scope: !546, file: !1, line: 171, type: !206)
!546 = distinct !DILexicalBlock(scope: !477, file: !1, line: 170, column: 14)
!547 = !DILocation(line: 171, column: 14, scope: !546)
!548 = !DILocalVariable(name: "bezt_curr", scope: !546, file: !1, line: 172, type: !206)
!549 = !DILocation(line: 172, column: 14, scope: !546)
!550 = !DILocalVariable(name: "j", scope: !546, file: !1, line: 173, type: !13)
!551 = !DILocation(line: 173, column: 7, scope: !546)
!552 = !DILocation(line: 175, column: 7, scope: !553)
!553 = distinct !DILexicalBlock(scope: !546, file: !1, line: 175, column: 7)
!554 = !DILocation(line: 175, column: 9, scope: !553)
!555 = !DILocation(line: 175, column: 14, scope: !553)
!556 = !DILocation(line: 175, column: 18, scope: !553)
!557 = !DILocation(line: 175, column: 26, scope: !553)
!558 = !DILocation(line: 175, column: 31, scope: !553)
!559 = !DILocation(line: 175, column: 7, scope: !546)
!560 = !DILocation(line: 176, column: 17, scope: !553)
!561 = !DILocation(line: 176, column: 15, scope: !553)
!562 = !DILocation(line: 176, column: 4, scope: !553)
!563 = !DILocation(line: 178, column: 16, scope: !546)
!564 = !DILocation(line: 178, column: 28, scope: !546)
!565 = !DILocation(line: 178, column: 13, scope: !546)
!566 = !DILocation(line: 179, column: 16, scope: !546)
!567 = !DILocation(line: 179, column: 28, scope: !546)
!568 = !DILocation(line: 179, column: 13, scope: !546)
!569 = !DILocation(line: 181, column: 10, scope: !570)
!570 = distinct !DILexicalBlock(scope: !546, file: !1, line: 181, column: 3)
!571 = !DILocation(line: 181, column: 8, scope: !570)
!572 = !DILocation(line: 181, column: 15, scope: !573)
!573 = distinct !DILexicalBlock(scope: !570, file: !1, line: 181, column: 3)
!574 = !DILocation(line: 181, column: 17, scope: !573)
!575 = !DILocation(line: 181, column: 3, scope: !570)
!576 = !DILocation(line: 182, column: 34, scope: !577)
!577 = distinct !DILexicalBlock(scope: !573, file: !1, line: 181, column: 27)
!578 = !DILocation(line: 182, column: 45, scope: !577)
!579 = !DILocation(line: 182, column: 52, scope: !577)
!580 = !DILocation(line: 182, column: 56, scope: !577)
!581 = !DILocation(line: 182, column: 67, scope: !577)
!582 = !DILocation(line: 182, column: 74, scope: !577)
!583 = !DILocation(line: 183, column: 34, scope: !577)
!584 = !DILocation(line: 183, column: 45, scope: !577)
!585 = !DILocation(line: 183, column: 52, scope: !577)
!586 = !DILocation(line: 183, column: 56, scope: !577)
!587 = !DILocation(line: 183, column: 67, scope: !577)
!588 = !DILocation(line: 183, column: 74, scope: !577)
!589 = !DILocation(line: 184, column: 37, scope: !577)
!590 = !DILocation(line: 184, column: 41, scope: !577)
!591 = !DILocation(line: 184, column: 35, scope: !577)
!592 = !DILocation(line: 184, column: 45, scope: !577)
!593 = !DILocation(line: 182, column: 4, scope: !577)
!594 = !DILocation(line: 185, column: 3, scope: !577)
!595 = !DILocation(line: 181, column: 23, scope: !573)
!596 = !DILocation(line: 181, column: 3, scope: !573)
!597 = distinct !{!597, !575, !598}
!598 = !DILocation(line: 185, column: 3, scope: !570)
!599 = !DILocation(line: 187, column: 9, scope: !546)
!600 = !DILocation(line: 187, column: 6, scope: !546)
!601 = !DILocation(line: 189, column: 7, scope: !602)
!602 = distinct !DILexicalBlock(scope: !546, file: !1, line: 189, column: 7)
!603 = !DILocation(line: 189, column: 9, scope: !602)
!604 = !DILocation(line: 189, column: 14, scope: !602)
!605 = !DILocation(line: 189, column: 18, scope: !602)
!606 = !DILocation(line: 189, column: 26, scope: !602)
!607 = !DILocation(line: 189, column: 31, scope: !602)
!608 = !DILocation(line: 189, column: 53, scope: !602)
!609 = !DILocation(line: 189, column: 7, scope: !546)
!610 = !DILocation(line: 190, column: 16, scope: !611)
!611 = distinct !DILexicalBlock(scope: !602, file: !1, line: 189, column: 59)
!612 = !DILocation(line: 190, column: 15, scope: !611)
!613 = !DILocation(line: 190, column: 20, scope: !611)
!614 = !DILocation(line: 190, column: 31, scope: !611)
!615 = !DILocation(line: 190, column: 4, scope: !611)
!616 = !DILocation(line: 191, column: 3, scope: !611)
!617 = !DILocation(line: 193, column: 16, scope: !546)
!618 = !DILocation(line: 193, column: 14, scope: !546)
!619 = !DILocation(line: 194, column: 13, scope: !546)
!620 = distinct !{!620, !543, !621}
!621 = !DILocation(line: 195, column: 2, scope: !477)
!622 = !DILocation(line: 197, column: 9, scope: !477)
!623 = !DILocation(line: 197, column: 2, scope: !477)
!624 = !DILocation(line: 198, column: 1, scope: !477)
!625 = distinct !DISubprogram(name: "copy_v2_v2", scope: !294, file: !294, line: 58, type: !626, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !14, !297}
!628 = !DILocalVariable(name: "r", arg: 1, scope: !625, file: !294, line: 58, type: !14)
!629 = !DILocation(line: 58, column: 31, scope: !625)
!630 = !DILocalVariable(name: "a", arg: 2, scope: !625, file: !294, line: 58, type: !297)
!631 = !DILocation(line: 58, column: 49, scope: !625)
!632 = !DILocation(line: 60, column: 9, scope: !625)
!633 = !DILocation(line: 60, column: 2, scope: !625)
!634 = !DILocation(line: 60, column: 7, scope: !625)
!635 = !DILocation(line: 61, column: 9, scope: !625)
!636 = !DILocation(line: 61, column: 2, scope: !625)
!637 = !DILocation(line: 61, column: 7, scope: !625)
!638 = !DILocation(line: 62, column: 1, scope: !625)
!639 = distinct !DISubprogram(name: "BKE_mask_spline_differentiate", scope: !1, file: !1, line: 200, type: !640, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!640 = !DISubroutineType(types: !641)
!641 = !{!480, !22, !13, !13, !481}
!642 = !DILocalVariable(name: "spline", arg: 1, scope: !639, file: !1, line: 200, type: !22)
!643 = !DILocation(line: 200, column: 51, scope: !639)
!644 = !DILocalVariable(name: "width", arg: 2, scope: !639, file: !1, line: 200, type: !13)
!645 = !DILocation(line: 200, column: 63, scope: !639)
!646 = !DILocalVariable(name: "height", arg: 3, scope: !639, file: !1, line: 200, type: !13)
!647 = !DILocation(line: 200, column: 74, scope: !639)
!648 = !DILocalVariable(name: "tot_diff_point", arg: 4, scope: !639, file: !1, line: 201, type: !481)
!649 = !DILocation(line: 201, column: 53, scope: !639)
!650 = !DILocalVariable(name: "resol", scope: !639, file: !1, line: 204, type: !5)
!651 = !DILocation(line: 204, column: 15, scope: !639)
!652 = !DILocation(line: 204, column: 50, scope: !639)
!653 = !DILocation(line: 204, column: 58, scope: !639)
!654 = !DILocation(line: 204, column: 65, scope: !639)
!655 = !DILocation(line: 204, column: 23, scope: !639)
!656 = !DILocation(line: 206, column: 55, scope: !639)
!657 = !DILocation(line: 206, column: 63, scope: !639)
!658 = !DILocation(line: 206, column: 79, scope: !639)
!659 = !DILocation(line: 206, column: 9, scope: !639)
!660 = !DILocation(line: 206, column: 2, scope: !639)
!661 = distinct !DISubprogram(name: "BKE_mask_spline_feather_collapse_inner_loops", scope: !1, file: !1, line: 334, type: !662, scopeLine: 336, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !22, !480, !452}
!664 = !DILocalVariable(name: "spline", arg: 1, scope: !661, file: !1, line: 335, type: !22)
!665 = !DILocation(line: 335, column: 21, scope: !661)
!666 = !DILocalVariable(name: "feather_points", arg: 2, scope: !661, file: !1, line: 335, type: !480)
!667 = !DILocation(line: 335, column: 37, scope: !661)
!668 = !DILocalVariable(name: "tot_feather_point", arg: 3, scope: !661, file: !1, line: 335, type: !452)
!669 = !DILocation(line: 335, column: 76, scope: !661)
!670 = !DILocalVariable(name: "buckets_per_side", scope: !661, file: !1, line: 340, type: !13)
!671 = !DILocation(line: 340, column: 6, scope: !661)
!672 = !DILocalVariable(name: "tot_bucket", scope: !661, file: !1, line: 340, type: !13)
!673 = !DILocation(line: 340, column: 24, scope: !661)
!674 = !DILocalVariable(name: "bucket_size", scope: !661, file: !1, line: 341, type: !11)
!675 = !DILocation(line: 341, column: 8, scope: !661)
!676 = !DILocalVariable(name: "bucket_scale", scope: !661, file: !1, line: 341, type: !154)
!677 = !DILocation(line: 341, column: 21, scope: !661)
!678 = !DILocalVariable(name: "buckets", scope: !661, file: !1, line: 343, type: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "FeatherEdgesBucket", file: !1, line: 215, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FeatherEdgesBucket", file: !1, line: 211, size: 192, elements: !682)
!682 = !{!683, !684, !687}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tot_segment", scope: !681, file: !1, line: 212, baseType: !13, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !681, file: !1, line: 213, baseType: !685, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !155)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_segment", scope: !681, file: !1, line: 214, baseType: !13, size: 32, offset: 128)
!688 = !DILocation(line: 343, column: 22, scope: !661)
!689 = !DILocalVariable(name: "i", scope: !661, file: !1, line: 345, type: !5)
!690 = !DILocation(line: 345, column: 15, scope: !661)
!691 = !DILocalVariable(name: "min", scope: !661, file: !1, line: 346, type: !154)
!692 = !DILocation(line: 346, column: 8, scope: !661)
!693 = !DILocalVariable(name: "max", scope: !661, file: !1, line: 346, type: !154)
!694 = !DILocation(line: 346, column: 16, scope: !661)
!695 = !DILocalVariable(name: "max_delta_x", scope: !661, file: !1, line: 347, type: !11)
!696 = !DILocation(line: 347, column: 8, scope: !661)
!697 = !DILocalVariable(name: "max_delta_y", scope: !661, file: !1, line: 347, type: !11)
!698 = !DILocation(line: 347, column: 29, scope: !661)
!699 = !DILocalVariable(name: "max_delta", scope: !661, file: !1, line: 347, type: !11)
!700 = !DILocation(line: 347, column: 50, scope: !661)
!701 = !DILocation(line: 349, column: 6, scope: !702)
!702 = distinct !DILexicalBlock(scope: !661, file: !1, line: 349, column: 6)
!703 = !DILocation(line: 349, column: 24, scope: !702)
!704 = !DILocation(line: 349, column: 6, scope: !661)
!705 = !DILocation(line: 354, column: 3, scope: !706)
!706 = distinct !DILexicalBlock(scope: !702, file: !1, line: 349, column: 29)
!707 = !DILocation(line: 358, column: 2, scope: !708)
!708 = distinct !DILexicalBlock(scope: !661, file: !1, line: 358, column: 2)
!709 = !DILocation(line: 360, column: 9, scope: !710)
!710 = distinct !DILexicalBlock(scope: !661, file: !1, line: 360, column: 2)
!711 = !DILocation(line: 360, column: 7, scope: !710)
!712 = !DILocation(line: 360, column: 14, scope: !713)
!713 = distinct !DILexicalBlock(scope: !710, file: !1, line: 360, column: 2)
!714 = !DILocation(line: 360, column: 18, scope: !713)
!715 = !DILocation(line: 360, column: 16, scope: !713)
!716 = !DILocation(line: 360, column: 2, scope: !710)
!717 = !DILocalVariable(name: "next", scope: !718, file: !1, line: 361, type: !5)
!718 = distinct !DILexicalBlock(scope: !713, file: !1, line: 360, column: 42)
!719 = !DILocation(line: 361, column: 16, scope: !718)
!720 = !DILocation(line: 361, column: 23, scope: !718)
!721 = !DILocation(line: 361, column: 25, scope: !718)
!722 = !DILocalVariable(name: "delta", scope: !718, file: !1, line: 362, type: !11)
!723 = !DILocation(line: 362, column: 9, scope: !718)
!724 = !DILocation(line: 364, column: 18, scope: !718)
!725 = !DILocation(line: 364, column: 23, scope: !718)
!726 = !DILocation(line: 364, column: 28, scope: !718)
!727 = !DILocation(line: 364, column: 43, scope: !718)
!728 = !DILocation(line: 364, column: 3, scope: !718)
!729 = !DILocation(line: 366, column: 7, scope: !730)
!730 = distinct !DILexicalBlock(scope: !718, file: !1, line: 366, column: 7)
!731 = !DILocation(line: 366, column: 15, scope: !730)
!732 = !DILocation(line: 366, column: 12, scope: !730)
!733 = !DILocation(line: 366, column: 7, scope: !718)
!734 = !DILocation(line: 367, column: 8, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 367, column: 8)
!736 = distinct !DILexicalBlock(scope: !730, file: !1, line: 366, column: 34)
!737 = !DILocation(line: 367, column: 16, scope: !735)
!738 = !DILocation(line: 367, column: 21, scope: !735)
!739 = !DILocation(line: 367, column: 8, scope: !736)
!740 = !DILocation(line: 368, column: 10, scope: !735)
!741 = !DILocation(line: 368, column: 5, scope: !735)
!742 = !DILocation(line: 370, column: 5, scope: !735)
!743 = !DILocation(line: 371, column: 3, scope: !736)
!744 = !DILocation(line: 373, column: 17, scope: !718)
!745 = !DILocation(line: 373, column: 32, scope: !718)
!746 = !DILocation(line: 373, column: 40, scope: !718)
!747 = !DILocation(line: 373, column: 55, scope: !718)
!748 = !DILocation(line: 373, column: 38, scope: !718)
!749 = !DILocation(line: 373, column: 11, scope: !718)
!750 = !DILocation(line: 373, column: 9, scope: !718)
