; ModuleID = 'blender/source/blender/modifiers/intern/MOD_meshcache_pc2.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_meshcache_pc2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.PC2Head = type { [12 x i8], i32, i32, float, float, i32 }

@.str = private unnamed_addr constant [21 x i8] c"Failed to seek frame\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"Unknown error opening file\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"Missing header\00", align 1
@.str.4 = private unnamed_addr constant [12 x i8] c"POINTCACHE2\00", align 1
@.str.5 = private unnamed_addr constant [15 x i8] c"Invalid header\00", align 1
@.str.6 = private unnamed_addr constant [22 x i8] c"Vertex count mismatch\00", align 1
@.str.7 = private unnamed_addr constant [20 x i8] c"Invalid frame total\00", align 1

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/modifiers/intern/MOD_meshcache_pc2.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!10 = distinct !DISubprogram(name: "MOD_meshcache_read_pc2_index", scope: !1, file: !1, line: 135, type: !11, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !76, !80, !80, !81, !82}
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !16, line: 7, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !18, line: 49, size: 1728, elements: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!19 = !{!20, !22, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !40, !41, !42, !46, !48, !50, !54, !57, !59, !62, !65, !66, !67, !71, !72}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !17, file: !18, line: 51, baseType: !21, size: 32)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !17, file: !18, line: 54, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !17, file: !18, line: 55, baseType: !23, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !17, file: !18, line: 56, baseType: !23, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !17, file: !18, line: 57, baseType: !23, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !17, file: !18, line: 58, baseType: !23, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !17, file: !18, line: 59, baseType: !23, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !17, file: !18, line: 60, baseType: !23, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !17, file: !18, line: 61, baseType: !23, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !17, file: !18, line: 64, baseType: !23, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !17, file: !18, line: 65, baseType: !23, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !17, file: !18, line: 66, baseType: !23, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !17, file: !18, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !18, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !17, file: !18, line: 70, baseType: !39, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !17, file: !18, line: 72, baseType: !21, size: 32, offset: 896)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !17, file: !18, line: 73, baseType: !21, size: 32, offset: 928)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !17, file: !18, line: 74, baseType: !43, size: 64, offset: 960)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !17, file: !18, line: 77, baseType: !47, size: 16, offset: 1024)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !17, file: !18, line: 78, baseType: !49, size: 8, offset: 1040)
!49 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !17, file: !18, line: 79, baseType: !51, size: 8, offset: 1048)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !17, file: !18, line: 81, baseType: !55, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !18, line: 43, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !17, file: !18, line: 89, baseType: !58, size: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !45)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !17, file: !18, line: 91, baseType: !60, size: 64, offset: 1216)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !18, line: 37, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !17, file: !18, line: 92, baseType: !63, size: 64, offset: 1280)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !18, line: 38, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !17, file: !18, line: 93, baseType: !39, size: 64, offset: 1344)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !17, file: !18, line: 94, baseType: !4, size: 64, offset: 1408)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !17, file: !18, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !17, file: !18, line: 96, baseType: !21, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !17, file: !18, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 3)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!85 = !DILocalVariable(name: "fp", arg: 1, scope: !10, file: !1, line: 135, type: !14)
!86 = !DILocation(line: 135, column: 41, scope: !10)
!87 = !DILocalVariable(name: "vertexCos", arg: 2, scope: !10, file: !1, line: 136, type: !76)
!88 = !DILocation(line: 136, column: 43, scope: !10)
!89 = !DILocalVariable(name: "verts_tot", arg: 3, scope: !10, file: !1, line: 136, type: !80)
!90 = !DILocation(line: 136, column: 68, scope: !10)
!91 = !DILocalVariable(name: "index", arg: 4, scope: !10, file: !1, line: 137, type: !80)
!92 = !DILocation(line: 137, column: 45, scope: !10)
!93 = !DILocalVariable(name: "factor", arg: 5, scope: !10, file: !1, line: 137, type: !81)
!94 = !DILocation(line: 137, column: 64, scope: !10)
!95 = !DILocalVariable(name: "err_str", arg: 6, scope: !10, file: !1, line: 138, type: !82)
!96 = !DILocation(line: 138, column: 48, scope: !10)
!97 = !DILocalVariable(name: "pc2_head", scope: !10, file: !1, line: 140, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC2Head", file: !1, line: 50, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PC2Head", file: !1, line: 43, size: 256, elements: !100)
!100 = !{!101, !105, !106, !107, !108, !109}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !99, file: !1, line: 44, baseType: !102, size: 96)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 96, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 12)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "file_version", scope: !99, file: !1, line: 45, baseType: !21, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "verts_tot", scope: !99, file: !1, line: 46, baseType: !21, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !99, file: !1, line: 47, baseType: !5, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sampling", scope: !99, file: !1, line: 48, baseType: !5, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "frame_tot", scope: !99, file: !1, line: 49, baseType: !21, size: 32, offset: 224)
!110 = !DILocation(line: 140, column: 10, scope: !10)
!111 = !DILocation(line: 142, column: 30, scope: !112)
!112 = distinct !DILexicalBlock(scope: !10, file: !1, line: 142, column: 6)
!113 = !DILocation(line: 142, column: 34, scope: !112)
!114 = !DILocation(line: 142, column: 56, scope: !112)
!115 = !DILocation(line: 142, column: 6, scope: !112)
!116 = !DILocation(line: 142, column: 65, scope: !112)
!117 = !DILocation(line: 142, column: 6, scope: !10)
!118 = !DILocation(line: 143, column: 3, scope: !119)
!119 = distinct !DILexicalBlock(scope: !112, file: !1, line: 142, column: 75)
!120 = !DILocation(line: 146, column: 12, scope: !121)
!121 = distinct !DILexicalBlock(scope: !10, file: !1, line: 146, column: 6)
!122 = !DILocation(line: 146, column: 16, scope: !121)
!123 = !DILocation(line: 146, column: 33, scope: !121)
!124 = !DILocation(line: 146, column: 22, scope: !121)
!125 = !DILocation(line: 146, column: 43, scope: !121)
!126 = !DILocation(line: 146, column: 59, scope: !121)
!127 = !DILocation(line: 146, column: 6, scope: !121)
!128 = !DILocation(line: 146, column: 74, scope: !121)
!129 = !DILocation(line: 146, column: 6, scope: !10)
!130 = !DILocation(line: 147, column: 4, scope: !131)
!131 = distinct !DILexicalBlock(scope: !121, file: !1, line: 146, column: 80)
!132 = !DILocation(line: 147, column: 12, scope: !131)
!133 = !DILocation(line: 148, column: 3, scope: !131)
!134 = !DILocation(line: 151, column: 6, scope: !135)
!135 = distinct !DILexicalBlock(scope: !10, file: !1, line: 151, column: 6)
!136 = !DILocation(line: 151, column: 13, scope: !135)
!137 = !DILocation(line: 151, column: 6, scope: !10)
!138 = !DILocalVariable(name: "vco", scope: !139, file: !1, line: 152, type: !140)
!139 = distinct !DILexicalBlock(scope: !135, file: !1, line: 151, column: 22)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!141 = !DILocation(line: 152, column: 10, scope: !139)
!142 = !DILocation(line: 152, column: 17, scope: !139)
!143 = !DILocation(line: 152, column: 16, scope: !139)
!144 = !DILocalVariable(name: "i", scope: !139, file: !1, line: 153, type: !145)
!145 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!146 = !DILocation(line: 153, column: 16, scope: !139)
!147 = !DILocation(line: 154, column: 21, scope: !148)
!148 = distinct !DILexicalBlock(scope: !139, file: !1, line: 154, column: 3)
!149 = !DILocation(line: 154, column: 10, scope: !148)
!150 = !DILocation(line: 154, column: 8, scope: !148)
!151 = !DILocation(line: 154, column: 32, scope: !152)
!152 = distinct !DILexicalBlock(scope: !148, file: !1, line: 154, column: 3)
!153 = !DILocation(line: 154, column: 34, scope: !152)
!154 = !DILocation(line: 154, column: 3, scope: !148)
!155 = !DILocation(line: 155, column: 10, scope: !156)
!156 = distinct !DILexicalBlock(scope: !152, file: !1, line: 154, column: 56)
!157 = !DILocation(line: 155, column: 37, scope: !156)
!158 = !DILocation(line: 155, column: 4, scope: !156)
!159 = !DILocation(line: 162, column: 3, scope: !156)
!160 = !DILocation(line: 154, column: 42, scope: !152)
!161 = !DILocation(line: 154, column: 50, scope: !152)
!162 = !DILocation(line: 154, column: 3, scope: !152)
!163 = distinct !{!163, !154, !164}
!164 = !DILocation(line: 162, column: 3, scope: !148)
!165 = !DILocation(line: 163, column: 2, scope: !139)
!166 = !DILocalVariable(name: "ifactor", scope: !167, file: !1, line: 165, type: !81)
!167 = distinct !DILexicalBlock(scope: !135, file: !1, line: 164, column: 7)
!168 = !DILocation(line: 165, column: 15, scope: !167)
!169 = !DILocation(line: 165, column: 32, scope: !167)
!170 = !DILocation(line: 165, column: 30, scope: !167)
!171 = !DILocalVariable(name: "vco", scope: !167, file: !1, line: 166, type: !140)
!172 = !DILocation(line: 166, column: 10, scope: !167)
!173 = !DILocation(line: 166, column: 17, scope: !167)
