; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_operators.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_operators.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMOpDefine = type { i8*, [16 x %struct.BMOSlotType], [16 x %struct.BMOSlotType], void (%struct.BMesh*, %struct.BMOperator*)*, i32 }
%struct.BMOSlotType = type { [32 x i8], i32, %union.eBMOpSlotSubType_Union }
%union.eBMOpSlotSubType_Union = type { i32 }
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }

!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!27 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!28 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !6, line: 123, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!35 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!36 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 182, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 249, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 260, baseType: !7, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59}
!53 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !61, line: 57, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!63 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 200, baseType: !7, size: 32, elements: !78)
!78 = !{!79}
!79 = !DIEnumerator(name: "BMO_FLAG_RESPECT_HIDE", value: 1, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 83, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !{!83, !84}
!83 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!85 = !{!86, !103, !108, !96, !112, !113, !114, !125, !126, !128, !130, !98, !133, !140, !141, !145, !149, !196, !198, !180, !124, !200, !100}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !45, line: 154, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !45, line: 152, size: 128, elements: !90)
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !89, file: !45, line: 153, baseType: !92, size: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !45, line: 82, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !45, line: 64, size: 128, elements: !94)
!94 = !{!95, !97, !99, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !45, line: 65, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !93, file: !45, line: 66, baseType: !98, size: 32, offset: 64)
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !93, file: !45, line: 73, baseType: !100, size: 8, offset: 96)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !93, file: !45, line: 74, baseType: !100, size: 8, offset: 104)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !93, file: !45, line: 80, baseType: !100, size: 8, offset: 112)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !106)
!105 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!106 = !{!107}
!107 = !DISubrange(count: 4)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 96, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElemF", file: !45, line: 149, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElemF", file: !45, line: 143, size: 192, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !116, file: !45, line: 144, baseType: !92, size: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !116, file: !45, line: 148, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !45, line: 180, size: 16, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !121, file: !45, line: 181, baseType: !124, size: 16)
!124 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !135, line: 94, size: 192, elements: !136)
!135 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !135, line: 94, baseType: !96, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !134, file: !135, line: 94, baseType: !96, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !135, line: 94, baseType: !96, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !61, line: 79, baseType: !60)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !61, line: 158, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !96}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !61, line: 159, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!96, !96}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !45, line: 103, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !45, line: 90, size: 448, elements: !152)
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !151, file: !45, line: 91, baseType: !92, size: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !151, file: !45, line: 92, baseType: !120, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !151, file: !45, line: 94, baseType: !109, size: 96, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !151, file: !45, line: 95, baseType: !109, size: 96, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !151, file: !45, line: 102, baseType: !158, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !45, line: 110, size: 640, elements: !160)
!160 = !{!161, !162, !163, !165, !166, !189, !195}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !159, file: !45, line: 111, baseType: !92, size: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !159, file: !45, line: 112, baseType: !120, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !159, file: !45, line: 114, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !159, file: !45, line: 114, baseType: !164, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !159, file: !45, line: 118, baseType: !167, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !45, line: 125, size: 576, elements: !169)
!169 = !{!170, !171, !172, !173, !185, !186, !187, !188}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !168, file: !45, line: 126, baseType: !92, size: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !168, file: !45, line: 129, baseType: !164, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !168, file: !45, line: 130, baseType: !158, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !168, file: !45, line: 131, baseType: !174, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !45, line: 164, size: 448, elements: !176)
!176 = !{!177, !178, !179, !182, !183, !184}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !175, file: !45, line: 165, baseType: !92, size: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !175, file: !45, line: 166, baseType: !120, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !175, file: !45, line: 172, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !45, line: 140, baseType: !168)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !175, file: !45, line: 174, baseType: !98, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !175, file: !45, line: 175, baseType: !109, size: 96, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !175, file: !45, line: 176, baseType: !124, size: 16, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !168, file: !45, line: 135, baseType: !167, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !168, file: !45, line: 135, baseType: !167, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !45, line: 139, baseType: !167, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !168, file: !45, line: 139, baseType: !167, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !159, file: !45, line: 122, baseType: !190, size: 128, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !45, line: 108, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !45, line: 106, size: 128, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !45, line: 107, baseType: !158, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !45, line: 107, baseType: !158, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !159, file: !45, line: 122, baseType: !190, size: 128, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !45, line: 123, baseType: !159)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !45, line: 178, baseType: !175)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!201 = !{!0, !202}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "bmo_error_messages", scope: !2, file: !3, line: 50, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 640, elements: !207)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!207 = !{!208}
!208 = !DISubrange(count: 10)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 352, elements: !211)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!211 = !{!212}
!212 = !DISubrange(count: 11)
!213 = !{i32 7, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{i32 1, !"wchar_size", i32 4}
!216 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!217 = distinct !DISubprogram(name: "BMO_op_flag_enable", scope: !3, file: !3, line: 83, type: !218, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220, !358, !210}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !45, line: 246, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !45, line: 186, size: 8064, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !236, !237, !238, !239, !241, !243, !245, !246, !247, !248, !249, !250, !251, !252, !301, !341, !342, !343, !344, !345, !346, !347, !348, !355, !356, !357}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !222, file: !45, line: 187, baseType: !98, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !222, file: !45, line: 187, baseType: !98, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !222, file: !45, line: 187, baseType: !98, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !222, file: !45, line: 187, baseType: !98, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !222, file: !45, line: 188, baseType: !98, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !222, file: !45, line: 188, baseType: !98, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !222, file: !45, line: 188, baseType: !98, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !222, file: !45, line: 193, baseType: !100, size: 8, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !222, file: !45, line: 197, baseType: !100, size: 8, offset: 232)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !222, file: !45, line: 201, baseType: !234, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !81, line: 44, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !222, file: !45, line: 201, baseType: !234, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !222, file: !45, line: 201, baseType: !234, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !222, file: !45, line: 201, baseType: !234, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !222, file: !45, line: 208, baseType: !240, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !222, file: !45, line: 209, baseType: !242, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !222, file: !45, line: 210, baseType: !244, size: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !222, file: !45, line: 213, baseType: !98, size: 32, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !222, file: !45, line: 214, baseType: !98, size: 32, offset: 736)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !222, file: !45, line: 215, baseType: !98, size: 32, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !222, file: !45, line: 218, baseType: !234, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !222, file: !45, line: 218, baseType: !234, size: 64, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !222, file: !45, line: 218, baseType: !234, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !222, file: !45, line: 220, baseType: !98, size: 32, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !222, file: !45, line: 221, baseType: !253, size: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !255)
!255 = !{!256, !288, !289, !293, !297, !298, !300}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !254, file: !6, line: 191, baseType: !257, size: 5120)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 5120, elements: !286)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !259)
!259 = !{!260, !261, !263, !273, !274}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !258, file: !6, line: 148, baseType: !205, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !258, file: !6, line: 149, baseType: !262, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !258, file: !6, line: 150, baseType: !264, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !266)
!266 = !{!267, !269, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !265, file: !6, line: 139, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !265, file: !6, line: 140, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !265, file: !6, line: 141, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !6, line: 152, baseType: !98, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !6, line: 162, baseType: !275, size: 128, offset: 192)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !258, file: !6, line: 155, size: 128, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !275, file: !6, line: 156, baseType: !98, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !275, file: !6, line: 157, baseType: !105, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !275, file: !6, line: 158, baseType: !96, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !275, file: !6, line: 159, baseType: !109, size: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !275, file: !6, line: 160, baseType: !200, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !275, file: !6, line: 161, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !135, line: 48, baseType: !285)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !135, line: 48, flags: DIFlagFwdDecl)
!286 = !{!287}
!287 = !DISubrange(count: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !254, file: !6, line: 192, baseType: !257, size: 5120, offset: 5120)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !254, file: !6, line: 193, baseType: !290, size: 64, offset: 10240)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !220, !253}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !254, file: !6, line: 194, baseType: !294, size: 64, offset: 10304)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !296, line: 52, flags: DIFlagFwdDecl)
!296 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !6, line: 195, baseType: !98, size: 32, offset: 10368)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !254, file: !6, line: 196, baseType: !299, size: 32, offset: 10400)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !254, file: !6, line: 197, baseType: !98, size: 32, offset: 10432)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !222, file: !45, line: 223, baseType: !302, size: 1600, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !303, line: 73, baseType: !304)
!303 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !303, line: 64, size: 1600, elements: !305)
!305 = !{!306, !324, !328, !329, !330, !331, !332}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !304, file: !303, line: 65, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !303, line: 53, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !303, line: 42, size: 832, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !303, line: 43, baseType: !98, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !309, file: !303, line: 44, baseType: !98, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !309, file: !303, line: 45, baseType: !98, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !309, file: !303, line: 46, baseType: !98, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !309, file: !303, line: 47, baseType: !98, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !309, file: !303, line: 48, baseType: !98, size: 32, offset: 160)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !309, file: !303, line: 49, baseType: !98, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !309, file: !303, line: 50, baseType: !98, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !303, line: 51, baseType: !320, size: 512, offset: 256)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 512, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !303, line: 52, baseType: !96, size: 64, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !304, file: !303, line: 66, baseType: !325, size: 1312, offset: 64)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 1312, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 41)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !304, file: !303, line: 69, baseType: !98, size: 32, offset: 1376)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !304, file: !303, line: 69, baseType: !98, size: 32, offset: 1408)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !304, file: !303, line: 70, baseType: !98, size: 32, offset: 1440)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !304, file: !303, line: 71, baseType: !234, size: 64, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !304, file: !303, line: 72, baseType: !333, size: 64, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !303, line: 59, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !303, line: 57, size: 8192, elements: !336)
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !335, file: !303, line: 58, baseType: !338, size: 8192)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 8192, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !222, file: !45, line: 223, baseType: !302, size: 1600, offset: 2752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !222, file: !45, line: 223, baseType: !302, size: 1600, offset: 4352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !222, file: !45, line: 223, baseType: !302, size: 1600, offset: 5952)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !222, file: !45, line: 233, baseType: !124, size: 16, offset: 7552)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !222, file: !45, line: 236, baseType: !98, size: 32, offset: 7584)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !222, file: !45, line: 238, baseType: !98, size: 32, offset: 7616)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !222, file: !45, line: 238, baseType: !98, size: 32, offset: 7648)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !222, file: !45, line: 239, baseType: !349, size: 128, offset: 7680)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !350, line: 71, baseType: !351)
!350 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !350, line: 69, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !351, file: !350, line: 70, baseType: !96, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !351, file: !350, line: 70, baseType: !96, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !222, file: !45, line: 241, baseType: !198, size: 64, offset: 7808)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !222, file: !45, line: 243, baseType: !349, size: 128, offset: 7872)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !222, file: !45, line: 245, baseType: !96, size: 64, offset: 8000)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !6, line: 198, baseType: !254)
!360 = !{}
!361 = !DILocalVariable(name: "UNUSED_bm", arg: 1, scope: !217, file: !3, line: 83, type: !220)
!362 = !DILocation(line: 83, column: 32, scope: !217)
!363 = !DILocalVariable(name: "op", arg: 2, scope: !217, file: !3, line: 83, type: !358)
!364 = !DILocation(line: 83, column: 56, scope: !217)
!365 = !DILocalVariable(name: "op_flag", arg: 3, scope: !217, file: !3, line: 83, type: !210)
!366 = !DILocation(line: 83, column: 70, scope: !217)
!367 = !DILocation(line: 85, column: 14, scope: !217)
!368 = !DILocation(line: 85, column: 2, scope: !217)
!369 = !DILocation(line: 85, column: 6, scope: !217)
!370 = !DILocation(line: 85, column: 11, scope: !217)
!371 = !DILocation(line: 86, column: 1, scope: !217)
!372 = distinct !DISubprogram(name: "BMO_op_flag_disable", scope: !3, file: !3, line: 88, type: !218, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!373 = !DILocalVariable(name: "UNUSED_bm", arg: 1, scope: !372, file: !3, line: 88, type: !220)
!374 = !DILocation(line: 88, column: 33, scope: !372)
!375 = !DILocalVariable(name: "op", arg: 2, scope: !372, file: !3, line: 88, type: !358)
!376 = !DILocation(line: 88, column: 57, scope: !372)
!377 = !DILocalVariable(name: "op_flag", arg: 3, scope: !372, file: !3, line: 88, type: !210)
!378 = !DILocation(line: 88, column: 71, scope: !372)
!379 = !DILocation(line: 90, column: 15, scope: !372)
!380 = !DILocation(line: 90, column: 14, scope: !372)
!381 = !DILocation(line: 90, column: 2, scope: !372)
!382 = !DILocation(line: 90, column: 6, scope: !372)
!383 = !DILocation(line: 90, column: 11, scope: !372)
!384 = !DILocation(line: 91, column: 1, scope: !372)
!385 = distinct !DISubprogram(name: "BMO_push", scope: !3, file: !3, line: 98, type: !386, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !220, !358}
!388 = !DILocalVariable(name: "bm", arg: 1, scope: !385, file: !3, line: 98, type: !220)
!389 = !DILocation(line: 98, column: 22, scope: !385)
!390 = !DILocalVariable(name: "UNUSED_op", arg: 2, scope: !385, file: !3, line: 98, type: !358)
!391 = !DILocation(line: 98, column: 38, scope: !385)
!392 = !DILocation(line: 100, column: 2, scope: !385)
!393 = !DILocation(line: 100, column: 6, scope: !385)
!394 = !DILocation(line: 100, column: 16, scope: !385)
!395 = !DILocation(line: 105, column: 6, scope: !396)
!396 = distinct !DILexicalBlock(scope: !385, file: !3, line: 105, column: 6)
!397 = !DILocation(line: 105, column: 10, scope: !396)
!398 = !DILocation(line: 105, column: 21, scope: !396)
!399 = !DILocation(line: 105, column: 6, scope: !385)
!400 = !DILocation(line: 106, column: 24, scope: !396)
!401 = !DILocation(line: 106, column: 3, scope: !396)
!402 = !DILocation(line: 108, column: 24, scope: !396)
!403 = !DILocation(line: 108, column: 3, scope: !396)
!404 = !DILocation(line: 109, column: 1, scope: !385)
!405 = distinct !DISubprogram(name: "bmo_flag_layer_alloc", scope: !3, file: !3, line: 1163, type: !406, scopeLine: 1164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !220}
!408 = !DILocalVariable(name: "bm", arg: 1, scope: !405, file: !3, line: 1163, type: !220)
!409 = !DILocation(line: 1163, column: 41, scope: !405)
!410 = !DILocalVariable(name: "voldpool", scope: !405, file: !3, line: 1168, type: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !81, line: 47, baseType: !235)
!413 = !DILocation(line: 1168, column: 15, scope: !405)
!414 = !DILocation(line: 1168, column: 26, scope: !405)
!415 = !DILocation(line: 1168, column: 30, scope: !405)
!416 = !DILocalVariable(name: "eoldpool", scope: !405, file: !3, line: 1169, type: !411)
!417 = !DILocation(line: 1169, column: 15, scope: !405)
!418 = !DILocation(line: 1169, column: 26, scope: !405)
!419 = !DILocation(line: 1169, column: 30, scope: !405)
!420 = !DILocalVariable(name: "foldpool", scope: !405, file: !3, line: 1170, type: !411)
!421 = !DILocation(line: 1170, column: 15, scope: !405)
!422 = !DILocation(line: 1170, column: 26, scope: !405)
!423 = !DILocation(line: 1170, column: 30, scope: !405)
!424 = !DILocalVariable(name: "old_totflags_size", scope: !405, file: !3, line: 1173, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !427, line: 46, baseType: !428)
!427 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!428 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!429 = !DILocation(line: 1173, column: 15, scope: !405)
!430 = !DILocation(line: 1173, column: 36, scope: !405)
!431 = !DILocation(line: 1173, column: 40, scope: !405)
!432 = !DILocation(line: 1173, column: 49, scope: !405)
!433 = !DILocation(line: 1175, column: 2, scope: !405)
!434 = !DILocation(line: 1175, column: 6, scope: !405)
!435 = !DILocation(line: 1175, column: 14, scope: !405)
!436 = !DILocation(line: 1177, column: 63, scope: !405)
!437 = !DILocation(line: 1177, column: 67, scope: !405)
!438 = !DILocation(line: 1177, column: 61, scope: !405)
!439 = !DILocation(line: 1177, column: 41, scope: !405)
!440 = !DILocation(line: 1177, column: 77, scope: !405)
!441 = !DILocation(line: 1177, column: 81, scope: !405)
!442 = !DILocation(line: 1177, column: 22, scope: !405)
!443 = !DILocation(line: 1177, column: 2, scope: !405)
!444 = !DILocation(line: 1177, column: 6, scope: !405)
!445 = !DILocation(line: 1177, column: 20, scope: !405)
!446 = !DILocation(line: 1178, column: 63, scope: !405)
!447 = !DILocation(line: 1178, column: 67, scope: !405)
!448 = !DILocation(line: 1178, column: 61, scope: !405)
!449 = !DILocation(line: 1178, column: 41, scope: !405)
!450 = !DILocation(line: 1178, column: 77, scope: !405)
!451 = !DILocation(line: 1178, column: 81, scope: !405)
!452 = !DILocation(line: 1178, column: 22, scope: !405)
!453 = !DILocation(line: 1178, column: 2, scope: !405)
!454 = !DILocation(line: 1178, column: 6, scope: !405)
!455 = !DILocation(line: 1178, column: 20, scope: !405)
!456 = !DILocation(line: 1179, column: 63, scope: !405)
!457 = !DILocation(line: 1179, column: 67, scope: !405)
!458 = !DILocation(line: 1179, column: 61, scope: !405)
!459 = !DILocation(line: 1179, column: 41, scope: !405)
!460 = !DILocation(line: 1179, column: 77, scope: !405)
!461 = !DILocation(line: 1179, column: 81, scope: !405)
!462 = !DILocation(line: 1179, column: 22, scope: !405)
!463 = !DILocation(line: 1179, column: 2, scope: !405)
!464 = !DILocation(line: 1179, column: 6, scope: !405)
!465 = !DILocation(line: 1179, column: 20, scope: !405)
!466 = !DILocalVariable(name: "iter", scope: !467, file: !3, line: 1189, type: !469)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1188, column: 3)
!468 = distinct !DILexicalBlock(scope: !405, file: !3, line: 1184, column: 2)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !61, line: 186, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !61, line: 164, size: 512, elements: !471)
!471 = !{!472, !549, !550, !551, !552}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !470, file: !61, line: 179, baseType: !473, size: 320)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !470, file: !61, line: 166, size: 320, elements: !474)
!474 = !{!475, !487, !493, !501, !509, !515, !521, !527, !531, !537, !543}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !473, file: !61, line: 167, baseType: !476, size: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !61, line: 113, size: 192, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !476, file: !61, line: 114, baseType: !479, size: 192)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !81, line: 80, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !81, line: 76, size: 192, elements: !481)
!481 = !{!482, !483, !486}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !480, file: !81, line: 77, baseType: !411, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !480, file: !81, line: 78, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !81, line: 45, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !480, file: !81, line: 79, baseType: !7, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !473, file: !61, line: 169, baseType: !488, size: 192)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !61, line: 116, size: 192, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !488, file: !61, line: 117, baseType: !149, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !488, file: !61, line: 118, baseType: !196, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !488, file: !61, line: 118, baseType: !196, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !473, file: !61, line: 170, baseType: !494, size: 320)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !61, line: 120, size: 320, elements: !495)
!495 = !{!496, !497, !498, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !494, file: !61, line: 121, baseType: !149, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !494, file: !61, line: 122, baseType: !180, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !494, file: !61, line: 122, baseType: !180, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !494, file: !61, line: 123, baseType: !196, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !494, file: !61, line: 123, baseType: !196, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !473, file: !61, line: 171, baseType: !502, size: 320)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !61, line: 125, size: 320, elements: !503)
!503 = !{!504, !505, !506, !507, !508}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !502, file: !61, line: 126, baseType: !149, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !502, file: !61, line: 127, baseType: !180, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !502, file: !61, line: 127, baseType: !180, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !502, file: !61, line: 128, baseType: !196, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !502, file: !61, line: 128, baseType: !196, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !473, file: !61, line: 172, baseType: !510, size: 192)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !61, line: 130, size: 192, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !510, file: !61, line: 131, baseType: !196, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !510, file: !61, line: 132, baseType: !180, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !510, file: !61, line: 132, baseType: !180, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !473, file: !61, line: 173, baseType: !516, size: 192)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !61, line: 134, size: 192, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !516, file: !61, line: 135, baseType: !180, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !516, file: !61, line: 136, baseType: !180, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !516, file: !61, line: 136, baseType: !180, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !473, file: !61, line: 174, baseType: !522, size: 192)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !61, line: 138, size: 192, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !522, file: !61, line: 139, baseType: !196, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !522, file: !61, line: 140, baseType: !180, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !522, file: !61, line: 140, baseType: !180, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !473, file: !61, line: 175, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !61, line: 142, size: 64, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !528, file: !61, line: 143, baseType: !196, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !473, file: !61, line: 176, baseType: !532, size: 192)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !61, line: 145, size: 192, elements: !533)
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !532, file: !61, line: 146, baseType: !198, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !532, file: !61, line: 147, baseType: !180, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !532, file: !61, line: 147, baseType: !180, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !473, file: !61, line: 177, baseType: !538, size: 192)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !61, line: 149, size: 192, elements: !539)
!539 = !{!540, !541, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !538, file: !61, line: 150, baseType: !198, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !538, file: !61, line: 151, baseType: !180, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !538, file: !61, line: 151, baseType: !180, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !473, file: !61, line: 178, baseType: !544, size: 192)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !61, line: 153, size: 192, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !544, file: !61, line: 154, baseType: !198, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !544, file: !61, line: 155, baseType: !180, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !544, file: !61, line: 155, baseType: !180, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !470, file: !61, line: 181, baseType: !141, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !470, file: !61, line: 182, baseType: !145, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !470, file: !61, line: 184, baseType: !98, size: 32, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !470, file: !61, line: 185, baseType: !100, size: 8, offset: 480)
!553 = !DILocation(line: 1189, column: 11, scope: !467)
!554 = !DILocalVariable(name: "ele", scope: !467, file: !3, line: 1190, type: !114)
!555 = !DILocation(line: 1190, column: 13, scope: !467)
!556 = !DILocalVariable(name: "i", scope: !467, file: !3, line: 1191, type: !98)
!557 = !DILocation(line: 1191, column: 8, scope: !467)
!558 = !DILocalVariable(name: "newpool", scope: !467, file: !3, line: 1193, type: !411)
!559 = !DILocation(line: 1193, column: 17, scope: !467)
!560 = !DILocation(line: 1193, column: 27, scope: !467)
!561 = !DILocation(line: 1193, column: 31, scope: !467)
!562 = !DILocation(line: 1196, column: 4, scope: !563)
!563 = distinct !DILexicalBlock(scope: !467, file: !3, line: 1196, column: 4)
!564 = !DILocation(line: 1196, column: 4, scope: !565)
!565 = distinct !DILexicalBlock(scope: !563, file: !3, line: 1196, column: 4)
!566 = !DILocalVariable(name: "oldflags", scope: !567, file: !3, line: 1197, type: !96)
!567 = distinct !DILexicalBlock(scope: !565, file: !3, line: 1196, column: 61)
!568 = !DILocation(line: 1197, column: 11, scope: !567)
!569 = !DILocation(line: 1197, column: 22, scope: !567)
!570 = !DILocation(line: 1197, column: 27, scope: !567)
!571 = !DILocation(line: 1198, column: 38, scope: !567)
!572 = !DILocation(line: 1198, column: 19, scope: !567)
!573 = !DILocation(line: 1198, column: 5, scope: !567)
!574 = !DILocation(line: 1198, column: 10, scope: !567)
!575 = !DILocation(line: 1198, column: 17, scope: !567)
!576 = !DILocation(line: 1199, column: 12, scope: !567)
!577 = !DILocation(line: 1199, column: 17, scope: !567)
!578 = !DILocation(line: 1199, column: 5, scope: !567)
!579 = !DILocation(line: 1199, column: 25, scope: !567)
!580 = !DILocation(line: 1199, column: 35, scope: !567)
!581 = !DILocation(line: 1200, column: 5, scope: !567)
!582 = !DILocation(line: 1201, column: 5, scope: !583)
!583 = distinct !DILexicalBlock(scope: !567, file: !3, line: 1201, column: 5)
!584 = !DILocation(line: 1202, column: 4, scope: !567)
!585 = distinct !{!585, !562, !586}
!586 = !DILocation(line: 1202, column: 4, scope: !563)
!587 = !DILocalVariable(name: "iter", scope: !588, file: !3, line: 1208, type: !469)
!588 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1207, column: 3)
!589 = !DILocation(line: 1208, column: 11, scope: !588)
!590 = !DILocalVariable(name: "ele", scope: !588, file: !3, line: 1209, type: !114)
!591 = !DILocation(line: 1209, column: 13, scope: !588)
!592 = !DILocalVariable(name: "i", scope: !588, file: !3, line: 1210, type: !98)
!593 = !DILocation(line: 1210, column: 8, scope: !588)
!594 = !DILocalVariable(name: "newpool", scope: !588, file: !3, line: 1212, type: !411)
!595 = !DILocation(line: 1212, column: 17, scope: !588)
!596 = !DILocation(line: 1212, column: 27, scope: !588)
!597 = !DILocation(line: 1212, column: 31, scope: !588)
!598 = !DILocation(line: 1214, column: 4, scope: !599)
!599 = distinct !DILexicalBlock(scope: !588, file: !3, line: 1214, column: 4)
!600 = !DILocation(line: 1214, column: 4, scope: !601)
!601 = distinct !DILexicalBlock(scope: !599, file: !3, line: 1214, column: 4)
!602 = !DILocalVariable(name: "oldflags", scope: !603, file: !3, line: 1215, type: !96)
!603 = distinct !DILexicalBlock(scope: !601, file: !3, line: 1214, column: 61)
!604 = !DILocation(line: 1215, column: 11, scope: !603)
!605 = !DILocation(line: 1215, column: 22, scope: !603)
!606 = !DILocation(line: 1215, column: 27, scope: !603)
!607 = !DILocation(line: 1216, column: 38, scope: !603)
!608 = !DILocation(line: 1216, column: 19, scope: !603)
!609 = !DILocation(line: 1216, column: 5, scope: !603)
!610 = !DILocation(line: 1216, column: 10, scope: !603)
!611 = !DILocation(line: 1216, column: 17, scope: !603)
!612 = !DILocation(line: 1217, column: 12, scope: !603)
!613 = !DILocation(line: 1217, column: 17, scope: !603)
!614 = !DILocation(line: 1217, column: 5, scope: !603)
!615 = !DILocation(line: 1217, column: 25, scope: !603)
!616 = !DILocation(line: 1217, column: 35, scope: !603)
!617 = !DILocation(line: 1218, column: 5, scope: !603)
!618 = !DILocation(line: 1219, column: 5, scope: !619)
!619 = distinct !DILexicalBlock(scope: !603, file: !3, line: 1219, column: 5)
!620 = !DILocation(line: 1220, column: 4, scope: !603)
!621 = distinct !{!621, !598, !622}
!622 = !DILocation(line: 1220, column: 4, scope: !599)
!623 = !DILocalVariable(name: "iter", scope: !624, file: !3, line: 1226, type: !469)
!624 = distinct !DILexicalBlock(scope: !468, file: !3, line: 1225, column: 3)
!625 = !DILocation(line: 1226, column: 11, scope: !624)
!626 = !DILocalVariable(name: "ele", scope: !624, file: !3, line: 1227, type: !114)
!627 = !DILocation(line: 1227, column: 13, scope: !624)
!628 = !DILocalVariable(name: "i", scope: !624, file: !3, line: 1228, type: !98)
!629 = !DILocation(line: 1228, column: 8, scope: !624)
!630 = !DILocalVariable(name: "newpool", scope: !624, file: !3, line: 1230, type: !411)
!631 = !DILocation(line: 1230, column: 17, scope: !624)
!632 = !DILocation(line: 1230, column: 27, scope: !624)
!633 = !DILocation(line: 1230, column: 31, scope: !624)
!634 = !DILocation(line: 1232, column: 4, scope: !635)
!635 = distinct !DILexicalBlock(scope: !624, file: !3, line: 1232, column: 4)
!636 = !DILocation(line: 1232, column: 4, scope: !637)
!637 = distinct !DILexicalBlock(scope: !635, file: !3, line: 1232, column: 4)
!638 = !DILocalVariable(name: "oldflags", scope: !639, file: !3, line: 1233, type: !96)
!639 = distinct !DILexicalBlock(scope: !637, file: !3, line: 1232, column: 61)
!640 = !DILocation(line: 1233, column: 11, scope: !639)
!641 = !DILocation(line: 1233, column: 22, scope: !639)
!642 = !DILocation(line: 1233, column: 27, scope: !639)
!643 = !DILocation(line: 1234, column: 38, scope: !639)
!644 = !DILocation(line: 1234, column: 19, scope: !639)
!645 = !DILocation(line: 1234, column: 5, scope: !639)
!646 = !DILocation(line: 1234, column: 10, scope: !639)
!647 = !DILocation(line: 1234, column: 17, scope: !639)
!648 = !DILocation(line: 1235, column: 12, scope: !639)
!649 = !DILocation(line: 1235, column: 17, scope: !639)
!650 = !DILocation(line: 1235, column: 5, scope: !639)
!651 = !DILocation(line: 1235, column: 25, scope: !639)
!652 = !DILocation(line: 1235, column: 35, scope: !639)
!653 = !DILocation(line: 1236, column: 5, scope: !639)
!654 = !DILocation(line: 1237, column: 5, scope: !655)
!655 = distinct !DILexicalBlock(scope: !639, file: !3, line: 1237, column: 5)
!656 = !DILocation(line: 1238, column: 4, scope: !639)
!657 = distinct !{!657, !634, !658}
!658 = !DILocation(line: 1238, column: 4, scope: !635)
!659 = !DILocation(line: 1242, column: 22, scope: !405)
!660 = !DILocation(line: 1242, column: 2, scope: !405)
!661 = !DILocation(line: 1243, column: 22, scope: !405)
!662 = !DILocation(line: 1243, column: 2, scope: !405)
!663 = !DILocation(line: 1244, column: 22, scope: !405)
!664 = !DILocation(line: 1244, column: 2, scope: !405)
!665 = !DILocation(line: 1246, column: 2, scope: !405)
!666 = !DILocation(line: 1246, column: 6, scope: !405)
!667 = !DILocation(line: 1246, column: 23, scope: !405)
!668 = !DILocation(line: 1249, column: 1, scope: !405)
!669 = distinct !DISubprogram(name: "bmo_flag_layer_clear", scope: !3, file: !3, line: 1338, type: !406, scopeLine: 1339, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!670 = !DILocalVariable(name: "bm", arg: 1, scope: !669, file: !3, line: 1338, type: !220)
!671 = !DILocation(line: 1338, column: 41, scope: !669)
!672 = !DILocalVariable(name: "zero_flag", scope: !669, file: !3, line: 1342, type: !673)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFlagLayer", file: !45, line: 182, baseType: !121)
!675 = !DILocation(line: 1342, column: 20, scope: !669)
!676 = !DILocalVariable(name: "totflags_offset", scope: !669, file: !3, line: 1344, type: !210)
!677 = !DILocation(line: 1344, column: 12, scope: !669)
!678 = !DILocation(line: 1344, column: 30, scope: !669)
!679 = !DILocation(line: 1344, column: 34, scope: !669)
!680 = !DILocation(line: 1344, column: 43, scope: !669)
!681 = !DILocalVariable(name: "iter", scope: !682, file: !3, line: 1355, type: !469)
!682 = distinct !DILexicalBlock(scope: !683, file: !3, line: 1354, column: 3)
!683 = distinct !DILexicalBlock(scope: !669, file: !3, line: 1349, column: 2)
!684 = !DILocation(line: 1355, column: 11, scope: !682)
!685 = !DILocalVariable(name: "ele", scope: !682, file: !3, line: 1356, type: !114)
!686 = !DILocation(line: 1356, column: 13, scope: !682)
!687 = !DILocalVariable(name: "i", scope: !682, file: !3, line: 1357, type: !98)
!688 = !DILocation(line: 1357, column: 8, scope: !682)
!689 = !DILocation(line: 1358, column: 4, scope: !690)
!690 = distinct !DILexicalBlock(scope: !682, file: !3, line: 1358, column: 4)
!691 = !DILocation(line: 1358, column: 4, scope: !692)
!692 = distinct !DILexicalBlock(scope: !690, file: !3, line: 1358, column: 4)
!693 = !DILocation(line: 1359, column: 5, scope: !694)
!694 = distinct !DILexicalBlock(scope: !692, file: !3, line: 1358, column: 61)
!695 = !DILocation(line: 1359, column: 10, scope: !694)
!696 = !DILocation(line: 1359, column: 17, scope: !694)
!697 = !DILocation(line: 1359, column: 36, scope: !694)
!698 = !DILocation(line: 1360, column: 5, scope: !694)
!699 = !DILocation(line: 1361, column: 4, scope: !694)
!700 = distinct !{!700, !689, !701}
!701 = !DILocation(line: 1361, column: 4, scope: !690)
!702 = !DILocalVariable(name: "iter", scope: !703, file: !3, line: 1367, type: !469)
!703 = distinct !DILexicalBlock(scope: !683, file: !3, line: 1366, column: 3)
!704 = !DILocation(line: 1367, column: 11, scope: !703)
!705 = !DILocalVariable(name: "ele", scope: !703, file: !3, line: 1368, type: !114)
!706 = !DILocation(line: 1368, column: 13, scope: !703)
!707 = !DILocalVariable(name: "i", scope: !703, file: !3, line: 1369, type: !98)
!708 = !DILocation(line: 1369, column: 8, scope: !703)
!709 = !DILocation(line: 1370, column: 4, scope: !710)
!710 = distinct !DILexicalBlock(scope: !703, file: !3, line: 1370, column: 4)
!711 = !DILocation(line: 1370, column: 4, scope: !712)
!712 = distinct !DILexicalBlock(scope: !710, file: !3, line: 1370, column: 4)
!713 = !DILocation(line: 1371, column: 5, scope: !714)
!714 = distinct !DILexicalBlock(scope: !712, file: !3, line: 1370, column: 61)
!715 = !DILocation(line: 1371, column: 10, scope: !714)
!716 = !DILocation(line: 1371, column: 17, scope: !714)
!717 = !DILocation(line: 1371, column: 36, scope: !714)
!718 = !DILocation(line: 1372, column: 5, scope: !714)
!719 = !DILocation(line: 1373, column: 4, scope: !714)
!720 = distinct !{!720, !709, !721}
!721 = !DILocation(line: 1373, column: 4, scope: !710)
!722 = !DILocalVariable(name: "iter", scope: !723, file: !3, line: 1379, type: !469)
!723 = distinct !DILexicalBlock(scope: !683, file: !3, line: 1378, column: 3)
!724 = !DILocation(line: 1379, column: 11, scope: !723)
!725 = !DILocalVariable(name: "ele", scope: !723, file: !3, line: 1380, type: !114)
!726 = !DILocation(line: 1380, column: 13, scope: !723)
!727 = !DILocalVariable(name: "i", scope: !723, file: !3, line: 1381, type: !98)
!728 = !DILocation(line: 1381, column: 8, scope: !723)
!729 = !DILocation(line: 1382, column: 4, scope: !730)
!730 = distinct !DILexicalBlock(scope: !723, file: !3, line: 1382, column: 4)
!731 = !DILocation(line: 1382, column: 4, scope: !732)
!732 = distinct !DILexicalBlock(scope: !730, file: !3, line: 1382, column: 4)
!733 = !DILocation(line: 1383, column: 5, scope: !734)
!734 = distinct !DILexicalBlock(scope: !732, file: !3, line: 1382, column: 61)
!735 = !DILocation(line: 1383, column: 10, scope: !734)
!736 = !DILocation(line: 1383, column: 17, scope: !734)
!737 = !DILocation(line: 1383, column: 36, scope: !734)
!738 = !DILocation(line: 1384, column: 5, scope: !734)
!739 = !DILocation(line: 1385, column: 4, scope: !734)
!740 = distinct !{!740, !729, !741}
!741 = !DILocation(line: 1385, column: 4, scope: !730)
!742 = !DILocation(line: 1389, column: 2, scope: !669)
!743 = !DILocation(line: 1389, column: 6, scope: !669)
!744 = !DILocation(line: 1389, column: 23, scope: !669)
!745 = !DILocation(line: 1390, column: 1, scope: !669)
!746 = distinct !DISubprogram(name: "BMO_pop", scope: !3, file: !3, line: 118, type: !406, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!747 = !DILocalVariable(name: "bm", arg: 1, scope: !746, file: !3, line: 118, type: !220)
!748 = !DILocation(line: 118, column: 21, scope: !746)
!749 = !DILocation(line: 120, column: 6, scope: !750)
!750 = distinct !DILexicalBlock(scope: !746, file: !3, line: 120, column: 6)
!751 = !DILocation(line: 120, column: 10, scope: !750)
!752 = !DILocation(line: 120, column: 21, scope: !750)
!753 = !DILocation(line: 120, column: 6, scope: !746)
!754 = !DILocation(line: 121, column: 23, scope: !750)
!755 = !DILocation(line: 121, column: 3, scope: !750)
!756 = !DILocation(line: 123, column: 2, scope: !746)
!757 = !DILocation(line: 123, column: 6, scope: !746)
!758 = !DILocation(line: 123, column: 16, scope: !746)
!759 = !DILocation(line: 124, column: 1, scope: !746)
!760 = distinct !DISubprogram(name: "bmo_flag_layer_free", scope: !3, file: !3, line: 1251, type: !406, scopeLine: 1252, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!761 = !DILocalVariable(name: "bm", arg: 1, scope: !760, file: !3, line: 1251, type: !220)
!762 = !DILocation(line: 1251, column: 40, scope: !760)
!763 = !DILocalVariable(name: "voldpool", scope: !760, file: !3, line: 1256, type: !411)
!764 = !DILocation(line: 1256, column: 15, scope: !760)
!765 = !DILocation(line: 1256, column: 26, scope: !760)
!766 = !DILocation(line: 1256, column: 30, scope: !760)
!767 = !DILocalVariable(name: "eoldpool", scope: !760, file: !3, line: 1257, type: !411)
!768 = !DILocation(line: 1257, column: 15, scope: !760)
!769 = !DILocation(line: 1257, column: 26, scope: !760)
!770 = !DILocation(line: 1257, column: 30, scope: !760)
!771 = !DILocalVariable(name: "foldpool", scope: !760, file: !3, line: 1258, type: !411)
!772 = !DILocation(line: 1258, column: 15, scope: !760)
!773 = !DILocation(line: 1258, column: 26, scope: !760)
!774 = !DILocation(line: 1258, column: 30, scope: !760)
!775 = !DILocalVariable(name: "new_totflags_size", scope: !760, file: !3, line: 1261, type: !425)
!776 = !DILocation(line: 1261, column: 15, scope: !760)
!777 = !DILocation(line: 1261, column: 37, scope: !760)
!778 = !DILocation(line: 1261, column: 41, scope: !760)
!779 = !DILocation(line: 1261, column: 50, scope: !760)
!780 = !DILocation(line: 1261, column: 36, scope: !760)
!781 = !DILocation(line: 1261, column: 55, scope: !760)
!782 = !DILocation(line: 1264, column: 2, scope: !760)
!783 = !DILocation(line: 1264, column: 6, scope: !760)
!784 = !DILocation(line: 1264, column: 14, scope: !760)
!785 = !DILocation(line: 1266, column: 41, scope: !760)
!786 = !DILocation(line: 1266, column: 60, scope: !760)
!787 = !DILocation(line: 1266, column: 64, scope: !760)
!788 = !DILocation(line: 1266, column: 22, scope: !760)
!789 = !DILocation(line: 1266, column: 2, scope: !760)
!790 = !DILocation(line: 1266, column: 6, scope: !760)
!791 = !DILocation(line: 1266, column: 20, scope: !760)
!792 = !DILocation(line: 1267, column: 41, scope: !760)
!793 = !DILocation(line: 1267, column: 60, scope: !760)
!794 = !DILocation(line: 1267, column: 64, scope: !760)
!795 = !DILocation(line: 1267, column: 22, scope: !760)
!796 = !DILocation(line: 1267, column: 2, scope: !760)
!797 = !DILocation(line: 1267, column: 6, scope: !760)
!798 = !DILocation(line: 1267, column: 20, scope: !760)
!799 = !DILocation(line: 1268, column: 41, scope: !760)
!800 = !DILocation(line: 1268, column: 60, scope: !760)
!801 = !DILocation(line: 1268, column: 64, scope: !760)
!802 = !DILocation(line: 1268, column: 22, scope: !760)
!803 = !DILocation(line: 1268, column: 2, scope: !760)
!804 = !DILocation(line: 1268, column: 6, scope: !760)
!805 = !DILocation(line: 1268, column: 20, scope: !760)
!806 = !DILocalVariable(name: "iter", scope: !807, file: !3, line: 1278, type: !469)
!807 = distinct !DILexicalBlock(scope: !808, file: !3, line: 1277, column: 3)
!808 = distinct !DILexicalBlock(scope: !760, file: !3, line: 1273, column: 2)
!809 = !DILocation(line: 1278, column: 11, scope: !807)
!810 = !DILocalVariable(name: "ele", scope: !807, file: !3, line: 1279, type: !114)
!811 = !DILocation(line: 1279, column: 13, scope: !807)
!812 = !DILocalVariable(name: "i", scope: !807, file: !3, line: 1280, type: !98)
!813 = !DILocation(line: 1280, column: 8, scope: !807)
!814 = !DILocalVariable(name: "newpool", scope: !807, file: !3, line: 1282, type: !411)
!815 = !DILocation(line: 1282, column: 17, scope: !807)
!816 = !DILocation(line: 1282, column: 27, scope: !807)
!817 = !DILocation(line: 1282, column: 31, scope: !807)
!818 = !DILocation(line: 1285, column: 4, scope: !819)
!819 = distinct !DILexicalBlock(scope: !807, file: !3, line: 1285, column: 4)
!820 = !DILocation(line: 1285, column: 4, scope: !821)
!821 = distinct !DILexicalBlock(scope: !819, file: !3, line: 1285, column: 4)
!822 = !DILocalVariable(name: "oldflags", scope: !823, file: !3, line: 1286, type: !96)
!823 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1285, column: 61)
!824 = !DILocation(line: 1286, column: 11, scope: !823)
!825 = !DILocation(line: 1286, column: 22, scope: !823)
!826 = !DILocation(line: 1286, column: 27, scope: !823)
!827 = !DILocation(line: 1287, column: 37, scope: !823)
!828 = !DILocation(line: 1287, column: 19, scope: !823)
!829 = !DILocation(line: 1287, column: 5, scope: !823)
!830 = !DILocation(line: 1287, column: 10, scope: !823)
!831 = !DILocation(line: 1287, column: 17, scope: !823)
!832 = !DILocation(line: 1288, column: 12, scope: !823)
!833 = !DILocation(line: 1288, column: 17, scope: !823)
!834 = !DILocation(line: 1288, column: 5, scope: !823)
!835 = !DILocation(line: 1288, column: 25, scope: !823)
!836 = !DILocation(line: 1288, column: 35, scope: !823)
!837 = !DILocation(line: 1289, column: 5, scope: !823)
!838 = !DILocation(line: 1290, column: 5, scope: !839)
!839 = distinct !DILexicalBlock(scope: !823, file: !3, line: 1290, column: 5)
!840 = !DILocation(line: 1291, column: 4, scope: !823)
!841 = distinct !{!841, !818, !842}
!842 = !DILocation(line: 1291, column: 4, scope: !819)
!843 = !DILocalVariable(name: "iter", scope: !844, file: !3, line: 1297, type: !469)
!844 = distinct !DILexicalBlock(scope: !808, file: !3, line: 1296, column: 3)
!845 = !DILocation(line: 1297, column: 11, scope: !844)
!846 = !DILocalVariable(name: "ele", scope: !844, file: !3, line: 1298, type: !114)
!847 = !DILocation(line: 1298, column: 13, scope: !844)
!848 = !DILocalVariable(name: "i", scope: !844, file: !3, line: 1299, type: !98)
!849 = !DILocation(line: 1299, column: 8, scope: !844)
!850 = !DILocalVariable(name: "newpool", scope: !844, file: !3, line: 1301, type: !411)
!851 = !DILocation(line: 1301, column: 17, scope: !844)
!852 = !DILocation(line: 1301, column: 27, scope: !844)
!853 = !DILocation(line: 1301, column: 31, scope: !844)
!854 = !DILocation(line: 1303, column: 4, scope: !855)
!855 = distinct !DILexicalBlock(scope: !844, file: !3, line: 1303, column: 4)
!856 = !DILocation(line: 1303, column: 4, scope: !857)
!857 = distinct !DILexicalBlock(scope: !855, file: !3, line: 1303, column: 4)
!858 = !DILocalVariable(name: "oldflags", scope: !859, file: !3, line: 1304, type: !96)
!859 = distinct !DILexicalBlock(scope: !857, file: !3, line: 1303, column: 61)
!860 = !DILocation(line: 1304, column: 11, scope: !859)
!861 = !DILocation(line: 1304, column: 22, scope: !859)
!862 = !DILocation(line: 1304, column: 27, scope: !859)
!863 = !DILocation(line: 1305, column: 37, scope: !859)
!864 = !DILocation(line: 1305, column: 19, scope: !859)
!865 = !DILocation(line: 1305, column: 5, scope: !859)
!866 = !DILocation(line: 1305, column: 10, scope: !859)
!867 = !DILocation(line: 1305, column: 17, scope: !859)
!868 = !DILocation(line: 1306, column: 12, scope: !859)
!869 = !DILocation(line: 1306, column: 17, scope: !859)
!870 = !DILocation(line: 1306, column: 5, scope: !859)
!871 = !DILocation(line: 1306, column: 25, scope: !859)
!872 = !DILocation(line: 1306, column: 35, scope: !859)
!873 = !DILocation(line: 1307, column: 5, scope: !859)
!874 = !DILocation(line: 1308, column: 5, scope: !875)
!875 = distinct !DILexicalBlock(scope: !859, file: !3, line: 1308, column: 5)
!876 = !DILocation(line: 1309, column: 4, scope: !859)
!877 = distinct !{!877, !854, !878}
!878 = !DILocation(line: 1309, column: 4, scope: !855)
!879 = !DILocalVariable(name: "iter", scope: !880, file: !3, line: 1315, type: !469)
!880 = distinct !DILexicalBlock(scope: !808, file: !3, line: 1314, column: 3)
!881 = !DILocation(line: 1315, column: 11, scope: !880)
!882 = !DILocalVariable(name: "ele", scope: !880, file: !3, line: 1316, type: !114)
!883 = !DILocation(line: 1316, column: 13, scope: !880)
!884 = !DILocalVariable(name: "i", scope: !880, file: !3, line: 1317, type: !98)
!885 = !DILocation(line: 1317, column: 8, scope: !880)
!886 = !DILocalVariable(name: "newpool", scope: !880, file: !3, line: 1319, type: !411)
!887 = !DILocation(line: 1319, column: 17, scope: !880)
!888 = !DILocation(line: 1319, column: 27, scope: !880)
!889 = !DILocation(line: 1319, column: 31, scope: !880)
!890 = !DILocation(line: 1321, column: 4, scope: !891)
!891 = distinct !DILexicalBlock(scope: !880, file: !3, line: 1321, column: 4)
!892 = !DILocation(line: 1321, column: 4, scope: !893)
!893 = distinct !DILexicalBlock(scope: !891, file: !3, line: 1321, column: 4)
!894 = !DILocalVariable(name: "oldflags", scope: !895, file: !3, line: 1322, type: !96)
!895 = distinct !DILexicalBlock(scope: !893, file: !3, line: 1321, column: 61)
!896 = !DILocation(line: 1322, column: 11, scope: !895)
!897 = !DILocation(line: 1322, column: 22, scope: !895)
!898 = !DILocation(line: 1322, column: 27, scope: !895)
!899 = !DILocation(line: 1323, column: 37, scope: !895)
!900 = !DILocation(line: 1323, column: 19, scope: !895)
!901 = !DILocation(line: 1323, column: 5, scope: !895)
!902 = !DILocation(line: 1323, column: 10, scope: !895)
!903 = !DILocation(line: 1323, column: 17, scope: !895)
!904 = !DILocation(line: 1324, column: 12, scope: !895)
!905 = !DILocation(line: 1324, column: 17, scope: !895)
!906 = !DILocation(line: 1324, column: 5, scope: !895)
!907 = !DILocation(line: 1324, column: 25, scope: !895)
!908 = !DILocation(line: 1324, column: 35, scope: !895)
!909 = !DILocation(line: 1325, column: 5, scope: !895)
!910 = !DILocation(line: 1326, column: 5, scope: !911)
!911 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1326, column: 5)
!912 = !DILocation(line: 1327, column: 4, scope: !895)
!913 = distinct !{!913, !890, !914}
!914 = !DILocation(line: 1327, column: 4, scope: !891)
!915 = !DILocation(line: 1331, column: 22, scope: !760)
!916 = !DILocation(line: 1331, column: 2, scope: !760)
!917 = !DILocation(line: 1332, column: 22, scope: !760)
!918 = !DILocation(line: 1332, column: 2, scope: !760)
!919 = !DILocation(line: 1333, column: 22, scope: !760)
!920 = !DILocation(line: 1333, column: 2, scope: !760)
!921 = !DILocation(line: 1335, column: 2, scope: !760)
!922 = !DILocation(line: 1335, column: 6, scope: !760)
!923 = !DILocation(line: 1335, column: 23, scope: !760)
!924 = !DILocation(line: 1336, column: 1, scope: !760)
!925 = distinct !DISubprogram(name: "BMO_op_init", scope: !3, file: !3, line: 170, type: !926, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !220, !358, !210, !205}
!928 = !DILocalVariable(name: "bm", arg: 1, scope: !925, file: !3, line: 170, type: !220)
!929 = !DILocation(line: 170, column: 25, scope: !925)
!930 = !DILocalVariable(name: "op", arg: 2, scope: !925, file: !3, line: 170, type: !358)
!931 = !DILocation(line: 170, column: 41, scope: !925)
!932 = !DILocalVariable(name: "flag", arg: 3, scope: !925, file: !3, line: 170, type: !210)
!933 = !DILocation(line: 170, column: 55, scope: !925)
!934 = !DILocalVariable(name: "opname", arg: 4, scope: !925, file: !3, line: 170, type: !205)
!935 = !DILocation(line: 170, column: 73, scope: !925)
!936 = !DILocalVariable(name: "opcode", scope: !925, file: !3, line: 172, type: !98)
!937 = !DILocation(line: 172, column: 6, scope: !925)
!938 = !DILocation(line: 172, column: 38, scope: !925)
!939 = !DILocation(line: 172, column: 15, scope: !925)
!940 = !DILocation(line: 177, column: 8, scope: !925)
!941 = !DILocation(line: 180, column: 6, scope: !942)
!942 = distinct !DILexicalBlock(scope: !925, file: !3, line: 180, column: 6)
!943 = !DILocation(line: 180, column: 13, scope: !942)
!944 = !DILocation(line: 180, column: 6, scope: !925)
!945 = !DILocation(line: 181, column: 10, scope: !946)
!946 = distinct !DILexicalBlock(scope: !942, file: !3, line: 180, column: 20)
!947 = !DILocation(line: 182, column: 2, scope: !946)
!948 = !DILocation(line: 184, column: 9, scope: !925)
!949 = !DILocation(line: 184, column: 2, scope: !925)
!950 = !DILocation(line: 185, column: 13, scope: !925)
!951 = !DILocation(line: 185, column: 2, scope: !925)
!952 = !DILocation(line: 185, column: 6, scope: !925)
!953 = !DILocation(line: 185, column: 11, scope: !925)
!954 = !DILocation(line: 186, column: 32, scope: !925)
!955 = !DILocation(line: 186, column: 18, scope: !925)
!956 = !DILocation(line: 186, column: 41, scope: !925)
!957 = !DILocation(line: 186, column: 2, scope: !925)
!958 = !DILocation(line: 186, column: 6, scope: !925)
!959 = !DILocation(line: 186, column: 16, scope: !925)
!960 = !DILocation(line: 187, column: 13, scope: !925)
!961 = !DILocation(line: 187, column: 2, scope: !925)
!962 = !DILocation(line: 187, column: 6, scope: !925)
!963 = !DILocation(line: 187, column: 11, scope: !925)
!964 = !DILocation(line: 190, column: 34, scope: !925)
!965 = !DILocation(line: 190, column: 20, scope: !925)
!966 = !DILocation(line: 190, column: 43, scope: !925)
!967 = !DILocation(line: 190, column: 59, scope: !925)
!968 = !DILocation(line: 190, column: 63, scope: !925)
!969 = !DILocation(line: 190, column: 2, scope: !925)
!970 = !DILocation(line: 191, column: 34, scope: !925)
!971 = !DILocation(line: 191, column: 20, scope: !925)
!972 = !DILocation(line: 191, column: 43, scope: !925)
!973 = !DILocation(line: 191, column: 59, scope: !925)
!974 = !DILocation(line: 191, column: 63, scope: !925)
!975 = !DILocation(line: 191, column: 2, scope: !925)
!976 = !DILocation(line: 194, column: 27, scope: !925)
!977 = !DILocation(line: 194, column: 13, scope: !925)
!978 = !DILocation(line: 194, column: 36, scope: !925)
!979 = !DILocation(line: 194, column: 2, scope: !925)
!980 = !DILocation(line: 194, column: 6, scope: !925)
!981 = !DILocation(line: 194, column: 11, scope: !925)
!982 = !DILocation(line: 197, column: 14, scope: !925)
!983 = !DILocation(line: 197, column: 2, scope: !925)
!984 = !DILocation(line: 197, column: 6, scope: !925)
!985 = !DILocation(line: 197, column: 12, scope: !925)
!986 = !DILocation(line: 198, column: 26, scope: !925)
!987 = !DILocation(line: 198, column: 30, scope: !925)
!988 = !DILocation(line: 198, column: 2, scope: !925)
!989 = !DILocation(line: 199, column: 1, scope: !925)
!990 = distinct !DISubprogram(name: "BMO_opcode_from_opname", scope: !3, file: !3, line: 1606, type: !991, scopeLine: 1607, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!991 = !DISubroutineType(types: !992)
!992 = !{!98, !205}
!993 = !DILocalVariable(name: "opname", arg: 1, scope: !990, file: !3, line: 1606, type: !205)
!994 = !DILocation(line: 1606, column: 40, scope: !990)
!995 = !DILocalVariable(name: "tot", scope: !990, file: !3, line: 1609, type: !996)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!997 = !DILocation(line: 1609, column: 21, scope: !990)
!998 = !DILocation(line: 1609, column: 27, scope: !990)
!999 = !DILocalVariable(name: "i", scope: !990, file: !3, line: 1610, type: !7)
!1000 = !DILocation(line: 1610, column: 15, scope: !990)
!1001 = !DILocation(line: 1611, column: 9, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1611, column: 2)
!1003 = !DILocation(line: 1611, column: 7, scope: !1002)
!1004 = !DILocation(line: 1611, column: 14, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 1611, column: 2)
!1006 = !DILocation(line: 1611, column: 18, scope: !1005)
!1007 = !DILocation(line: 1611, column: 16, scope: !1005)
!1008 = !DILocation(line: 1611, column: 2, scope: !1002)
!1009 = !DILocation(line: 1612, column: 7, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 1612, column: 7)
!1011 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1611, column: 28)
!1012 = !DILocation(line: 1612, column: 7, scope: !1011)
!1013 = !DILocation(line: 1613, column: 11, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 1612, column: 48)
!1015 = !DILocation(line: 1613, column: 4, scope: !1014)
!1016 = !DILocation(line: 1615, column: 2, scope: !1011)
!1017 = !DILocation(line: 1611, column: 24, scope: !1005)
!1018 = !DILocation(line: 1611, column: 2, scope: !1005)
!1019 = distinct !{!1019, !1008, !1020}
!1020 = !DILocation(line: 1615, column: 2, scope: !1002)
!1021 = !DILocation(line: 1616, column: 2, scope: !990)
!1022 = !DILocation(line: 1617, column: 1, scope: !990)
!1023 = distinct !DISubprogram(name: "bmo_op_slots_init", scope: !3, file: !3, line: 128, type: !1024, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !1026, !1037}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOSlotType", file: !6, line: 212, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOSlotType", file: !6, line: 208, size: 320, elements: !1030)
!1030 = !{!1031, !1035, !1036}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !6, line: 209, baseType: !1032, size: 256)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 256, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1029, file: !6, line: 210, baseType: !262, size: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1029, file: !6, line: 211, baseType: !264, size: 32, offset: 288)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !6, line: 163, baseType: !258)
!1039 = !DILocalVariable(name: "slot_types", arg: 1, scope: !1023, file: !3, line: 128, type: !1026)
!1040 = !DILocation(line: 128, column: 50, scope: !1023)
!1041 = !DILocalVariable(name: "slot_args", arg: 2, scope: !1023, file: !3, line: 128, type: !1037)
!1042 = !DILocation(line: 128, column: 72, scope: !1023)
!1043 = !DILocalVariable(name: "slot", scope: !1023, file: !3, line: 130, type: !1037)
!1044 = !DILocation(line: 130, column: 12, scope: !1023)
!1045 = !DILocalVariable(name: "i", scope: !1023, file: !3, line: 131, type: !7)
!1046 = !DILocation(line: 131, column: 15, scope: !1023)
!1047 = !DILocation(line: 132, column: 9, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 132, column: 2)
!1049 = !DILocation(line: 132, column: 7, scope: !1048)
!1050 = !DILocation(line: 132, column: 14, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 132, column: 2)
!1052 = !DILocation(line: 132, column: 25, scope: !1051)
!1053 = !DILocation(line: 132, column: 28, scope: !1051)
!1054 = !DILocation(line: 132, column: 2, scope: !1048)
!1055 = !DILocation(line: 133, column: 11, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 132, column: 39)
!1057 = !DILocation(line: 133, column: 21, scope: !1056)
!1058 = !DILocation(line: 133, column: 8, scope: !1056)
!1059 = !DILocation(line: 134, column: 24, scope: !1056)
!1060 = !DILocation(line: 134, column: 35, scope: !1056)
!1061 = !DILocation(line: 134, column: 38, scope: !1056)
!1062 = !DILocation(line: 134, column: 3, scope: !1056)
!1063 = !DILocation(line: 134, column: 9, scope: !1056)
!1064 = !DILocation(line: 134, column: 22, scope: !1056)
!1065 = !DILocation(line: 135, column: 24, scope: !1056)
!1066 = !DILocation(line: 135, column: 35, scope: !1056)
!1067 = !DILocation(line: 135, column: 38, scope: !1056)
!1068 = !DILocation(line: 135, column: 3, scope: !1056)
!1069 = !DILocation(line: 135, column: 9, scope: !1056)
!1070 = !DILocation(line: 135, column: 22, scope: !1056)
!1071 = !DILocation(line: 136, column: 3, scope: !1056)
!1072 = !DILocation(line: 136, column: 9, scope: !1056)
!1073 = !DILocation(line: 136, column: 24, scope: !1056)
!1074 = !DILocation(line: 136, column: 35, scope: !1056)
!1075 = !DILocation(line: 136, column: 38, scope: !1056)
!1076 = !DILocation(line: 139, column: 11, scope: !1056)
!1077 = !DILocation(line: 139, column: 17, scope: !1056)
!1078 = !DILocation(line: 139, column: 3, scope: !1056)
!1079 = !DILocation(line: 141, column: 24, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 139, column: 28)
!1081 = !DILocation(line: 141, column: 5, scope: !1080)
!1082 = !DILocation(line: 141, column: 11, scope: !1080)
!1083 = !DILocation(line: 141, column: 16, scope: !1080)
!1084 = !DILocation(line: 141, column: 22, scope: !1080)
!1085 = !DILocation(line: 142, column: 5, scope: !1080)
!1086 = !DILocation(line: 144, column: 5, scope: !1080)
!1087 = !DILocation(line: 146, column: 2, scope: !1056)
!1088 = !DILocation(line: 132, column: 35, scope: !1051)
!1089 = !DILocation(line: 132, column: 2, scope: !1051)
!1090 = distinct !{!1090, !1054, !1091}
!1091 = !DILocation(line: 146, column: 2, scope: !1048)
!1092 = !DILocation(line: 147, column: 1, scope: !1023)
!1093 = distinct !DISubprogram(name: "BMO_op_exec", scope: !3, file: !3, line: 210, type: !386, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1094 = !DILocalVariable(name: "bm", arg: 1, scope: !1093, file: !3, line: 210, type: !220)
!1095 = !DILocation(line: 210, column: 25, scope: !1093)
!1096 = !DILocalVariable(name: "op", arg: 2, scope: !1093, file: !3, line: 210, type: !358)
!1097 = !DILocation(line: 210, column: 41, scope: !1093)
!1098 = !DILocation(line: 213, column: 32, scope: !1093)
!1099 = !DILocation(line: 213, column: 2, scope: !1093)
!1100 = !DILocation(line: 215, column: 11, scope: !1093)
!1101 = !DILocation(line: 215, column: 15, scope: !1093)
!1102 = !DILocation(line: 215, column: 2, scope: !1093)
!1103 = !DILocation(line: 217, column: 6, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 217, column: 6)
!1105 = !DILocation(line: 217, column: 10, scope: !1104)
!1106 = !DILocation(line: 217, column: 21, scope: !1104)
!1107 = !DILocation(line: 217, column: 6, scope: !1093)
!1108 = !DILocation(line: 218, column: 20, scope: !1104)
!1109 = !DILocation(line: 218, column: 24, scope: !1104)
!1110 = !DILocation(line: 218, column: 28, scope: !1104)
!1111 = !DILocation(line: 218, column: 3, scope: !1104)
!1112 = !DILocation(line: 219, column: 2, scope: !1093)
!1113 = !DILocation(line: 219, column: 6, scope: !1093)
!1114 = !DILocation(line: 219, column: 11, scope: !1093)
!1115 = !DILocation(line: 219, column: 15, scope: !1093)
!1116 = !DILocation(line: 221, column: 6, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 221, column: 6)
!1118 = !DILocation(line: 221, column: 10, scope: !1117)
!1119 = !DILocation(line: 221, column: 21, scope: !1117)
!1120 = !DILocation(line: 221, column: 6, scope: !1093)
!1121 = !DILocation(line: 222, column: 18, scope: !1117)
!1122 = !DILocation(line: 222, column: 22, scope: !1117)
!1123 = !DILocation(line: 222, column: 26, scope: !1117)
!1124 = !DILocation(line: 222, column: 3, scope: !1117)
!1125 = !DILocation(line: 224, column: 10, scope: !1093)
!1126 = !DILocation(line: 224, column: 2, scope: !1093)
!1127 = !DILocation(line: 225, column: 1, scope: !1093)
!1128 = distinct !DISubprogram(name: "BMO_op_finish", scope: !3, file: !3, line: 232, type: !386, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1129 = !DILocalVariable(name: "bm", arg: 1, scope: !1128, file: !3, line: 232, type: !220)
!1130 = !DILocation(line: 232, column: 27, scope: !1128)
!1131 = !DILocalVariable(name: "op", arg: 2, scope: !1128, file: !3, line: 232, type: !358)
!1132 = !DILocation(line: 232, column: 43, scope: !1128)
!1133 = !DILocation(line: 234, column: 34, scope: !1128)
!1134 = !DILocation(line: 234, column: 38, scope: !1128)
!1135 = !DILocation(line: 234, column: 20, scope: !1128)
!1136 = !DILocation(line: 234, column: 45, scope: !1128)
!1137 = !DILocation(line: 234, column: 61, scope: !1128)
!1138 = !DILocation(line: 234, column: 65, scope: !1128)
!1139 = !DILocation(line: 234, column: 2, scope: !1128)
!1140 = !DILocation(line: 235, column: 34, scope: !1128)
!1141 = !DILocation(line: 235, column: 38, scope: !1128)
!1142 = !DILocation(line: 235, column: 20, scope: !1128)
!1143 = !DILocation(line: 235, column: 45, scope: !1128)
!1144 = !DILocation(line: 235, column: 61, scope: !1128)
!1145 = !DILocation(line: 235, column: 65, scope: !1128)
!1146 = !DILocation(line: 235, column: 2, scope: !1128)
!1147 = !DILocation(line: 237, column: 20, scope: !1128)
!1148 = !DILocation(line: 237, column: 24, scope: !1128)
!1149 = !DILocation(line: 237, column: 2, scope: !1128)
!1150 = !DILocation(line: 245, column: 8, scope: !1128)
!1151 = !DILocation(line: 247, column: 1, scope: !1128)
!1152 = distinct !DISubprogram(name: "bmo_op_slots_free", scope: !3, file: !3, line: 149, type: !1024, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1153 = !DILocalVariable(name: "slot_types", arg: 1, scope: !1152, file: !3, line: 149, type: !1026)
!1154 = !DILocation(line: 149, column: 50, scope: !1152)
!1155 = !DILocalVariable(name: "slot_args", arg: 2, scope: !1152, file: !3, line: 149, type: !1037)
!1156 = !DILocation(line: 149, column: 72, scope: !1152)
!1157 = !DILocalVariable(name: "slot", scope: !1152, file: !3, line: 151, type: !1037)
!1158 = !DILocation(line: 151, column: 12, scope: !1152)
!1159 = !DILocalVariable(name: "i", scope: !1152, file: !3, line: 152, type: !7)
!1160 = !DILocation(line: 152, column: 15, scope: !1152)
!1161 = !DILocation(line: 153, column: 9, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 153, column: 2)
!1163 = !DILocation(line: 153, column: 7, scope: !1162)
!1164 = !DILocation(line: 153, column: 14, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 153, column: 2)
!1166 = !DILocation(line: 153, column: 25, scope: !1165)
!1167 = !DILocation(line: 153, column: 28, scope: !1165)
!1168 = !DILocation(line: 153, column: 2, scope: !1162)
!1169 = !DILocation(line: 154, column: 11, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 153, column: 39)
!1171 = !DILocation(line: 154, column: 21, scope: !1170)
!1172 = !DILocation(line: 154, column: 8, scope: !1170)
!1173 = !DILocation(line: 155, column: 11, scope: !1170)
!1174 = !DILocation(line: 155, column: 17, scope: !1170)
!1175 = !DILocation(line: 155, column: 3, scope: !1170)
!1176 = !DILocation(line: 157, column: 20, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 155, column: 28)
!1178 = !DILocation(line: 157, column: 26, scope: !1177)
!1179 = !DILocation(line: 157, column: 31, scope: !1177)
!1180 = !DILocation(line: 157, column: 5, scope: !1177)
!1181 = !DILocation(line: 158, column: 5, scope: !1177)
!1182 = !DILocation(line: 160, column: 5, scope: !1177)
!1183 = !DILocation(line: 162, column: 2, scope: !1170)
!1184 = !DILocation(line: 153, column: 35, scope: !1165)
!1185 = !DILocation(line: 153, column: 2, scope: !1165)
!1186 = distinct !{!1186, !1168, !1187}
!1187 = !DILocation(line: 162, column: 2, scope: !1162)
!1188 = !DILocation(line: 163, column: 1, scope: !1152)
!1189 = distinct !DISubprogram(name: "BMO_slot_exists", scope: !3, file: !3, line: 254, type: !1190, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!132, !1037, !205}
!1192 = !DILocalVariable(name: "slot_args", arg: 1, scope: !1189, file: !3, line: 254, type: !1037)
!1193 = !DILocation(line: 254, column: 31, scope: !1189)
!1194 = !DILocalVariable(name: "identifier", arg: 2, scope: !1189, file: !3, line: 254, type: !205)
!1195 = !DILocation(line: 254, column: 72, scope: !1189)
!1196 = !DILocalVariable(name: "slot_code", scope: !1189, file: !3, line: 256, type: !98)
!1197 = !DILocation(line: 256, column: 6, scope: !1189)
!1198 = !DILocation(line: 256, column: 39, scope: !1189)
!1199 = !DILocation(line: 256, column: 50, scope: !1189)
!1200 = !DILocation(line: 256, column: 18, scope: !1189)
!1201 = !DILocation(line: 257, column: 10, scope: !1189)
!1202 = !DILocation(line: 257, column: 20, scope: !1189)
!1203 = !DILocation(line: 257, column: 9, scope: !1189)
!1204 = !DILocation(line: 257, column: 2, scope: !1189)
!1205 = distinct !DISubprogram(name: "bmo_name_to_slotcode", scope: !3, file: !3, line: 1581, type: !1206, scopeLine: 1582, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!98, !1037, !205}
!1208 = !DILocalVariable(name: "slot_args", arg: 1, scope: !1205, file: !3, line: 1581, type: !1037)
!1209 = !DILocation(line: 1581, column: 42, scope: !1205)
!1210 = !DILocalVariable(name: "identifier", arg: 2, scope: !1205, file: !3, line: 1581, type: !205)
!1211 = !DILocation(line: 1581, column: 83, scope: !1205)
!1212 = !DILocalVariable(name: "i", scope: !1205, file: !3, line: 1583, type: !98)
!1213 = !DILocation(line: 1583, column: 6, scope: !1205)
!1214 = !DILocation(line: 1585, column: 2, scope: !1205)
!1215 = !DILocation(line: 1585, column: 9, scope: !1205)
!1216 = !DILocation(line: 1585, column: 20, scope: !1205)
!1217 = !DILocation(line: 1586, column: 7, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 1586, column: 7)
!1219 = distinct !DILexicalBlock(scope: !1205, file: !3, line: 1585, column: 31)
!1220 = !DILocation(line: 1586, column: 7, scope: !1219)
!1221 = !DILocation(line: 1587, column: 11, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 1586, column: 65)
!1223 = !DILocation(line: 1587, column: 4, scope: !1222)
!1224 = !DILocation(line: 1589, column: 12, scope: !1219)
!1225 = !DILocation(line: 1590, column: 4, scope: !1219)
!1226 = distinct !{!1226, !1214, !1227}
!1227 = !DILocation(line: 1591, column: 2, scope: !1205)
!1228 = !DILocation(line: 1593, column: 2, scope: !1205)
!1229 = !DILocation(line: 1594, column: 1, scope: !1205)
!1230 = distinct !DISubprogram(name: "BMO_slot_get", scope: !3, file: !3, line: 265, type: !1231, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!1037, !1037, !205}
!1233 = !DILocalVariable(name: "slot_args", arg: 1, scope: !1230, file: !3, line: 265, type: !1037)
!1234 = !DILocation(line: 265, column: 33, scope: !1230)
!1235 = !DILocalVariable(name: "identifier", arg: 2, scope: !1230, file: !3, line: 265, type: !205)
!1236 = !DILocation(line: 265, column: 74, scope: !1230)
!1237 = !DILocalVariable(name: "slot_code", scope: !1230, file: !3, line: 267, type: !98)
!1238 = !DILocation(line: 267, column: 6, scope: !1230)
!1239 = !DILocation(line: 267, column: 45, scope: !1230)
!1240 = !DILocation(line: 267, column: 56, scope: !1230)
!1241 = !DILocation(line: 267, column: 18, scope: !1230)
!1242 = !DILocation(line: 269, column: 6, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1230, file: !3, line: 269, column: 6)
!1244 = !DILocation(line: 269, column: 6, scope: !1230)
!1245 = !DILocation(line: 272, column: 3, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 269, column: 31)
!1247 = !DILocation(line: 275, column: 10, scope: !1230)
!1248 = !DILocation(line: 275, column: 20, scope: !1230)
!1249 = !DILocation(line: 275, column: 2, scope: !1230)
!1250 = !DILocation(line: 276, column: 1, scope: !1230)
!1251 = distinct !DISubprogram(name: "bmo_name_to_slotcode_check", scope: !3, file: !3, line: 1596, type: !1206, scopeLine: 1597, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1252 = !DILocalVariable(name: "slot_args", arg: 1, scope: !1251, file: !3, line: 1596, type: !1037)
!1253 = !DILocation(line: 1596, column: 48, scope: !1251)
!1254 = !DILocalVariable(name: "identifier", arg: 2, scope: !1251, file: !3, line: 1596, type: !205)
!1255 = !DILocation(line: 1596, column: 89, scope: !1251)
!1256 = !DILocalVariable(name: "i", scope: !1251, file: !3, line: 1598, type: !98)
!1257 = !DILocation(line: 1598, column: 6, scope: !1251)
!1258 = !DILocation(line: 1598, column: 31, scope: !1251)
!1259 = !DILocation(line: 1598, column: 42, scope: !1251)
!1260 = !DILocation(line: 1598, column: 10, scope: !1251)
!1261 = !DILocation(line: 1599, column: 6, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1251, file: !3, line: 1599, column: 6)
!1263 = !DILocation(line: 1599, column: 8, scope: !1262)
!1264 = !DILocation(line: 1599, column: 6, scope: !1251)
!1265 = !DILocation(line: 1600, column: 11, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 1599, column: 13)
!1267 = !DILocation(line: 1600, column: 102, scope: !1266)
!1268 = !DILocation(line: 1600, column: 3, scope: !1266)
!1269 = !DILocation(line: 1601, column: 2, scope: !1266)
!1270 = !DILocation(line: 1603, column: 9, scope: !1251)
!1271 = !DILocation(line: 1603, column: 2, scope: !1251)
!1272 = distinct !DISubprogram(name: "_bmo_slot_copy", scope: !3, file: !3, line: 284, type: !1273, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !360)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{null, !1037, !205, !1037, !205, !294}
!1275 = !DILocalVariable(name: "slot_args_src", arg: 1, scope: !1272, file: !3, line: 284, type: !1037)
!1276 = !DILocation(line: 284, column: 30, scope: !1272)
!1277 = !DILocalVariable(name: "slot_name_src", arg: 2, scope: !1272, file: !3, line: 284, type: !205)
!1278 = !DILocation(line: 284, column: 75, scope: !1272)
!1279 = !DILocalVariable(name: "slot_args_dst", arg: 3, scope: !1272, file: !3, line: 285, type: !1037)
!1280 = !DILocation(line: 285, column: 30, scope: !1272)
!1281 = !DILocalVariable(name: "slot_name_dst", arg: 4, scope: !1272, file: !3, line: 285, type: !205)
!1282 = !DILocation(line: 285, column: 75, scope: !1272)
!1283 = !DILocalVariable(name: "arena_dst", arg: 5, scope: !1272, file: !3, line: 286, type: !294)
!1284 = !DILocation(line: 286, column: 38, scope: !1272)
!1285 = !DILocalVariable(name: "slot_src", scope: !1272, file: !3, line: 288, type: !1037)
!1286 = !DILocation(line: 288, column: 12, scope: !1272)
!1287 = !DILocation(line: 288, column: 36, scope: !1272)
!1288 = !DILocation(line: 288, column: 51, scope: !1272)
!1289 = !DILocation(line: 288, column: 23, scope: !1272)
!1290 = !DILocalVariable(name: "slot_dst", scope: !1272, file: !3, line: 289, type: !1037)
!1291 = !DILocation(line: 289, column: 12, scope: !1272)
!1292 = !DILocation(line: 289, column: 36, scope: !1272)
!1293 = !DILocation(line: 289, column: 51, scope: !1272)
!1294 = !DILocation(line: 289, column: 23, scope: !1272)
!1295 = !DILocation(line: 291, column: 6, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 291, column: 6)
!1297 = !DILocation(line: 291, column: 18, scope: !1296)
!1298 = !DILocation(line: 291, column: 15, scope: !1296)
!1299 = !DILocation(line: 291, column: 6, scope: !1272)
!1300 = !DILocation(line: 292, column: 3, scope: !1296)
!1301 = !DILocation(line: 295, column: 6, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 295, column: 6)
!1303 = !DILocation(line: 295, column: 16, scope: !1302)
!1304 = !DILocation(line: 295, column: 29, scope: !1302)
!1305 = !DILocation(line: 295, column: 39, scope: !1302)
!1306 = !DILocation(line: 295, column: 26, scope: !1302)
!1307 = !DILocation(line: 295, column: 6, scope: !1272)
!1308 = !DILocation(line: 296, column: 3, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1302, file: !3, line: 295, column: 50)
!1310 = !DILocation(line: 299, column: 6, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 299, column: 6)
!1312 = !DILocation(line: 299, column: 16, scope: !1311)
!1313 = !DILocation(line: 299, column: 26, scope: !1311)
!1314 = !DILocation(line: 299, column: 6, scope: !1272)
!1315 = !DILocation(line: 301, column: 3, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1311, file: !3, line: 299, column: 54)
!1317 = !DILocation(line: 301, column: 13, scope: !1316)
