; ModuleID = 'blender/source/blender/blenkernel/intern/icons.c'
source_filename = "blender/source/blender/blenkernel/intern/icons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GHash = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.Icon = type { i8*, i8*, i16, void (i8*)* }
%struct.PreviewImage = type { [2 x i32], [2 x i32], [2 x i16], [2 x i16], [2 x i32*], [2 x %struct.GPUTexture*] }
%struct.GPUTexture = type opaque
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "gNextIconId", scope: !2, file: !3, line: 60, type: !74, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !948, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/icons.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eIconSizes", file: !6, line: 153, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "ICON_SIZE_ICON", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ICON_SIZE_PREVIEW", value: 1, isUnsigned: true)
!11 = !{!12, !32, !34, !35, !677, !679, !760, !841, !843, !45, !945, !55}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewImage", file: !6, line: 167, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !6, line: 159, size: 448, elements: !15)
!15 = !{!16, !20, !21, !24, !25, !28}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !14, file: !6, line: 161, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 2)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !14, file: !6, line: 162, baseType: !17, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !14, file: !6, line: 163, baseType: !22, size: 32, offset: 128)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !18)
!23 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !14, file: !6, line: 164, baseType: !22, size: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !14, file: !6, line: 165, baseType: !26, size: 128, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !18)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !14, file: !6, line: 166, baseType: !29, size: 128, offset: 320)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !18)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !6, line: 46, flags: DIFlagFwdDecl)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "Material", file: !37, line: 203, baseType: !38)
!37 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !37, line: 93, size: 7552, elements: !39)
!39 = !{!40, !109, !113, !114, !115, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !163, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !232, !233, !234, !235, !236, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !634, !635, !636, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !676}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !38, file: !37, line: 94, baseType: !41, size: 960)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !6, line: 130, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !6, line: 117, size: 960, elements: !43)
!43 = !{!44, !46, !47, !49, !68, !72, !73, !75, !76, !77}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !6, line: 118, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !42, file: !6, line: 118, baseType: !45, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !42, file: !6, line: 119, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !42, file: !6, line: 120, baseType: !50, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !6, line: 136, size: 17600, elements: !52)
!52 = !{!53, !54, !56, !59, !63, !64, !65}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !51, file: !6, line: 137, baseType: !41, size: 960)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !51, file: !6, line: 138, baseType: !55, size: 64, offset: 960)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !51, file: !6, line: 139, baseType: !57, size: 64, offset: 1024)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !6, line: 43, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !6, line: 140, baseType: !60, size: 8192, offset: 1088)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8192, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 1024)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !51, file: !6, line: 141, baseType: !60, size: 8192, offset: 9280)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !51, file: !6, line: 148, baseType: !50, size: 64, offset: 17472)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !51, file: !6, line: 150, baseType: !66, size: 64, offset: 17536)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !6, line: 45, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !6, line: 121, baseType: !69, size: 528, offset: 256)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 528, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 66)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !42, file: !6, line: 126, baseType: !23, size: 16, offset: 784)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !42, file: !6, line: 127, baseType: !74, size: 32, offset: 800)
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !42, file: !6, line: 128, baseType: !74, size: 32, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !42, file: !6, line: 128, baseType: !74, size: 32, offset: 864)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !42, file: !6, line: 129, baseType: !78, size: 64, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !6, line: 75, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !6, line: 62, size: 1024, elements: !81)
!81 = !{!82, !84, !85, !86, !87, !88, !92, !93, !107, !108}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !80, file: !6, line: 63, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !80, file: !6, line: 63, baseType: !83, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !6, line: 64, baseType: !33, size: 8, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !80, file: !6, line: 64, baseType: !33, size: 8, offset: 136)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !80, file: !6, line: 65, baseType: !23, size: 16, offset: 144)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !6, line: 66, baseType: !89, size: 512, offset: 160)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !80, file: !6, line: 67, baseType: !74, size: 32, offset: 672)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !6, line: 69, baseType: !94, size: 256, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !6, line: 60, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !6, line: 48, size: 256, elements: !96)
!96 = !{!97, !98, !105, !106}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !95, file: !6, line: 49, baseType: !45, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !95, file: !6, line: 58, baseType: !99, size: 128, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !100, line: 71, baseType: !101)
!100 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !100, line: 69, size: 128, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !101, file: !100, line: 70, baseType: !45, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !101, file: !100, line: 70, baseType: !45, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !95, file: !6, line: 59, baseType: !74, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !95, file: !6, line: 59, baseType: !74, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !80, file: !6, line: 70, baseType: !74, size: 32, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !80, file: !6, line: 74, baseType: !74, size: 32, offset: 992)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !38, file: !37, line: 95, baseType: !110, size: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !112, line: 42, flags: DIFlagFwdDecl)
!112 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !38, file: !37, line: 97, baseType: !23, size: 16, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !38, file: !37, line: 97, baseType: !23, size: 16, offset: 1040)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !38, file: !37, line: 99, baseType: !116, size: 32, offset: 1056)
!116 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !38, file: !37, line: 99, baseType: !116, size: 32, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !38, file: !37, line: 99, baseType: !116, size: 32, offset: 1120)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !38, file: !37, line: 100, baseType: !116, size: 32, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !38, file: !37, line: 100, baseType: !116, size: 32, offset: 1184)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !38, file: !37, line: 100, baseType: !116, size: 32, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !38, file: !37, line: 101, baseType: !116, size: 32, offset: 1248)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !38, file: !37, line: 101, baseType: !116, size: 32, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !38, file: !37, line: 101, baseType: !116, size: 32, offset: 1312)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !38, file: !37, line: 102, baseType: !116, size: 32, offset: 1344)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !38, file: !37, line: 102, baseType: !116, size: 32, offset: 1376)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !38, file: !37, line: 102, baseType: !116, size: 32, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !38, file: !37, line: 103, baseType: !116, size: 32, offset: 1440)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !38, file: !37, line: 103, baseType: !116, size: 32, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !38, file: !37, line: 103, baseType: !116, size: 32, offset: 1504)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !38, file: !37, line: 103, baseType: !116, size: 32, offset: 1536)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !38, file: !37, line: 103, baseType: !116, size: 32, offset: 1568)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !38, file: !37, line: 104, baseType: !116, size: 32, offset: 1600)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !38, file: !37, line: 104, baseType: !116, size: 32, offset: 1632)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !38, file: !37, line: 104, baseType: !116, size: 32, offset: 1664)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !38, file: !37, line: 104, baseType: !116, size: 32, offset: 1696)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !38, file: !37, line: 104, baseType: !116, size: 32, offset: 1728)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !38, file: !37, line: 105, baseType: !116, size: 32, offset: 1760)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !38, file: !37, line: 108, baseType: !140, size: 704, offset: 1792)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !37, line: 53, size: 704, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !140, file: !37, line: 54, baseType: !116, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !140, file: !37, line: 55, baseType: !116, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !140, file: !37, line: 56, baseType: !116, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !140, file: !37, line: 57, baseType: !116, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !140, file: !37, line: 59, baseType: !147, size: 96, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 96, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 3)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !140, file: !37, line: 60, baseType: !147, size: 96, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !140, file: !37, line: 61, baseType: !147, size: 96, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !140, file: !37, line: 63, baseType: !116, size: 32, offset: 416)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !140, file: !37, line: 64, baseType: !116, size: 32, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !140, file: !37, line: 65, baseType: !116, size: 32, offset: 480)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !140, file: !37, line: 67, baseType: !23, size: 16, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !140, file: !37, line: 68, baseType: !23, size: 16, offset: 528)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !140, file: !37, line: 69, baseType: !23, size: 16, offset: 544)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !140, file: !37, line: 70, baseType: !23, size: 16, offset: 560)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !140, file: !37, line: 72, baseType: !116, size: 32, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !140, file: !37, line: 73, baseType: !116, size: 32, offset: 608)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !140, file: !37, line: 74, baseType: !116, size: 32, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !140, file: !37, line: 75, baseType: !116, size: 32, offset: 672)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !38, file: !37, line: 109, baseType: !164, size: 128, offset: 2496)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !37, line: 79, size: 128, elements: !165)
!165 = !{!166, !167, !168, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !37, line: 80, baseType: !74, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !164, file: !37, line: 81, baseType: !74, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !164, file: !37, line: 82, baseType: !74, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !164, file: !37, line: 83, baseType: !74, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !38, file: !37, line: 111, baseType: !116, size: 32, offset: 2624)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !38, file: !37, line: 111, baseType: !116, size: 32, offset: 2656)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !38, file: !37, line: 112, baseType: !116, size: 32, offset: 2688)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !38, file: !37, line: 112, baseType: !116, size: 32, offset: 2720)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !38, file: !37, line: 113, baseType: !116, size: 32, offset: 2752)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !38, file: !37, line: 114, baseType: !116, size: 32, offset: 2784)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !38, file: !37, line: 114, baseType: !116, size: 32, offset: 2816)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !38, file: !37, line: 115, baseType: !23, size: 16, offset: 2848)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !38, file: !37, line: 115, baseType: !23, size: 16, offset: 2864)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !38, file: !37, line: 116, baseType: !23, size: 16, offset: 2880)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !38, file: !37, line: 117, baseType: !33, size: 8, offset: 2896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !38, file: !37, line: 117, baseType: !33, size: 8, offset: 2904)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !38, file: !37, line: 119, baseType: !116, size: 32, offset: 2912)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !38, file: !37, line: 119, baseType: !116, size: 32, offset: 2944)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !38, file: !37, line: 120, baseType: !23, size: 16, offset: 2976)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !38, file: !37, line: 120, baseType: !23, size: 16, offset: 2992)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !38, file: !37, line: 121, baseType: !116, size: 32, offset: 3008)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !38, file: !37, line: 121, baseType: !116, size: 32, offset: 3040)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !38, file: !37, line: 122, baseType: !116, size: 32, offset: 3072)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !38, file: !37, line: 123, baseType: !116, size: 32, offset: 3104)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !38, file: !37, line: 124, baseType: !23, size: 16, offset: 3136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !38, file: !37, line: 125, baseType: !23, size: 16, offset: 3152)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !38, file: !37, line: 127, baseType: !74, size: 32, offset: 3168)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !38, file: !37, line: 127, baseType: !74, size: 32, offset: 3200)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !38, file: !37, line: 128, baseType: !74, size: 32, offset: 3232)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !38, file: !37, line: 128, baseType: !74, size: 32, offset: 3264)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !38, file: !37, line: 129, baseType: !23, size: 16, offset: 3296)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !38, file: !37, line: 129, baseType: !23, size: 16, offset: 3312)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !38, file: !37, line: 129, baseType: !23, size: 16, offset: 3328)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !38, file: !37, line: 129, baseType: !23, size: 16, offset: 3344)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !38, file: !37, line: 130, baseType: !116, size: 32, offset: 3360)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !38, file: !37, line: 130, baseType: !116, size: 32, offset: 3392)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !38, file: !37, line: 130, baseType: !116, size: 32, offset: 3424)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !38, file: !37, line: 130, baseType: !116, size: 32, offset: 3456)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !38, file: !37, line: 131, baseType: !116, size: 32, offset: 3488)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !38, file: !37, line: 131, baseType: !116, size: 32, offset: 3520)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !38, file: !37, line: 131, baseType: !116, size: 32, offset: 3552)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !38, file: !37, line: 131, baseType: !116, size: 32, offset: 3584)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !38, file: !37, line: 132, baseType: !116, size: 32, offset: 3616)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !38, file: !37, line: 132, baseType: !116, size: 32, offset: 3648)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !38, file: !37, line: 133, baseType: !89, size: 512, offset: 3680)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !38, file: !37, line: 135, baseType: !116, size: 32, offset: 4192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !38, file: !37, line: 136, baseType: !116, size: 32, offset: 4224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !38, file: !37, line: 137, baseType: !116, size: 32, offset: 4256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !38, file: !37, line: 138, baseType: !74, size: 32, offset: 4288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !38, file: !37, line: 141, baseType: !33, size: 8, offset: 4320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !38, file: !37, line: 141, baseType: !33, size: 8, offset: 4328)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !38, file: !37, line: 141, baseType: !33, size: 8, offset: 4336)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !38, file: !37, line: 141, baseType: !33, size: 8, offset: 4344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !38, file: !37, line: 142, baseType: !23, size: 16, offset: 4352)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !38, file: !37, line: 142, baseType: !23, size: 16, offset: 4368)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !38, file: !37, line: 142, baseType: !23, size: 16, offset: 4384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !38, file: !37, line: 145, baseType: !33, size: 8, offset: 4400)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !38, file: !37, line: 145, baseType: !33, size: 8, offset: 4408)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !38, file: !37, line: 148, baseType: !23, size: 16, offset: 4416)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !38, file: !37, line: 148, baseType: !23, size: 16, offset: 4432)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !38, file: !37, line: 149, baseType: !116, size: 32, offset: 4448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !38, file: !37, line: 149, baseType: !116, size: 32, offset: 4480)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !38, file: !37, line: 152, baseType: !229, size: 128, offset: 4512)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 4)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !38, file: !37, line: 153, baseType: !116, size: 32, offset: 4640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !38, file: !37, line: 154, baseType: !116, size: 32, offset: 4672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !38, file: !37, line: 157, baseType: !23, size: 16, offset: 4704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !38, file: !37, line: 157, baseType: !23, size: 16, offset: 4720)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !38, file: !37, line: 160, baseType: !237, size: 64, offset: 4736)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !239, line: 113, size: 6208, elements: !240)
!239 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !{!241, !242, !243, !244, !245, !246, !250}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !238, file: !239, line: 114, baseType: !23, size: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !238, file: !239, line: 114, baseType: !23, size: 16, offset: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !238, file: !239, line: 115, baseType: !33, size: 8, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !238, file: !239, line: 115, baseType: !33, size: 8, offset: 40)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !238, file: !239, line: 116, baseType: !33, size: 8, offset: 48)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !238, file: !239, line: 117, baseType: !247, size: 8, offset: 56)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !239, line: 119, baseType: !251, size: 6144, offset: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 6144, elements: !261)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !239, line: 109, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !239, line: 106, size: 192, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !253, file: !239, line: 107, baseType: !116, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !253, file: !239, line: 107, baseType: !116, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !253, file: !239, line: 107, baseType: !116, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !253, file: !239, line: 107, baseType: !116, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !253, file: !239, line: 107, baseType: !116, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !253, file: !239, line: 108, baseType: !74, size: 32, offset: 160)
!261 = !{!262}
!262 = !DISubrange(count: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !38, file: !37, line: 161, baseType: !237, size: 64, offset: 4800)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !38, file: !37, line: 162, baseType: !33, size: 8, offset: 4864)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !38, file: !37, line: 162, baseType: !33, size: 8, offset: 4872)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !38, file: !37, line: 163, baseType: !33, size: 8, offset: 4880)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !38, file: !37, line: 163, baseType: !33, size: 8, offset: 4888)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !38, file: !37, line: 164, baseType: !23, size: 16, offset: 4896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !38, file: !37, line: 164, baseType: !23, size: 16, offset: 4912)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !38, file: !37, line: 165, baseType: !116, size: 32, offset: 4928)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !38, file: !37, line: 165, baseType: !116, size: 32, offset: 4960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !38, file: !37, line: 167, baseType: !273, size: 1152, offset: 4992)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, elements: !632)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !239, line: 57, size: 2496, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !284, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !275, file: !239, line: 59, baseType: !23, size: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !275, file: !239, line: 59, baseType: !23, size: 16, offset: 16)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !275, file: !239, line: 59, baseType: !23, size: 16, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !275, file: !239, line: 59, baseType: !23, size: 16, offset: 48)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !275, file: !239, line: 60, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !239, line: 49, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !275, file: !239, line: 61, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !239, line: 202, size: 3328, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !359, !362, !365, !432, !433, !463, !464, !542, !563, !571, !572}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !286, file: !239, line: 203, baseType: !41, size: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !286, file: !239, line: 204, baseType: !110, size: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !286, file: !239, line: 206, baseType: !116, size: 32, offset: 1024)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !286, file: !239, line: 206, baseType: !116, size: 32, offset: 1056)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !286, file: !239, line: 207, baseType: !116, size: 32, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !286, file: !239, line: 207, baseType: !116, size: 32, offset: 1120)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !286, file: !239, line: 207, baseType: !116, size: 32, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !286, file: !239, line: 207, baseType: !116, size: 32, offset: 1184)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !286, file: !239, line: 207, baseType: !116, size: 32, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !286, file: !239, line: 207, baseType: !116, size: 32, offset: 1248)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !286, file: !239, line: 208, baseType: !116, size: 32, offset: 1280)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !286, file: !239, line: 208, baseType: !116, size: 32, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !286, file: !239, line: 211, baseType: !116, size: 32, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !286, file: !239, line: 211, baseType: !116, size: 32, offset: 1376)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !286, file: !239, line: 211, baseType: !116, size: 32, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !286, file: !239, line: 211, baseType: !116, size: 32, offset: 1440)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !286, file: !239, line: 211, baseType: !116, size: 32, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !286, file: !239, line: 214, baseType: !116, size: 32, offset: 1504)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !286, file: !239, line: 214, baseType: !116, size: 32, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !286, file: !239, line: 217, baseType: !116, size: 32, offset: 1568)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !286, file: !239, line: 218, baseType: !116, size: 32, offset: 1600)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !286, file: !239, line: 219, baseType: !116, size: 32, offset: 1632)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !286, file: !239, line: 220, baseType: !116, size: 32, offset: 1664)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !286, file: !239, line: 221, baseType: !116, size: 32, offset: 1696)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !286, file: !239, line: 222, baseType: !23, size: 16, offset: 1728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !286, file: !239, line: 222, baseType: !23, size: 16, offset: 1744)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !286, file: !239, line: 224, baseType: !23, size: 16, offset: 1760)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !286, file: !239, line: 224, baseType: !23, size: 16, offset: 1776)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !286, file: !239, line: 227, baseType: !23, size: 16, offset: 1792)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !286, file: !239, line: 227, baseType: !23, size: 16, offset: 1808)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !286, file: !239, line: 229, baseType: !23, size: 16, offset: 1824)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !239, line: 229, baseType: !23, size: 16, offset: 1840)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !239, line: 230, baseType: !23, size: 16, offset: 1856)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !286, file: !239, line: 230, baseType: !23, size: 16, offset: 1872)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !286, file: !239, line: 232, baseType: !116, size: 32, offset: 1888)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !286, file: !239, line: 232, baseType: !116, size: 32, offset: 1920)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !286, file: !239, line: 232, baseType: !116, size: 32, offset: 1952)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !286, file: !239, line: 232, baseType: !116, size: 32, offset: 1984)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !286, file: !239, line: 233, baseType: !74, size: 32, offset: 2016)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !286, file: !239, line: 234, baseType: !74, size: 32, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !286, file: !239, line: 235, baseType: !23, size: 16, offset: 2080)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !286, file: !239, line: 235, baseType: !23, size: 16, offset: 2096)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !286, file: !239, line: 236, baseType: !23, size: 16, offset: 2112)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !286, file: !239, line: 239, baseType: !23, size: 16, offset: 2128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !286, file: !239, line: 240, baseType: !74, size: 32, offset: 2144)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !286, file: !239, line: 241, baseType: !74, size: 32, offset: 2176)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !286, file: !239, line: 241, baseType: !74, size: 32, offset: 2208)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !286, file: !239, line: 241, baseType: !74, size: 32, offset: 2240)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !286, file: !239, line: 243, baseType: !116, size: 32, offset: 2272)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !286, file: !239, line: 243, baseType: !116, size: 32, offset: 2304)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !286, file: !239, line: 244, baseType: !116, size: 32, offset: 2336)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !286, file: !239, line: 246, baseType: !340, size: 320, offset: 2368)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !341, line: 50, size: 320, elements: !342)
!341 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = !{!343, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !340, file: !341, line: 51, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !341, line: 40, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !340, file: !341, line: 53, baseType: !74, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !340, file: !341, line: 54, baseType: !74, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !340, file: !341, line: 55, baseType: !74, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !340, file: !341, line: 55, baseType: !74, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !340, file: !341, line: 56, baseType: !33, size: 8, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !340, file: !341, line: 56, baseType: !33, size: 8, offset: 200)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !340, file: !341, line: 57, baseType: !33, size: 8, offset: 208)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !340, file: !341, line: 57, baseType: !33, size: 8, offset: 216)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !340, file: !341, line: 59, baseType: !23, size: 16, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !340, file: !341, line: 59, baseType: !23, size: 16, offset: 240)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !340, file: !341, line: 59, baseType: !23, size: 16, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !340, file: !341, line: 61, baseType: !23, size: 16, offset: 272)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !340, file: !341, line: 63, baseType: !74, size: 32, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !286, file: !239, line: 248, baseType: !360, size: 64, offset: 2688)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !112, line: 43, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !286, file: !239, line: 249, baseType: !363, size: 64, offset: 2752)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !112, line: 45, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !286, file: !239, line: 250, baseType: !366, size: 64, offset: 2816)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !341, line: 77, size: 15424, elements: !368)
!368 = !{!369, !370, !371, !374, !375, !378, !381, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !421, !422, !426}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !367, file: !341, line: 78, baseType: !41, size: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !341, line: 80, baseType: !60, size: 8192, offset: 960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !367, file: !341, line: 82, baseType: !372, size: 64, offset: 9152)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !341, line: 43, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !367, file: !341, line: 83, baseType: !30, size: 64, offset: 9216)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !367, file: !341, line: 86, baseType: !376, size: 64, offset: 9280)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !341, line: 41, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !367, file: !341, line: 87, baseType: !379, size: 64, offset: 9344)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !341, line: 44, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !367, file: !341, line: 89, baseType: !382, size: 512, offset: 9408)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 512, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 8)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !367, file: !341, line: 90, baseType: !23, size: 16, offset: 9920)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !367, file: !341, line: 90, baseType: !23, size: 16, offset: 9936)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !367, file: !341, line: 92, baseType: !23, size: 16, offset: 9952)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !341, line: 92, baseType: !23, size: 16, offset: 9968)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !367, file: !341, line: 93, baseType: !23, size: 16, offset: 9984)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !341, line: 93, baseType: !23, size: 16, offset: 10000)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !367, file: !341, line: 94, baseType: !74, size: 32, offset: 10016)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !367, file: !341, line: 97, baseType: !23, size: 16, offset: 10048)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !367, file: !341, line: 97, baseType: !23, size: 16, offset: 10064)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !367, file: !341, line: 98, baseType: !23, size: 16, offset: 10080)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !367, file: !341, line: 98, baseType: !23, size: 16, offset: 10096)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !367, file: !341, line: 99, baseType: !23, size: 16, offset: 10112)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !367, file: !341, line: 99, baseType: !23, size: 16, offset: 10128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !367, file: !341, line: 100, baseType: !7, size: 32, offset: 10144)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !367, file: !341, line: 101, baseType: !27, size: 64, offset: 10176)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !367, file: !341, line: 103, baseType: !66, size: 64, offset: 10240)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !367, file: !341, line: 104, baseType: !402, size: 64, offset: 10304)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !367, file: !341, line: 107, baseType: !116, size: 32, offset: 10368)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !367, file: !341, line: 108, baseType: !74, size: 32, offset: 10400)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !367, file: !341, line: 109, baseType: !23, size: 16, offset: 10432)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !367, file: !341, line: 110, baseType: !23, size: 16, offset: 10448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !367, file: !341, line: 113, baseType: !74, size: 32, offset: 10464)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !367, file: !341, line: 113, baseType: !74, size: 32, offset: 10496)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !367, file: !341, line: 114, baseType: !33, size: 8, offset: 10528)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !367, file: !341, line: 114, baseType: !33, size: 8, offset: 10536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !367, file: !341, line: 115, baseType: !23, size: 16, offset: 10544)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !367, file: !341, line: 116, baseType: !229, size: 128, offset: 10560)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !367, file: !341, line: 119, baseType: !116, size: 32, offset: 10688)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !367, file: !341, line: 119, baseType: !116, size: 32, offset: 10720)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !367, file: !341, line: 122, baseType: !416, size: 512, offset: 10752)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !417, line: 182, baseType: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !417, line: 180, size: 512, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !418, file: !417, line: 181, baseType: !89, size: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !367, file: !341, line: 123, baseType: !33, size: 8, offset: 11264)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !367, file: !341, line: 125, baseType: !423, size: 56, offset: 11272)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 56, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 7)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !367, file: !341, line: 126, baseType: !427, size: 4096, offset: 11328)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 4096, elements: !383)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !341, line: 69, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !341, line: 67, size: 512, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !341, line: 68, baseType: !89, size: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !286, file: !239, line: 251, baseType: !237, size: 64, offset: 2880)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !286, file: !239, line: 252, baseType: !434, size: 64, offset: 2944)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !239, line: 122, size: 1600, elements: !436)
!436 = !{!437, !438, !439, !445, !448, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !435, file: !239, line: 123, baseType: !282, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !435, file: !239, line: 124, baseType: !366, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !435, file: !239, line: 125, baseType: !440, size: 384, offset: 128)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 384, elements: !443)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !417, line: 136, flags: DIFlagFwdDecl)
!443 = !{!444}
!444 = !DISubrange(count: 6)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !435, file: !239, line: 126, baseType: !446, size: 512, offset: 512)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 512, elements: !447)
!447 = !{!231, !231}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !435, file: !239, line: 127, baseType: !449, size: 288, offset: 1024)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 288, elements: !450)
!450 = !{!149, !149}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !435, file: !239, line: 128, baseType: !23, size: 16, offset: 1312)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !435, file: !239, line: 128, baseType: !23, size: 16, offset: 1328)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !435, file: !239, line: 129, baseType: !116, size: 32, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !435, file: !239, line: 129, baseType: !116, size: 32, offset: 1376)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !435, file: !239, line: 130, baseType: !116, size: 32, offset: 1408)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !435, file: !239, line: 131, baseType: !7, size: 32, offset: 1440)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !435, file: !239, line: 132, baseType: !23, size: 16, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !435, file: !239, line: 132, baseType: !23, size: 16, offset: 1488)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !435, file: !239, line: 133, baseType: !74, size: 32, offset: 1504)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !435, file: !239, line: 133, baseType: !74, size: 32, offset: 1536)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !435, file: !239, line: 134, baseType: !23, size: 16, offset: 1568)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !435, file: !239, line: 134, baseType: !23, size: 16, offset: 1584)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !286, file: !239, line: 253, baseType: !402, size: 64, offset: 3008)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !286, file: !239, line: 254, baseType: !465, size: 64, offset: 3072)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !239, line: 137, size: 832, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !483, !484, !485, !486, !487, !489, !490, !491, !492, !493, !494}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !466, file: !239, line: 138, baseType: !23, size: 16)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !466, file: !239, line: 140, baseType: !23, size: 16, offset: 16)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !466, file: !239, line: 141, baseType: !116, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !466, file: !239, line: 142, baseType: !116, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !466, file: !239, line: 143, baseType: !23, size: 16, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !466, file: !239, line: 144, baseType: !23, size: 16, offset: 112)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !466, file: !239, line: 145, baseType: !74, size: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !466, file: !239, line: 147, baseType: !74, size: 32, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !466, file: !239, line: 149, baseType: !282, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !466, file: !239, line: 150, baseType: !74, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !466, file: !239, line: 151, baseType: !23, size: 16, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !466, file: !239, line: 152, baseType: !23, size: 16, offset: 304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !466, file: !239, line: 154, baseType: !45, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !466, file: !239, line: 155, baseType: !482, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !466, file: !239, line: 157, baseType: !116, size: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !466, file: !239, line: 158, baseType: !23, size: 16, offset: 480)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !466, file: !239, line: 159, baseType: !23, size: 16, offset: 496)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !466, file: !239, line: 160, baseType: !23, size: 16, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !466, file: !239, line: 161, baseType: !488, size: 48, offset: 528)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 48, elements: !148)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !466, file: !239, line: 162, baseType: !116, size: 32, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !466, file: !239, line: 164, baseType: !116, size: 32, offset: 608)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !466, file: !239, line: 164, baseType: !116, size: 32, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !466, file: !239, line: 164, baseType: !116, size: 32, offset: 672)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !466, file: !239, line: 165, baseType: !237, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !466, file: !239, line: 167, baseType: !495, size: 64, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !417, line: 72, size: 3072, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !511, !512, !538, !539, !540, !541}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !417, line: 73, baseType: !74, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !496, file: !417, line: 73, baseType: !74, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !496, file: !417, line: 74, baseType: !74, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !496, file: !417, line: 75, baseType: !74, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !496, file: !417, line: 77, baseType: !503, size: 128, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !504, line: 95, baseType: !505)
!504 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !504, line: 92, size: 128, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !505, file: !504, line: 93, baseType: !116, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !505, file: !504, line: 93, baseType: !116, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !505, file: !504, line: 94, baseType: !116, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !505, file: !504, line: 94, baseType: !116, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !496, file: !417, line: 77, baseType: !503, size: 128, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !496, file: !417, line: 79, baseType: !513, size: 2304, offset: 384)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 2304, elements: !230)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !417, line: 67, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !417, line: 55, size: 576, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !524, !525, !534, !535, !536, !537}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !515, file: !417, line: 56, baseType: !23, size: 16)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !515, file: !417, line: 56, baseType: !23, size: 16, offset: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !515, file: !417, line: 58, baseType: !116, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !515, file: !417, line: 59, baseType: !116, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !515, file: !417, line: 59, baseType: !116, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !515, file: !417, line: 60, baseType: !523, size: 64, offset: 128)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !18)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !515, file: !417, line: 60, baseType: !523, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !515, file: !417, line: 61, baseType: !526, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !417, line: 47, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !417, line: 44, size: 96, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !528, file: !417, line: 45, baseType: !116, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !528, file: !417, line: 45, baseType: !116, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !417, line: 46, baseType: !23, size: 16, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !528, file: !417, line: 46, baseType: !23, size: 16, offset: 80)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !515, file: !417, line: 62, baseType: !526, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !515, file: !417, line: 64, baseType: !526, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !515, file: !417, line: 65, baseType: !523, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !515, file: !417, line: 66, baseType: !523, size: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !496, file: !417, line: 80, baseType: !147, size: 96, offset: 2688)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !496, file: !417, line: 80, baseType: !147, size: 96, offset: 2784)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !496, file: !417, line: 81, baseType: !147, size: 96, offset: 2880)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !496, file: !417, line: 83, baseType: !147, size: 96, offset: 2976)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !286, file: !239, line: 255, baseType: !543, size: 64, offset: 3136)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !239, line: 170, size: 8704, elements: !545)
!545 = !{!546, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !544, file: !239, line: 171, baseType: !547, size: 96)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 96, elements: !148)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !544, file: !239, line: 172, baseType: !74, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !544, file: !239, line: 173, baseType: !23, size: 16, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !544, file: !239, line: 174, baseType: !23, size: 16, offset: 144)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !544, file: !239, line: 175, baseType: !23, size: 16, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !544, file: !239, line: 176, baseType: !23, size: 16, offset: 176)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !544, file: !239, line: 177, baseType: !23, size: 16, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !544, file: !239, line: 178, baseType: !23, size: 16, offset: 208)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !544, file: !239, line: 179, baseType: !74, size: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !544, file: !239, line: 181, baseType: !282, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !544, file: !239, line: 182, baseType: !116, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !544, file: !239, line: 183, baseType: !74, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !544, file: !239, line: 184, baseType: !60, size: 8192, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !544, file: !239, line: 187, baseType: !482, size: 64, offset: 8576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !544, file: !239, line: 188, baseType: !74, size: 32, offset: 8640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !544, file: !239, line: 189, baseType: !74, size: 32, offset: 8672)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !286, file: !239, line: 256, baseType: !564, size: 64, offset: 3200)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !239, line: 193, size: 640, elements: !566)
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !565, file: !239, line: 194, baseType: !282, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !565, file: !239, line: 195, baseType: !89, size: 512, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !565, file: !239, line: 197, baseType: !74, size: 32, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !565, file: !239, line: 198, baseType: !74, size: 32, offset: 608)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !286, file: !239, line: 258, baseType: !33, size: 8, offset: 3264)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !286, file: !239, line: 259, baseType: !423, size: 56, offset: 3272)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !275, file: !239, line: 62, baseType: !89, size: 512, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !275, file: !239, line: 64, baseType: !33, size: 8, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !275, file: !239, line: 64, baseType: !33, size: 8, offset: 712)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !275, file: !239, line: 64, baseType: !33, size: 8, offset: 720)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !275, file: !239, line: 64, baseType: !33, size: 8, offset: 728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !275, file: !239, line: 65, baseType: !147, size: 96, offset: 736)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !239, line: 65, baseType: !147, size: 96, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !275, file: !239, line: 65, baseType: !116, size: 32, offset: 928)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !275, file: !239, line: 67, baseType: !23, size: 16, offset: 960)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !275, file: !239, line: 67, baseType: !23, size: 16, offset: 976)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !275, file: !239, line: 67, baseType: !23, size: 16, offset: 992)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !275, file: !239, line: 67, baseType: !23, size: 16, offset: 1008)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !275, file: !239, line: 68, baseType: !23, size: 16, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !275, file: !239, line: 68, baseType: !23, size: 16, offset: 1040)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !275, file: !239, line: 69, baseType: !33, size: 8, offset: 1056)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !275, file: !239, line: 69, baseType: !423, size: 56, offset: 1064)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !275, file: !239, line: 70, baseType: !116, size: 32, offset: 1120)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !275, file: !239, line: 70, baseType: !116, size: 32, offset: 1152)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !275, file: !239, line: 70, baseType: !116, size: 32, offset: 1184)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !275, file: !239, line: 70, baseType: !116, size: 32, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !275, file: !239, line: 71, baseType: !116, size: 32, offset: 1248)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !275, file: !239, line: 71, baseType: !116, size: 32, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !275, file: !239, line: 74, baseType: !116, size: 32, offset: 1312)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !275, file: !239, line: 74, baseType: !116, size: 32, offset: 1344)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !275, file: !239, line: 77, baseType: !116, size: 32, offset: 1376)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !275, file: !239, line: 77, baseType: !116, size: 32, offset: 1408)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !275, file: !239, line: 77, baseType: !116, size: 32, offset: 1440)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !275, file: !239, line: 78, baseType: !116, size: 32, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !275, file: !239, line: 78, baseType: !116, size: 32, offset: 1504)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !275, file: !239, line: 78, baseType: !116, size: 32, offset: 1536)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !275, file: !239, line: 79, baseType: !116, size: 32, offset: 1568)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !275, file: !239, line: 79, baseType: !116, size: 32, offset: 1600)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !275, file: !239, line: 79, baseType: !116, size: 32, offset: 1632)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !275, file: !239, line: 79, baseType: !116, size: 32, offset: 1664)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !275, file: !239, line: 80, baseType: !116, size: 32, offset: 1696)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !275, file: !239, line: 80, baseType: !116, size: 32, offset: 1728)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !275, file: !239, line: 80, baseType: !116, size: 32, offset: 1760)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !275, file: !239, line: 81, baseType: !116, size: 32, offset: 1792)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !275, file: !239, line: 81, baseType: !116, size: 32, offset: 1824)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !275, file: !239, line: 81, baseType: !116, size: 32, offset: 1856)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !275, file: !239, line: 82, baseType: !116, size: 32, offset: 1888)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !275, file: !239, line: 82, baseType: !116, size: 32, offset: 1920)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !275, file: !239, line: 82, baseType: !116, size: 32, offset: 1952)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !275, file: !239, line: 85, baseType: !116, size: 32, offset: 1984)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !275, file: !239, line: 85, baseType: !116, size: 32, offset: 2016)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !275, file: !239, line: 85, baseType: !116, size: 32, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !275, file: !239, line: 85, baseType: !116, size: 32, offset: 2080)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !275, file: !239, line: 86, baseType: !116, size: 32, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !275, file: !239, line: 86, baseType: !116, size: 32, offset: 2144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !275, file: !239, line: 86, baseType: !116, size: 32, offset: 2176)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !275, file: !239, line: 86, baseType: !116, size: 32, offset: 2208)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !275, file: !239, line: 87, baseType: !116, size: 32, offset: 2240)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !275, file: !239, line: 87, baseType: !116, size: 32, offset: 2272)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !275, file: !239, line: 87, baseType: !116, size: 32, offset: 2304)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !275, file: !239, line: 87, baseType: !116, size: 32, offset: 2336)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !275, file: !239, line: 90, baseType: !116, size: 32, offset: 2368)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !275, file: !239, line: 93, baseType: !116, size: 32, offset: 2400)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !275, file: !239, line: 93, baseType: !116, size: 32, offset: 2432)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !275, file: !239, line: 93, baseType: !116, size: 32, offset: 2464)
!632 = !{!633}
!633 = !DISubrange(count: 18)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !38, file: !37, line: 168, baseType: !360, size: 64, offset: 6144)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !38, file: !37, line: 169, baseType: !363, size: 64, offset: 6208)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !38, file: !37, line: 170, baseType: !637, size: 64, offset: 6272)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !37, line: 46, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !38, file: !37, line: 171, baseType: !402, size: 64, offset: 6336)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !38, file: !37, line: 174, baseType: !116, size: 32, offset: 6400)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !38, file: !37, line: 174, baseType: !116, size: 32, offset: 6432)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reflect", scope: !38, file: !37, line: 174, baseType: !116, size: 32, offset: 6464)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fhdist", scope: !38, file: !37, line: 175, baseType: !116, size: 32, offset: 6496)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "xyfrict", scope: !38, file: !37, line: 175, baseType: !116, size: 32, offset: 6528)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dynamode", scope: !38, file: !37, line: 176, baseType: !23, size: 16, offset: 6560)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !38, file: !37, line: 176, baseType: !23, size: 16, offset: 6576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sss_radius", scope: !38, file: !37, line: 179, baseType: !147, size: 96, offset: 6592)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sss_col", scope: !38, file: !37, line: 179, baseType: !147, size: 96, offset: 6688)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sss_error", scope: !38, file: !37, line: 180, baseType: !116, size: 32, offset: 6784)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sss_scale", scope: !38, file: !37, line: 180, baseType: !116, size: 32, offset: 6816)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sss_ior", scope: !38, file: !37, line: 180, baseType: !116, size: 32, offset: 6848)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sss_colfac", scope: !38, file: !37, line: 181, baseType: !116, size: 32, offset: 6880)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sss_texfac", scope: !38, file: !37, line: 181, baseType: !116, size: 32, offset: 6912)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sss_front", scope: !38, file: !37, line: 182, baseType: !116, size: 32, offset: 6944)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sss_back", scope: !38, file: !37, line: 182, baseType: !116, size: 32, offset: 6976)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sss_flag", scope: !38, file: !37, line: 183, baseType: !23, size: 16, offset: 7008)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sss_preset", scope: !38, file: !37, line: 183, baseType: !23, size: 16, offset: 7024)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mapto_textured", scope: !38, file: !37, line: 185, baseType: !74, size: 32, offset: 7040)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "shadowonly_flag", scope: !38, file: !37, line: 186, baseType: !23, size: 16, offset: 7072)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !38, file: !37, line: 187, baseType: !23, size: 16, offset: 7088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "line_col", scope: !38, file: !37, line: 190, baseType: !229, size: 128, offset: 7104)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "line_priority", scope: !38, file: !37, line: 191, baseType: !23, size: 16, offset: 7232)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vcol_alpha", scope: !38, file: !37, line: 192, baseType: !23, size: 16, offset: 7248)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "paint_active_slot", scope: !38, file: !37, line: 195, baseType: !23, size: 16, offset: 7264)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "paint_clone_slot", scope: !38, file: !37, line: 196, baseType: !23, size: 16, offset: 7280)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tot_slots", scope: !38, file: !37, line: 197, baseType: !23, size: 16, offset: 7296)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !38, file: !37, line: 198, baseType: !488, size: 48, offset: 7312)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "texpaintslot", scope: !38, file: !37, line: 200, baseType: !669, size: 64, offset: 7360)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TexPaintSlot", file: !37, line: 86, size: 192, elements: !671)
!671 = !{!672, !673, !674, !675}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !670, file: !37, line: 87, baseType: !366, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !670, file: !37, line: 88, baseType: !32, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !670, file: !37, line: 89, baseType: !74, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !670, file: !37, line: 90, baseType: !74, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "gpumaterial", scope: !38, file: !37, line: 202, baseType: !99, size: 128, offset: 7424)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !239, line: 261, baseType: !286)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "World", file: !681, line: 131, baseType: !682)
!681 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !681, line: 52, size: 4224, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !682, file: !681, line: 53, baseType: !41, size: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !682, file: !681, line: 54, baseType: !110, size: 64, offset: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !682, file: !681, line: 56, baseType: !23, size: 16, offset: 1024)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !682, file: !681, line: 56, baseType: !23, size: 16, offset: 1040)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !682, file: !681, line: 57, baseType: !23, size: 16, offset: 1056)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !682, file: !681, line: 57, baseType: !23, size: 16, offset: 1072)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !682, file: !681, line: 59, baseType: !116, size: 32, offset: 1088)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !682, file: !681, line: 59, baseType: !116, size: 32, offset: 1120)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !682, file: !681, line: 59, baseType: !116, size: 32, offset: 1152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !682, file: !681, line: 60, baseType: !116, size: 32, offset: 1184)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !682, file: !681, line: 60, baseType: !116, size: 32, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !682, file: !681, line: 60, baseType: !116, size: 32, offset: 1248)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !682, file: !681, line: 61, baseType: !116, size: 32, offset: 1280)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !682, file: !681, line: 61, baseType: !116, size: 32, offset: 1312)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !682, file: !681, line: 61, baseType: !116, size: 32, offset: 1344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !682, file: !681, line: 68, baseType: !116, size: 32, offset: 1376)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !682, file: !681, line: 68, baseType: !116, size: 32, offset: 1408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !682, file: !681, line: 68, baseType: !116, size: 32, offset: 1440)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !682, file: !681, line: 69, baseType: !116, size: 32, offset: 1472)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !682, file: !681, line: 69, baseType: !116, size: 32, offset: 1504)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !682, file: !681, line: 74, baseType: !116, size: 32, offset: 1536)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !682, file: !681, line: 79, baseType: !116, size: 32, offset: 1568)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !682, file: !681, line: 81, baseType: !23, size: 16, offset: 1600)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !682, file: !681, line: 91, baseType: !23, size: 16, offset: 1616)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !682, file: !681, line: 92, baseType: !23, size: 16, offset: 1632)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !682, file: !681, line: 93, baseType: !23, size: 16, offset: 1648)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !682, file: !681, line: 94, baseType: !23, size: 16, offset: 1664)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !682, file: !681, line: 94, baseType: !23, size: 16, offset: 1680)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !682, file: !681, line: 94, baseType: !23, size: 16, offset: 1696)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !682, file: !681, line: 94, baseType: !23, size: 16, offset: 1712)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !682, file: !681, line: 96, baseType: !116, size: 32, offset: 1728)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !682, file: !681, line: 96, baseType: !116, size: 32, offset: 1760)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !682, file: !681, line: 96, baseType: !116, size: 32, offset: 1792)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !682, file: !681, line: 96, baseType: !116, size: 32, offset: 1824)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !682, file: !681, line: 98, baseType: !116, size: 32, offset: 1856)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !682, file: !681, line: 98, baseType: !116, size: 32, offset: 1888)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !682, file: !681, line: 98, baseType: !116, size: 32, offset: 1920)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !682, file: !681, line: 98, baseType: !116, size: 32, offset: 1952)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !682, file: !681, line: 99, baseType: !116, size: 32, offset: 1984)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !682, file: !681, line: 99, baseType: !116, size: 32, offset: 2016)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !682, file: !681, line: 100, baseType: !116, size: 32, offset: 2048)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !682, file: !681, line: 100, baseType: !116, size: 32, offset: 2080)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !682, file: !681, line: 103, baseType: !23, size: 16, offset: 2112)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !682, file: !681, line: 103, baseType: !23, size: 16, offset: 2128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !682, file: !681, line: 103, baseType: !23, size: 16, offset: 2144)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !682, file: !681, line: 103, baseType: !23, size: 16, offset: 2160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !682, file: !681, line: 106, baseType: !116, size: 32, offset: 2176)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !682, file: !681, line: 106, baseType: !116, size: 32, offset: 2208)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !682, file: !681, line: 106, baseType: !116, size: 32, offset: 2240)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !682, file: !681, line: 106, baseType: !116, size: 32, offset: 2272)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !682, file: !681, line: 107, baseType: !23, size: 16, offset: 2304)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !682, file: !681, line: 107, baseType: !23, size: 16, offset: 2320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !682, file: !681, line: 107, baseType: !23, size: 16, offset: 2336)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !682, file: !681, line: 107, baseType: !23, size: 16, offset: 2352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !682, file: !681, line: 108, baseType: !116, size: 32, offset: 2368)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !682, file: !681, line: 108, baseType: !116, size: 32, offset: 2400)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !682, file: !681, line: 109, baseType: !116, size: 32, offset: 2432)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !682, file: !681, line: 109, baseType: !116, size: 32, offset: 2464)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !682, file: !681, line: 110, baseType: !116, size: 32, offset: 2496)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !682, file: !681, line: 110, baseType: !116, size: 32, offset: 2528)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !682, file: !681, line: 110, baseType: !116, size: 32, offset: 2560)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !682, file: !681, line: 111, baseType: !23, size: 16, offset: 2592)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !682, file: !681, line: 111, baseType: !23, size: 16, offset: 2608)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !682, file: !681, line: 112, baseType: !23, size: 16, offset: 2624)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !682, file: !681, line: 112, baseType: !23, size: 16, offset: 2640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !682, file: !681, line: 112, baseType: !23, size: 16, offset: 2656)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !681, line: 115, baseType: !23, size: 16, offset: 2672)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !682, file: !681, line: 118, baseType: !482, size: 64, offset: 2688)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !682, file: !681, line: 118, baseType: !482, size: 64, offset: 2752)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !682, file: !681, line: 121, baseType: !363, size: 64, offset: 2816)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !682, file: !681, line: 122, baseType: !273, size: 1152, offset: 2880)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !682, file: !681, line: 123, baseType: !23, size: 16, offset: 4032)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !682, file: !681, line: 123, baseType: !23, size: 16, offset: 4048)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !681, line: 123, baseType: !22, size: 32, offset: 4064)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !682, file: !681, line: 126, baseType: !402, size: 64, offset: 4096)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !682, file: !681, line: 129, baseType: !360, size: 64, offset: 4160)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lamp", file: !112, line: 113, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lamp", file: !112, line: 48, size: 4160, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !833, !834, !835, !836, !837, !839, !840}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !762, file: !112, line: 49, baseType: !41, size: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !762, file: !112, line: 50, baseType: !110, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !762, file: !112, line: 52, baseType: !23, size: 16, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !112, line: 52, baseType: !23, size: 16, offset: 1040)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !762, file: !112, line: 53, baseType: !74, size: 32, offset: 1056)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !762, file: !112, line: 55, baseType: !23, size: 16, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !762, file: !112, line: 55, baseType: !23, size: 16, offset: 1104)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !762, file: !112, line: 56, baseType: !116, size: 32, offset: 1120)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !762, file: !112, line: 56, baseType: !116, size: 32, offset: 1152)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !762, file: !112, line: 56, baseType: !116, size: 32, offset: 1184)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !762, file: !112, line: 56, baseType: !116, size: 32, offset: 1216)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "shdwr", scope: !762, file: !112, line: 57, baseType: !116, size: 32, offset: 1248)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "shdwg", scope: !762, file: !112, line: 57, baseType: !116, size: 32, offset: 1280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "shdwb", scope: !762, file: !112, line: 57, baseType: !116, size: 32, offset: 1312)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "shdwpad", scope: !762, file: !112, line: 57, baseType: !116, size: 32, offset: 1344)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !762, file: !112, line: 59, baseType: !116, size: 32, offset: 1376)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !762, file: !112, line: 59, baseType: !116, size: 32, offset: 1408)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "spotsize", scope: !762, file: !112, line: 59, baseType: !116, size: 32, offset: 1440)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "spotblend", scope: !762, file: !112, line: 59, baseType: !116, size: 32, offset: 1472)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "haint", scope: !762, file: !112, line: 60, baseType: !116, size: 32, offset: 1504)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "att1", scope: !762, file: !112, line: 63, baseType: !116, size: 32, offset: 1536)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "att2", scope: !762, file: !112, line: 63, baseType: !116, size: 32, offset: 1568)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "curfalloff", scope: !762, file: !112, line: 64, baseType: !495, size: 64, offset: 1600)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !762, file: !112, line: 65, baseType: !23, size: 16, offset: 1664)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !762, file: !112, line: 66, baseType: !23, size: 16, offset: 1680)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !762, file: !112, line: 68, baseType: !116, size: 32, offset: 1696)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !762, file: !112, line: 68, baseType: !116, size: 32, offset: 1728)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !762, file: !112, line: 69, baseType: !116, size: 32, offset: 1760)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !762, file: !112, line: 69, baseType: !116, size: 32, offset: 1792)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "compressthresh", scope: !762, file: !112, line: 69, baseType: !116, size: 32, offset: 1824)
