; ModuleID = 'blender/source/blender/render/intern/raytrace/rayobject_instance.cpp'
source_filename = "blender/source/blender/render/intern/raytrace/rayobject_instance.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RayObjectAPI = type { i32 (%struct.RayObject*, %struct.Isect*)*, void (%struct.RayObject*, %struct.RayObject*)*, void (%struct.RayObject*)*, void (%struct.RayObject*)*, void (%struct.RayObject*, float*, float*)*, float (%struct.RayObject*)*, void (%struct.RayObject*, %struct.RayHint*, float*, float*)* }
%struct.RayObject = type { %struct.RayObjectAPI*, %struct.RayObjectControl }
%struct.RayObjectControl = type { i8*, i32 (i8*)* }
%struct.Isect = type { [3 x float], [3 x float], float, [3 x float], [3 x float], [6 x i32], [3 x float], i32, i32, i32, i32, i8*, float, float, i32, %struct.anon, %struct.anon, %struct.RayObject*, %struct.RayHint* }
%struct.anon = type { i8*, i8* }
%struct.RayHint = type { %union.anon }
%union.anon = type { %struct.LCTSHint }
%struct.LCTSHint = type { i32, [256 x %struct.RayObject*] }
%struct.InstanceRayObject = type { %struct.RayObject, %struct.RayObject*, i8*, i8*, [4 x [4 x float]], [4 x [4 x float]] }

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [18 x i8] c"InstanceRayObject\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "instance_api", linkageName: "_ZL12instance_api", scope: !2, file: !3, line: 54, type: !694, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !115, imports: !116, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/render/intern/raytrace/rayobject_instance.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !26, !112}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "InstanceRayObject", file: !3, line: 75, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceRayObject", file: !3, line: 65, size: 1408, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS17InstanceRayObject")
!9 = !{!10, !104, !105, !106, !107, !111}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "rayobj", scope: !8, file: !3, line: 66, baseType: !11, size: 192)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "RayObject", file: !12, line: 50, baseType: !13)
!12 = !DIFile(filename: "blender/source/blender/render/intern/include/rayobject.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObject", file: !14, line: 118, size: 192, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTS9RayObject")
!14 = !DIFile(filename: "blender/source/blender/render/intern/include/../raytrace/rayobject_internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !95}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !13, file: !14, line: 119, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObjectAPI", file: !14, line: 131, size: 448, flags: DIFlagTypePassByValue, elements: !19, identifier: "_ZTS12RayObjectAPI")
!19 = !{!20, !66, !71, !76, !78, !84, !89}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "raycast", scope: !18, file: !14, line: 132, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_raycast_callback", file: !14, line: 123, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !26, !27}
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Isect", file: !29, line: 60, size: 1408, flags: DIFlagTypePassByValue, elements: !30, identifier: "_ZTS5Isect")
!29 = !DIFile(filename: "blender/source/blender/render/intern/include/rayintersection.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !36, !37, !38, !39, !40, !44, !45, !46, !47, !48, !49, !51, !52, !53, !54, !59, !60, !62}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !28, file: !29, line: 63, baseType: !32, size: 96)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 96, elements: !34)
!33 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!34 = !{!35}
!35 = !DISubrange(count: 3)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !28, file: !29, line: 64, baseType: !32, size: 96, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !28, file: !29, line: 65, baseType: !33, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "origstart", scope: !28, file: !29, line: 68, baseType: !32, size: 96, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "origdir", scope: !28, file: !29, line: 69, baseType: !32, size: 96, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bv_index", scope: !28, file: !29, line: 72, baseType: !41, size: 192, offset: 416)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 6)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "idot_axis", scope: !28, file: !29, line: 73, baseType: !32, size: 96, offset: 608)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !28, file: !29, line: 76, baseType: !25, size: 32, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !28, file: !29, line: 77, baseType: !25, size: 32, offset: 736)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !28, file: !29, line: 78, baseType: !25, size: 32, offset: 768)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !28, file: !29, line: 79, baseType: !25, size: 32, offset: 800)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !28, file: !29, line: 80, baseType: !50, size: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !28, file: !29, line: 83, baseType: !33, size: 32, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !28, file: !29, line: 83, baseType: !33, size: 32, offset: 928)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "isect", scope: !28, file: !29, line: 84, baseType: !25, size: 32, offset: 960)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !28, file: !29, line: 89, baseType: !55, size: 128, offset: 1024)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !28, file: !29, line: 86, size: 128, flags: DIFlagTypePassByValue, elements: !56, identifier: "_ZTSN5IsectUt_E")
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !55, file: !29, line: 87, baseType: !50, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !55, file: !29, line: 88, baseType: !50, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !28, file: !29, line: 89, baseType: !55, size: 128, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "last_hit", scope: !28, file: !29, line: 92, baseType: !61, size: 64, offset: 1280)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !28, file: !29, line: 98, baseType: !63, size: 64, offset: 1344)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "RayHint", file: !29, line: 56, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayHint", file: !29, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTS7RayHint")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !18, file: !14, line: 133, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_add_callback", file: !14, line: 124, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !26, !26}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !18, file: !14, line: 134, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_done_callback", file: !14, line: 125, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !26}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !18, file: !14, line: 135, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_free_callback", file: !14, line: 126, baseType: !73)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !18, file: !14, line: 136, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_merge_bb_callback", file: !14, line: 127, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !26, !83, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !18, file: !14, line: 137, baseType: !85, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_cost_callback", file: !14, line: 128, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!33, !26}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "hint_bb", scope: !18, file: !14, line: 138, baseType: !90, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_hint_bb_callback", file: !14, line: 129, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !26, !94, !83, !83}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !13, file: !14, line: 120, baseType: !96, size: 128, offset: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObjectControl", file: !14, line: 51, size: 128, flags: DIFlagTypePassByValue, elements: !97, identifier: "_ZTS16RayObjectControl")
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !14, line: 52, baseType: !50, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !96, file: !14, line: 53, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobjectcontrol_test_break_callback", file: !14, line: 49, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!25, !50}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !8, file: !3, line: 67, baseType: !26, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !8, file: !3, line: 69, baseType: !50, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "target_ob", scope: !8, file: !3, line: 70, baseType: !50, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "global2target", scope: !8, file: !3, line: 72, baseType: !108, size: 512, offset: 384)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !109)
!109 = !{!110, !110}
!110 = !DISubrange(count: 4)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "target2global", scope: !8, file: !3, line: 73, baseType: !108, size: 512, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !113, line: 87, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!114 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!115 = !{!0}
!116 = !{!117, !124, !131, !133, !135, !139, !141, !143, !145, !147, !149, !151, !153, !158, !162, !164, !166, !171, !173, !175, !177, !179, !181, !183, !186, !188, !190, !194, !199, !201, !203, !205, !207, !209, !211, !213, !215, !217, !219, !223, !227, !229, !231, !233, !235, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !261, !265, !269, !271, !273, !275, !277, !279, !281, !283, !285, !287, !291, !295, !299, !301, !303, !305, !310, !314, !318, !320, !322, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !346, !350, !354, !356, !358, !360, !367, !371, !375, !377, !379, !381, !383, !385, !387, !391, !395, !397, !399, !401, !403, !407, !411, !415, !417, !419, !421, !423, !425, !427, !431, !435, !439, !441, !445, !449, !451, !453, !455, !457, !459, !461, !467, !472, !476, !482, !486, !491, !493, !495, !499, !503, !516, !520, !524, !528, !532, !537, !541, !545, !549, !553, !561, !565, !569, !571, !575, !579, !584, !590, !594, !598, !600, !608, !612, !619, !621, !625, !629, !633, !637, !642, !646, !650, !651, !652, !653, !655, !656, !657, !658, !659, !660, !661, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !119, file: !123, line: 52)
!118 = !DINamespace(name: "std", scope: null)
!119 = !DISubprogram(name: "abs", scope: !120, file: !120, line: 840, type: !121, flags: DIFlagPrototyped, spFlags: 0)
!120 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!121 = !DISubroutineType(types: !122)
!122 = !{!25, !25}
!123 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!124 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !125, file: !130, line: 83)
!125 = !DISubprogram(name: "acos", scope: !126, file: !126, line: 53, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !129}
!129 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!130 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !132, file: !130, line: 102)
!132 = !DISubprogram(name: "asin", scope: !126, file: !126, line: 55, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!133 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !134, file: !130, line: 121)
!134 = !DISubprogram(name: "atan", scope: !126, file: !126, line: 57, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!135 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !136, file: !130, line: 140)
!136 = !DISubprogram(name: "atan2", scope: !126, file: !126, line: 59, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!137 = !DISubroutineType(types: !138)
!138 = !{!129, !129, !129}
!139 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !140, file: !130, line: 161)
!140 = !DISubprogram(name: "ceil", scope: !126, file: !126, line: 159, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!141 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !142, file: !130, line: 180)
!142 = !DISubprogram(name: "cos", scope: !126, file: !126, line: 62, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!143 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !144, file: !130, line: 199)
!144 = !DISubprogram(name: "cosh", scope: !126, file: !126, line: 71, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!145 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !146, file: !130, line: 218)
!146 = !DISubprogram(name: "exp", scope: !126, file: !126, line: 95, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!147 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !148, file: !130, line: 237)
!148 = !DISubprogram(name: "fabs", scope: !126, file: !126, line: 162, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!149 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !150, file: !130, line: 256)
!150 = !DISubprogram(name: "floor", scope: !126, file: !126, line: 165, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!151 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !152, file: !130, line: 275)
!152 = !DISubprogram(name: "fmod", scope: !126, file: !126, line: 168, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!153 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !154, file: !130, line: 296)
!154 = !DISubprogram(name: "frexp", scope: !126, file: !126, line: 98, type: !155, flags: DIFlagPrototyped, spFlags: 0)
!155 = !DISubroutineType(types: !156)
!156 = !{!129, !129, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !159, file: !130, line: 315)
!159 = !DISubprogram(name: "ldexp", scope: !126, file: !126, line: 101, type: !160, flags: DIFlagPrototyped, spFlags: 0)
!160 = !DISubroutineType(types: !161)
!161 = !{!129, !129, !25}
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !163, file: !130, line: 334)
!163 = !DISubprogram(name: "log", scope: !126, file: !126, line: 104, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !165, file: !130, line: 353)
!165 = !DISubprogram(name: "log10", scope: !126, file: !126, line: 107, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !167, file: !130, line: 372)
!167 = !DISubprogram(name: "modf", scope: !126, file: !126, line: 110, type: !168, flags: DIFlagPrototyped, spFlags: 0)
!168 = !DISubroutineType(types: !169)
!169 = !{!129, !129, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!171 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !172, file: !130, line: 384)
!172 = !DISubprogram(name: "pow", scope: !126, file: !126, line: 140, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!173 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !174, file: !130, line: 421)
!174 = !DISubprogram(name: "sin", scope: !126, file: !126, line: 64, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!175 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !176, file: !130, line: 440)
!176 = !DISubprogram(name: "sinh", scope: !126, file: !126, line: 73, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!177 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !178, file: !130, line: 459)
!178 = !DISubprogram(name: "sqrt", scope: !126, file: !126, line: 143, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!179 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !180, file: !130, line: 478)
!180 = !DISubprogram(name: "tan", scope: !126, file: !126, line: 66, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !182, file: !130, line: 497)
!182 = !DISubprogram(name: "tanh", scope: !126, file: !126, line: 75, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!183 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !184, file: !130, line: 1065)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !185, line: 150, baseType: !129)
!185 = !DIFile(filename: "/usr/include/math.h", directory: "")
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !187, file: !130, line: 1066)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !185, line: 149, baseType: !33)
!188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !189, file: !130, line: 1069)
!189 = !DISubprogram(name: "acosh", scope: !126, file: !126, line: 85, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !191, file: !130, line: 1070)
!191 = !DISubprogram(name: "acoshf", scope: !126, file: !126, line: 85, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!192 = !DISubroutineType(types: !193)
!193 = !{!33, !33}
!194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !195, file: !130, line: 1071)
!195 = !DISubprogram(name: "acoshl", scope: !126, file: !126, line: 85, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !198}
!198 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !200, file: !130, line: 1073)
!200 = !DISubprogram(name: "asinh", scope: !126, file: !126, line: 87, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !202, file: !130, line: 1074)
!202 = !DISubprogram(name: "asinhf", scope: !126, file: !126, line: 87, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !204, file: !130, line: 1075)
!204 = !DISubprogram(name: "asinhl", scope: !126, file: !126, line: 87, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !206, file: !130, line: 1077)
!206 = !DISubprogram(name: "atanh", scope: !126, file: !126, line: 89, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !208, file: !130, line: 1078)
!208 = !DISubprogram(name: "atanhf", scope: !126, file: !126, line: 89, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !210, file: !130, line: 1079)
!210 = !DISubprogram(name: "atanhl", scope: !126, file: !126, line: 89, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !212, file: !130, line: 1081)
!212 = !DISubprogram(name: "cbrt", scope: !126, file: !126, line: 152, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !214, file: !130, line: 1082)
!214 = !DISubprogram(name: "cbrtf", scope: !126, file: !126, line: 152, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !216, file: !130, line: 1083)
!216 = !DISubprogram(name: "cbrtl", scope: !126, file: !126, line: 152, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !218, file: !130, line: 1085)
!218 = !DISubprogram(name: "copysign", scope: !126, file: !126, line: 196, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !220, file: !130, line: 1086)
!220 = !DISubprogram(name: "copysignf", scope: !126, file: !126, line: 196, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!221 = !DISubroutineType(types: !222)
!222 = !{!33, !33, !33}
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !224, file: !130, line: 1087)
!224 = !DISubprogram(name: "copysignl", scope: !126, file: !126, line: 196, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!225 = !DISubroutineType(types: !226)
!226 = !{!198, !198, !198}
!227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !228, file: !130, line: 1089)
!228 = !DISubprogram(name: "erf", scope: !126, file: !126, line: 228, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !230, file: !130, line: 1090)
!230 = !DISubprogram(name: "erff", scope: !126, file: !126, line: 228, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !232, file: !130, line: 1091)
!232 = !DISubprogram(name: "erfl", scope: !126, file: !126, line: 228, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !234, file: !130, line: 1093)
!234 = !DISubprogram(name: "erfc", scope: !126, file: !126, line: 229, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !236, file: !130, line: 1094)
!236 = !DISubprogram(name: "erfcf", scope: !126, file: !126, line: 229, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !238, file: !130, line: 1095)
!238 = !DISubprogram(name: "erfcl", scope: !126, file: !126, line: 229, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !240, file: !130, line: 1097)
!240 = !DISubprogram(name: "exp2", scope: !126, file: !126, line: 130, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !242, file: !130, line: 1098)
!242 = !DISubprogram(name: "exp2f", scope: !126, file: !126, line: 130, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !244, file: !130, line: 1099)
!244 = !DISubprogram(name: "exp2l", scope: !126, file: !126, line: 130, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !246, file: !130, line: 1101)
!246 = !DISubprogram(name: "expm1", scope: !126, file: !126, line: 119, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !248, file: !130, line: 1102)
!248 = !DISubprogram(name: "expm1f", scope: !126, file: !126, line: 119, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !250, file: !130, line: 1103)
!250 = !DISubprogram(name: "expm1l", scope: !126, file: !126, line: 119, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !252, file: !130, line: 1105)
!252 = !DISubprogram(name: "fdim", scope: !126, file: !126, line: 326, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !254, file: !130, line: 1106)
!254 = !DISubprogram(name: "fdimf", scope: !126, file: !126, line: 326, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !256, file: !130, line: 1107)
!256 = !DISubprogram(name: "fdiml", scope: !126, file: !126, line: 326, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !258, file: !130, line: 1109)
!258 = !DISubprogram(name: "fma", scope: !126, file: !126, line: 335, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!259 = !DISubroutineType(types: !260)
!260 = !{!129, !129, !129, !129}
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !262, file: !130, line: 1110)
!262 = !DISubprogram(name: "fmaf", scope: !126, file: !126, line: 335, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{!33, !33, !33, !33}
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !266, file: !130, line: 1111)
!266 = !DISubprogram(name: "fmal", scope: !126, file: !126, line: 335, type: !267, flags: DIFlagPrototyped, spFlags: 0)
!267 = !DISubroutineType(types: !268)
!268 = !{!198, !198, !198, !198}
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !270, file: !130, line: 1113)
!270 = !DISubprogram(name: "fmax", scope: !126, file: !126, line: 329, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !272, file: !130, line: 1114)
!272 = !DISubprogram(name: "fmaxf", scope: !126, file: !126, line: 329, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !274, file: !130, line: 1115)
!274 = !DISubprogram(name: "fmaxl", scope: !126, file: !126, line: 329, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !276, file: !130, line: 1117)
!276 = !DISubprogram(name: "fmin", scope: !126, file: !126, line: 332, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !278, file: !130, line: 1118)
!278 = !DISubprogram(name: "fminf", scope: !126, file: !126, line: 332, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !280, file: !130, line: 1119)
!280 = !DISubprogram(name: "fminl", scope: !126, file: !126, line: 332, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !282, file: !130, line: 1121)
!282 = !DISubprogram(name: "hypot", scope: !126, file: !126, line: 147, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !284, file: !130, line: 1122)
!284 = !DISubprogram(name: "hypotf", scope: !126, file: !126, line: 147, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !286, file: !130, line: 1123)
!286 = !DISubprogram(name: "hypotl", scope: !126, file: !126, line: 147, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !288, file: !130, line: 1125)
!288 = !DISubprogram(name: "ilogb", scope: !126, file: !126, line: 280, type: !289, flags: DIFlagPrototyped, spFlags: 0)
!289 = !DISubroutineType(types: !290)
!290 = !{!25, !129}
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !292, file: !130, line: 1126)
!292 = !DISubprogram(name: "ilogbf", scope: !126, file: !126, line: 280, type: !293, flags: DIFlagPrototyped, spFlags: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{!25, !33}
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !296, file: !130, line: 1127)
!296 = !DISubprogram(name: "ilogbl", scope: !126, file: !126, line: 280, type: !297, flags: DIFlagPrototyped, spFlags: 0)
!297 = !DISubroutineType(types: !298)
!298 = !{!25, !198}
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !300, file: !130, line: 1129)
!300 = !DISubprogram(name: "lgamma", scope: !126, file: !126, line: 230, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !302, file: !130, line: 1130)
!302 = !DISubprogram(name: "lgammaf", scope: !126, file: !126, line: 230, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !304, file: !130, line: 1131)
!304 = !DISubprogram(name: "lgammal", scope: !126, file: !126, line: 230, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !306, file: !130, line: 1134)
!306 = !DISubprogram(name: "llrint", scope: !126, file: !126, line: 316, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !129}
!309 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !311, file: !130, line: 1135)
!311 = !DISubprogram(name: "llrintf", scope: !126, file: !126, line: 316, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!312 = !DISubroutineType(types: !313)
!313 = !{!309, !33}
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !315, file: !130, line: 1136)
!315 = !DISubprogram(name: "llrintl", scope: !126, file: !126, line: 316, type: !316, flags: DIFlagPrototyped, spFlags: 0)
!316 = !DISubroutineType(types: !317)
!317 = !{!309, !198}
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !319, file: !130, line: 1138)
!319 = !DISubprogram(name: "llround", scope: !126, file: !126, line: 322, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !321, file: !130, line: 1139)
!321 = !DISubprogram(name: "llroundf", scope: !126, file: !126, line: 322, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !323, file: !130, line: 1140)
!323 = !DISubprogram(name: "llroundl", scope: !126, file: !126, line: 322, type: !316, flags: DIFlagPrototyped, spFlags: 0)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !325, file: !130, line: 1143)
!325 = !DISubprogram(name: "log1p", scope: !126, file: !126, line: 122, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !327, file: !130, line: 1144)
!327 = !DISubprogram(name: "log1pf", scope: !126, file: !126, line: 122, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !329, file: !130, line: 1145)
!329 = !DISubprogram(name: "log1pl", scope: !126, file: !126, line: 122, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !331, file: !130, line: 1147)
!331 = !DISubprogram(name: "log2", scope: !126, file: !126, line: 133, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !333, file: !130, line: 1148)
!333 = !DISubprogram(name: "log2f", scope: !126, file: !126, line: 133, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !335, file: !130, line: 1149)
!335 = !DISubprogram(name: "log2l", scope: !126, file: !126, line: 133, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !337, file: !130, line: 1151)
!337 = !DISubprogram(name: "logb", scope: !126, file: !126, line: 125, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !339, file: !130, line: 1152)
!339 = !DISubprogram(name: "logbf", scope: !126, file: !126, line: 125, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !341, file: !130, line: 1153)
!341 = !DISubprogram(name: "logbl", scope: !126, file: !126, line: 125, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !343, file: !130, line: 1155)
!343 = !DISubprogram(name: "lrint", scope: !126, file: !126, line: 314, type: !344, flags: DIFlagPrototyped, spFlags: 0)
!344 = !DISubroutineType(types: !345)
!345 = !{!114, !129}
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !347, file: !130, line: 1156)
!347 = !DISubprogram(name: "lrintf", scope: !126, file: !126, line: 314, type: !348, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DISubroutineType(types: !349)
!349 = !{!114, !33}
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !351, file: !130, line: 1157)
!351 = !DISubprogram(name: "lrintl", scope: !126, file: !126, line: 314, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DISubroutineType(types: !353)
!353 = !{!114, !198}
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !355, file: !130, line: 1159)
!355 = !DISubprogram(name: "lround", scope: !126, file: !126, line: 320, type: !344, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !357, file: !130, line: 1160)
!357 = !DISubprogram(name: "lroundf", scope: !126, file: !126, line: 320, type: !348, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !359, file: !130, line: 1161)
!359 = !DISubprogram(name: "lroundl", scope: !126, file: !126, line: 320, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !361, file: !130, line: 1163)
!361 = !DISubprogram(name: "nan", scope: !126, file: !126, line: 201, type: !362, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DISubroutineType(types: !363)
!363 = !{!129, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !368, file: !130, line: 1164)
!368 = !DISubprogram(name: "nanf", scope: !126, file: !126, line: 201, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!369 = !DISubroutineType(types: !370)
!370 = !{!33, !364}
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !372, file: !130, line: 1165)
!372 = !DISubprogram(name: "nanl", scope: !126, file: !126, line: 201, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DISubroutineType(types: !374)
!374 = !{!198, !364}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !376, file: !130, line: 1167)
!376 = !DISubprogram(name: "nearbyint", scope: !126, file: !126, line: 294, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !378, file: !130, line: 1168)
!378 = !DISubprogram(name: "nearbyintf", scope: !126, file: !126, line: 294, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !380, file: !130, line: 1169)
!380 = !DISubprogram(name: "nearbyintl", scope: !126, file: !126, line: 294, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !382, file: !130, line: 1171)
!382 = !DISubprogram(name: "nextafter", scope: !126, file: !126, line: 259, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !384, file: !130, line: 1172)
!384 = !DISubprogram(name: "nextafterf", scope: !126, file: !126, line: 259, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !386, file: !130, line: 1173)
!386 = !DISubprogram(name: "nextafterl", scope: !126, file: !126, line: 259, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !388, file: !130, line: 1175)
!388 = !DISubprogram(name: "nexttoward", scope: !126, file: !126, line: 261, type: !389, flags: DIFlagPrototyped, spFlags: 0)
!389 = !DISubroutineType(types: !390)
!390 = !{!129, !129, !198}
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !392, file: !130, line: 1176)
!392 = !DISubprogram(name: "nexttowardf", scope: !126, file: !126, line: 261, type: !393, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DISubroutineType(types: !394)
!394 = !{!33, !33, !198}
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !396, file: !130, line: 1177)
!396 = !DISubprogram(name: "nexttowardl", scope: !126, file: !126, line: 261, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !398, file: !130, line: 1179)
!398 = !DISubprogram(name: "remainder", scope: !126, file: !126, line: 272, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !400, file: !130, line: 1180)
!400 = !DISubprogram(name: "remainderf", scope: !126, file: !126, line: 272, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !402, file: !130, line: 1181)
!402 = !DISubprogram(name: "remainderl", scope: !126, file: !126, line: 272, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !404, file: !130, line: 1183)
!404 = !DISubprogram(name: "remquo", scope: !126, file: !126, line: 307, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DISubroutineType(types: !406)
!406 = !{!129, !129, !129, !157}
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !408, file: !130, line: 1184)
!408 = !DISubprogram(name: "remquof", scope: !126, file: !126, line: 307, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!33, !33, !33, !157}
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !412, file: !130, line: 1185)
!412 = !DISubprogram(name: "remquol", scope: !126, file: !126, line: 307, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DISubroutineType(types: !414)
!414 = !{!198, !198, !198, !157}
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !416, file: !130, line: 1187)
!416 = !DISubprogram(name: "rint", scope: !126, file: !126, line: 256, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !418, file: !130, line: 1188)
!418 = !DISubprogram(name: "rintf", scope: !126, file: !126, line: 256, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !420, file: !130, line: 1189)
!420 = !DISubprogram(name: "rintl", scope: !126, file: !126, line: 256, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !422, file: !130, line: 1191)
!422 = !DISubprogram(name: "round", scope: !126, file: !126, line: 298, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !424, file: !130, line: 1192)
!424 = !DISubprogram(name: "roundf", scope: !126, file: !126, line: 298, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !426, file: !130, line: 1193)
!426 = !DISubprogram(name: "roundl", scope: !126, file: !126, line: 298, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !428, file: !130, line: 1195)
!428 = !DISubprogram(name: "scalbln", scope: !126, file: !126, line: 290, type: !429, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DISubroutineType(types: !430)
!430 = !{!129, !129, !114}
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !432, file: !130, line: 1196)
!432 = !DISubprogram(name: "scalblnf", scope: !126, file: !126, line: 290, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DISubroutineType(types: !434)
!434 = !{!33, !33, !114}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !436, file: !130, line: 1197)
!436 = !DISubprogram(name: "scalblnl", scope: !126, file: !126, line: 290, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!198, !198, !114}
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !440, file: !130, line: 1199)
!440 = !DISubprogram(name: "scalbn", scope: !126, file: !126, line: 276, type: !160, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !442, file: !130, line: 1200)
!442 = !DISubprogram(name: "scalbnf", scope: !126, file: !126, line: 276, type: !443, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{!33, !33, !25}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !446, file: !130, line: 1201)
!446 = !DISubprogram(name: "scalbnl", scope: !126, file: !126, line: 276, type: !447, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DISubroutineType(types: !448)
!448 = !{!198, !198, !25}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !450, file: !130, line: 1203)
!450 = !DISubprogram(name: "tgamma", scope: !126, file: !126, line: 235, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !452, file: !130, line: 1204)
!452 = !DISubprogram(name: "tgammaf", scope: !126, file: !126, line: 235, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !454, file: !130, line: 1205)
!454 = !DISubprogram(name: "tgammal", scope: !126, file: !126, line: 235, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !456, file: !130, line: 1207)
!456 = !DISubprogram(name: "trunc", scope: !126, file: !126, line: 302, type: !127, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !458, file: !130, line: 1208)
!458 = !DISubprogram(name: "truncf", scope: !126, file: !126, line: 302, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !460, file: !130, line: 1209)
!460 = !DISubprogram(name: "truncl", scope: !126, file: !126, line: 302, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !462, file: !466, line: 38)
!462 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !118, file: !123, line: 103, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DISubroutineType(types: !464)
!464 = !{!465, !465}
!465 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!466 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !468, file: !466, line: 54)
!468 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !118, file: !130, line: 380, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{!198, !198, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !473, file: !475, line: 127)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !120, line: 62, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!475 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !477, file: !475, line: 128)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !120, line: 70, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !479, identifier: "_ZTS6ldiv_t")
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !478, file: !120, line: 68, baseType: !114, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !478, file: !120, line: 69, baseType: !114, size: 64, offset: 64)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !483, file: !475, line: 130)
!483 = !DISubprogram(name: "abort", scope: !120, file: !120, line: 591, type: !484, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!484 = !DISubroutineType(types: !485)
!485 = !{null}
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !487, file: !475, line: 134)
!487 = !DISubprogram(name: "atexit", scope: !120, file: !120, line: 595, type: !488, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{!25, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !492, file: !475, line: 137)
!492 = !DISubprogram(name: "at_quick_exit", scope: !120, file: !120, line: 600, type: !488, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !494, file: !475, line: 140)
!494 = !DISubprogram(name: "atof", scope: !120, file: !120, line: 101, type: !362, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !496, file: !475, line: 141)
!496 = !DISubprogram(name: "atoi", scope: !120, file: !120, line: 104, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{!25, !364}
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !500, file: !475, line: 142)
!500 = !DISubprogram(name: "atol", scope: !120, file: !120, line: 107, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!114, !364}
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !504, file: !475, line: 143)
!504 = !DISubprogram(name: "bsearch", scope: !120, file: !120, line: 820, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!50, !507, !507, !509, !509, !512}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !510, line: 46, baseType: !511)
!510 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!511 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !120, line: 808, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!25, !507, !507}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !517, file: !475, line: 144)
!517 = !DISubprogram(name: "calloc", scope: !120, file: !120, line: 542, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!50, !509, !509}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !521, file: !475, line: 145)
!521 = !DISubprogram(name: "div", scope: !120, file: !120, line: 852, type: !522, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DISubroutineType(types: !523)
!523 = !{!473, !25, !25}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !525, file: !475, line: 146)
!525 = !DISubprogram(name: "exit", scope: !120, file: !120, line: 617, type: !526, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !25}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !529, file: !475, line: 147)
!529 = !DISubprogram(name: "free", scope: !120, file: !120, line: 565, type: !530, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !50}
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !533, file: !475, line: 148)
!533 = !DISubprogram(name: "getenv", scope: !120, file: !120, line: 634, type: !534, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DISubroutineType(types: !535)
!535 = !{!536, !364}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !538, file: !475, line: 149)
!538 = !DISubprogram(name: "labs", scope: !120, file: !120, line: 841, type: !539, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DISubroutineType(types: !540)
!540 = !{!114, !114}
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !542, file: !475, line: 150)
!542 = !DISubprogram(name: "ldiv", scope: !120, file: !120, line: 854, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!477, !114, !114}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !546, file: !475, line: 151)
!546 = !DISubprogram(name: "malloc", scope: !120, file: !120, line: 539, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!50, !509}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !550, file: !475, line: 153)
!550 = !DISubprogram(name: "mblen", scope: !120, file: !120, line: 922, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!25, !364, !509}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !554, file: !475, line: 154)
!554 = !DISubprogram(name: "mbstowcs", scope: !120, file: !120, line: 933, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!509, !557, !560, !509}
!557 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !364)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !562, file: !475, line: 155)
!562 = !DISubprogram(name: "mbtowc", scope: !120, file: !120, line: 925, type: !563, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DISubroutineType(types: !564)
!564 = !{!25, !557, !560, !509}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !566, file: !475, line: 157)
!566 = !DISubprogram(name: "qsort", scope: !120, file: !120, line: 830, type: !567, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !50, !509, !509, !512}
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !570, file: !475, line: 160)
!570 = !DISubprogram(name: "quick_exit", scope: !120, file: !120, line: 623, type: !526, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !572, file: !475, line: 163)
!572 = !DISubprogram(name: "rand", scope: !120, file: !120, line: 453, type: !573, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DISubroutineType(types: !574)
!574 = !{!25}
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !576, file: !475, line: 164)
!576 = !DISubprogram(name: "realloc", scope: !120, file: !120, line: 550, type: !577, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DISubroutineType(types: !578)
!578 = !{!50, !50, !509}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !580, file: !475, line: 165)
!580 = !DISubprogram(name: "srand", scope: !120, file: !120, line: 455, type: !581, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !583}
!583 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !585, file: !475, line: 166)
!585 = !DISubprogram(name: "strtod", scope: !120, file: !120, line: 117, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!129, !560, !588}
!588 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !591, file: !475, line: 167)
!591 = !DISubprogram(name: "strtol", scope: !120, file: !120, line: 176, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!114, !560, !588, !25}
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !595, file: !475, line: 168)
!595 = !DISubprogram(name: "strtoul", scope: !120, file: !120, line: 180, type: !596, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DISubroutineType(types: !597)
!597 = !{!511, !560, !588, !25}
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !599, file: !475, line: 169)
!599 = !DISubprogram(name: "system", scope: !120, file: !120, line: 784, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !601, file: !475, line: 171)
!601 = !DISubprogram(name: "wcstombs", scope: !120, file: !120, line: 936, type: !602, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DISubroutineType(types: !603)
!603 = !{!509, !604, !605, !509}
!604 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !536)
!605 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !609, file: !475, line: 172)
!609 = !DISubprogram(name: "wctomb", scope: !120, file: !120, line: 929, type: !610, flags: DIFlagPrototyped, spFlags: 0)
!610 = !DISubroutineType(types: !611)
!611 = !{!25, !536, !559}
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !614, file: !475, line: 200)
!613 = !DINamespace(name: "__gnu_cxx", scope: null)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !120, line: 80, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !616, identifier: "_ZTS7lldiv_t")
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !615, file: !120, line: 78, baseType: !309, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !615, file: !120, line: 79, baseType: !309, size: 64, offset: 64)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !620, file: !475, line: 206)
!620 = !DISubprogram(name: "_Exit", scope: !120, file: !120, line: 629, type: !526, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !622, file: !475, line: 210)
!622 = !DISubprogram(name: "llabs", scope: !120, file: !120, line: 844, type: !623, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DISubroutineType(types: !624)
!624 = !{!309, !309}
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !626, file: !475, line: 216)
!626 = !DISubprogram(name: "lldiv", scope: !120, file: !120, line: 858, type: !627, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DISubroutineType(types: !628)
!628 = !{!614, !309, !309}
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !630, file: !475, line: 227)
!630 = !DISubprogram(name: "atoll", scope: !120, file: !120, line: 112, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DISubroutineType(types: !632)
!632 = !{!309, !364}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !634, file: !475, line: 228)
!634 = !DISubprogram(name: "strtoll", scope: !120, file: !120, line: 200, type: !635, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{!309, !560, !588, !25}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !638, file: !475, line: 229)
!638 = !DISubprogram(name: "strtoull", scope: !120, file: !120, line: 205, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !560, !588, !25}
!641 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !643, file: !475, line: 231)
!643 = !DISubprogram(name: "strtof", scope: !120, file: !120, line: 123, type: !644, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!33, !560, !588}
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !613, entity: !647, file: !475, line: 232)
!647 = !DISubprogram(name: "strtold", scope: !120, file: !120, line: 126, type: !648, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DISubroutineType(types: !649)
!649 = !{!198, !560, !588}
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !614, file: !475, line: 240)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !620, file: !475, line: 242)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !622, file: !475, line: 244)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !654, file: !475, line: 245)
!654 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !613, file: !475, line: 213, type: !627, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !626, file: !475, line: 246)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !630, file: !475, line: 248)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !643, file: !475, line: 249)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !634, file: !475, line: 250)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !638, file: !475, line: 251)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !647, file: !475, line: 252)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !483, file: !662, line: 38)
!662 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
