; ModuleID = 'blender/source/blender/blenkernel/intern/tracking.c'
source_filename = "blender/source/blender/blenkernel/intern/tracking.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { %struct.ListBase }
%struct.ListBase = type { i8*, i8* }
%struct.StructRNA = type opaque
%struct.MovieTracking = type { %struct.MovieTrackingSettings, %struct.MovieTrackingCamera, %struct.ListBase, %struct.ListBase, %struct.MovieTrackingReconstruction, %struct.MovieTrackingStabilization, %struct.MovieTrackingTrack*, %struct.MovieTrackingPlaneTrack*, %struct.ListBase, i32, i32, %struct.MovieTrackingStats*, %struct.MovieTrackingDopesheet }
%struct.MovieTrackingSettings = type { i32, i16, i16, float, i16, i16, i16, i16, i16, i16, float, i16, i16, i32, i32, i32, i16, i16, float, i32, i32, float, float, i32 }
%struct.MovieTrackingCamera = type { i8*, i16, i16, float, float, float, i16, i16, [2 x float], float, float, float, float, float }
%struct.MovieTrackingReconstruction = type { i32, float, i32, i32, %struct.MovieReconstructedCamera* }
%struct.MovieReconstructedCamera = type { i32, float, [4 x [4 x float]] }
%struct.MovieTrackingStabilization = type { i32, i32, i32, float, %struct.MovieTrackingTrack*, float, float, float, i32, i32, float }

!21 = !DIEnumerator(name: "TRACK_ALGORITHM_FLAG_USE_BRUTE", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "TRACK_ALGORITHM_FLAG_USE_NORMALIZATION", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "TRACK_ALGORITHM_FLAG_USE_MASK", value: 8, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 461, baseType: !7, size: 32, elements: !25)
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "TRACKING_FILTER_NEAREST", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "TRACKING_FILTER_BILINEAR", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "TRACKING_FILTER_BICUBIC", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 473, baseType: !7, size: 32, elements: !30)
!30 = !{!31}
!31 = !DIEnumerator(name: "TRACKING_OBJECT_CAMERA", value: 1, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 380, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!34 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!38 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!39 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!40 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!41 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!42 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!43 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!44 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 371, baseType: !7, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51}
!47 = !DIEnumerator(name: "MARKER_DISABLED", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "MARKER_TRACKED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "MARKER_GRAPH_SEL_X", value: 4, isUnsigned: true)
!50 = !DIEnumerator(name: "MARKER_GRAPH_SEL_Y", value: 8, isUnsigned: true)
!51 = !DIEnumerator(name: "MARKER_GRAPH_SEL", value: 12, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 115, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!54 = !{!55, !56, !57}
!55 = !DIEnumerator(name: "CAMERA_SENSOR_FIT_AUTO", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "CAMERA_SENSOR_FIT_HOR", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "CAMERA_SENSOR_FIT_VERT", value: 2, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 492, baseType: !7, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "TRACKING_DOPE_SORT_INVERSE", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "TRACKING_DOPE_SELECTED_ONLY", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "TRACKING_DOPE_SHOW_HIDDEN", value: 4, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 468, baseType: !7, size: 32, elements: !64)
!64 = !{!65}
!65 = !DIEnumerator(name: "TRACKING_RECONSTRUCTED", value: 1, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 484, baseType: !7, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "TRACKING_DOPE_SORT_NAME", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "TRACKING_DOPE_SORT_LONGEST", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "TRACKING_DOPE_SORT_TOTAL", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "TRACKING_DOPE_SORT_AVERAGE_ERROR", value: 3, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 499, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIEnumerator(name: "TRACKING_COVERAGE_BAD", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "TRACKING_COVERAGE_ACCEPTABLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "TRACKING_COVERAGE_OK", value: 2, isUnsigned: true)
!77 = !{!78, !79, !80, !81, !83, !84, !86}
!78 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 2)
!90 = !{!0}
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 76, size: 128, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !91, file: !3, line: 77, baseType: !94, size: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !95, line: 71, baseType: !96)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !95, line: 69, size: 128, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !96, file: !95, line: 70, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !96, file: !95, line: 70, baseType: !79, size: 64, offset: 64)
!100 = !{i32 7, !"Dwarf Version", i32 4}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{i32 1, !"wchar_size", i32 4}
!103 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!104 = distinct !DISubprogram(name: "BKE_tracking_free", scope: !3, file: !3, line: 174, type: !105, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTracking", file: !6, line: 356, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !6, line: 340, size: 2624, elements: !110)
!110 = !{!111, !140, !158, !159, !160, !178, !310, !311, !421, !422, !423, !424, !433}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !109, file: !6, line: 341, baseType: !112, size: 576)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !6, line: 251, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !6, line: 207, size: 576, elements: !114)
!114 = !{!115, !116, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !6, line: 208, baseType: !80, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !113, file: !6, line: 211, baseType: !117, size: 16, offset: 32)
!117 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !113, file: !6, line: 212, baseType: !117, size: 16, offset: 48)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !113, file: !6, line: 213, baseType: !78, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !113, file: !6, line: 214, baseType: !117, size: 16, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !113, file: !6, line: 215, baseType: !117, size: 16, offset: 112)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !113, file: !6, line: 216, baseType: !117, size: 16, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !113, file: !6, line: 217, baseType: !117, size: 16, offset: 144)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !113, file: !6, line: 218, baseType: !117, size: 16, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !113, file: !6, line: 219, baseType: !117, size: 16, offset: 176)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !113, file: !6, line: 220, baseType: !78, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !113, file: !6, line: 222, baseType: !117, size: 16, offset: 224)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !113, file: !6, line: 225, baseType: !117, size: 16, offset: 240)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !113, file: !6, line: 228, baseType: !80, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !113, file: !6, line: 229, baseType: !80, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !113, file: !6, line: 233, baseType: !80, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !113, file: !6, line: 236, baseType: !117, size: 16, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !6, line: 236, baseType: !117, size: 16, offset: 368)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !113, file: !6, line: 241, baseType: !78, size: 32, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !113, file: !6, line: 244, baseType: !80, size: 32, offset: 416)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !113, file: !6, line: 244, baseType: !80, size: 32, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !113, file: !6, line: 245, baseType: !78, size: 32, offset: 480)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !113, file: !6, line: 248, baseType: !78, size: 32, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !113, file: !6, line: 250, baseType: !80, size: 32, offset: 544)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !109, file: !6, line: 342, baseType: !141, size: 448, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !6, line: 79, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !6, line: 61, size: 448, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !142, file: !6, line: 62, baseType: !79, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !142, file: !6, line: 64, baseType: !117, size: 16, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !142, file: !6, line: 65, baseType: !117, size: 16, offset: 80)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !142, file: !6, line: 67, baseType: !78, size: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !142, file: !6, line: 68, baseType: !78, size: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !142, file: !6, line: 69, baseType: !78, size: 32, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !142, file: !6, line: 70, baseType: !117, size: 16, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !142, file: !6, line: 71, baseType: !117, size: 16, offset: 208)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !142, file: !6, line: 72, baseType: !87, size: 64, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !142, file: !6, line: 75, baseType: !78, size: 32, offset: 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !142, file: !6, line: 75, baseType: !78, size: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !142, file: !6, line: 75, baseType: !78, size: 32, offset: 352)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !142, file: !6, line: 78, baseType: !78, size: 32, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !142, file: !6, line: 78, baseType: !78, size: 32, offset: 416)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !109, file: !6, line: 343, baseType: !94, size: 128, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !109, file: !6, line: 344, baseType: !94, size: 128, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !109, file: !6, line: 345, baseType: !161, size: 192, offset: 1280)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !6, line: 278, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !6, line: 270, size: 192, elements: !163)
!163 = !{!164, !165, !166, !167, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !162, file: !6, line: 271, baseType: !80, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !162, file: !6, line: 273, baseType: !78, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !162, file: !6, line: 275, baseType: !80, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !162, file: !6, line: 276, baseType: !80, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !162, file: !6, line: 277, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !6, line: 55, size: 576, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !170, file: !6, line: 56, baseType: !80, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !170, file: !6, line: 57, baseType: !78, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !170, file: !6, line: 58, baseType: !175, size: 512, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 512, elements: !176)
!176 = !{!177, !177}
!177 = !DISubrange(count: 4)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !109, file: !6, line: 346, baseType: !179, size: 384, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !6, line: 268, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !6, line: 253, size: 384, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !304, !305, !306, !307, !308, !309}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !180, file: !6, line: 254, baseType: !80, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !180, file: !6, line: 255, baseType: !80, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !180, file: !6, line: 255, baseType: !80, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !180, file: !6, line: 258, baseType: !78, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !180, file: !6, line: 259, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !6, line: 164, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !6, line: 108, size: 1664, elements: !190)
!190 = !{!191, !193, !194, !198, !199, !200, !201, !202, !203, !204, !205, !218, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !302, !303}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !6, line: 109, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !189, file: !6, line: 109, baseType: !192, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !6, line: 111, baseType: !195, size: 512, offset: 128)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 512, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !189, file: !6, line: 119, baseType: !87, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !189, file: !6, line: 119, baseType: !87, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !189, file: !6, line: 125, baseType: !87, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !189, file: !6, line: 125, baseType: !87, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !189, file: !6, line: 127, baseType: !87, size: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !189, file: !6, line: 130, baseType: !80, size: 32, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !189, file: !6, line: 131, baseType: !80, size: 32, offset: 992)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !189, file: !6, line: 132, baseType: !206, size: 64, offset: 1024)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !6, line: 106, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !6, line: 81, size: 512, elements: !209)
!209 = !{!210, !211, !214, !215, !216, !217}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !208, file: !6, line: 82, baseType: !87, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !208, file: !6, line: 97, baseType: !212, size: 256, offset: 64)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !213)
!213 = !{!177, !89}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !208, file: !6, line: 102, baseType: !87, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !208, file: !6, line: 102, baseType: !87, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !208, file: !6, line: 104, baseType: !80, size: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !6, line: 105, baseType: !80, size: 32, offset: 480)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !189, file: !6, line: 135, baseType: !219, size: 96, offset: 1088)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 96, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 3)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !189, file: !6, line: 136, baseType: !78, size: 32, offset: 1184)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !6, line: 139, baseType: !80, size: 32, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !189, file: !6, line: 139, baseType: !80, size: 32, offset: 1248)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !189, file: !6, line: 139, baseType: !80, size: 32, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !189, file: !6, line: 140, baseType: !219, size: 96, offset: 1312)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !189, file: !6, line: 143, baseType: !117, size: 16, offset: 1408)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !189, file: !6, line: 144, baseType: !117, size: 16, offset: 1424)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !189, file: !6, line: 145, baseType: !117, size: 16, offset: 1440)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !189, file: !6, line: 148, baseType: !117, size: 16, offset: 1456)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !189, file: !6, line: 149, baseType: !80, size: 32, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !189, file: !6, line: 150, baseType: !78, size: 32, offset: 1504)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !189, file: !6, line: 152, baseType: !234, size: 64, offset: 1536)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !236, line: 130, size: 1216, elements: !237)
!236 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = !{!238, !297, !298, !299, !300, !301}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !235, file: !236, line: 131, baseType: !239, size: 960)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !240, line: 130, baseType: !241)
!240 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !240, line: 117, size: 960, elements: !242)
!242 = !{!243, !244, !245, !247, !266, !270, !271, !272, !273, !274}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !240, line: 118, baseType: !79, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !241, file: !240, line: 118, baseType: !79, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !241, file: !240, line: 119, baseType: !246, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !241, file: !240, line: 120, baseType: !248, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !240, line: 136, size: 17600, elements: !250)
!250 = !{!251, !252, !254, !257, !261, !262, !263}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !249, file: !240, line: 137, baseType: !239, size: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !249, file: !240, line: 138, baseType: !253, size: 64, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !249, file: !240, line: 139, baseType: !255, size: 64, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !240, line: 43, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !240, line: 140, baseType: !258, size: 8192, offset: 1088)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8192, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !249, file: !240, line: 141, baseType: !258, size: 8192, offset: 9280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !249, file: !240, line: 148, baseType: !248, size: 64, offset: 17472)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !249, file: !240, line: 150, baseType: !264, size: 64, offset: 17536)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !240, line: 45, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !240, line: 121, baseType: !267, size: 528, offset: 256)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 528, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 66)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !241, file: !240, line: 126, baseType: !117, size: 16, offset: 784)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !241, file: !240, line: 127, baseType: !80, size: 32, offset: 800)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !241, file: !240, line: 128, baseType: !80, size: 32, offset: 832)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !241, file: !240, line: 128, baseType: !80, size: 32, offset: 864)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !241, file: !240, line: 129, baseType: !275, size: 64, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !240, line: 75, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !240, line: 62, size: 1024, elements: !278)
!278 = !{!279, !281, !282, !283, !284, !285, !286, !287, !295, !296}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !240, line: 63, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !277, file: !240, line: 63, baseType: !280, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !240, line: 64, baseType: !85, size: 8, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !277, file: !240, line: 64, baseType: !85, size: 8, offset: 136)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !240, line: 65, baseType: !117, size: 16, offset: 144)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !277, file: !240, line: 66, baseType: !195, size: 512, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !277, file: !240, line: 67, baseType: !80, size: 32, offset: 672)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !240, line: 69, baseType: !288, size: 256, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !240, line: 60, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !240, line: 48, size: 256, elements: !290)
!290 = !{!291, !292, !293, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !289, file: !240, line: 49, baseType: !79, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !289, file: !240, line: 58, baseType: !94, size: 128, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !289, file: !240, line: 59, baseType: !80, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !289, file: !240, line: 59, baseType: !80, size: 32, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !277, file: !240, line: 70, baseType: !80, size: 32, offset: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !277, file: !240, line: 74, baseType: !80, size: 32, offset: 992)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !235, file: !236, line: 134, baseType: !94, size: 128, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !235, file: !236, line: 135, baseType: !80, size: 32, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !235, file: !236, line: 141, baseType: !117, size: 16, offset: 1120)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !235, file: !236, line: 142, baseType: !117, size: 16, offset: 1136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !235, file: !236, line: 143, baseType: !79, size: 64, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !189, file: !6, line: 163, baseType: !78, size: 32, offset: 1600)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !189, file: !6, line: 163, baseType: !78, size: 32, offset: 1632)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !180, file: !6, line: 261, baseType: !78, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !180, file: !6, line: 261, baseType: !78, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !180, file: !6, line: 261, baseType: !78, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !180, file: !6, line: 263, baseType: !80, size: 32, offset: 288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !180, file: !6, line: 266, baseType: !80, size: 32, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !180, file: !6, line: 267, baseType: !78, size: 32, offset: 352)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !109, file: !6, line: 347, baseType: !187, size: 64, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !109, file: !6, line: 348, baseType: !312, size: 64, offset: 1920)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !6, line: 205, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !6, line: 186, size: 1024, elements: !315)
!315 = !{!316, !318, !319, !320, !322, !323, !324, !332, !333, !334, !419, !420}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !6, line: 187, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !314, file: !6, line: 187, baseType: !317, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !6, line: 189, baseType: !195, size: 512, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !314, file: !6, line: 191, baseType: !321, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !314, file: !6, line: 193, baseType: !80, size: 32, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !314, file: !6, line: 193, baseType: !80, size: 32, offset: 736)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !314, file: !6, line: 195, baseType: !325, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !6, line: 184, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !6, line: 166, size: 320, elements: !328)
!328 = !{!329, !330, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !327, file: !6, line: 180, baseType: !212, size: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !327, file: !6, line: 182, baseType: !80, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !6, line: 183, baseType: !80, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !314, file: !6, line: 196, baseType: !80, size: 32, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !314, file: !6, line: 198, baseType: !80, size: 32, offset: 864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !314, file: !6, line: 200, baseType: !335, size: 64, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !337, line: 77, size: 15424, elements: !338)
!337 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!338 = !{!339, !340, !341, !344, !347, !350, !353, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !373, !374, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !400, !401, !402, !408, !409, !413}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !336, file: !337, line: 78, baseType: !239, size: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !336, file: !337, line: 80, baseType: !258, size: 8192, offset: 960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !336, file: !337, line: 82, baseType: !342, size: 64, offset: 9152)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !337, line: 43, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !336, file: !337, line: 83, baseType: !345, size: 64, offset: 9216)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !240, line: 46, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !336, file: !337, line: 86, baseType: !348, size: 64, offset: 9280)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !337, line: 41, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !336, file: !337, line: 87, baseType: !351, size: 64, offset: 9344)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !337, line: 44, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !336, file: !337, line: 89, baseType: !354, size: 512, offset: 9408)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 512, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !336, file: !337, line: 90, baseType: !117, size: 16, offset: 9920)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !336, file: !337, line: 90, baseType: !117, size: 16, offset: 9936)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !336, file: !337, line: 92, baseType: !117, size: 16, offset: 9952)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !337, line: 92, baseType: !117, size: 16, offset: 9968)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !336, file: !337, line: 93, baseType: !117, size: 16, offset: 9984)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !337, line: 93, baseType: !117, size: 16, offset: 10000)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !336, file: !337, line: 94, baseType: !80, size: 32, offset: 10016)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !336, file: !337, line: 97, baseType: !117, size: 16, offset: 10048)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !336, file: !337, line: 97, baseType: !117, size: 16, offset: 10064)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !336, file: !337, line: 98, baseType: !117, size: 16, offset: 10080)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !336, file: !337, line: 98, baseType: !117, size: 16, offset: 10096)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !336, file: !337, line: 99, baseType: !117, size: 16, offset: 10112)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !336, file: !337, line: 99, baseType: !117, size: 16, offset: 10128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !336, file: !337, line: 100, baseType: !7, size: 32, offset: 10144)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !336, file: !337, line: 101, baseType: !372, size: 64, offset: 10176)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !336, file: !337, line: 103, baseType: !264, size: 64, offset: 10240)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !336, file: !337, line: 104, baseType: !375, size: 64, offset: 10304)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !240, line: 159, size: 448, elements: !377)
!377 = !{!378, !380, !381, !383, !384, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !376, file: !240, line: 161, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !88)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !376, file: !240, line: 162, baseType: !379, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !376, file: !240, line: 163, baseType: !382, size: 32, offset: 128)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !88)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !376, file: !240, line: 164, baseType: !382, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !376, file: !240, line: 165, baseType: !385, size: 128, offset: 192)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, elements: !88)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !376, file: !240, line: 166, baseType: !387, size: 128, offset: 320)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 128, elements: !88)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !336, file: !337, line: 107, baseType: !78, size: 32, offset: 10368)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !336, file: !337, line: 108, baseType: !80, size: 32, offset: 10400)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !336, file: !337, line: 109, baseType: !117, size: 16, offset: 10432)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !336, file: !337, line: 110, baseType: !117, size: 16, offset: 10448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !336, file: !337, line: 113, baseType: !80, size: 32, offset: 10464)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !336, file: !337, line: 113, baseType: !80, size: 32, offset: 10496)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !336, file: !337, line: 114, baseType: !85, size: 8, offset: 10528)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !336, file: !337, line: 114, baseType: !85, size: 8, offset: 10536)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !336, file: !337, line: 115, baseType: !117, size: 16, offset: 10544)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !336, file: !337, line: 116, baseType: !398, size: 128, offset: 10560)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !399)
!399 = !{!177}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !336, file: !337, line: 119, baseType: !78, size: 32, offset: 10688)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !336, file: !337, line: 119, baseType: !78, size: 32, offset: 10720)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !336, file: !337, line: 122, baseType: !403, size: 512, offset: 10752)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !404, line: 182, baseType: !405)
!404 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !404, line: 180, size: 512, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !404, line: 181, baseType: !195, size: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !336, file: !337, line: 123, baseType: !85, size: 8, offset: 11264)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !336, file: !337, line: 125, baseType: !410, size: 56, offset: 11272)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 56, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 7)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !336, file: !337, line: 126, baseType: !414, size: 4096, offset: 11328)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 4096, elements: !355)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !337, line: 69, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !337, line: 67, size: 512, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !416, file: !337, line: 68, baseType: !195, size: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !314, file: !6, line: 201, baseType: !78, size: 32, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !314, file: !6, line: 204, baseType: !80, size: 32, offset: 992)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !109, file: !6, line: 350, baseType: !94, size: 128, offset: 1984)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !109, file: !6, line: 351, baseType: !80, size: 32, offset: 2112)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !109, file: !6, line: 351, baseType: !80, size: 32, offset: 2144)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !109, file: !6, line: 353, baseType: !425, size: 64, offset: 2176)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !6, line: 297, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !6, line: 295, size: 2048, elements: !428)
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !427, file: !6, line: 296, baseType: !430, size: 2048)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !109, file: !6, line: 355, baseType: !434, size: 384, offset: 2240)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !6, line: 338, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !6, line: 322, size: 384, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !435, file: !6, line: 323, baseType: !80, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !435, file: !6, line: 325, baseType: !117, size: 16, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !6, line: 326, baseType: !117, size: 16, offset: 48)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !435, file: !6, line: 331, baseType: !94, size: 128, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !435, file: !6, line: 334, baseType: !94, size: 128, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !435, file: !6, line: 335, baseType: !80, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !435, file: !6, line: 337, baseType: !80, size: 32, offset: 352)
!444 = !{}
!445 = !DILocalVariable(name: "tracking", arg: 1, scope: !104, file: !3, line: 174, type: !107)
!446 = !DILocation(line: 174, column: 39, scope: !104)
!447 = !DILocation(line: 176, column: 24, scope: !104)
!448 = !DILocation(line: 176, column: 34, scope: !104)
!449 = !DILocation(line: 176, column: 2, scope: !104)
!450 = !DILocation(line: 177, column: 30, scope: !104)
!451 = !DILocation(line: 177, column: 40, scope: !104)
!452 = !DILocation(line: 177, column: 2, scope: !104)
!453 = !DILocation(line: 178, column: 32, scope: !104)
!454 = !DILocation(line: 178, column: 42, scope: !104)
!455 = !DILocation(line: 178, column: 2, scope: !104)
!456 = !DILocation(line: 179, column: 25, scope: !104)
!457 = !DILocation(line: 179, column: 35, scope: !104)
!458 = !DILocation(line: 179, column: 2, scope: !104)
!459 = !DILocation(line: 181, column: 6, scope: !460)
!460 = distinct !DILexicalBlock(scope: !104, file: !3, line: 181, column: 6)
!461 = !DILocation(line: 181, column: 16, scope: !460)
!462 = !DILocation(line: 181, column: 23, scope: !460)
!463 = !DILocation(line: 181, column: 6, scope: !104)
!464 = !DILocation(line: 182, column: 32, scope: !460)
!465 = !DILocation(line: 182, column: 42, scope: !460)
!466 = !DILocation(line: 182, column: 49, scope: !460)
!467 = !DILocation(line: 182, column: 3, scope: !460)
!468 = !DILocation(line: 184, column: 27, scope: !104)
!469 = !DILocation(line: 184, column: 37, scope: !104)
!470 = !DILocation(line: 184, column: 2, scope: !104)
!471 = !DILocation(line: 185, column: 1, scope: !104)
!472 = distinct !DISubprogram(name: "tracking_tracks_free", scope: !3, file: !3, line: 83, type: !473, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !444)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!476 = !DILocalVariable(name: "tracks", arg: 1, scope: !472, file: !3, line: 83, type: !475)
!477 = !DILocation(line: 83, column: 44, scope: !472)
!478 = !DILocalVariable(name: "track", scope: !472, file: !3, line: 85, type: !187)
!479 = !DILocation(line: 85, column: 22, scope: !472)
!480 = !DILocation(line: 87, column: 15, scope: !481)
!481 = distinct !DILexicalBlock(scope: !472, file: !3, line: 87, column: 2)
!482 = !DILocation(line: 87, column: 23, scope: !481)
!483 = !DILocation(line: 87, column: 13, scope: !481)
!484 = !DILocation(line: 87, column: 7, scope: !481)
!485 = !DILocation(line: 87, column: 30, scope: !486)
!486 = distinct !DILexicalBlock(scope: !481, file: !3, line: 87, column: 2)
!487 = !DILocation(line: 87, column: 2, scope: !481)
!488 = !DILocation(line: 88, column: 27, scope: !489)
!489 = distinct !DILexicalBlock(scope: !486, file: !3, line: 87, column: 58)
!490 = !DILocation(line: 88, column: 3, scope: !489)
!491 = !DILocation(line: 89, column: 2, scope: !489)
!492 = !DILocation(line: 87, column: 45, scope: !486)
!493 = !DILocation(line: 87, column: 52, scope: !486)
!494 = !DILocation(line: 87, column: 43, scope: !486)
!495 = !DILocation(line: 87, column: 2, scope: !486)
!496 = distinct !{!496, !487, !497}
!497 = !DILocation(line: 89, column: 2, scope: !481)
!498 = !DILocation(line: 91, column: 16, scope: !472)
!499 = !DILocation(line: 91, column: 2, scope: !472)
!500 = !DILocation(line: 92, column: 1, scope: !472)
!501 = distinct !DISubprogram(name: "tracking_plane_tracks_free", scope: !3, file: !3, line: 95, type: !473, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !444)
!502 = !DILocalVariable(name: "plane_tracks", arg: 1, scope: !501, file: !3, line: 95, type: !475)
!503 = !DILocation(line: 95, column: 50, scope: !501)
!504 = !DILocalVariable(name: "plane_track", scope: !501, file: !3, line: 97, type: !312)
!505 = !DILocation(line: 97, column: 27, scope: !501)
!506 = !DILocation(line: 99, column: 21, scope: !507)
!507 = distinct !DILexicalBlock(scope: !501, file: !3, line: 99, column: 2)
!508 = !DILocation(line: 99, column: 35, scope: !507)
!509 = !DILocation(line: 99, column: 19, scope: !507)
!510 = !DILocation(line: 99, column: 7, scope: !507)
!511 = !DILocation(line: 99, column: 42, scope: !512)
!512 = distinct !DILexicalBlock(scope: !507, file: !3, line: 99, column: 2)
!513 = !DILocation(line: 99, column: 2, scope: !507)
!514 = !DILocation(line: 100, column: 33, scope: !515)
!515 = distinct !DILexicalBlock(scope: !512, file: !3, line: 99, column: 88)
!516 = !DILocation(line: 100, column: 3, scope: !515)
!517 = !DILocation(line: 101, column: 2, scope: !515)
!518 = !DILocation(line: 99, column: 69, scope: !512)
!519 = !DILocation(line: 99, column: 82, scope: !512)
!520 = !DILocation(line: 99, column: 67, scope: !512)
!521 = !DILocation(line: 99, column: 2, scope: !512)
!522 = distinct !{!522, !513, !523}
!523 = !DILocation(line: 101, column: 2, scope: !507)
!524 = !DILocation(line: 103, column: 16, scope: !501)
!525 = !DILocation(line: 103, column: 2, scope: !501)
!526 = !DILocation(line: 104, column: 1, scope: !501)
!527 = distinct !DISubprogram(name: "tracking_reconstruction_free", scope: !3, file: !3, line: 111, type: !528, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !444)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!531 = !DILocalVariable(name: "reconstruction", arg: 1, scope: !527, file: !3, line: 111, type: !530)
!532 = !DILocation(line: 111, column: 71, scope: !527)
!533 = !DILocation(line: 113, column: 6, scope: !534)
!534 = distinct !DILexicalBlock(scope: !527, file: !3, line: 113, column: 6)
!535 = !DILocation(line: 113, column: 22, scope: !534)
!536 = !DILocation(line: 113, column: 6, scope: !527)
!537 = !DILocation(line: 114, column: 3, scope: !534)
!538 = !DILocation(line: 114, column: 13, scope: !534)
!539 = !DILocation(line: 114, column: 29, scope: !534)
!540 = !DILocation(line: 115, column: 1, scope: !527)
!541 = distinct !DISubprogram(name: "tracking_objects_free", scope: !3, file: !3, line: 130, type: !473, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !444)
!542 = !DILocalVariable(name: "objects", arg: 1, scope: !541, file: !3, line: 130, type: !475)
!543 = !DILocation(line: 130, column: 45, scope: !541)
!544 = !DILocalVariable(name: "object", scope: !541, file: !3, line: 132, type: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingObject", file: !6, line: 293, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingObject", file: !6, line: 280, size: 1216, elements: !548)
!548 = !{!549, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !6, line: 281, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !547, file: !6, line: 281, baseType: !550, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !547, file: !6, line: 283, baseType: !195, size: 512, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !547, file: !6, line: 284, baseType: !80, size: 32, offset: 640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !547, file: !6, line: 285, baseType: !78, size: 32, offset: 672)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !547, file: !6, line: 287, baseType: !94, size: 128, offset: 704)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !547, file: !6, line: 288, baseType: !94, size: 128, offset: 832)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !547, file: !6, line: 289, baseType: !161, size: 192, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !547, file: !6, line: 292, baseType: !80, size: 32, offset: 1152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !547, file: !6, line: 292, baseType: !80, size: 32, offset: 1184)
!560 = !DILocation(line: 132, column: 23, scope: !541)
!561 = !DILocation(line: 135, column: 16, scope: !562)
!562 = distinct !DILexicalBlock(scope: !541, file: !3, line: 135, column: 2)
!563 = !DILocation(line: 135, column: 25, scope: !562)
!564 = !DILocation(line: 135, column: 14, scope: !562)
!565 = !DILocation(line: 135, column: 7, scope: !562)
!566 = !DILocation(line: 135, column: 32, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !3, line: 135, column: 2)
!568 = !DILocation(line: 135, column: 2, scope: !562)
!569 = !DILocation(line: 136, column: 24, scope: !567)
!570 = !DILocation(line: 136, column: 3, scope: !567)
!571 = !DILocation(line: 135, column: 49, scope: !567)
!572 = !DILocation(line: 135, column: 57, scope: !567)
!573 = !DILocation(line: 135, column: 47, scope: !567)
!574 = !DILocation(line: 135, column: 2, scope: !567)
!575 = distinct !{!575, !568, !576}
!576 = !DILocation(line: 136, column: 30, scope: !562)
!577 = !DILocation(line: 139, column: 16, scope: !541)
!578 = !DILocation(line: 139, column: 2, scope: !541)
!579 = !DILocation(line: 140, column: 1, scope: !541)
!580 = distinct !DISubprogram(name: "BKE_tracking_distortion_free", scope: !3, file: !3, line: 1835, type: !581, scopeLine: 1836, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieDistortion", file: !3, line: 74, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieDistortion", file: !3, line: 72, size: 64, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !585, file: !3, line: 73, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "libmv_CameraIntrinsics", file: !590, line: 34, flags: DIFlagFwdDecl)
!590 = !DIFile(filename: "blender/extern/libmv/intern/camera_intrinsics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!591 = !DILocalVariable(name: "distortion", arg: 1, scope: !580, file: !3, line: 1835, type: !583)
!592 = !DILocation(line: 1835, column: 52, scope: !580)
!593 = !DILocation(line: 1837, column: 32, scope: !580)
!594 = !DILocation(line: 1837, column: 44, scope: !580)
!595 = !DILocation(line: 1837, column: 2, scope: !580)
!596 = !DILocation(line: 1839, column: 2, scope: !580)
!597 = !DILocation(line: 1839, column: 12, scope: !580)
!598 = !DILocation(line: 1840, column: 1, scope: !580)
!599 = distinct !DISubprogram(name: "tracking_dopesheet_free", scope: !3, file: !3, line: 145, type: !600, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !444)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!603 = !DILocalVariable(name: "dopesheet", arg: 1, scope: !599, file: !3, line: 145, type: !602)
!604 = !DILocation(line: 145, column: 61, scope: !599)
!605 = !DILocalVariable(name: "channel", scope: !599, file: !3, line: 147, type: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheetChannel", file: !6, line: 310, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheetChannel", file: !6, line: 299, size: 896, elements: !609)
!609 = !{!610, !612, !613, !614, !615, !616, !617, !619, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !608, file: !6, line: 300, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !608, file: !6, line: 300, baseType: !611, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !608, file: !6, line: 302, baseType: !187, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !608, file: !6, line: 303, baseType: !80, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !608, file: !6, line: 305, baseType: !195, size: 512, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tot_segment", scope: !608, file: !6, line: 307, baseType: !80, size: 32, offset: 736)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !608, file: !6, line: 308, baseType: !618, size: 64, offset: 768)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "max_segment", scope: !608, file: !6, line: 309, baseType: !80, size: 32, offset: 832)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "total_frames", scope: !608, file: !6, line: 309, baseType: !80, size: 32, offset: 864)
!621 = !DILocation(line: 147, column: 33, scope: !599)
!622 = !DILocation(line: 150, column: 12, scope: !599)
!623 = !DILocation(line: 150, column: 23, scope: !599)
!624 = !DILocation(line: 150, column: 32, scope: !599)
!625 = !DILocation(line: 150, column: 10, scope: !599)
!626 = !DILocation(line: 151, column: 2, scope: !599)
!627 = !DILocation(line: 151, column: 9, scope: !599)
!628 = !DILocation(line: 152, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !630, file: !3, line: 152, column: 7)
!630 = distinct !DILexicalBlock(scope: !599, file: !3, line: 151, column: 18)
!631 = !DILocation(line: 152, column: 16, scope: !629)
!632 = !DILocation(line: 152, column: 7, scope: !630)
!633 = !DILocation(line: 153, column: 4, scope: !634)
!634 = distinct !DILexicalBlock(scope: !629, file: !3, line: 152, column: 26)
!635 = !DILocation(line: 153, column: 14, scope: !634)
!636 = !DILocation(line: 153, column: 23, scope: !634)
!637 = !DILocation(line: 154, column: 3, scope: !634)
!638 = !DILocation(line: 156, column: 13, scope: !630)
!639 = !DILocation(line: 156, column: 22, scope: !630)
!640 = !DILocation(line: 156, column: 11, scope: !630)
!641 = distinct !{!641, !626, !642}
!642 = !DILocation(line: 157, column: 2, scope: !599)
!643 = !DILocation(line: 160, column: 17, scope: !599)
!644 = !DILocation(line: 160, column: 28, scope: !599)
!645 = !DILocation(line: 160, column: 2, scope: !599)
!646 = !DILocation(line: 161, column: 17, scope: !599)
!647 = !DILocation(line: 161, column: 28, scope: !599)
!648 = !DILocation(line: 161, column: 2, scope: !599)
!649 = !DILocation(line: 164, column: 22, scope: !599)
!650 = !DILocation(line: 164, column: 33, scope: !599)
!651 = !DILocation(line: 164, column: 2, scope: !599)
!652 = !DILocation(line: 165, column: 22, scope: !599)
!653 = !DILocation(line: 165, column: 33, scope: !599)
!654 = !DILocation(line: 165, column: 2, scope: !599)
!655 = !DILocation(line: 166, column: 2, scope: !599)
!656 = !DILocation(line: 166, column: 13, scope: !599)
!657 = !DILocation(line: 166, column: 25, scope: !599)
!658 = !DILocation(line: 167, column: 1, scope: !599)
!659 = distinct !DISubprogram(name: "BKE_tracking_settings_init", scope: !3, file: !3, line: 190, type: !105, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!660 = !DILocalVariable(name: "tracking", arg: 1, scope: !659, file: !3, line: 190, type: !107)
!661 = !DILocation(line: 190, column: 48, scope: !659)
!662 = !DILocation(line: 192, column: 2, scope: !659)
!663 = !DILocation(line: 192, column: 12, scope: !659)
!664 = !DILocation(line: 192, column: 19, scope: !659)
!665 = !DILocation(line: 192, column: 32, scope: !659)
!666 = !DILocation(line: 193, column: 2, scope: !659)
!667 = !DILocation(line: 193, column: 12, scope: !659)
!668 = !DILocation(line: 193, column: 19, scope: !659)
!669 = !DILocation(line: 193, column: 32, scope: !659)
!670 = !DILocation(line: 194, column: 2, scope: !659)
!671 = !DILocation(line: 194, column: 12, scope: !659)
!672 = !DILocation(line: 194, column: 19, scope: !659)
!673 = !DILocation(line: 194, column: 25, scope: !659)
!674 = !DILocation(line: 196, column: 2, scope: !659)
!675 = !DILocation(line: 196, column: 12, scope: !659)
!676 = !DILocation(line: 196, column: 21, scope: !659)
!677 = !DILocation(line: 196, column: 42, scope: !659)
!678 = !DILocation(line: 197, column: 2, scope: !659)
!679 = !DILocation(line: 197, column: 12, scope: !659)
!680 = !DILocation(line: 197, column: 21, scope: !659)
!681 = !DILocation(line: 197, column: 49, scope: !659)
!682 = !DILocation(line: 198, column: 2, scope: !659)
!683 = !DILocation(line: 198, column: 12, scope: !659)
!684 = !DILocation(line: 198, column: 21, scope: !659)
!685 = !DILocation(line: 198, column: 42, scope: !659)
!686 = !DILocation(line: 199, column: 2, scope: !659)
!687 = !DILocation(line: 199, column: 12, scope: !659)
!688 = !DILocation(line: 199, column: 21, scope: !659)
!689 = !DILocation(line: 199, column: 41, scope: !659)
!690 = !DILocation(line: 200, column: 2, scope: !659)
!691 = !DILocation(line: 200, column: 12, scope: !659)
!692 = !DILocation(line: 200, column: 21, scope: !659)
!693 = !DILocation(line: 200, column: 44, scope: !659)
!694 = !DILocation(line: 201, column: 2, scope: !659)
!695 = !DILocation(line: 201, column: 12, scope: !659)
!696 = !DILocation(line: 201, column: 21, scope: !659)
!697 = !DILocation(line: 201, column: 36, scope: !659)
!698 = !DILocation(line: 202, column: 2, scope: !659)
!699 = !DILocation(line: 202, column: 12, scope: !659)
!700 = !DILocation(line: 202, column: 21, scope: !659)
!701 = !DILocation(line: 202, column: 26, scope: !659)
!702 = !DILocation(line: 203, column: 2, scope: !659)
!703 = !DILocation(line: 203, column: 12, scope: !659)
!704 = !DILocation(line: 203, column: 21, scope: !659)
!705 = !DILocation(line: 203, column: 37, scope: !659)
!706 = !DILocation(line: 205, column: 2, scope: !659)
!707 = !DILocation(line: 205, column: 12, scope: !659)
!708 = !DILocation(line: 205, column: 26, scope: !659)
!709 = !DILocation(line: 205, column: 35, scope: !659)
!710 = !DILocation(line: 206, column: 2, scope: !659)
!711 = !DILocation(line: 206, column: 12, scope: !659)
!712 = !DILocation(line: 206, column: 26, scope: !659)
!713 = !DILocation(line: 206, column: 33, scope: !659)
!714 = !DILocation(line: 207, column: 2, scope: !659)
!715 = !DILocation(line: 207, column: 12, scope: !659)
!716 = !DILocation(line: 207, column: 26, scope: !659)
!717 = !DILocation(line: 207, column: 33, scope: !659)
!718 = !DILocation(line: 208, column: 2, scope: !659)
!719 = !DILocation(line: 208, column: 12, scope: !659)
!720 = !DILocation(line: 208, column: 26, scope: !659)
!721 = !DILocation(line: 208, column: 35, scope: !659)
!722 = !DILocation(line: 209, column: 2, scope: !659)
!723 = !DILocation(line: 209, column: 12, scope: !659)
!724 = !DILocation(line: 209, column: 26, scope: !659)
!725 = !DILocation(line: 209, column: 33, scope: !659)
!726 = !DILocation(line: 211, column: 26, scope: !659)
!727 = !DILocation(line: 211, column: 2, scope: !659)
!728 = !DILocation(line: 212, column: 1, scope: !659)
!729 = distinct !DISubprogram(name: "BKE_tracking_object_add", scope: !3, file: !3, line: 1461, type: !730, scopeLine: 1462, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!730 = !DISubroutineType(types: !731)
!731 = !{!550, !107, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!734 = !DILocalVariable(name: "tracking", arg: 1, scope: !729, file: !3, line: 1461, type: !107)
!735 = !DILocation(line: 1461, column: 61, scope: !729)
!736 = !DILocalVariable(name: "name", arg: 2, scope: !729, file: !3, line: 1461, type: !732)
!737 = !DILocation(line: 1461, column: 83, scope: !729)
!738 = !DILocalVariable(name: "object", scope: !729, file: !3, line: 1463, type: !545)
!739 = !DILocation(line: 1463, column: 23, scope: !729)
!740 = !DILocation(line: 1463, column: 32, scope: !729)
!741 = !DILocation(line: 1465, column: 6, scope: !742)
!742 = distinct !DILexicalBlock(scope: !729, file: !3, line: 1465, column: 6)
!743 = !DILocation(line: 1465, column: 16, scope: !742)
!744 = !DILocation(line: 1465, column: 27, scope: !742)
!745 = !DILocation(line: 1465, column: 6, scope: !729)
!746 = !DILocation(line: 1467, column: 15, scope: !747)
!747 = distinct !DILexicalBlock(scope: !742, file: !3, line: 1465, column: 33)
!748 = !DILocation(line: 1467, column: 23, scope: !747)
!749 = !DILocation(line: 1467, column: 3, scope: !747)
!750 = !DILocation(line: 1469, column: 3, scope: !747)
!751 = !DILocation(line: 1469, column: 11, scope: !747)
!752 = !DILocation(line: 1469, column: 16, scope: !747)
!753 = !DILocation(line: 1470, column: 2, scope: !747)
!754 = !DILocation(line: 1472, column: 15, scope: !755)
!755 = distinct !DILexicalBlock(scope: !742, file: !3, line: 1471, column: 7)
!756 = !DILocation(line: 1472, column: 23, scope: !755)
!757 = !DILocation(line: 1472, column: 29, scope: !755)
!758 = !DILocation(line: 1472, column: 3, scope: !755)
!759 = !DILocation(line: 1475, column: 15, scope: !729)
!760 = !DILocation(line: 1475, column: 25, scope: !729)
!761 = !DILocation(line: 1475, column: 34, scope: !729)
!762 = !DILocation(line: 1475, column: 2, scope: !729)
!763 = !DILocation(line: 1477, column: 2, scope: !729)
!764 = !DILocation(line: 1477, column: 12, scope: !729)
!765 = !DILocation(line: 1477, column: 22, scope: !729)
!766 = !DILocation(line: 1478, column: 38, scope: !729)
!767 = !DILocation(line: 1478, column: 48, scope: !729)
!768 = !DILocation(line: 1478, column: 23, scope: !729)
!769 = !DILocation(line: 1478, column: 57, scope: !729)
!770 = !DILocation(line: 1478, column: 2, scope: !729)
!771 = !DILocation(line: 1478, column: 12, scope: !729)
!772 = !DILocation(line: 1478, column: 21, scope: !729)
!773 = !DILocation(line: 1480, column: 2, scope: !729)
!774 = !DILocation(line: 1480, column: 10, scope: !729)
!775 = !DILocation(line: 1480, column: 16, scope: !729)
!776 = !DILocation(line: 1481, column: 2, scope: !729)
!777 = !DILocation(line: 1481, column: 10, scope: !729)
!778 = !DILocation(line: 1481, column: 20, scope: !729)
!779 = !DILocation(line: 1482, column: 2, scope: !729)
!780 = !DILocation(line: 1482, column: 10, scope: !729)
!781 = !DILocation(line: 1482, column: 20, scope: !729)
!782 = !DILocation(line: 1484, column: 34, scope: !729)
!783 = !DILocation(line: 1484, column: 44, scope: !729)
!784 = !DILocation(line: 1484, column: 2, scope: !729)
!785 = !DILocation(line: 1485, column: 36, scope: !729)
!786 = !DILocation(line: 1485, column: 2, scope: !729)
!787 = !DILocation(line: 1487, column: 9, scope: !729)
!788 = !DILocation(line: 1487, column: 2, scope: !729)
!789 = distinct !DISubprogram(name: "BKE_tracking_get_active_tracks", scope: !3, file: !3, line: 215, type: !790, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !107}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!793 = !DILocalVariable(name: "tracking", arg: 1, scope: !789, file: !3, line: 215, type: !107)
!794 = !DILocation(line: 215, column: 57, scope: !789)
!795 = !DILocalVariable(name: "object", scope: !789, file: !3, line: 217, type: !545)
!796 = !DILocation(line: 217, column: 23, scope: !789)
!797 = !DILocation(line: 217, column: 63, scope: !789)
!798 = !DILocation(line: 217, column: 32, scope: !789)
!799 = !DILocation(line: 219, column: 6, scope: !800)
!800 = distinct !DILexicalBlock(scope: !789, file: !3, line: 219, column: 6)
!801 = !DILocation(line: 219, column: 13, scope: !800)
!802 = !DILocation(line: 219, column: 17, scope: !800)
!803 = !DILocation(line: 219, column: 25, scope: !800)
!804 = !DILocation(line: 219, column: 30, scope: !800)
!805 = !DILocation(line: 219, column: 56, scope: !800)
!806 = !DILocation(line: 219, column: 6, scope: !789)
!807 = !DILocation(line: 220, column: 11, scope: !808)
!808 = distinct !DILexicalBlock(scope: !800, file: !3, line: 219, column: 62)
!809 = !DILocation(line: 220, column: 19, scope: !808)
!810 = !DILocation(line: 220, column: 3, scope: !808)
!811 = !DILocation(line: 223, column: 10, scope: !789)
!812 = !DILocation(line: 223, column: 20, scope: !789)
!813 = !DILocation(line: 223, column: 2, scope: !789)
!814 = !DILocation(line: 224, column: 1, scope: !789)
!815 = distinct !DISubprogram(name: "BKE_tracking_object_get_active", scope: !3, file: !3, line: 1546, type: !816, scopeLine: 1547, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!816 = !DISubroutineType(types: !817)
!817 = !{!550, !107}
!818 = !DILocalVariable(name: "tracking", arg: 1, scope: !815, file: !3, line: 1546, type: !107)
!819 = !DILocation(line: 1546, column: 68, scope: !815)
!820 = !DILocation(line: 1548, column: 23, scope: !815)
!821 = !DILocation(line: 1548, column: 33, scope: !815)
!822 = !DILocation(line: 1548, column: 42, scope: !815)
!823 = !DILocation(line: 1548, column: 52, scope: !815)
!824 = !DILocation(line: 1548, column: 9, scope: !815)
!825 = !DILocation(line: 1548, column: 2, scope: !815)
!826 = distinct !DISubprogram(name: "BKE_tracking_get_active_plane_tracks", scope: !3, file: !3, line: 227, type: !790, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!827 = !DILocalVariable(name: "tracking", arg: 1, scope: !826, file: !3, line: 227, type: !107)
!828 = !DILocation(line: 227, column: 63, scope: !826)
!829 = !DILocalVariable(name: "object", scope: !826, file: !3, line: 229, type: !545)
!830 = !DILocation(line: 229, column: 23, scope: !826)
!831 = !DILocation(line: 229, column: 63, scope: !826)
!832 = !DILocation(line: 229, column: 32, scope: !826)
!833 = !DILocation(line: 231, column: 6, scope: !834)
!834 = distinct !DILexicalBlock(scope: !826, file: !3, line: 231, column: 6)
!835 = !DILocation(line: 231, column: 13, scope: !834)
!836 = !DILocation(line: 231, column: 17, scope: !834)
!837 = !DILocation(line: 231, column: 25, scope: !834)
!838 = !DILocation(line: 231, column: 30, scope: !834)
!839 = !DILocation(line: 231, column: 56, scope: !834)
!840 = !DILocation(line: 231, column: 6, scope: !826)
!841 = !DILocation(line: 232, column: 11, scope: !842)
!842 = distinct !DILexicalBlock(scope: !834, file: !3, line: 231, column: 62)
!843 = !DILocation(line: 232, column: 19, scope: !842)
!844 = !DILocation(line: 232, column: 3, scope: !842)
!845 = !DILocation(line: 235, column: 10, scope: !826)
!846 = !DILocation(line: 235, column: 20, scope: !826)
!847 = !DILocation(line: 235, column: 2, scope: !826)
!848 = !DILocation(line: 236, column: 1, scope: !826)
!849 = distinct !DISubprogram(name: "BKE_tracking_get_active_reconstruction", scope: !3, file: !3, line: 239, type: !850, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !107}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!853 = !DILocalVariable(name: "tracking", arg: 1, scope: !849, file: !3, line: 239, type: !107)
!854 = !DILocation(line: 239, column: 84, scope: !849)
!855 = !DILocalVariable(name: "object", scope: !849, file: !3, line: 241, type: !545)
!856 = !DILocation(line: 241, column: 23, scope: !849)
!857 = !DILocation(line: 241, column: 63, scope: !849)
!858 = !DILocation(line: 241, column: 32, scope: !849)
!859 = !DILocation(line: 243, column: 48, scope: !849)
!860 = !DILocation(line: 243, column: 58, scope: !849)
!861 = !DILocation(line: 243, column: 9, scope: !849)
!862 = !DILocation(line: 243, column: 2, scope: !849)
!863 = distinct !DISubprogram(name: "BKE_tracking_object_get_reconstruction", scope: !3, file: !3, line: 1583, type: !864, scopeLine: 1585, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!864 = !DISubroutineType(types: !865)
!865 = !{!852, !107, !545}
!866 = !DILocalVariable(name: "tracking", arg: 1, scope: !863, file: !3, line: 1583, type: !107)
!867 = !DILocation(line: 1583, column: 84, scope: !863)
!868 = !DILocalVariable(name: "object", arg: 2, scope: !863, file: !3, line: 1584, type: !545)
!869 = !DILocation(line: 1584, column: 90, scope: !863)
!870 = !DILocation(line: 1586, column: 6, scope: !871)
!871 = distinct !DILexicalBlock(scope: !863, file: !3, line: 1586, column: 6)
!872 = !DILocation(line: 1586, column: 14, scope: !871)
!873 = !DILocation(line: 1586, column: 19, scope: !871)
!874 = !DILocation(line: 1586, column: 6, scope: !863)
!875 = !DILocation(line: 1587, column: 11, scope: !876)
!876 = distinct !DILexicalBlock(scope: !871, file: !3, line: 1586, column: 45)
!877 = !DILocation(line: 1587, column: 21, scope: !876)
!878 = !DILocation(line: 1587, column: 3, scope: !876)
!879 = !DILocation(line: 1590, column: 10, scope: !863)
!880 = !DILocation(line: 1590, column: 18, scope: !863)
!881 = !DILocation(line: 1590, column: 2, scope: !863)
!882 = !DILocation(line: 1591, column: 1, scope: !863)
!883 = distinct !DISubprogram(name: "BKE_tracking_get_camera_object_matrix", scope: !3, file: !3, line: 249, type: !884, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !444)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !886, !1939, !1941}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !888, line: 1299, baseType: !889)
!888 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !888, line: 1216, size: 39680, elements: !890)
!890 = !{!891, !892, !962, !1227, !1230, !1231, !1232, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1258, !1261, !1264, !1479, !1482, !1781, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1803, !1804, !1805, !1806, !1807, !1815, !1882, !1889, !1890, !1897, !1931, !1932, !1933, !1934, !1935, !1936}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !889, file: !888, line: 1217, baseType: !239, size: 960)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !889, file: !888, line: 1218, baseType: !893, size: 64, offset: 960)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !895, line: 838, size: 768, elements: !896)
!895 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!896 = !{!897, !912, !913, !923, !924, !955, !956, !957, !958, !959, !960, !961}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !894, file: !895, line: 840, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !900, line: 499, baseType: !901)
!900 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !900, line: 486, size: 1600, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !901, file: !900, line: 487, baseType: !239, size: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !901, file: !900, line: 489, baseType: !94, size: 128, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !901, file: !900, line: 490, baseType: !94, size: 128, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !901, file: !900, line: 491, baseType: !94, size: 128, offset: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !901, file: !900, line: 492, baseType: !94, size: 128, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !901, file: !900, line: 494, baseType: !80, size: 32, offset: 1472)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !901, file: !900, line: 495, baseType: !80, size: 32, offset: 1504)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !901, file: !900, line: 497, baseType: !80, size: 32, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !901, file: !900, line: 498, baseType: !80, size: 32, offset: 1568)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !894, file: !895, line: 844, baseType: !898, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !894, file: !895, line: 848, baseType: !914, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !895, line: 549, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !895, line: 544, size: 320, elements: !917)
!917 = !{!918, !920, !921, !922}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !916, file: !895, line: 545, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !916, file: !895, line: 545, baseType: !919, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !916, file: !895, line: 547, baseType: !898, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !916, file: !895, line: 548, baseType: !94, size: 128, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !894, file: !895, line: 851, baseType: !94, size: 128, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !894, file: !895, line: 853, baseType: !925, size: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !895, line: 594, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !895, line: 561, size: 1664, elements: !928)
!928 = !{!929, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !895, line: 562, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !927, file: !895, line: 562, baseType: !930, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !927, file: !895, line: 564, baseType: !94, size: 128, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !927, file: !895, line: 565, baseType: !898, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !927, file: !895, line: 566, baseType: !914, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !927, file: !895, line: 568, baseType: !94, size: 128, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !927, file: !895, line: 569, baseType: !94, size: 128, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !927, file: !895, line: 571, baseType: !195, size: 512, offset: 640)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !927, file: !895, line: 573, baseType: !78, size: 32, offset: 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !927, file: !895, line: 574, baseType: !78, size: 32, offset: 1184)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !927, file: !895, line: 576, baseType: !78, size: 32, offset: 1216)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !927, file: !895, line: 576, baseType: !78, size: 32, offset: 1248)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !927, file: !895, line: 577, baseType: !78, size: 32, offset: 1280)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !927, file: !895, line: 577, baseType: !78, size: 32, offset: 1312)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !927, file: !895, line: 579, baseType: !78, size: 32, offset: 1344)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !927, file: !895, line: 580, baseType: !78, size: 32, offset: 1376)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !927, file: !895, line: 582, baseType: !78, size: 32, offset: 1408)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !927, file: !895, line: 582, baseType: !78, size: 32, offset: 1440)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !927, file: !895, line: 583, baseType: !117, size: 16, offset: 1472)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !927, file: !895, line: 585, baseType: !117, size: 16, offset: 1488)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !927, file: !895, line: 586, baseType: !117, size: 16, offset: 1504)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !927, file: !895, line: 588, baseType: !117, size: 16, offset: 1520)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !927, file: !895, line: 590, baseType: !79, size: 64, offset: 1536)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !927, file: !895, line: 592, baseType: !80, size: 32, offset: 1600)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !927, file: !895, line: 593, baseType: !80, size: 32, offset: 1632)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !894, file: !895, line: 858, baseType: !94, size: 128, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !894, file: !895, line: 859, baseType: !94, size: 128, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !894, file: !895, line: 862, baseType: !80, size: 32, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !894, file: !895, line: 863, baseType: !80, size: 32, offset: 672)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !894, file: !895, line: 866, baseType: !117, size: 16, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !894, file: !895, line: 867, baseType: !117, size: 16, offset: 720)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !894, file: !895, line: 868, baseType: !78, size: 32, offset: 736)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !889, file: !888, line: 1220, baseType: !963, size: 64, offset: 1024)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !965, line: 115, size: 11392, elements: !966)
!965 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!966 = !{!967, !968, !969, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !987, !996, !998, !999, !1040, !1041, !1042, !1043, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1156, !1159, !1162, !1163, !1164, !1165, !1166, !1169, !1172, !1175, !1176, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1191, !1194, !1195, !1215, !1216}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !964, file: !965, line: 116, baseType: !239, size: 960)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !964, file: !965, line: 117, baseType: !893, size: 64, offset: 960)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !964, file: !965, line: 119, baseType: !970, size: 64, offset: 1024)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !965, line: 57, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !964, file: !965, line: 121, baseType: !117, size: 16, offset: 1088)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !964, file: !965, line: 121, baseType: !117, size: 16, offset: 1104)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !964, file: !965, line: 122, baseType: !80, size: 32, offset: 1120)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !964, file: !965, line: 122, baseType: !80, size: 32, offset: 1152)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !964, file: !965, line: 122, baseType: !80, size: 32, offset: 1184)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !964, file: !965, line: 123, baseType: !195, size: 512, offset: 1216)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !964, file: !965, line: 124, baseType: !963, size: 64, offset: 1728)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !964, file: !965, line: 124, baseType: !963, size: 64, offset: 1792)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !964, file: !965, line: 127, baseType: !963, size: 64, offset: 1856)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !964, file: !965, line: 127, baseType: !963, size: 64, offset: 1920)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !964, file: !965, line: 127, baseType: !963, size: 64, offset: 1984)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !964, file: !965, line: 128, baseType: !984, size: 64, offset: 2048)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !986, line: 46, flags: DIFlagFwdDecl)
!986 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !964, file: !965, line: 130, baseType: !988, size: 64, offset: 2112)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !965, line: 97, size: 832, elements: !990)
!990 = !{!991, !994, !995}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !989, file: !965, line: 98, baseType: !992, size: 768)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 768, elements: !993)
!993 = !{!356, !221}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !989, file: !965, line: 99, baseType: !80, size: 32, offset: 768)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !989, file: !965, line: 99, baseType: !80, size: 32, offset: 800)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !964, file: !965, line: 131, baseType: !997, size: 64, offset: 2176)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !964, file: !965, line: 132, baseType: !997, size: 64, offset: 2240)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !964, file: !965, line: 133, baseType: !1000, size: 64, offset: 2304)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !900, line: 334, size: 1728, elements: !1002)
!1002 = !{!1003, !1004, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1039}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1001, file: !900, line: 335, baseType: !94, size: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1001, file: !900, line: 336, baseType: !1005, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !900, line: 47, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1001, file: !900, line: 338, baseType: !117, size: 16, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1001, file: !900, line: 338, baseType: !117, size: 16, offset: 208)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1001, file: !900, line: 339, baseType: !7, size: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1001, file: !900, line: 340, baseType: !80, size: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1001, file: !900, line: 342, baseType: !78, size: 32, offset: 288)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1001, file: !900, line: 343, baseType: !219, size: 96, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1001, file: !900, line: 344, baseType: !219, size: 96, offset: 416)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1001, file: !900, line: 347, baseType: !94, size: 128, offset: 512)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1001, file: !900, line: 349, baseType: !80, size: 32, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1001, file: !900, line: 350, baseType: !80, size: 32, offset: 672)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1001, file: !900, line: 351, baseType: !79, size: 64, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1001, file: !900, line: 352, baseType: !79, size: 64, offset: 768)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1001, file: !900, line: 354, baseType: !1020, size: 384, offset: 832)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !900, line: 116, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !900, line: 94, size: 384, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1021, file: !900, line: 96, baseType: !80, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1021, file: !900, line: 96, baseType: !80, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1021, file: !900, line: 97, baseType: !80, size: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1021, file: !900, line: 97, baseType: !80, size: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1021, file: !900, line: 99, baseType: !117, size: 16, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1021, file: !900, line: 100, baseType: !117, size: 16, offset: 144)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1021, file: !900, line: 102, baseType: !117, size: 16, offset: 160)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1021, file: !900, line: 105, baseType: !117, size: 16, offset: 176)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1021, file: !900, line: 108, baseType: !117, size: 16, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1021, file: !900, line: 109, baseType: !117, size: 16, offset: 208)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1021, file: !900, line: 111, baseType: !117, size: 16, offset: 224)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1021, file: !900, line: 112, baseType: !117, size: 16, offset: 240)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1021, file: !900, line: 114, baseType: !80, size: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1021, file: !900, line: 114, baseType: !80, size: 32, offset: 288)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1021, file: !900, line: 115, baseType: !80, size: 32, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1021, file: !900, line: 115, baseType: !80, size: 32, offset: 352)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1001, file: !900, line: 355, baseType: !195, size: 512, offset: 1216)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !964, file: !965, line: 134, baseType: !79, size: 64, offset: 2368)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !964, file: !965, line: 136, baseType: !234, size: 64, offset: 2432)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !964, file: !965, line: 138, baseType: !1020, size: 384, offset: 2496)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !964, file: !965, line: 139, baseType: !1044, size: 64, offset: 2880)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !900, line: 80, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !900, line: 72, size: 192, elements: !1047)
!1047 = !{!1048, !1055, !1056, !1057, !1058}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1046, file: !900, line: 73, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !900, line: 59, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !900, line: 56, size: 128, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1051, file: !900, line: 57, baseType: !219, size: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1051, file: !900, line: 58, baseType: !80, size: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1046, file: !900, line: 74, baseType: !80, size: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1046, file: !900, line: 76, baseType: !80, size: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1046, file: !900, line: 77, baseType: !80, size: 32, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1046, file: !900, line: 79, baseType: !80, size: 32, offset: 160)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !964, file: !965, line: 141, baseType: !94, size: 128, offset: 2944)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !964, file: !965, line: 142, baseType: !94, size: 128, offset: 3072)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !964, file: !965, line: 143, baseType: !94, size: 128, offset: 3200)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !964, file: !965, line: 144, baseType: !94, size: 128, offset: 3328)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !964, file: !965, line: 146, baseType: !80, size: 32, offset: 3456)
