; ModuleID = 'libpng/pngset.c'
source_filename = "libpng/pngset.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "libpng/pngset.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !10, !12, !14, !18, !21, !23, !8, !32, !34, !40, !47, !55, !67, !79}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !6, line: 532, baseType: !7)
!6 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !6, line: 447, baseType: !9)
!9 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !6, line: 449, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !6, line: 441, baseType: !13)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !6, line: 454, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 46, baseType: !17)
!16 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !6, line: 536, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !6, line: 559, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !24, line: 559, baseType: !25)
!24 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !24, line: 558, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !24, line: 553, size: 24, elements: !28)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !27, file: !24, line: 555, baseType: !10, size: 8)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !27, file: !24, line: 556, baseType: !10, size: 8, offset: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !27, file: !24, line: 557, baseType: !10, size: 8, offset: 16)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !6, line: 526, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !24, line: 654, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !24, line: 653, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !24, line: 637, size: 448, elements: !38)
!38 = !{!39, !41, !42, !43, !44, !45, !46}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !37, file: !24, line: 639, baseType: !40, size: 32)
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !37, file: !24, line: 644, baseType: !18, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !37, file: !24, line: 645, baseType: !18, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !37, file: !24, line: 647, baseType: !14, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !37, file: !24, line: 648, baseType: !14, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !37, file: !24, line: 649, baseType: !18, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !37, file: !24, line: 651, baseType: !18, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !24, line: 615, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !24, line: 614, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !24, line: 608, size: 256, elements: !51)
!51 = !{!52, !53, !54, !65}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !24, line: 610, baseType: !18, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !50, file: !24, line: 611, baseType: !10, size: 8, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !50, file: !24, line: 612, baseType: !55, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !24, line: 599, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !24, line: 598, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !24, line: 591, size: 80, elements: !59)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !58, file: !24, line: 593, baseType: !8, size: 16)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !58, file: !24, line: 594, baseType: !8, size: 16, offset: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !58, file: !24, line: 595, baseType: !8, size: 16, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !58, file: !24, line: 596, baseType: !8, size: 16, offset: 48)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !58, file: !24, line: 597, baseType: !8, size: 16, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !50, file: !24, line: 613, baseType: !66, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !6, line: 442, baseType: !40)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !24, line: 707, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !24, line: 706, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !24, line: 695, size: 256, elements: !71)
!71 = !{!72, !76, !77, !78}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !24, line: 697, baseType: !73, size: 40)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 40, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 5)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !24, line: 698, baseType: !33, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !24, line: 699, baseType: !14, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !70, file: !24, line: 702, baseType: !10, size: 8, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !80, line: 367, baseType: !13)
!80 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{i32 7, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{i32 1, !"wchar_size", i32 4}
!84 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!85 = distinct !DISubprogram(name: "png_set_bKGD", scope: !1, file: !1, line: 25, type: !86, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !88, !307, !471}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !24, line: 851, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !24, line: 849, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !92, line: 29, size: 9728, elements: !93)
!92 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !{!94, !119, !125, !133, !134, !136, !141, !142, !143, !159, !160, !161, !162, !163, !164, !165, !166, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !255, !264, !265, !270, !271, !272, !273, !274, !275, !276, !279, !280, !281, !282, !283, !292, !293, !294, !295, !300, !302, !386, !391, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !419, !420, !421, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !442, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !91, file: !92, line: 32, baseType: !95, size: 1600)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !96, line: 45, baseType: !97)
!96 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 1600, elements: !117)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !96, line: 33, size: 1600, elements: !99)
!99 = !{!100, !107, !108}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !98, file: !96, line: 39, baseType: !101, size: 512)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !102, line: 31, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 512, elements: !105)
!104 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!105 = !{!106}
!106 = !DISubrange(count: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !98, file: !96, line: 40, baseType: !40, size: 32, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !98, file: !96, line: 41, baseType: !109, size: 1024, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !110, line: 8, baseType: !111)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 5, size: 1024, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !111, file: !110, line: 7, baseType: !114, size: 1024)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1024, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 16)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !91, file: !92, line: 33, baseType: !120, size: 64, offset: 1600)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !24, line: 913, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !124, !40}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !91, file: !92, line: 35, baseType: !126, size: 64, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !24, line: 861, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !88, !130}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !6, line: 537, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !91, file: !92, line: 37, baseType: !126, size: 64, offset: 1728)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !91, file: !92, line: 39, baseType: !135, size: 64, offset: 1792)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !6, line: 524, baseType: !4)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !91, file: !92, line: 40, baseType: !137, size: 64, offset: 1856)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !24, line: 862, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !88, !32, !14}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !91, file: !92, line: 41, baseType: !137, size: 64, offset: 1920)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !91, file: !92, line: 42, baseType: !135, size: 64, offset: 1984)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !91, file: !92, line: 45, baseType: !144, size: 64, offset: 2048)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !24, line: 889, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !88, !148, !32}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !24, line: 842, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !24, line: 840, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !24, line: 832, size: 192, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !151, file: !24, line: 834, baseType: !12, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !151, file: !24, line: 835, baseType: !14, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !151, file: !24, line: 836, baseType: !10, size: 8, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !151, file: !24, line: 837, baseType: !10, size: 8, offset: 136)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !151, file: !24, line: 838, baseType: !10, size: 8, offset: 144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !151, file: !24, line: 839, baseType: !10, size: 8, offset: 152)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !91, file: !92, line: 49, baseType: !144, size: 64, offset: 2112)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !91, file: !92, line: 56, baseType: !135, size: 64, offset: 2176)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !91, file: !92, line: 57, baseType: !10, size: 8, offset: 2240)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !91, file: !92, line: 58, baseType: !10, size: 8, offset: 2248)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !91, file: !92, line: 62, baseType: !12, size: 32, offset: 2272)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !92, line: 63, baseType: !12, size: 32, offset: 2304)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !91, file: !92, line: 64, baseType: !12, size: 32, offset: 2336)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !91, file: !92, line: 66, baseType: !167, size: 896, offset: 2368)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !168, line: 104, baseType: !169)
!168 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !168, line: 85, size: 896, elements: !170)
!170 = !{!171, !175, !176, !178, !179, !180, !181, !182, !187, !193, !198, !199, !200, !201}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !169, file: !168, line: 86, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !80, line: 374, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !80, line: 365, baseType: !11)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !169, file: !168, line: 87, baseType: !79, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !169, file: !168, line: 88, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !80, line: 368, baseType: !17)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !169, file: !168, line: 90, baseType: !172, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !169, file: !168, line: 91, baseType: !79, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !169, file: !168, line: 92, baseType: !177, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !169, file: !168, line: 94, baseType: !19, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !168, line: 95, baseType: !183, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !168, line: 1714, size: 32, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !184, file: !168, line: 1714, baseType: !40, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !169, file: !168, line: 97, baseType: !188, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !168, line: 80, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !192, !79, !79}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !80, line: 383, baseType: !4)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !169, file: !168, line: 98, baseType: !194, size: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !168, line: 81, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !192, !192}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !169, file: !168, line: 99, baseType: !192, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !169, file: !168, line: 101, baseType: !40, size: 32, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !169, file: !168, line: 102, baseType: !177, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !169, file: !168, line: 103, baseType: !177, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !91, file: !92, line: 67, baseType: !32, size: 64, offset: 3264)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !91, file: !92, line: 68, baseType: !79, size: 32, offset: 3328)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !91, file: !92, line: 80, baseType: !12, size: 32, offset: 3360)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !91, file: !92, line: 83, baseType: !40, size: 32, offset: 3392)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !91, file: !92, line: 84, baseType: !40, size: 32, offset: 3424)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !91, file: !92, line: 85, baseType: !40, size: 32, offset: 3456)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !91, file: !92, line: 86, baseType: !40, size: 32, offset: 3488)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !91, file: !92, line: 87, baseType: !40, size: 32, offset: 3520)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !91, file: !92, line: 92, baseType: !40, size: 32, offset: 3552)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !91, file: !92, line: 93, baseType: !40, size: 32, offset: 3584)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !91, file: !92, line: 94, baseType: !40, size: 32, offset: 3616)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !91, file: !92, line: 95, baseType: !40, size: 32, offset: 3648)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !91, file: !92, line: 96, baseType: !40, size: 32, offset: 3680)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !91, file: !92, line: 100, baseType: !12, size: 32, offset: 3712)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !91, file: !92, line: 101, baseType: !12, size: 32, offset: 3744)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !91, file: !92, line: 102, baseType: !12, size: 32, offset: 3776)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !91, file: !92, line: 103, baseType: !12, size: 32, offset: 3808)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !91, file: !92, line: 104, baseType: !14, size: 64, offset: 3840)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !91, file: !92, line: 105, baseType: !12, size: 32, offset: 3904)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !91, file: !92, line: 106, baseType: !12, size: 32, offset: 3936)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !91, file: !92, line: 107, baseType: !12, size: 32, offset: 3968)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !91, file: !92, line: 108, baseType: !32, size: 64, offset: 4032)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !91, file: !92, line: 111, baseType: !32, size: 64, offset: 4096)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !91, file: !92, line: 114, baseType: !32, size: 64, offset: 4160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !91, file: !92, line: 115, baseType: !32, size: 64, offset: 4224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !91, file: !92, line: 116, baseType: !32, size: 64, offset: 4288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !91, file: !92, line: 117, baseType: !32, size: 64, offset: 4352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !91, file: !92, line: 118, baseType: !14, size: 64, offset: 4416)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !91, file: !92, line: 120, baseType: !12, size: 32, offset: 4480)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !91, file: !92, line: 121, baseType: !12, size: 32, offset: 4512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !91, file: !92, line: 122, baseType: !23, size: 64, offset: 4544)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !91, file: !92, line: 123, baseType: !8, size: 16, offset: 4608)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !91, file: !92, line: 127, baseType: !40, size: 32, offset: 4640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !91, file: !92, line: 130, baseType: !8, size: 16, offset: 4672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !91, file: !92, line: 131, baseType: !10, size: 8, offset: 4688)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !91, file: !92, line: 132, baseType: !10, size: 8, offset: 4696)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !91, file: !92, line: 133, baseType: !10, size: 8, offset: 4704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !91, file: !92, line: 134, baseType: !10, size: 8, offset: 4712)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !91, file: !92, line: 135, baseType: !10, size: 8, offset: 4720)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !91, file: !92, line: 136, baseType: !10, size: 8, offset: 4728)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !91, file: !92, line: 137, baseType: !10, size: 8, offset: 4736)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !91, file: !92, line: 138, baseType: !10, size: 8, offset: 4744)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !91, file: !92, line: 139, baseType: !10, size: 8, offset: 4752)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !91, file: !92, line: 140, baseType: !10, size: 8, offset: 4760)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !91, file: !92, line: 141, baseType: !10, size: 8, offset: 4768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !91, file: !92, line: 142, baseType: !10, size: 8, offset: 4776)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !91, file: !92, line: 143, baseType: !10, size: 8, offset: 4784)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !91, file: !92, line: 145, baseType: !10, size: 8, offset: 4792)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !91, file: !92, line: 147, baseType: !73, size: 40, offset: 4800)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !91, file: !92, line: 151, baseType: !8, size: 16, offset: 4848)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !91, file: !92, line: 156, baseType: !10, size: 8, offset: 4864)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !91, file: !92, line: 157, baseType: !254, size: 32, offset: 4896)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !6, line: 521, baseType: !66)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !91, file: !92, line: 158, baseType: !256, size: 80, offset: 4928)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !24, line: 570, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !24, line: 563, size: 80, elements: !258)
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !257, file: !24, line: 565, baseType: !10, size: 8)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !257, file: !24, line: 566, baseType: !8, size: 16, offset: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !257, file: !24, line: 567, baseType: !8, size: 16, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !257, file: !24, line: 568, baseType: !8, size: 16, offset: 48)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !257, file: !24, line: 569, baseType: !8, size: 16, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !91, file: !92, line: 160, baseType: !256, size: 80, offset: 5008)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !91, file: !92, line: 165, baseType: !266, size: 64, offset: 5120)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !24, line: 863, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !88}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !91, file: !92, line: 166, baseType: !12, size: 32, offset: 5184)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !91, file: !92, line: 167, baseType: !12, size: 32, offset: 5216)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !91, file: !92, line: 171, baseType: !40, size: 32, offset: 5248)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !91, file: !92, line: 172, baseType: !254, size: 32, offset: 5280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !91, file: !92, line: 173, baseType: !254, size: 32, offset: 5312)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !91, file: !92, line: 175, baseType: !32, size: 64, offset: 5376)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !91, file: !92, line: 176, baseType: !277, size: 64, offset: 5440)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !6, line: 556, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !91, file: !92, line: 180, baseType: !32, size: 64, offset: 5504)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !91, file: !92, line: 181, baseType: !32, size: 64, offset: 5568)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !91, file: !92, line: 182, baseType: !277, size: 64, offset: 5632)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !91, file: !92, line: 183, baseType: !277, size: 64, offset: 5696)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !91, file: !92, line: 188, baseType: !284, size: 40, offset: 5760)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !24, line: 582, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !24, line: 575, size: 40, elements: !286)
!286 = !{!287, !288, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !285, file: !24, line: 577, baseType: !10, size: 8)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !285, file: !24, line: 578, baseType: !10, size: 8, offset: 8)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !285, file: !24, line: 579, baseType: !10, size: 8, offset: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !285, file: !24, line: 580, baseType: !10, size: 8, offset: 24)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !285, file: !24, line: 581, baseType: !10, size: 8, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !91, file: !92, line: 192, baseType: !284, size: 40, offset: 5800)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !91, file: !92, line: 197, baseType: !32, size: 64, offset: 5888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !91, file: !92, line: 198, baseType: !256, size: 80, offset: 5952)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !91, file: !92, line: 201, baseType: !296, size: 64, offset: 6080)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !24, line: 864, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !88, !12, !40}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !91, file: !92, line: 202, baseType: !301, size: 64, offset: 6144)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !24, line: 866, baseType: !297)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !91, file: !92, line: 204, baseType: !303, size: 64, offset: 6208)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !24, line: 870, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !88, !307}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !24, line: 723, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !24, line: 722, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !311, line: 56, size: 2496, elements: !312)
!311 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !330, !331, !332, !333, !334, !335, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !310, file: !311, line: 59, baseType: !12, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !310, file: !311, line: 60, baseType: !12, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !310, file: !311, line: 61, baseType: !12, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !310, file: !311, line: 62, baseType: !14, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !310, file: !311, line: 63, baseType: !23, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !310, file: !311, line: 64, baseType: !8, size: 16, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !310, file: !311, line: 65, baseType: !8, size: 16, offset: 272)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !310, file: !311, line: 66, baseType: !10, size: 8, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !310, file: !311, line: 67, baseType: !10, size: 8, offset: 296)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !310, file: !311, line: 69, baseType: !10, size: 8, offset: 304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !310, file: !311, line: 70, baseType: !10, size: 8, offset: 312)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !310, file: !311, line: 71, baseType: !10, size: 8, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !310, file: !311, line: 74, baseType: !10, size: 8, offset: 328)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !310, file: !311, line: 75, baseType: !10, size: 8, offset: 336)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !310, file: !311, line: 76, baseType: !10, size: 8, offset: 344)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !310, file: !311, line: 77, baseType: !329, size: 64, offset: 352)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !105)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !310, file: !311, line: 90, baseType: !254, size: 32, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !310, file: !311, line: 96, baseType: !10, size: 8, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !310, file: !311, line: 108, baseType: !40, size: 32, offset: 480)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !310, file: !311, line: 109, baseType: !40, size: 32, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !310, file: !311, line: 110, baseType: !34, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !310, file: !311, line: 117, baseType: !336, size: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !24, line: 683, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !24, line: 675, size: 64, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !337, file: !24, line: 677, baseType: !8, size: 16)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !337, file: !24, line: 678, baseType: !10, size: 8, offset: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !337, file: !24, line: 679, baseType: !10, size: 8, offset: 24)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !337, file: !24, line: 680, baseType: !10, size: 8, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !337, file: !24, line: 681, baseType: !10, size: 8, offset: 40)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !337, file: !24, line: 682, baseType: !10, size: 8, offset: 48)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !310, file: !311, line: 127, baseType: !284, size: 40, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !310, file: !311, line: 141, baseType: !32, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !310, file: !311, line: 142, baseType: !256, size: 80, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !310, file: !311, line: 152, baseType: !256, size: 80, offset: 912)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !310, file: !311, line: 161, baseType: !66, size: 32, offset: 992)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !310, file: !311, line: 162, baseType: !66, size: 32, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !310, file: !311, line: 163, baseType: !10, size: 8, offset: 1056)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !310, file: !311, line: 171, baseType: !12, size: 32, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !310, file: !311, line: 172, baseType: !12, size: 32, offset: 1120)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !310, file: !311, line: 173, baseType: !10, size: 8, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !310, file: !311, line: 183, baseType: !5, size: 64, offset: 1216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !310, file: !311, line: 193, baseType: !254, size: 32, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !310, file: !311, line: 194, baseType: !254, size: 32, offset: 1312)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !310, file: !311, line: 195, baseType: !254, size: 32, offset: 1344)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !310, file: !311, line: 196, baseType: !254, size: 32, offset: 1376)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !310, file: !311, line: 197, baseType: !254, size: 32, offset: 1408)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !310, file: !311, line: 198, baseType: !254, size: 32, offset: 1440)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !310, file: !311, line: 199, baseType: !254, size: 32, offset: 1472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !310, file: !311, line: 200, baseType: !254, size: 32, offset: 1504)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !310, file: !311, line: 215, baseType: !18, size: 64, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !310, file: !311, line: 216, baseType: !66, size: 32, offset: 1600)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !310, file: !311, line: 217, baseType: !66, size: 32, offset: 1632)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !310, file: !311, line: 218, baseType: !18, size: 64, offset: 1664)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !310, file: !311, line: 219, baseType: !21, size: 64, offset: 1728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !310, file: !311, line: 220, baseType: !10, size: 8, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !310, file: !311, line: 221, baseType: !10, size: 8, offset: 1800)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !310, file: !311, line: 225, baseType: !12, size: 32, offset: 1824)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !310, file: !311, line: 230, baseType: !67, size: 64, offset: 1856)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !310, file: !311, line: 231, baseType: !40, size: 32, offset: 1920)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !310, file: !311, line: 236, baseType: !18, size: 64, offset: 1984)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !310, file: !311, line: 237, baseType: !32, size: 64, offset: 2048)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !310, file: !311, line: 238, baseType: !12, size: 32, offset: 2112)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !310, file: !311, line: 239, baseType: !10, size: 8, offset: 2144)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !310, file: !311, line: 244, baseType: !47, size: 64, offset: 2176)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !310, file: !311, line: 245, baseType: !12, size: 32, offset: 2240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !310, file: !311, line: 256, baseType: !10, size: 8, offset: 2272)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !310, file: !311, line: 257, baseType: !18, size: 64, offset: 2304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !310, file: !311, line: 258, baseType: !18, size: 64, offset: 2368)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !310, file: !311, line: 265, baseType: !384, size: 64, offset: 2432)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !6, line: 553, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !91, file: !92, line: 205, baseType: !387, size: 64, offset: 6272)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !24, line: 883, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !88, !32, !12, !40}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !91, file: !92, line: 206, baseType: !392, size: 64, offset: 6336)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !24, line: 871, baseType: !304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !91, file: !92, line: 207, baseType: !32, size: 64, offset: 6400)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !91, file: !92, line: 208, baseType: !32, size: 64, offset: 6464)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !91, file: !92, line: 209, baseType: !32, size: 64, offset: 6528)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !91, file: !92, line: 210, baseType: !32, size: 64, offset: 6592)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !91, file: !92, line: 211, baseType: !12, size: 32, offset: 6656)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !91, file: !92, line: 212, baseType: !12, size: 32, offset: 6688)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !91, file: !92, line: 213, baseType: !14, size: 64, offset: 6720)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !91, file: !92, line: 214, baseType: !14, size: 64, offset: 6784)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !91, file: !92, line: 215, baseType: !14, size: 64, offset: 6848)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !91, file: !92, line: 216, baseType: !14, size: 64, offset: 6912)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !91, file: !92, line: 217, baseType: !40, size: 32, offset: 6976)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !91, file: !92, line: 218, baseType: !40, size: 32, offset: 7008)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !91, file: !92, line: 232, baseType: !32, size: 64, offset: 7040)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !91, file: !92, line: 233, baseType: !32, size: 64, offset: 7104)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !91, file: !92, line: 237, baseType: !5, size: 64, offset: 7168)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !91, file: !92, line: 241, baseType: !10, size: 8, offset: 7232)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !91, file: !92, line: 242, baseType: !10, size: 8, offset: 7240)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !91, file: !92, line: 243, baseType: !32, size: 64, offset: 7296)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !91, file: !92, line: 244, baseType: !5, size: 64, offset: 7360)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !91, file: !92, line: 245, baseType: !5, size: 64, offset: 7424)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !91, file: !92, line: 246, baseType: !5, size: 64, offset: 7488)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !91, file: !92, line: 247, baseType: !5, size: 64, offset: 7552)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !91, file: !92, line: 251, baseType: !416, size: 232, offset: 7616)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 232, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 29)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !91, file: !92, line: 256, baseType: !12, size: 32, offset: 7872)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !91, file: !92, line: 259, baseType: !135, size: 64, offset: 7936)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !91, file: !92, line: 260, baseType: !422, size: 64, offset: 8000)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !24, line: 894, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!40, !88, !67}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !91, file: !92, line: 264, baseType: !40, size: 32, offset: 8064)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !91, file: !92, line: 265, baseType: !32, size: 64, offset: 8128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !91, file: !92, line: 270, baseType: !10, size: 8, offset: 8192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !91, file: !92, line: 275, baseType: !10, size: 8, offset: 8200)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !91, file: !92, line: 277, baseType: !10, size: 8, offset: 8208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !91, file: !92, line: 279, baseType: !8, size: 16, offset: 8224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !91, file: !92, line: 280, baseType: !8, size: 16, offset: 8240)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !91, file: !92, line: 287, baseType: !12, size: 32, offset: 8256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !91, file: !92, line: 292, baseType: !10, size: 8, offset: 8288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !91, file: !92, line: 299, baseType: !135, size: 64, offset: 8320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !91, file: !92, line: 300, baseType: !437, size: 64, offset: 8384)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !24, line: 950, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!135, !88, !441}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !6, line: 591, baseType: !14)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !91, file: !92, line: 301, baseType: !443, size: 64, offset: 8448)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !24, line: 952, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !88, !135}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !91, file: !92, line: 305, baseType: !32, size: 64, offset: 8512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !91, file: !92, line: 309, baseType: !32, size: 64, offset: 8576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !91, file: !92, line: 310, baseType: !32, size: 64, offset: 8640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !91, file: !92, line: 312, baseType: !32, size: 64, offset: 8704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !91, file: !92, line: 317, baseType: !10, size: 8, offset: 8768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !91, file: !92, line: 320, baseType: !12, size: 32, offset: 8800)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !91, file: !92, line: 321, baseType: !12, size: 32, offset: 8832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !91, file: !92, line: 326, baseType: !12, size: 32, offset: 8864)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !91, file: !92, line: 331, baseType: !441, size: 64, offset: 8896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !91, file: !92, line: 337, baseType: !69, size: 256, offset: 8960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !91, file: !92, line: 341, baseType: !14, size: 64, offset: 9216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !91, file: !92, line: 344, baseType: !18, size: 64, offset: 9280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !91, file: !92, line: 348, baseType: !12, size: 32, offset: 9344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !91, file: !92, line: 352, baseType: !32, size: 64, offset: 9408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !91, file: !92, line: 354, baseType: !462, size: 256, offset: 9472)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 256, elements: !469)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !148, !32, !466}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !6, line: 527, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!469 = !{!470}
!470 = !DISubrange(count: 4)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_color_16p", file: !24, line: 572, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!474 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !85, file: !1, line: 25, type: !88)
!475 = !DILocation(line: 25, column: 26, scope: !85)
!476 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !85, file: !1, line: 25, type: !307)
!477 = !DILocation(line: 25, column: 45, scope: !85)
!478 = !DILocalVariable(name: "background", arg: 3, scope: !85, file: !1, line: 26, type: !471)
!479 = !DILocation(line: 26, column: 25, scope: !85)
!480 = !DILocation(line: 30, column: 8, scope: !481)
!481 = distinct !DILexicalBlock(scope: !85, file: !1, line: 30, column: 8)
!482 = !DILocation(line: 30, column: 16, scope: !481)
!483 = !DILocation(line: 30, column: 24, scope: !481)
!484 = !DILocation(line: 30, column: 27, scope: !481)
!485 = !DILocation(line: 30, column: 36, scope: !481)
!486 = !DILocation(line: 30, column: 8, scope: !85)
!487 = !DILocation(line: 31, column: 7, scope: !481)
!488 = !DILocation(line: 33, column: 17, scope: !85)
!489 = !DILocation(line: 33, column: 27, scope: !85)
!490 = !DILocation(line: 33, column: 4, scope: !85)
!491 = !DILocation(line: 33, column: 40, scope: !85)
!492 = !DILocation(line: 34, column: 4, scope: !85)
!493 = !DILocation(line: 34, column: 14, scope: !85)
!494 = !DILocation(line: 34, column: 20, scope: !85)
!495 = !DILocation(line: 35, column: 1, scope: !85)
!496 = distinct !DISubprogram(name: "png_set_cHRM_fixed", scope: !1, file: !1, line: 40, type: !497, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !88, !307, !254, !254, !254, !254, !254, !254, !254, !254}
!499 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !496, file: !1, line: 40, type: !88)
!500 = !DILocation(line: 40, column: 32, scope: !496)
!501 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !496, file: !1, line: 40, type: !307)
!502 = !DILocation(line: 40, column: 51, scope: !496)
!503 = !DILocalVariable(name: "white_x", arg: 3, scope: !496, file: !1, line: 41, type: !254)
!504 = !DILocation(line: 41, column: 21, scope: !496)
!505 = !DILocalVariable(name: "white_y", arg: 4, scope: !496, file: !1, line: 41, type: !254)
!506 = !DILocation(line: 41, column: 46, scope: !496)
!507 = !DILocalVariable(name: "red_x", arg: 5, scope: !496, file: !1, line: 41, type: !254)
!508 = !DILocation(line: 41, column: 71, scope: !496)
!509 = !DILocalVariable(name: "red_y", arg: 6, scope: !496, file: !1, line: 42, type: !254)
!510 = !DILocation(line: 42, column: 21, scope: !496)
!511 = !DILocalVariable(name: "green_x", arg: 7, scope: !496, file: !1, line: 42, type: !254)
!512 = !DILocation(line: 42, column: 44, scope: !496)
!513 = !DILocalVariable(name: "green_y", arg: 8, scope: !496, file: !1, line: 42, type: !254)
!514 = !DILocation(line: 42, column: 69, scope: !496)
!515 = !DILocalVariable(name: "blue_x", arg: 9, scope: !496, file: !1, line: 43, type: !254)
!516 = !DILocation(line: 43, column: 21, scope: !496)
!517 = !DILocalVariable(name: "blue_y", arg: 10, scope: !496, file: !1, line: 43, type: !254)
!518 = !DILocation(line: 43, column: 45, scope: !496)
!519 = !DILocation(line: 47, column: 8, scope: !520)
!520 = distinct !DILexicalBlock(scope: !496, file: !1, line: 47, column: 8)
!521 = !DILocation(line: 47, column: 16, scope: !520)
!522 = !DILocation(line: 47, column: 24, scope: !520)
!523 = !DILocation(line: 47, column: 27, scope: !520)
!524 = !DILocation(line: 47, column: 36, scope: !520)
!525 = !DILocation(line: 47, column: 8, scope: !496)
!526 = !DILocation(line: 48, column: 7, scope: !520)
!527 = !DILocation(line: 51, column: 29, scope: !528)
!528 = distinct !DILexicalBlock(scope: !496, file: !1, line: 51, column: 8)
!529 = !DILocation(line: 52, column: 8, scope: !528)
!530 = !DILocation(line: 52, column: 17, scope: !528)
!531 = !DILocation(line: 52, column: 26, scope: !528)
!532 = !DILocation(line: 52, column: 33, scope: !528)
!533 = !DILocation(line: 52, column: 40, scope: !528)
!534 = !DILocation(line: 52, column: 49, scope: !528)
!535 = !DILocation(line: 52, column: 58, scope: !528)
!536 = !DILocation(line: 52, column: 66, scope: !528)
!537 = !DILocation(line: 51, column: 8, scope: !528)
!538 = !DILocation(line: 51, column: 8, scope: !496)
!539 = !DILocation(line: 55, column: 27, scope: !540)
!540 = distinct !DILexicalBlock(scope: !528, file: !1, line: 54, column: 4)
!541 = !DILocation(line: 55, column: 7, scope: !540)
!542 = !DILocation(line: 55, column: 17, scope: !540)
!543 = !DILocation(line: 55, column: 25, scope: !540)
!544 = !DILocation(line: 56, column: 27, scope: !540)
!545 = !DILocation(line: 56, column: 7, scope: !540)
!546 = !DILocation(line: 56, column: 17, scope: !540)
!547 = !DILocation(line: 56, column: 25, scope: !540)
!548 = !DILocation(line: 57, column: 27, scope: !540)
!549 = !DILocation(line: 57, column: 7, scope: !540)
!550 = !DILocation(line: 57, column: 17, scope: !540)
!551 = !DILocation(line: 57, column: 25, scope: !540)
!552 = !DILocation(line: 58, column: 27, scope: !540)
!553 = !DILocation(line: 58, column: 7, scope: !540)
!554 = !DILocation(line: 58, column: 17, scope: !540)
!555 = !DILocation(line: 58, column: 25, scope: !540)
!556 = !DILocation(line: 59, column: 27, scope: !540)
!557 = !DILocation(line: 59, column: 7, scope: !540)
!558 = !DILocation(line: 59, column: 17, scope: !540)
!559 = !DILocation(line: 59, column: 25, scope: !540)
!560 = !DILocation(line: 60, column: 27, scope: !540)
!561 = !DILocation(line: 60, column: 7, scope: !540)
!562 = !DILocation(line: 60, column: 17, scope: !540)
!563 = !DILocation(line: 60, column: 25, scope: !540)
!564 = !DILocation(line: 61, column: 27, scope: !540)
!565 = !DILocation(line: 61, column: 7, scope: !540)
!566 = !DILocation(line: 61, column: 17, scope: !540)
!567 = !DILocation(line: 61, column: 25, scope: !540)
!568 = !DILocation(line: 62, column: 27, scope: !540)
!569 = !DILocation(line: 62, column: 7, scope: !540)
!570 = !DILocation(line: 62, column: 17, scope: !540)
!571 = !DILocation(line: 62, column: 25, scope: !540)
!572 = !DILocation(line: 63, column: 7, scope: !540)
!573 = !DILocation(line: 63, column: 17, scope: !540)
!574 = !DILocation(line: 63, column: 23, scope: !540)
!575 = !DILocation(line: 64, column: 4, scope: !540)
!576 = !DILocation(line: 65, column: 1, scope: !496)
!577 = distinct !DISubprogram(name: "png_set_cHRM_XYZ_fixed", scope: !1, file: !1, line: 68, type: !578, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !88, !307, !254, !254, !254, !254, !254, !254, !254, !254, !254}
!580 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !577, file: !1, line: 68, type: !88)
!581 = !DILocation(line: 68, column: 36, scope: !577)
!582 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !577, file: !1, line: 68, type: !307)
!583 = !DILocation(line: 68, column: 55, scope: !577)
!584 = !DILocalVariable(name: "int_red_X", arg: 3, scope: !577, file: !1, line: 69, type: !254)
!585 = !DILocation(line: 69, column: 21, scope: !577)
!586 = !DILocalVariable(name: "int_red_Y", arg: 4, scope: !577, file: !1, line: 69, type: !254)
!587 = !DILocation(line: 69, column: 48, scope: !577)
!588 = !DILocalVariable(name: "int_red_Z", arg: 5, scope: !577, file: !1, line: 70, type: !254)
!589 = !DILocation(line: 70, column: 21, scope: !577)
!590 = !DILocalVariable(name: "int_green_X", arg: 6, scope: !577, file: !1, line: 70, type: !254)
!591 = !DILocation(line: 70, column: 48, scope: !577)
!592 = !DILocalVariable(name: "int_green_Y", arg: 7, scope: !577, file: !1, line: 71, type: !254)
!593 = !DILocation(line: 71, column: 21, scope: !577)
!594 = !DILocalVariable(name: "int_green_Z", arg: 8, scope: !577, file: !1, line: 71, type: !254)
!595 = !DILocation(line: 71, column: 50, scope: !577)
!596 = !DILocalVariable(name: "int_blue_X", arg: 9, scope: !577, file: !1, line: 72, type: !254)
!597 = !DILocation(line: 72, column: 21, scope: !577)
!598 = !DILocalVariable(name: "int_blue_Y", arg: 10, scope: !577, file: !1, line: 72, type: !254)
!599 = !DILocation(line: 72, column: 49, scope: !577)
!600 = !DILocalVariable(name: "int_blue_Z", arg: 11, scope: !577, file: !1, line: 73, type: !254)
!601 = !DILocation(line: 73, column: 21, scope: !577)
!602 = !DILocalVariable(name: "XYZ", scope: !577, file: !1, line: 75, type: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_XYZ", file: !604, line: 1381, baseType: !605)
!604 = !DIFile(filename: "libpng/pngpriv.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_XYZ", file: !604, line: 1376, size: 288, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "redX", scope: !605, file: !604, line: 1378, baseType: !254, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "redY", scope: !605, file: !604, line: 1378, baseType: !254, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "redZ", scope: !605, file: !604, line: 1378, baseType: !254, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "greenX", scope: !605, file: !604, line: 1379, baseType: !254, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "greenY", scope: !605, file: !604, line: 1379, baseType: !254, size: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "greenZ", scope: !605, file: !604, line: 1379, baseType: !254, size: 32, offset: 160)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "blueX", scope: !605, file: !604, line: 1380, baseType: !254, size: 32, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "blueY", scope: !605, file: !604, line: 1380, baseType: !254, size: 32, offset: 224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "blueZ", scope: !605, file: !604, line: 1380, baseType: !254, size: 32, offset: 256)
!616 = !DILocation(line: 75, column: 12, scope: !577)
!617 = !DILocalVariable(name: "xy", scope: !577, file: !1, line: 76, type: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_xy", file: !604, line: 1374, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_xy", file: !604, line: 1368, size: 256, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "redx", scope: !619, file: !604, line: 1370, baseType: !254, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "redy", scope: !619, file: !604, line: 1370, baseType: !254, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "greenx", scope: !619, file: !604, line: 1371, baseType: !254, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "greeny", scope: !619, file: !604, line: 1371, baseType: !254, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bluex", scope: !619, file: !604, line: 1372, baseType: !254, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bluey", scope: !619, file: !604, line: 1372, baseType: !254, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "whitex", scope: !619, file: !604, line: 1373, baseType: !254, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "whitey", scope: !619, file: !604, line: 1373, baseType: !254, size: 32, offset: 224)
!629 = !DILocation(line: 76, column: 11, scope: !577)
!630 = !DILocation(line: 80, column: 8, scope: !631)
!631 = distinct !DILexicalBlock(scope: !577, file: !1, line: 80, column: 8)
!632 = !DILocation(line: 80, column: 16, scope: !631)
!633 = !DILocation(line: 80, column: 24, scope: !631)
!634 = !DILocation(line: 80, column: 27, scope: !631)
!635 = !DILocation(line: 80, column: 36, scope: !631)
!636 = !DILocation(line: 80, column: 8, scope: !577)
!637 = !DILocation(line: 81, column: 7, scope: !631)
!638 = !DILocation(line: 83, column: 15, scope: !577)
!639 = !DILocation(line: 83, column: 8, scope: !577)
!640 = !DILocation(line: 83, column: 13, scope: !577)
!641 = !DILocation(line: 84, column: 15, scope: !577)
!642 = !DILocation(line: 84, column: 8, scope: !577)
!643 = !DILocation(line: 84, column: 13, scope: !577)
!644 = !DILocation(line: 85, column: 15, scope: !577)
!645 = !DILocation(line: 85, column: 8, scope: !577)
!646 = !DILocation(line: 85, column: 13, scope: !577)
!647 = !DILocation(line: 86, column: 17, scope: !577)
!648 = !DILocation(line: 86, column: 8, scope: !577)
!649 = !DILocation(line: 86, column: 15, scope: !577)
!650 = !DILocation(line: 87, column: 17, scope: !577)
!651 = !DILocation(line: 87, column: 8, scope: !577)
!652 = !DILocation(line: 87, column: 15, scope: !577)
!653 = !DILocation(line: 88, column: 17, scope: !577)
!654 = !DILocation(line: 88, column: 8, scope: !577)
!655 = !DILocation(line: 88, column: 15, scope: !577)
!656 = !DILocation(line: 89, column: 16, scope: !577)
!657 = !DILocation(line: 89, column: 8, scope: !577)
!658 = !DILocation(line: 89, column: 14, scope: !577)
!659 = !DILocation(line: 90, column: 16, scope: !577)
!660 = !DILocation(line: 90, column: 8, scope: !577)
!661 = !DILocation(line: 90, column: 14, scope: !577)
!662 = !DILocation(line: 91, column: 16, scope: !577)
!663 = !DILocation(line: 91, column: 8, scope: !577)
!664 = !DILocation(line: 91, column: 14, scope: !577)
!665 = !DILocation(line: 93, column: 8, scope: !666)
!666 = distinct !DILexicalBlock(scope: !577, file: !1, line: 93, column: 8)
!667 = !DILocation(line: 93, column: 8, scope: !577)
!668 = !DILocation(line: 94, column: 17, scope: !666)
!669 = !DILocation(line: 94, column: 7, scope: !666)
!670 = !DILocation(line: 96, column: 23, scope: !577)
!671 = !DILocation(line: 96, column: 32, scope: !577)
!672 = !DILocation(line: 96, column: 45, scope: !577)
!673 = !DILocation(line: 96, column: 56, scope: !577)
!674 = !DILocation(line: 96, column: 67, scope: !577)
!675 = !DILocation(line: 96, column: 76, scope: !577)
!676 = !DILocation(line: 97, column: 10, scope: !577)
!677 = !DILocation(line: 97, column: 21, scope: !577)
!678 = !DILocation(line: 97, column: 32, scope: !577)
!679 = !DILocation(line: 97, column: 42, scope: !577)
!680 = !DILocation(line: 96, column: 4, scope: !577)
!681 = !DILocation(line: 98, column: 1, scope: !577)
!682 = distinct !DISubprogram(name: "png_set_cHRM", scope: !1, file: !1, line: 102, type: !683, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !88, !307, !685, !685, !685, !685, !685, !685, !685, !685}
!685 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!686 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !682, file: !1, line: 102, type: !88)
!687 = !DILocation(line: 102, column: 26, scope: !682)
!688 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !682, file: !1, line: 102, type: !307)
!689 = !DILocation(line: 102, column: 45, scope: !682)
!690 = !DILocalVariable(name: "white_x", arg: 3, scope: !682, file: !1, line: 103, type: !685)
!691 = !DILocation(line: 103, column: 12, scope: !682)
!692 = !DILocalVariable(name: "white_y", arg: 4, scope: !682, file: !1, line: 103, type: !685)
!693 = !DILocation(line: 103, column: 28, scope: !682)
