; ModuleID = 'libpng/pngrtran.c'
source_filename = "libpng/pngrtran.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "libpng/pngrtran.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !8, !10, !12, !13, !23, !24, !26, !30}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !6, line: 449, baseType: !7)
!6 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !6, line: 526, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !6, line: 441, baseType: !11)
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_dsortpp", file: !1, line: 378, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_dsort", file: !1, line: 376, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_dsort_struct", file: !1, line: 371, size: 128, elements: !18)
!18 = !{!19, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !1, line: 373, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !17, file: !1, line: 374, baseType: !5, size: 8, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !17, file: !1, line: 375, baseType: !5, size: 8, offset: 72)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_dsortp", file: !1, line: 377, baseType: !15)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !6, line: 447, baseType: !25)
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !6, line: 454, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 46, baseType: !29)
!28 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !6, line: 521, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !6, line: 442, baseType: !12)
!32 = !{i32 7, !"Dwarf Version", i32 4}
!33 = !{i32 2, !"Debug Info Version", i32 3}
!34 = !{i32 1, !"wchar_size", i32 4}
!35 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!36 = distinct !DISubprogram(name: "png_set_crc_action", scope: !1, file: !1, line: 25, type: !37, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !12, !12}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !40, line: 851, baseType: !41)
!40 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !40, line: 849, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !44, line: 29, size: 9728, elements: !45)
!44 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = !{!46, !71, !77, !86, !87, !89, !94, !95, !96, !112, !113, !114, !115, !116, !117, !118, !119, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !218, !219, !220, !221, !230, !231, !236, !237, !238, !239, !240, !241, !242, !246, !247, !248, !249, !250, !259, !260, !261, !262, !267, !269, !397, !402, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !430, !431, !432, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !453, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !43, file: !44, line: 32, baseType: !47, size: 1600)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !48, line: 45, baseType: !49)
!48 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1600, elements: !69)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !48, line: 33, size: 1600, elements: !51)
!51 = !{!52, !59, !60}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !50, file: !48, line: 39, baseType: !53, size: 512)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !54, line: 31, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 512, elements: !57)
!56 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!57 = !{!58}
!58 = !DISubrange(count: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !50, file: !48, line: 40, baseType: !12, size: 32, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !50, file: !48, line: 41, baseType: !61, size: 1024, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !62, line: 8, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 5, size: 1024, elements: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !63, file: !62, line: 7, baseType: !66, size: 1024)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 16)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !43, file: !44, line: 33, baseType: !72, size: 64, offset: 1600)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !40, line: 913, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76, !12}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !43, file: !44, line: 35, baseType: !78, size: 64, offset: 1664)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !40, line: 861, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !39, !82}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !6, line: 537, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !43, file: !44, line: 37, baseType: !78, size: 64, offset: 1728)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !43, file: !44, line: 39, baseType: !88, size: 64, offset: 1792)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !6, line: 524, baseType: !4)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !43, file: !44, line: 40, baseType: !90, size: 64, offset: 1856)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !40, line: 862, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !39, !8, !26}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !43, file: !44, line: 41, baseType: !90, size: 64, offset: 1920)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !43, file: !44, line: 42, baseType: !88, size: 64, offset: 1984)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !43, file: !44, line: 45, baseType: !97, size: 64, offset: 2048)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !40, line: 889, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !39, !101, !8}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !40, line: 842, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !40, line: 840, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !40, line: 832, size: 192, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !104, file: !40, line: 834, baseType: !10, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !104, file: !40, line: 835, baseType: !26, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !104, file: !40, line: 836, baseType: !5, size: 8, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !104, file: !40, line: 837, baseType: !5, size: 8, offset: 136)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !104, file: !40, line: 838, baseType: !5, size: 8, offset: 144)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !104, file: !40, line: 839, baseType: !5, size: 8, offset: 152)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !43, file: !44, line: 49, baseType: !97, size: 64, offset: 2112)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !43, file: !44, line: 56, baseType: !88, size: 64, offset: 2176)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !43, file: !44, line: 57, baseType: !5, size: 8, offset: 2240)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !43, file: !44, line: 58, baseType: !5, size: 8, offset: 2248)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !43, file: !44, line: 62, baseType: !10, size: 32, offset: 2272)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !44, line: 63, baseType: !10, size: 32, offset: 2304)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !43, file: !44, line: 64, baseType: !10, size: 32, offset: 2336)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !43, file: !44, line: 66, baseType: !120, size: 896, offset: 2368)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !121, line: 104, baseType: !122)
!121 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !121, line: 85, size: 896, elements: !123)
!123 = !{!124, !129, !131, !133, !134, !135, !136, !138, !143, !149, !154, !155, !156, !157}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !122, file: !121, line: 86, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !127, line: 374, baseType: !128)
!127 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !127, line: 365, baseType: !7)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !122, file: !121, line: 87, baseType: !130, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !127, line: 367, baseType: !11)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !122, file: !121, line: 88, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !127, line: 368, baseType: !29)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !122, file: !121, line: 90, baseType: !125, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !122, file: !121, line: 91, baseType: !130, size: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !122, file: !121, line: 92, baseType: !132, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !122, file: !121, line: 94, baseType: !137, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !122, file: !121, line: 95, baseType: !139, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !121, line: 1714, size: 32, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !140, file: !121, line: 1714, baseType: !12, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !122, file: !121, line: 97, baseType: !144, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !121, line: 80, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !148, !130, !130}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !127, line: 383, baseType: !4)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !122, file: !121, line: 98, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !121, line: 81, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !148, !148}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !122, file: !121, line: 99, baseType: !148, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !122, file: !121, line: 101, baseType: !12, size: 32, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !122, file: !121, line: 102, baseType: !132, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !122, file: !121, line: 103, baseType: !132, size: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !43, file: !44, line: 67, baseType: !8, size: 64, offset: 3264)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !43, file: !44, line: 68, baseType: !130, size: 32, offset: 3328)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !43, file: !44, line: 80, baseType: !10, size: 32, offset: 3360)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !43, file: !44, line: 83, baseType: !12, size: 32, offset: 3392)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !43, file: !44, line: 84, baseType: !12, size: 32, offset: 3424)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !43, file: !44, line: 85, baseType: !12, size: 32, offset: 3456)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !43, file: !44, line: 86, baseType: !12, size: 32, offset: 3488)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !43, file: !44, line: 87, baseType: !12, size: 32, offset: 3520)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !43, file: !44, line: 92, baseType: !12, size: 32, offset: 3552)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !43, file: !44, line: 93, baseType: !12, size: 32, offset: 3584)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !43, file: !44, line: 94, baseType: !12, size: 32, offset: 3616)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !43, file: !44, line: 95, baseType: !12, size: 32, offset: 3648)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !43, file: !44, line: 96, baseType: !12, size: 32, offset: 3680)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !43, file: !44, line: 100, baseType: !10, size: 32, offset: 3712)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !43, file: !44, line: 101, baseType: !10, size: 32, offset: 3744)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !43, file: !44, line: 102, baseType: !10, size: 32, offset: 3776)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !43, file: !44, line: 103, baseType: !10, size: 32, offset: 3808)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !43, file: !44, line: 104, baseType: !26, size: 64, offset: 3840)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !43, file: !44, line: 105, baseType: !10, size: 32, offset: 3904)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !43, file: !44, line: 106, baseType: !10, size: 32, offset: 3936)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !43, file: !44, line: 107, baseType: !10, size: 32, offset: 3968)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !43, file: !44, line: 108, baseType: !8, size: 64, offset: 4032)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !43, file: !44, line: 111, baseType: !8, size: 64, offset: 4096)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !43, file: !44, line: 114, baseType: !8, size: 64, offset: 4160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !43, file: !44, line: 115, baseType: !8, size: 64, offset: 4224)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !43, file: !44, line: 116, baseType: !8, size: 64, offset: 4288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !43, file: !44, line: 117, baseType: !8, size: 64, offset: 4352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !43, file: !44, line: 118, baseType: !26, size: 64, offset: 4416)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !43, file: !44, line: 120, baseType: !10, size: 32, offset: 4480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !43, file: !44, line: 121, baseType: !10, size: 32, offset: 4512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !43, file: !44, line: 122, baseType: !189, size: 64, offset: 4544)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !40, line: 559, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !40, line: 558, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !40, line: 553, size: 24, elements: !193)
!193 = !{!194, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !192, file: !40, line: 555, baseType: !5, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !192, file: !40, line: 556, baseType: !5, size: 8, offset: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !192, file: !40, line: 557, baseType: !5, size: 8, offset: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !43, file: !44, line: 123, baseType: !24, size: 16, offset: 4608)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !43, file: !44, line: 127, baseType: !12, size: 32, offset: 4640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !43, file: !44, line: 130, baseType: !24, size: 16, offset: 4672)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !43, file: !44, line: 131, baseType: !5, size: 8, offset: 4688)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !43, file: !44, line: 132, baseType: !5, size: 8, offset: 4696)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !43, file: !44, line: 133, baseType: !5, size: 8, offset: 4704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !43, file: !44, line: 134, baseType: !5, size: 8, offset: 4712)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !43, file: !44, line: 135, baseType: !5, size: 8, offset: 4720)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !43, file: !44, line: 136, baseType: !5, size: 8, offset: 4728)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !43, file: !44, line: 137, baseType: !5, size: 8, offset: 4736)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !43, file: !44, line: 138, baseType: !5, size: 8, offset: 4744)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !43, file: !44, line: 139, baseType: !5, size: 8, offset: 4752)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !43, file: !44, line: 140, baseType: !5, size: 8, offset: 4760)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !43, file: !44, line: 141, baseType: !5, size: 8, offset: 4768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !43, file: !44, line: 142, baseType: !5, size: 8, offset: 4776)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !43, file: !44, line: 143, baseType: !5, size: 8, offset: 4784)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !43, file: !44, line: 145, baseType: !5, size: 8, offset: 4792)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !43, file: !44, line: 147, baseType: !215, size: 40, offset: 4800)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 40, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 5)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !43, file: !44, line: 151, baseType: !24, size: 16, offset: 4848)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !43, file: !44, line: 156, baseType: !5, size: 8, offset: 4864)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !43, file: !44, line: 157, baseType: !30, size: 32, offset: 4896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !43, file: !44, line: 158, baseType: !222, size: 80, offset: 4928)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !40, line: 570, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !40, line: 563, size: 80, elements: !224)
!224 = !{!225, !226, !227, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !223, file: !40, line: 565, baseType: !5, size: 8)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !223, file: !40, line: 566, baseType: !24, size: 16, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !223, file: !40, line: 567, baseType: !24, size: 16, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !223, file: !40, line: 568, baseType: !24, size: 16, offset: 48)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !223, file: !40, line: 569, baseType: !24, size: 16, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !43, file: !44, line: 160, baseType: !222, size: 80, offset: 5008)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !43, file: !44, line: 165, baseType: !232, size: 64, offset: 5120)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !40, line: 863, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !39}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !43, file: !44, line: 166, baseType: !10, size: 32, offset: 5184)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !43, file: !44, line: 167, baseType: !10, size: 32, offset: 5216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !43, file: !44, line: 171, baseType: !12, size: 32, offset: 5248)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !43, file: !44, line: 172, baseType: !30, size: 32, offset: 5280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !43, file: !44, line: 173, baseType: !30, size: 32, offset: 5312)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !43, file: !44, line: 175, baseType: !8, size: 64, offset: 5376)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !43, file: !44, line: 176, baseType: !243, size: 64, offset: 5440)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !6, line: 556, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !43, file: !44, line: 180, baseType: !8, size: 64, offset: 5504)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !43, file: !44, line: 181, baseType: !8, size: 64, offset: 5568)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !43, file: !44, line: 182, baseType: !243, size: 64, offset: 5632)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !43, file: !44, line: 183, baseType: !243, size: 64, offset: 5696)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !43, file: !44, line: 188, baseType: !251, size: 40, offset: 5760)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !40, line: 582, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !40, line: 575, size: 40, elements: !253)
!253 = !{!254, !255, !256, !257, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !252, file: !40, line: 577, baseType: !5, size: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !252, file: !40, line: 578, baseType: !5, size: 8, offset: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !252, file: !40, line: 579, baseType: !5, size: 8, offset: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !252, file: !40, line: 580, baseType: !5, size: 8, offset: 24)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !252, file: !40, line: 581, baseType: !5, size: 8, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !43, file: !44, line: 192, baseType: !251, size: 40, offset: 5800)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !43, file: !44, line: 197, baseType: !8, size: 64, offset: 5888)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !43, file: !44, line: 198, baseType: !222, size: 80, offset: 5952)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !43, file: !44, line: 201, baseType: !263, size: 64, offset: 6080)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !40, line: 864, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !39, !10, !12}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !43, file: !44, line: 202, baseType: !268, size: 64, offset: 6144)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !40, line: 866, baseType: !264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !43, file: !44, line: 204, baseType: !270, size: 64, offset: 6208)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !40, line: 870, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !39, !274}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !40, line: 723, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !40, line: 722, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !278, line: 56, size: 2496, elements: !279)
!278 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !297, !298, !299, !300, !301, !315, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !352, !353, !354, !355, !365, !366, !367, !368, !369, !370, !390, !391, !392, !393, !394}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !277, file: !278, line: 59, baseType: !10, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !277, file: !278, line: 60, baseType: !10, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !277, file: !278, line: 61, baseType: !10, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !277, file: !278, line: 62, baseType: !26, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !277, file: !278, line: 63, baseType: !189, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !277, file: !278, line: 64, baseType: !24, size: 16, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !277, file: !278, line: 65, baseType: !24, size: 16, offset: 272)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !277, file: !278, line: 66, baseType: !5, size: 8, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !277, file: !278, line: 67, baseType: !5, size: 8, offset: 296)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !277, file: !278, line: 69, baseType: !5, size: 8, offset: 304)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !277, file: !278, line: 70, baseType: !5, size: 8, offset: 312)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !277, file: !278, line: 71, baseType: !5, size: 8, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !277, file: !278, line: 74, baseType: !5, size: 8, offset: 328)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !277, file: !278, line: 75, baseType: !5, size: 8, offset: 336)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !277, file: !278, line: 76, baseType: !5, size: 8, offset: 344)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !277, file: !278, line: 77, baseType: !296, size: 64, offset: 352)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !57)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !277, file: !278, line: 90, baseType: !30, size: 32, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !277, file: !278, line: 96, baseType: !5, size: 8, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !277, file: !278, line: 108, baseType: !12, size: 32, offset: 480)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !277, file: !278, line: 109, baseType: !12, size: 32, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !277, file: !278, line: 110, baseType: !302, size: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !40, line: 654, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !40, line: 653, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !40, line: 637, size: 448, elements: !306)
!306 = !{!307, !308, !310, !311, !312, !313, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !305, file: !40, line: 639, baseType: !12, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !305, file: !40, line: 644, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !6, line: 536, baseType: !137)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !305, file: !40, line: 645, baseType: !309, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !305, file: !40, line: 647, baseType: !26, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !305, file: !40, line: 648, baseType: !26, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !305, file: !40, line: 649, baseType: !309, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !305, file: !40, line: 651, baseType: !309, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !277, file: !278, line: 117, baseType: !316, size: 64, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !40, line: 683, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !40, line: 675, size: 64, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !317, file: !40, line: 677, baseType: !24, size: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !317, file: !40, line: 678, baseType: !5, size: 8, offset: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !317, file: !40, line: 679, baseType: !5, size: 8, offset: 24)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !317, file: !40, line: 680, baseType: !5, size: 8, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !317, file: !40, line: 681, baseType: !5, size: 8, offset: 40)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !317, file: !40, line: 682, baseType: !5, size: 8, offset: 48)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !277, file: !278, line: 127, baseType: !251, size: 40, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !277, file: !278, line: 141, baseType: !8, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !277, file: !278, line: 142, baseType: !222, size: 80, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !277, file: !278, line: 152, baseType: !222, size: 80, offset: 912)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !277, file: !278, line: 161, baseType: !31, size: 32, offset: 992)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !277, file: !278, line: 162, baseType: !31, size: 32, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !277, file: !278, line: 163, baseType: !5, size: 8, offset: 1056)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !277, file: !278, line: 171, baseType: !10, size: 32, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !277, file: !278, line: 172, baseType: !10, size: 32, offset: 1120)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !277, file: !278, line: 173, baseType: !5, size: 8, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !277, file: !278, line: 183, baseType: !336, size: 64, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !6, line: 532, baseType: !245)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !277, file: !278, line: 193, baseType: !30, size: 32, offset: 1280)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !277, file: !278, line: 194, baseType: !30, size: 32, offset: 1312)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !277, file: !278, line: 195, baseType: !30, size: 32, offset: 1344)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !277, file: !278, line: 196, baseType: !30, size: 32, offset: 1376)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !277, file: !278, line: 197, baseType: !30, size: 32, offset: 1408)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !277, file: !278, line: 198, baseType: !30, size: 32, offset: 1440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !277, file: !278, line: 199, baseType: !30, size: 32, offset: 1472)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !277, file: !278, line: 200, baseType: !30, size: 32, offset: 1504)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !277, file: !278, line: 215, baseType: !309, size: 64, offset: 1536)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !277, file: !278, line: 216, baseType: !31, size: 32, offset: 1600)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !277, file: !278, line: 217, baseType: !31, size: 32, offset: 1632)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !277, file: !278, line: 218, baseType: !309, size: 64, offset: 1664)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !277, file: !278, line: 219, baseType: !350, size: 64, offset: 1728)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !6, line: 559, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !277, file: !278, line: 220, baseType: !5, size: 8, offset: 1792)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !277, file: !278, line: 221, baseType: !5, size: 8, offset: 1800)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !277, file: !278, line: 225, baseType: !10, size: 32, offset: 1824)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !277, file: !278, line: 230, baseType: !356, size: 64, offset: 1856)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !40, line: 707, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !40, line: 706, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !40, line: 695, size: 256, elements: !360)
!360 = !{!361, !362, !363, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !359, file: !40, line: 697, baseType: !215, size: 40)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !40, line: 698, baseType: !9, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !359, file: !40, line: 699, baseType: !26, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !359, file: !40, line: 702, baseType: !5, size: 8, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !277, file: !278, line: 231, baseType: !12, size: 32, offset: 1920)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !277, file: !278, line: 236, baseType: !309, size: 64, offset: 1984)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !277, file: !278, line: 237, baseType: !8, size: 64, offset: 2048)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !277, file: !278, line: 238, baseType: !10, size: 32, offset: 2112)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !277, file: !278, line: 239, baseType: !5, size: 8, offset: 2144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !277, file: !278, line: 244, baseType: !371, size: 64, offset: 2176)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !40, line: 615, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !40, line: 614, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !40, line: 608, size: 256, elements: !375)
!375 = !{!376, !377, !378, !389}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !40, line: 610, baseType: !309, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !374, file: !40, line: 611, baseType: !5, size: 8, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !374, file: !40, line: 612, baseType: !379, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !40, line: 599, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !40, line: 598, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !40, line: 591, size: 80, elements: !383)
!383 = !{!384, !385, !386, !387, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !382, file: !40, line: 593, baseType: !24, size: 16)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !382, file: !40, line: 594, baseType: !24, size: 16, offset: 16)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !382, file: !40, line: 595, baseType: !24, size: 16, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !382, file: !40, line: 596, baseType: !24, size: 16, offset: 48)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !382, file: !40, line: 597, baseType: !24, size: 16, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !374, file: !40, line: 613, baseType: !31, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !277, file: !278, line: 245, baseType: !10, size: 32, offset: 2240)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !277, file: !278, line: 256, baseType: !5, size: 8, offset: 2272)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !277, file: !278, line: 257, baseType: !309, size: 64, offset: 2304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !277, file: !278, line: 258, baseType: !309, size: 64, offset: 2368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !277, file: !278, line: 265, baseType: !395, size: 64, offset: 2432)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !6, line: 553, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !43, file: !44, line: 205, baseType: !398, size: 64, offset: 6272)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !40, line: 883, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !39, !8, !10, !12}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !43, file: !44, line: 206, baseType: !403, size: 64, offset: 6336)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !40, line: 871, baseType: !271)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !43, file: !44, line: 207, baseType: !8, size: 64, offset: 6400)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !43, file: !44, line: 208, baseType: !8, size: 64, offset: 6464)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !43, file: !44, line: 209, baseType: !8, size: 64, offset: 6528)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !43, file: !44, line: 210, baseType: !8, size: 64, offset: 6592)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !43, file: !44, line: 211, baseType: !10, size: 32, offset: 6656)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !43, file: !44, line: 212, baseType: !10, size: 32, offset: 6688)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !43, file: !44, line: 213, baseType: !26, size: 64, offset: 6720)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !43, file: !44, line: 214, baseType: !26, size: 64, offset: 6784)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !43, file: !44, line: 215, baseType: !26, size: 64, offset: 6848)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !43, file: !44, line: 216, baseType: !26, size: 64, offset: 6912)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !43, file: !44, line: 217, baseType: !12, size: 32, offset: 6976)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !43, file: !44, line: 218, baseType: !12, size: 32, offset: 7008)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !43, file: !44, line: 232, baseType: !8, size: 64, offset: 7040)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !43, file: !44, line: 233, baseType: !8, size: 64, offset: 7104)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !43, file: !44, line: 237, baseType: !336, size: 64, offset: 7168)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !43, file: !44, line: 241, baseType: !5, size: 8, offset: 7232)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !43, file: !44, line: 242, baseType: !5, size: 8, offset: 7240)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !43, file: !44, line: 243, baseType: !8, size: 64, offset: 7296)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !43, file: !44, line: 244, baseType: !336, size: 64, offset: 7360)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !43, file: !44, line: 245, baseType: !336, size: 64, offset: 7424)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !43, file: !44, line: 246, baseType: !336, size: 64, offset: 7488)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !43, file: !44, line: 247, baseType: !336, size: 64, offset: 7552)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !43, file: !44, line: 251, baseType: !427, size: 232, offset: 7616)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 232, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 29)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !43, file: !44, line: 256, baseType: !10, size: 32, offset: 7872)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !43, file: !44, line: 259, baseType: !88, size: 64, offset: 7936)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !43, file: !44, line: 260, baseType: !433, size: 64, offset: 8000)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !40, line: 894, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!12, !39, !356}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !43, file: !44, line: 264, baseType: !12, size: 32, offset: 8064)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !43, file: !44, line: 265, baseType: !8, size: 64, offset: 8128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !43, file: !44, line: 270, baseType: !5, size: 8, offset: 8192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !43, file: !44, line: 275, baseType: !5, size: 8, offset: 8200)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !43, file: !44, line: 277, baseType: !5, size: 8, offset: 8208)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !43, file: !44, line: 279, baseType: !24, size: 16, offset: 8224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !43, file: !44, line: 280, baseType: !24, size: 16, offset: 8240)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !43, file: !44, line: 287, baseType: !10, size: 32, offset: 8256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !43, file: !44, line: 292, baseType: !5, size: 8, offset: 8288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !43, file: !44, line: 299, baseType: !88, size: 64, offset: 8320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !43, file: !44, line: 300, baseType: !448, size: 64, offset: 8384)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !40, line: 950, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!88, !39, !452}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !6, line: 591, baseType: !26)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !43, file: !44, line: 301, baseType: !454, size: 64, offset: 8448)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !40, line: 952, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !39, !88}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !43, file: !44, line: 305, baseType: !8, size: 64, offset: 8512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !43, file: !44, line: 309, baseType: !8, size: 64, offset: 8576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !43, file: !44, line: 310, baseType: !8, size: 64, offset: 8640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !43, file: !44, line: 312, baseType: !8, size: 64, offset: 8704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !43, file: !44, line: 317, baseType: !5, size: 8, offset: 8768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !43, file: !44, line: 320, baseType: !10, size: 32, offset: 8800)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !43, file: !44, line: 321, baseType: !10, size: 32, offset: 8832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !43, file: !44, line: 326, baseType: !10, size: 32, offset: 8864)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !43, file: !44, line: 331, baseType: !452, size: 64, offset: 8896)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !43, file: !44, line: 337, baseType: !358, size: 256, offset: 8960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !43, file: !44, line: 341, baseType: !26, size: 64, offset: 9216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !43, file: !44, line: 344, baseType: !309, size: 64, offset: 9280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !43, file: !44, line: 348, baseType: !10, size: 32, offset: 9344)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !43, file: !44, line: 352, baseType: !8, size: 64, offset: 9408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !43, file: !44, line: 354, baseType: !473, size: 256, offset: 9472)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 256, elements: !480)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !101, !8, !477}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !6, line: 527, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!480 = !{!481}
!481 = !DISubrange(count: 4)
!482 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !36, file: !1, line: 25, type: !39)
!483 = !DILocation(line: 25, column: 32, scope: !36)
!484 = !DILocalVariable(name: "crit_action", arg: 2, scope: !36, file: !1, line: 25, type: !12)
!485 = !DILocation(line: 25, column: 45, scope: !36)
!486 = !DILocalVariable(name: "ancil_action", arg: 3, scope: !36, file: !1, line: 25, type: !12)
!487 = !DILocation(line: 25, column: 62, scope: !36)
!488 = !DILocation(line: 29, column: 8, scope: !489)
!489 = distinct !DILexicalBlock(scope: !36, file: !1, line: 29, column: 8)
!490 = !DILocation(line: 29, column: 16, scope: !489)
!491 = !DILocation(line: 29, column: 8, scope: !36)
!492 = !DILocation(line: 30, column: 7, scope: !489)
!493 = !DILocation(line: 33, column: 12, scope: !36)
!494 = !DILocation(line: 33, column: 4, scope: !36)
!495 = !DILocation(line: 36, column: 10, scope: !496)
!496 = distinct !DILexicalBlock(scope: !36, file: !1, line: 34, column: 4)
!497 = !DILocation(line: 39, column: 10, scope: !496)
!498 = !DILocation(line: 39, column: 19, scope: !496)
!499 = !DILocation(line: 39, column: 25, scope: !496)
!500 = !DILocation(line: 40, column: 10, scope: !496)
!501 = !DILocation(line: 40, column: 19, scope: !496)
!502 = !DILocation(line: 40, column: 25, scope: !496)
!503 = !DILocation(line: 41, column: 10, scope: !496)
!504 = !DILocation(line: 44, column: 10, scope: !496)
!505 = !DILocation(line: 44, column: 19, scope: !496)
!506 = !DILocation(line: 44, column: 25, scope: !496)
!507 = !DILocation(line: 45, column: 10, scope: !496)
!508 = !DILocation(line: 45, column: 19, scope: !496)
!509 = !DILocation(line: 45, column: 25, scope: !496)
!510 = !DILocation(line: 47, column: 10, scope: !496)
!511 = !DILocation(line: 50, column: 22, scope: !496)
!512 = !DILocation(line: 50, column: 10, scope: !496)
!513 = !DILocation(line: 56, column: 10, scope: !496)
!514 = !DILocation(line: 56, column: 19, scope: !496)
!515 = !DILocation(line: 56, column: 25, scope: !496)
!516 = !DILocation(line: 57, column: 10, scope: !496)
!517 = !DILocation(line: 61, column: 12, scope: !36)
!518 = !DILocation(line: 61, column: 4, scope: !36)
!519 = !DILocation(line: 64, column: 10, scope: !520)
!520 = distinct !DILexicalBlock(scope: !36, file: !1, line: 62, column: 4)
!521 = !DILocation(line: 67, column: 10, scope: !520)
!522 = !DILocation(line: 67, column: 19, scope: !520)
!523 = !DILocation(line: 67, column: 25, scope: !520)
!524 = !DILocation(line: 68, column: 10, scope: !520)
!525 = !DILocation(line: 68, column: 19, scope: !520)
!526 = !DILocation(line: 68, column: 25, scope: !520)
!527 = !DILocation(line: 69, column: 10, scope: !520)
!528 = !DILocation(line: 72, column: 10, scope: !520)
!529 = !DILocation(line: 72, column: 19, scope: !520)
!530 = !DILocation(line: 72, column: 25, scope: !520)
!531 = !DILocation(line: 73, column: 10, scope: !520)
!532 = !DILocation(line: 73, column: 19, scope: !520)
!533 = !DILocation(line: 73, column: 25, scope: !520)
!534 = !DILocation(line: 75, column: 10, scope: !520)
!535 = !DILocation(line: 78, column: 10, scope: !520)
!536 = !DILocation(line: 78, column: 19, scope: !520)
!537 = !DILocation(line: 78, column: 25, scope: !520)
!538 = !DILocation(line: 79, column: 10, scope: !520)
!539 = !DILocation(line: 79, column: 19, scope: !520)
!540 = !DILocation(line: 79, column: 25, scope: !520)
