; ModuleID = 'blender/source/blender/editors/space_action/action_select.c'
source_filename = "blender/source/blender/editors/space_action/action_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSAction_Flag", file: !172, line: 608, baseType: !7, size: 32, elements: !173)
!172 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!174 = !DIEnumerator(name: "SACTION_MOVING", value: 1, isUnsigned: true)
!175 = !DIEnumerator(name: "SACTION_SLIDERS", value: 2, isUnsigned: true)
!176 = !DIEnumerator(name: "SACTION_DRAWTIME", value: 4, isUnsigned: true)
!177 = !DIEnumerator(name: "SACTION_NOTRANSKEYCULL", value: 16, isUnsigned: true)
!178 = !DIEnumerator(name: "SACTION_POSEMARKERS_SHOW", value: 64, isUnsigned: true)
!179 = !DIEnumerator(name: "SACTION_NODRAWGCOLORS", value: 128, isUnsigned: true)
!180 = !DIEnumerator(name: "SACTION_NODRAWCFRANUM", value: 256, isUnsigned: true)
!181 = !DIEnumerator(name: "SACTION_TEMP_NEEDCHANSYNC", value: 512, isUnsigned: true)
!182 = !DIEnumerator(name: "SACTION_NOREALTIMEUPDATES", value: 1024, isUnsigned: true)
!183 = !DIEnumerator(name: "SACTION_MARKERS_MOVE", value: 2048, isUnsigned: true)
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimChannels_SetFlag", file: !63, line: 393, baseType: !7, size: 32, elements: !185)
!185 = !{!186, !187, !188, !189}
!186 = !DIEnumerator(name: "ACHANNEL_SETFLAG_CLEAR", value: 0, isUnsigned: true)
!187 = !DIEnumerator(name: "ACHANNEL_SETFLAG_ADD", value: 1, isUnsigned: true)
!188 = !DIEnumerator(name: "ACHANNEL_SETFLAG_INVERT", value: 2, isUnsigned: true)
!189 = !DIEnumerator(name: "ACHANNEL_SETFLAG_TOGGLE", value: 3, isUnsigned: true)
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eActionGroup_Flag", file: !172, line: 453, baseType: !76, size: 32, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200}
!192 = !DIEnumerator(name: "AGRP_SELECTED", value: 1)
!193 = !DIEnumerator(name: "AGRP_ACTIVE", value: 2)
!194 = !DIEnumerator(name: "AGRP_PROTECTED", value: 4)
!195 = !DIEnumerator(name: "AGRP_EXPANDED", value: 8)
!196 = !DIEnumerator(name: "AGRP_MUTED", value: 16)
!197 = !DIEnumerator(name: "AGRP_NOTVISIBLE", value: 32)
!198 = !DIEnumerator(name: "AGRP_EXPANDED_G", value: 64)
!199 = !DIEnumerator(name: "AGRP_TEMP", value: 1073741824)
!200 = !DIEnumerator(name: "AGRP_MOVED", value: -2147483648)
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFCurve_Flags", file: !202, line: 467, baseType: !7, size: 32, elements: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!204 = !DIEnumerator(name: "FCURVE_VISIBLE", value: 1, isUnsigned: true)
!205 = !DIEnumerator(name: "FCURVE_SELECTED", value: 2, isUnsigned: true)
!206 = !DIEnumerator(name: "FCURVE_ACTIVE", value: 4, isUnsigned: true)
!207 = !DIEnumerator(name: "FCURVE_PROTECTED", value: 8, isUnsigned: true)
!208 = !DIEnumerator(name: "FCURVE_MUTED", value: 16, isUnsigned: true)
!209 = !DIEnumerator(name: "FCURVE_AUTO_HANDLES", value: 32, isUnsigned: true)
!210 = !DIEnumerator(name: "FCURVE_DISABLED", value: 1024, isUnsigned: true)
!211 = !DIEnumerator(name: "FCURVE_INT_VALUES", value: 2048, isUnsigned: true)
!212 = !DIEnumerator(name: "FCURVE_DISCRETE_VALUES", value: 4096, isUnsigned: true)
!213 = !DIEnumerator(name: "FCURVE_TAGGED", value: 32768, isUnsigned: true)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !215, line: 217, baseType: !7, size: 32, elements: !216)
!215 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = !{!217, !218, !219, !220}
!217 = !DIEnumerator(name: "MASK_LAYERFLAG_LOCKED", value: 16, isUnsigned: true)
!218 = !DIEnumerator(name: "MASK_LAYERFLAG_SELECT", value: 32, isUnsigned: true)
!219 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_DISCRETE", value: 64, isUnsigned: true)
!220 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_OVERLAP", value: 128, isUnsigned: true)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnim_KeyType", file: !63, line: 179, baseType: !7, size: 32, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!223 = !DIEnumerator(name: "ALE_NONE", value: 0, isUnsigned: true)
!224 = !DIEnumerator(name: "ALE_FCURVE", value: 1, isUnsigned: true)
!225 = !DIEnumerator(name: "ALE_GPFRAME", value: 2, isUnsigned: true)
!226 = !DIEnumerator(name: "ALE_MASKLAY", value: 3, isUnsigned: true)
!227 = !DIEnumerator(name: "ALE_NLASTRIP", value: 4, isUnsigned: true)
!228 = !DIEnumerator(name: "ALE_ALL", value: 5, isUnsigned: true)
!229 = !DIEnumerator(name: "ALE_SCE", value: 6, isUnsigned: true)
!230 = !DIEnumerator(name: "ALE_OB", value: 7, isUnsigned: true)
!231 = !DIEnumerator(name: "ALE_ACT", value: 8, isUnsigned: true)
!232 = !DIEnumerator(name: "ALE_GROUP", value: 9, isUnsigned: true)
!233 = !{!234, !235, !236, !344, !2130, !2132, !508, !244, !2134, !2158}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!235 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !202, line: 463, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !202, line: 433, size: 896, elements: !239)
!239 = !{!240, !242, !243, !279, !294, !295, !320, !331, !332, !333, !334, !335, !336, !338, !339, !342, !343}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !202, line: 434, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !202, line: 434, baseType: !241, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !238, file: !202, line: 437, baseType: !244, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !172, line: 450, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !172, line: 440, size: 960, elements: !247)
!247 = !{!248, !250, !251, !258, !259, !260, !265}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !172, line: 441, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !246, file: !172, line: 441, baseType: !249, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !246, file: !172, line: 443, baseType: !252, size: 128, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !253, line: 71, baseType: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !253, line: 69, size: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !254, file: !253, line: 70, baseType: !234, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !254, file: !253, line: 70, baseType: !234, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !246, file: !172, line: 445, baseType: !76, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !246, file: !172, line: 446, baseType: !76, size: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !172, line: 447, baseType: !261, size: 512, offset: 320)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 512, elements: !263)
!262 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !{!264}
!264 = !DISubrange(count: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !246, file: !172, line: 449, baseType: !266, size: 128, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !267, line: 347, baseType: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !267, line: 340, size: 128, elements: !269)
!269 = !{!270, !274, !275, !276, !278}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !268, file: !267, line: 341, baseType: !271, size: 32)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 32, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 4)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !268, file: !267, line: 342, baseType: !271, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !268, file: !267, line: 343, baseType: !271, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !267, line: 345, baseType: !277, size: 16, offset: 96)
!277 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !268, file: !267, line: 346, baseType: !277, size: 16, offset: 112)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !238, file: !202, line: 440, baseType: !280, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !202, line: 386, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !202, line: 371, size: 2368, elements: !283)
!283 = !{!284, !285, !289, !290, !291, !292, !293}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !282, file: !202, line: 372, baseType: !252, size: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !282, file: !202, line: 377, baseType: !286, size: 2048, offset: 128)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 2048, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !282, file: !202, line: 378, baseType: !234, size: 64, offset: 2176)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !282, file: !202, line: 380, baseType: !235, size: 32, offset: 2240)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !282, file: !202, line: 381, baseType: !235, size: 32, offset: 2272)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !282, file: !202, line: 384, baseType: !76, size: 32, offset: 2304)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !202, line: 385, baseType: !76, size: 32, offset: 2336)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !238, file: !202, line: 442, baseType: !252, size: 128, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !238, file: !202, line: 445, baseType: !296, size: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !298, line: 133, baseType: !299)
!298 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !298, line: 117, size: 576, elements: !300)
!300 = !{!301, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !299, file: !298, line: 118, baseType: !302, size: 288)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 288, elements: !303)
!303 = !{!304, !304}
!304 = !DISubrange(count: 3)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !299, file: !298, line: 119, baseType: !235, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !299, file: !298, line: 119, baseType: !235, size: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !299, file: !298, line: 119, baseType: !235, size: 32, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !299, file: !298, line: 121, baseType: !262, size: 8, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !299, file: !298, line: 123, baseType: !262, size: 8, offset: 392)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !299, file: !298, line: 123, baseType: !262, size: 8, offset: 400)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !299, file: !298, line: 124, baseType: !262, size: 8, offset: 408)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !299, file: !298, line: 124, baseType: !262, size: 8, offset: 416)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !299, file: !298, line: 124, baseType: !262, size: 8, offset: 424)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !299, file: !298, line: 126, baseType: !262, size: 8, offset: 432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !299, file: !298, line: 128, baseType: !262, size: 8, offset: 440)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !299, file: !298, line: 129, baseType: !235, size: 32, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !299, file: !298, line: 130, baseType: !235, size: 32, offset: 480)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !299, file: !298, line: 130, baseType: !235, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !299, file: !298, line: 132, baseType: !271, size: 32, offset: 544)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !238, file: !202, line: 446, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !202, line: 430, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !202, line: 426, size: 128, elements: !324)
!324 = !{!325, !329, !330}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !323, file: !202, line: 427, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 64, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 2)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !202, line: 428, baseType: !76, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !323, file: !202, line: 429, baseType: !76, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !238, file: !202, line: 447, baseType: !7, size: 32, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !238, file: !202, line: 450, baseType: !235, size: 32, offset: 544)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !238, file: !202, line: 451, baseType: !277, size: 16, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !238, file: !202, line: 452, baseType: !277, size: 16, offset: 592)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !238, file: !202, line: 455, baseType: !76, size: 32, offset: 608)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !238, file: !202, line: 456, baseType: !337, size: 64, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !238, file: !202, line: 459, baseType: !76, size: 32, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !238, file: !202, line: 460, baseType: !340, size: 96, offset: 736)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 96, elements: !341)
!341 = !{!304}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !238, file: !202, line: 462, baseType: !235, size: 32, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !238, file: !202, line: 462, baseType: !235, size: 32, offset: 864)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceAction", file: !172, line: 605, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceAction", file: !172, line: 589, size: 2752, elements: !347)
!347 = !{!348, !362, !363, !364, !365, !366, !367, !2113, !2114, !2126, !2127, !2128, !2129}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !172, line: 590, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !351, line: 85, size: 448, elements: !352)
!351 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355, !356, !357, !358}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !351, line: 86, baseType: !349, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !351, line: 86, baseType: !349, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !350, file: !351, line: 87, baseType: !252, size: 128, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !350, file: !351, line: 88, baseType: !76, size: 32, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !350, file: !351, line: 89, baseType: !235, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !350, file: !351, line: 90, baseType: !359, size: 128, offset: 320)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 128, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !346, file: !172, line: 590, baseType: !349, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !346, file: !172, line: 591, baseType: !252, size: 128, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !346, file: !172, line: 592, baseType: !76, size: 32, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !346, file: !172, line: 593, baseType: !235, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !346, file: !172, line: 595, baseType: !359, size: 128, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !346, file: !172, line: 597, baseType: !368, size: 1280, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !369, line: 71, baseType: !370)
!369 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !369, line: 40, size: 1280, elements: !371)
!371 = !{!372, !381, !382, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !410, !411, !412, !415}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !370, file: !369, line: 41, baseType: !373, size: 128)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !374, line: 95, baseType: !375)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !374, line: 92, size: 128, elements: !376)
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !375, file: !374, line: 93, baseType: !235, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !375, file: !374, line: 93, baseType: !235, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !375, file: !374, line: 94, baseType: !235, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !375, file: !374, line: 94, baseType: !235, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !370, file: !369, line: 41, baseType: !373, size: 128, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !370, file: !369, line: 42, baseType: !383, size: 128, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !374, line: 89, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !374, line: 86, size: 128, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !384, file: !374, line: 87, baseType: !76, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !384, file: !374, line: 87, baseType: !76, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !384, file: !374, line: 88, baseType: !76, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !384, file: !374, line: 88, baseType: !76, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !370, file: !369, line: 42, baseType: !383, size: 128, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !370, file: !369, line: 43, baseType: !383, size: 128, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !370, file: !369, line: 45, baseType: !326, size: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !370, file: !369, line: 45, baseType: !326, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !370, file: !369, line: 46, baseType: !235, size: 32, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !370, file: !369, line: 46, baseType: !235, size: 32, offset: 800)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !370, file: !369, line: 48, baseType: !277, size: 16, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !370, file: !369, line: 49, baseType: !277, size: 16, offset: 848)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !370, file: !369, line: 51, baseType: !277, size: 16, offset: 864)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !370, file: !369, line: 52, baseType: !277, size: 16, offset: 880)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !370, file: !369, line: 53, baseType: !277, size: 16, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !369, line: 55, baseType: !277, size: 16, offset: 912)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !370, file: !369, line: 56, baseType: !277, size: 16, offset: 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !370, file: !369, line: 58, baseType: !277, size: 16, offset: 944)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !370, file: !369, line: 58, baseType: !277, size: 16, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !370, file: !369, line: 59, baseType: !277, size: 16, offset: 976)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !370, file: !369, line: 59, baseType: !277, size: 16, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !370, file: !369, line: 61, baseType: !277, size: 16, offset: 1008)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !370, file: !369, line: 63, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !370, file: !369, line: 64, baseType: !76, size: 32, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !370, file: !369, line: 65, baseType: !76, size: 32, offset: 1120)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !370, file: !369, line: 68, baseType: !413, size: 64, offset: 1152)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !369, line: 68, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !370, file: !369, line: 69, baseType: !416, size: 64, offset: 1216)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !418, line: 490, size: 768, elements: !419)
!418 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!419 = !{!420, !421, !422, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !418, line: 491, baseType: !416, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !418, line: 491, baseType: !416, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !417, file: !418, line: 493, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !47, line: 169, size: 2048, elements: !425)
!425 = !{!426, !427, !428, !429, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2079, !2082, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !47, line: 170, baseType: !423, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !47, line: 170, baseType: !423, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !424, file: !47, line: 172, baseType: !234, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !424, file: !47, line: 174, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !432, line: 49, size: 1984, elements: !433)
!432 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!433 = !{!434, !493, !494, !495, !496, !497, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !431, file: !432, line: 50, baseType: !435, size: 960)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !436, line: 130, baseType: !437)
!436 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !436, line: 117, size: 960, elements: !438)
!438 = !{!439, !440, !441, !443, !462, !466, !467, !468, !469, !470}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !436, line: 118, baseType: !234, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !436, line: 118, baseType: !234, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !437, file: !436, line: 119, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !437, file: !436, line: 120, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !436, line: 136, size: 17600, elements: !446)
!446 = !{!447, !448, !450, !453, !457, !458, !459}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !445, file: !436, line: 137, baseType: !435, size: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !445, file: !436, line: 138, baseType: !449, size: 64, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !445, file: !436, line: 139, baseType: !451, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !436, line: 43, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !436, line: 140, baseType: !454, size: 8192, offset: 1088)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 8192, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !445, file: !436, line: 141, baseType: !454, size: 8192, offset: 9280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !445, file: !436, line: 148, baseType: !444, size: 64, offset: 17472)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !445, file: !436, line: 150, baseType: !460, size: 64, offset: 17536)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !436, line: 45, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !437, file: !436, line: 121, baseType: !463, size: 528, offset: 256)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 528, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 66)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !437, file: !436, line: 126, baseType: !277, size: 16, offset: 784)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !437, file: !436, line: 127, baseType: !76, size: 32, offset: 800)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !437, file: !436, line: 128, baseType: !76, size: 32, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !437, file: !436, line: 128, baseType: !76, size: 32, offset: 864)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !437, file: !436, line: 129, baseType: !471, size: 64, offset: 896)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !436, line: 75, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !436, line: 62, size: 1024, elements: !474)
!474 = !{!475, !477, !478, !479, !480, !481, !482, !483, !491, !492}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !436, line: 63, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !473, file: !436, line: 63, baseType: !476, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !436, line: 64, baseType: !262, size: 8, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !473, file: !436, line: 64, baseType: !262, size: 8, offset: 136)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !473, file: !436, line: 65, baseType: !277, size: 16, offset: 144)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !436, line: 66, baseType: !261, size: 512, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !473, file: !436, line: 67, baseType: !76, size: 32, offset: 672)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !473, file: !436, line: 69, baseType: !484, size: 256, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !436, line: 60, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !436, line: 48, size: 256, elements: !486)
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !485, file: !436, line: 49, baseType: !234, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !485, file: !436, line: 58, baseType: !252, size: 128, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !485, file: !436, line: 59, baseType: !76, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !485, file: !436, line: 59, baseType: !76, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !473, file: !436, line: 70, baseType: !76, size: 32, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !473, file: !436, line: 74, baseType: !76, size: 32, offset: 992)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !431, file: !432, line: 52, baseType: !252, size: 128, offset: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !431, file: !432, line: 53, baseType: !252, size: 128, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !431, file: !432, line: 54, baseType: !252, size: 128, offset: 1216)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !431, file: !432, line: 55, baseType: !252, size: 128, offset: 1344)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !431, file: !432, line: 57, baseType: !498, size: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !500, line: 1216, size: 39680, elements: !501)
!500 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!501 = !{!502, !503, !571, !849, !852, !853, !854, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !880, !945, !1378, !1593, !1596, !1877, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1899, !1900, !1901, !1902, !1903, !1911, !1978, !1985, !1986, !1993, !1994, !1995, !1996, !1997, !1998, !1999}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !499, file: !500, line: 1217, baseType: !435, size: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !499, file: !500, line: 1218, baseType: !504, size: 64, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !202, line: 838, size: 768, elements: !506)
!506 = !{!507, !521, !522, !532, !533, !564, !565, !566, !567, !568, !569, !570}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !505, file: !202, line: 840, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !172, line: 499, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !172, line: 486, size: 1600, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !510, file: !172, line: 487, baseType: !435, size: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !510, file: !172, line: 489, baseType: !252, size: 128, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !510, file: !172, line: 490, baseType: !252, size: 128, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !510, file: !172, line: 491, baseType: !252, size: 128, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !510, file: !172, line: 492, baseType: !252, size: 128, offset: 1344)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !172, line: 494, baseType: !76, size: 32, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !510, file: !172, line: 495, baseType: !76, size: 32, offset: 1504)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !510, file: !172, line: 497, baseType: !76, size: 32, offset: 1536)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !510, file: !172, line: 498, baseType: !76, size: 32, offset: 1568)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !505, file: !202, line: 844, baseType: !508, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !505, file: !202, line: 848, baseType: !523, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !202, line: 549, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !202, line: 544, size: 320, elements: !526)
!526 = !{!527, !529, !530, !531}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !202, line: 545, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !525, file: !202, line: 545, baseType: !528, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !525, file: !202, line: 547, baseType: !508, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !525, file: !202, line: 548, baseType: !252, size: 128, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !505, file: !202, line: 851, baseType: !252, size: 128, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !505, file: !202, line: 853, baseType: !534, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !202, line: 594, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !202, line: 561, size: 1664, elements: !537)
!537 = !{!538, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !202, line: 562, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !536, file: !202, line: 562, baseType: !539, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !536, file: !202, line: 564, baseType: !252, size: 128, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !536, file: !202, line: 565, baseType: !508, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !536, file: !202, line: 566, baseType: !523, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !536, file: !202, line: 568, baseType: !252, size: 128, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !536, file: !202, line: 569, baseType: !252, size: 128, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !536, file: !202, line: 571, baseType: !261, size: 512, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !536, file: !202, line: 573, baseType: !235, size: 32, offset: 1152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !536, file: !202, line: 574, baseType: !235, size: 32, offset: 1184)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !536, file: !202, line: 576, baseType: !235, size: 32, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !536, file: !202, line: 576, baseType: !235, size: 32, offset: 1248)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !536, file: !202, line: 577, baseType: !235, size: 32, offset: 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !536, file: !202, line: 577, baseType: !235, size: 32, offset: 1312)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !536, file: !202, line: 579, baseType: !235, size: 32, offset: 1344)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !536, file: !202, line: 580, baseType: !235, size: 32, offset: 1376)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !536, file: !202, line: 582, baseType: !235, size: 32, offset: 1408)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !536, file: !202, line: 582, baseType: !235, size: 32, offset: 1440)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !536, file: !202, line: 583, baseType: !277, size: 16, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !536, file: !202, line: 585, baseType: !277, size: 16, offset: 1488)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !536, file: !202, line: 586, baseType: !277, size: 16, offset: 1504)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !536, file: !202, line: 588, baseType: !277, size: 16, offset: 1520)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !536, file: !202, line: 590, baseType: !234, size: 64, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !202, line: 592, baseType: !76, size: 32, offset: 1600)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !536, file: !202, line: 593, baseType: !76, size: 32, offset: 1632)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !505, file: !202, line: 858, baseType: !252, size: 128, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !505, file: !202, line: 859, baseType: !252, size: 128, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !202, line: 862, baseType: !76, size: 32, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !505, file: !202, line: 863, baseType: !76, size: 32, offset: 672)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !505, file: !202, line: 866, baseType: !277, size: 16, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !505, file: !202, line: 867, baseType: !277, size: 16, offset: 720)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !505, file: !202, line: 868, baseType: !235, size: 32, offset: 736)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !499, file: !500, line: 1220, baseType: !572, size: 64, offset: 1024)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !574, line: 115, size: 11392, elements: !575)
!574 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!575 = !{!576, !577, !578, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !596, !605, !607, !608, !649, !650, !661, !662, !678, !679, !680, !681, !682, !683, !684, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !701, !702, !703, !704, !705, !706, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !766, !767, !768, !769, !770, !771, !772, !773, !774, !777, !780, !783, !784, !785, !786, !787, !790, !793, !796, !797, !803, !804, !805, !806, !807, !808, !810, !813, !816, !817, !837, !838}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !573, file: !574, line: 116, baseType: !435, size: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !573, file: !574, line: 117, baseType: !504, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !573, file: !574, line: 119, baseType: !579, size: 64, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !574, line: 57, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !574, line: 121, baseType: !277, size: 16, offset: 1088)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !573, file: !574, line: 121, baseType: !277, size: 16, offset: 1104)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !573, file: !574, line: 122, baseType: !76, size: 32, offset: 1120)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !573, file: !574, line: 122, baseType: !76, size: 32, offset: 1152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !573, file: !574, line: 122, baseType: !76, size: 32, offset: 1184)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !573, file: !574, line: 123, baseType: !261, size: 512, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !573, file: !574, line: 124, baseType: !572, size: 64, offset: 1728)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !573, file: !574, line: 124, baseType: !572, size: 64, offset: 1792)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !573, file: !574, line: 127, baseType: !572, size: 64, offset: 1856)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !573, file: !574, line: 127, baseType: !572, size: 64, offset: 1920)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !573, file: !574, line: 127, baseType: !572, size: 64, offset: 1984)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !573, file: !574, line: 128, baseType: !593, size: 64, offset: 2048)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !595, line: 46, flags: DIFlagFwdDecl)
!595 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !573, file: !574, line: 130, baseType: !597, size: 64, offset: 2112)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !574, line: 97, size: 832, elements: !599)
!599 = !{!600, !603, !604}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !598, file: !574, line: 98, baseType: !601, size: 768)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 768, elements: !602)
!602 = !{!361, !304}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !574, line: 99, baseType: !76, size: 32, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !598, file: !574, line: 99, baseType: !76, size: 32, offset: 800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !573, file: !574, line: 131, baseType: !606, size: 64, offset: 2176)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !573, file: !574, line: 132, baseType: !606, size: 64, offset: 2240)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !573, file: !574, line: 133, baseType: !609, size: 64, offset: 2304)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !172, line: 334, size: 1728, elements: !611)
!611 = !{!612, !613, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !648}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !610, file: !172, line: 335, baseType: !252, size: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !610, file: !172, line: 336, baseType: !614, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !172, line: 47, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !172, line: 338, baseType: !277, size: 16, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !610, file: !172, line: 338, baseType: !277, size: 16, offset: 208)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !610, file: !172, line: 339, baseType: !7, size: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !610, file: !172, line: 340, baseType: !76, size: 32, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !610, file: !172, line: 342, baseType: !235, size: 32, offset: 288)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !610, file: !172, line: 343, baseType: !340, size: 96, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !610, file: !172, line: 344, baseType: !340, size: 96, offset: 416)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !610, file: !172, line: 347, baseType: !252, size: 128, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !610, file: !172, line: 349, baseType: !76, size: 32, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !610, file: !172, line: 350, baseType: !76, size: 32, offset: 672)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !610, file: !172, line: 351, baseType: !234, size: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !610, file: !172, line: 352, baseType: !234, size: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !610, file: !172, line: 354, baseType: !629, size: 384, offset: 832)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !172, line: 116, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !172, line: 94, size: 384, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !630, file: !172, line: 96, baseType: !76, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !630, file: !172, line: 96, baseType: !76, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !630, file: !172, line: 97, baseType: !76, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !630, file: !172, line: 97, baseType: !76, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !630, file: !172, line: 99, baseType: !277, size: 16, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !630, file: !172, line: 100, baseType: !277, size: 16, offset: 144)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !630, file: !172, line: 102, baseType: !277, size: 16, offset: 160)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !630, file: !172, line: 105, baseType: !277, size: 16, offset: 176)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !630, file: !172, line: 108, baseType: !277, size: 16, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !630, file: !172, line: 109, baseType: !277, size: 16, offset: 208)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !630, file: !172, line: 111, baseType: !277, size: 16, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !630, file: !172, line: 112, baseType: !277, size: 16, offset: 240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !630, file: !172, line: 114, baseType: !76, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !630, file: !172, line: 114, baseType: !76, size: 32, offset: 288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !630, file: !172, line: 115, baseType: !76, size: 32, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !630, file: !172, line: 115, baseType: !76, size: 32, offset: 352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !610, file: !172, line: 355, baseType: !261, size: 512, offset: 1216)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !573, file: !574, line: 134, baseType: !234, size: 64, offset: 2368)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !573, file: !574, line: 136, baseType: !651, size: 64, offset: 2432)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !653, line: 130, size: 1216, elements: !654)
!653 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!654 = !{!655, !656, !657, !658, !659, !660}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !652, file: !653, line: 131, baseType: !435, size: 960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !652, file: !653, line: 134, baseType: !252, size: 128, offset: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !652, file: !653, line: 135, baseType: !76, size: 32, offset: 1088)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !652, file: !653, line: 141, baseType: !277, size: 16, offset: 1120)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !652, file: !653, line: 142, baseType: !277, size: 16, offset: 1136)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !652, file: !653, line: 143, baseType: !234, size: 64, offset: 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !573, file: !574, line: 138, baseType: !629, size: 384, offset: 2496)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !573, file: !574, line: 139, baseType: !663, size: 64, offset: 2880)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !172, line: 80, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !172, line: 72, size: 192, elements: !666)
!666 = !{!667, !674, !675, !676, !677}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !665, file: !172, line: 73, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !172, line: 59, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !172, line: 56, size: 128, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !670, file: !172, line: 57, baseType: !340, size: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !670, file: !172, line: 58, baseType: !76, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !665, file: !172, line: 74, baseType: !76, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !665, file: !172, line: 76, baseType: !76, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !665, file: !172, line: 77, baseType: !76, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !665, file: !172, line: 79, baseType: !76, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !573, file: !574, line: 141, baseType: !252, size: 128, offset: 2944)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !573, file: !574, line: 142, baseType: !252, size: 128, offset: 3072)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !573, file: !574, line: 143, baseType: !252, size: 128, offset: 3200)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !573, file: !574, line: 144, baseType: !252, size: 128, offset: 3328)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !573, file: !574, line: 146, baseType: !76, size: 32, offset: 3456)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !573, file: !574, line: 147, baseType: !76, size: 32, offset: 3488)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !573, file: !574, line: 150, baseType: !685, size: 64, offset: 3520)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !298, line: 46, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !573, file: !574, line: 151, baseType: !337, size: 64, offset: 3584)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !573, file: !574, line: 152, baseType: !76, size: 32, offset: 3648)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !573, file: !574, line: 153, baseType: !76, size: 32, offset: 3680)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !573, file: !574, line: 156, baseType: !340, size: 96, offset: 3712)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !573, file: !574, line: 156, baseType: !340, size: 96, offset: 3808)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !573, file: !574, line: 156, baseType: !340, size: 96, offset: 3904)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !573, file: !574, line: 157, baseType: !340, size: 96, offset: 4000)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !573, file: !574, line: 158, baseType: !340, size: 96, offset: 4096)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !573, file: !574, line: 159, baseType: !340, size: 96, offset: 4192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !573, file: !574, line: 160, baseType: !340, size: 96, offset: 4288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !573, file: !574, line: 160, baseType: !340, size: 96, offset: 4384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !573, file: !574, line: 161, baseType: !700, size: 128, offset: 4480)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 128, elements: !272)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !573, file: !574, line: 161, baseType: !700, size: 128, offset: 4608)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !573, file: !574, line: 162, baseType: !340, size: 96, offset: 4736)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !573, file: !574, line: 162, baseType: !340, size: 96, offset: 4832)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !573, file: !574, line: 163, baseType: !235, size: 32, offset: 4928)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !573, file: !574, line: 163, baseType: !235, size: 32, offset: 4960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !573, file: !574, line: 164, baseType: !707, size: 512, offset: 4992)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 512, elements: !708)
!708 = !{!273, !273}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !573, file: !574, line: 165, baseType: !707, size: 512, offset: 5504)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !573, file: !574, line: 166, baseType: !707, size: 512, offset: 6016)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !573, file: !574, line: 167, baseType: !707, size: 512, offset: 6528)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !573, file: !574, line: 176, baseType: !707, size: 512, offset: 7040)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !573, file: !574, line: 178, baseType: !7, size: 32, offset: 7552)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !573, file: !574, line: 180, baseType: !277, size: 16, offset: 7584)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !573, file: !574, line: 181, baseType: !277, size: 16, offset: 7600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !573, file: !574, line: 183, baseType: !277, size: 16, offset: 7616)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !573, file: !574, line: 183, baseType: !277, size: 16, offset: 7632)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !573, file: !574, line: 184, baseType: !277, size: 16, offset: 7648)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !573, file: !574, line: 184, baseType: !277, size: 16, offset: 7664)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !573, file: !574, line: 185, baseType: !277, size: 16, offset: 7680)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !573, file: !574, line: 186, baseType: !277, size: 16, offset: 7696)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !573, file: !574, line: 187, baseType: !277, size: 16, offset: 7712)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !573, file: !574, line: 188, baseType: !262, size: 8, offset: 7728)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !573, file: !574, line: 189, baseType: !262, size: 8, offset: 7736)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !573, file: !574, line: 192, baseType: !76, size: 32, offset: 7744)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !573, file: !574, line: 192, baseType: !76, size: 32, offset: 7776)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !573, file: !574, line: 192, baseType: !76, size: 32, offset: 7808)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !573, file: !574, line: 192, baseType: !76, size: 32, offset: 7840)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !573, file: !574, line: 194, baseType: !76, size: 32, offset: 7872)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !573, file: !574, line: 202, baseType: !235, size: 32, offset: 7904)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !573, file: !574, line: 202, baseType: !235, size: 32, offset: 7936)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !573, file: !574, line: 202, baseType: !235, size: 32, offset: 7968)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !573, file: !574, line: 211, baseType: !235, size: 32, offset: 8000)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !573, file: !574, line: 212, baseType: !235, size: 32, offset: 8032)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !573, file: !574, line: 213, baseType: !235, size: 32, offset: 8064)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !573, file: !574, line: 214, baseType: !235, size: 32, offset: 8096)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !573, file: !574, line: 215, baseType: !235, size: 32, offset: 8128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !573, file: !574, line: 216, baseType: !235, size: 32, offset: 8160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !573, file: !574, line: 219, baseType: !235, size: 32, offset: 8192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !573, file: !574, line: 220, baseType: !235, size: 32, offset: 8224)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !573, file: !574, line: 221, baseType: !235, size: 32, offset: 8256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !573, file: !574, line: 224, baseType: !743, size: 16, offset: 8288)
!743 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !573, file: !574, line: 224, baseType: !743, size: 16, offset: 8304)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !573, file: !574, line: 226, baseType: !277, size: 16, offset: 8320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !573, file: !574, line: 228, baseType: !262, size: 8, offset: 8336)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !573, file: !574, line: 229, baseType: !262, size: 8, offset: 8344)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !573, file: !574, line: 231, baseType: !277, size: 16, offset: 8352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !573, file: !574, line: 232, baseType: !262, size: 8, offset: 8368)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !573, file: !574, line: 233, baseType: !262, size: 8, offset: 8376)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !573, file: !574, line: 234, baseType: !235, size: 32, offset: 8384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !573, file: !574, line: 235, baseType: !235, size: 32, offset: 8416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !573, file: !574, line: 237, baseType: !252, size: 128, offset: 8448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !573, file: !574, line: 238, baseType: !252, size: 128, offset: 8576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !573, file: !574, line: 239, baseType: !252, size: 128, offset: 8704)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !573, file: !574, line: 240, baseType: !252, size: 128, offset: 8832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !573, file: !574, line: 242, baseType: !235, size: 32, offset: 8960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !573, file: !574, line: 244, baseType: !277, size: 16, offset: 8992)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !573, file: !574, line: 245, baseType: !743, size: 16, offset: 9008)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !573, file: !574, line: 246, baseType: !700, size: 128, offset: 9024)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !573, file: !574, line: 248, baseType: !76, size: 32, offset: 9152)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !573, file: !574, line: 249, baseType: !76, size: 32, offset: 9184)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !573, file: !574, line: 251, baseType: !764, size: 64, offset: 9216)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !574, line: 251, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !573, file: !574, line: 253, baseType: !262, size: 8, offset: 9280)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !573, file: !574, line: 254, baseType: !262, size: 8, offset: 9288)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !573, file: !574, line: 255, baseType: !277, size: 16, offset: 9296)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !573, file: !574, line: 256, baseType: !340, size: 96, offset: 9312)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !573, file: !574, line: 258, baseType: !252, size: 128, offset: 9408)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !573, file: !574, line: 259, baseType: !252, size: 128, offset: 9536)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !573, file: !574, line: 260, baseType: !252, size: 128, offset: 9664)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !573, file: !574, line: 261, baseType: !252, size: 128, offset: 9792)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !573, file: !574, line: 263, baseType: !775, size: 64, offset: 9920)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !574, line: 52, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !573, file: !574, line: 264, baseType: !778, size: 64, offset: 9984)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !574, line: 53, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !573, file: !574, line: 265, baseType: !781, size: 64, offset: 10048)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !172, line: 46, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !573, file: !574, line: 267, baseType: !262, size: 8, offset: 10112)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !573, file: !574, line: 268, baseType: !262, size: 8, offset: 10120)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !573, file: !574, line: 269, baseType: !277, size: 16, offset: 10128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !573, file: !574, line: 270, baseType: !235, size: 32, offset: 10144)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !573, file: !574, line: 272, baseType: !788, size: 64, offset: 10176)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !574, line: 54, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !573, file: !574, line: 275, baseType: !791, size: 64, offset: 10240)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !574, line: 275, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !573, file: !574, line: 277, baseType: !794, size: 64, offset: 10304)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !574, line: 56, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !573, file: !574, line: 277, baseType: !794, size: 64, offset: 10368)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !573, file: !574, line: 278, baseType: !798, size: 64, offset: 10432)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !799, line: 27, baseType: !800)
!799 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !801, line: 45, baseType: !802)
!801 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!802 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !573, file: !574, line: 279, baseType: !798, size: 64, offset: 10496)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !573, file: !574, line: 280, baseType: !7, size: 32, offset: 10560)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !573, file: !574, line: 281, baseType: !7, size: 32, offset: 10592)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !573, file: !574, line: 283, baseType: !252, size: 128, offset: 10624)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !573, file: !574, line: 284, baseType: !252, size: 128, offset: 10752)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !573, file: !574, line: 285, baseType: !809, size: 64, offset: 10880)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !573, file: !574, line: 287, baseType: !811, size: 64, offset: 10944)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !574, line: 59, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !573, file: !574, line: 288, baseType: !814, size: 64, offset: 11008)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !574, line: 288, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !573, file: !574, line: 290, baseType: !326, size: 64, offset: 11072)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !573, file: !574, line: 291, baseType: !818, size: 64, offset: 11136)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !820, line: 65, baseType: !821)
!820 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !820, line: 50, size: 320, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !821, file: !820, line: 51, baseType: !498, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !821, file: !820, line: 53, baseType: !76, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !821, file: !820, line: 54, baseType: !76, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !821, file: !820, line: 55, baseType: !76, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !821, file: !820, line: 55, baseType: !76, size: 32, offset: 160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !821, file: !820, line: 56, baseType: !262, size: 8, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !821, file: !820, line: 56, baseType: !262, size: 8, offset: 200)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !821, file: !820, line: 57, baseType: !262, size: 8, offset: 208)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !821, file: !820, line: 57, baseType: !262, size: 8, offset: 216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !821, file: !820, line: 59, baseType: !277, size: 16, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !821, file: !820, line: 59, baseType: !277, size: 16, offset: 240)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !821, file: !820, line: 59, baseType: !277, size: 16, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !820, line: 61, baseType: !277, size: 16, offset: 272)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !821, file: !820, line: 63, baseType: !76, size: 32, offset: 288)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !573, file: !574, line: 293, baseType: !252, size: 128, offset: 11200)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !573, file: !574, line: 294, baseType: !839, size: 64, offset: 11328)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !574, line: 113, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !574, line: 108, size: 256, elements: !842)
!842 = !{!843, !845, !846, !847, !848}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !574, line: 109, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !841, file: !574, line: 109, baseType: !844, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !841, file: !574, line: 110, baseType: !572, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !841, file: !574, line: 111, baseType: !76, size: 32, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !841, file: !574, line: 112, baseType: !235, size: 32, offset: 224)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !499, file: !500, line: 1221, baseType: !850, size: 64, offset: 1088)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !500, line: 52, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !499, file: !500, line: 1223, baseType: !498, size: 64, offset: 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !499, file: !500, line: 1225, baseType: !252, size: 128, offset: 1216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !499, file: !500, line: 1226, baseType: !855, size: 64, offset: 1344)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !500, line: 69, size: 320, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !500, line: 70, baseType: !855, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !856, file: !500, line: 70, baseType: !855, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !856, file: !500, line: 71, baseType: !7, size: 32, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !856, file: !500, line: 71, baseType: !7, size: 32, offset: 160)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !856, file: !500, line: 72, baseType: !76, size: 32, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !856, file: !500, line: 73, baseType: !277, size: 16, offset: 224)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !856, file: !500, line: 73, baseType: !277, size: 16, offset: 240)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !856, file: !500, line: 74, baseType: !572, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !499, file: !500, line: 1227, baseType: !572, size: 64, offset: 1408)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !499, file: !500, line: 1229, baseType: !340, size: 96, offset: 1472)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !499, file: !500, line: 1230, baseType: !340, size: 96, offset: 1568)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !499, file: !500, line: 1231, baseType: !340, size: 96, offset: 1664)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !499, file: !500, line: 1231, baseType: !340, size: 96, offset: 1760)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !499, file: !500, line: 1233, baseType: !7, size: 32, offset: 1856)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !499, file: !500, line: 1234, baseType: !76, size: 32, offset: 1888)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !499, file: !500, line: 1235, baseType: !7, size: 32, offset: 1920)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !499, file: !500, line: 1237, baseType: !277, size: 16, offset: 1952)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !499, file: !500, line: 1239, baseType: !262, size: 8, offset: 1968)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !499, file: !500, line: 1240, baseType: !877, size: 8, offset: 1976)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 8, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 1)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !499, file: !500, line: 1242, baseType: !881, size: 64, offset: 1984)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !883, line: 328, size: 3456, elements: !884)
!883 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!884 = !{!885, !886, !887, !890, !891, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !916, !921, !922, !925, !929, !933, !937, !941, !942, !943, !944}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !882, file: !883, line: 329, baseType: !435, size: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !882, file: !883, line: 330, baseType: !504, size: 64, offset: 960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !882, file: !883, line: 332, baseType: !888, size: 64, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !883, line: 332, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !882, file: !883, line: 333, baseType: !261, size: 512, offset: 1088)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !882, file: !883, line: 335, baseType: !892, size: 64, offset: 1600)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !6, line: 41, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !882, file: !883, line: 337, baseType: !651, size: 64, offset: 1664)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !882, file: !883, line: 338, baseType: !326, size: 64, offset: 1728)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !882, file: !883, line: 340, baseType: !252, size: 128, offset: 1792)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !882, file: !883, line: 340, baseType: !252, size: 128, offset: 1920)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !883, line: 342, baseType: !76, size: 32, offset: 2048)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !882, file: !883, line: 342, baseType: !76, size: 32, offset: 2080)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !882, file: !883, line: 343, baseType: !76, size: 32, offset: 2112)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !882, file: !883, line: 345, baseType: !76, size: 32, offset: 2144)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !882, file: !883, line: 346, baseType: !76, size: 32, offset: 2176)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !882, file: !883, line: 347, baseType: !277, size: 16, offset: 2208)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !882, file: !883, line: 348, baseType: !277, size: 16, offset: 2224)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !882, file: !883, line: 349, baseType: !76, size: 32, offset: 2240)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !882, file: !883, line: 351, baseType: !76, size: 32, offset: 2272)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !882, file: !883, line: 353, baseType: !277, size: 16, offset: 2304)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !882, file: !883, line: 354, baseType: !277, size: 16, offset: 2320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !882, file: !883, line: 355, baseType: !76, size: 32, offset: 2336)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !882, file: !883, line: 357, baseType: !373, size: 128, offset: 2368)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !882, file: !883, line: 363, baseType: !252, size: 128, offset: 2496)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !882, file: !883, line: 363, baseType: !252, size: 128, offset: 2624)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !882, file: !883, line: 368, baseType: !914, size: 64, offset: 2752)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !883, line: 48, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !882, file: !883, line: 372, baseType: !917, size: 32, offset: 2816)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !883, line: 274, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !883, line: 271, size: 32, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !918, file: !883, line: 273, baseType: !7, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !882, file: !883, line: 373, baseType: !76, size: 32, offset: 2848)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !882, file: !883, line: 382, baseType: !923, size: 64, offset: 2880)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !883, line: 46, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !882, file: !883, line: 385, baseType: !926, size: 64, offset: 2944)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !234, !235}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !882, file: !883, line: 386, baseType: !930, size: 64, offset: 3008)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !234, !337}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !882, file: !883, line: 387, baseType: !934, size: 64, offset: 3072)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!76, !234}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !882, file: !883, line: 388, baseType: !938, size: 64, offset: 3136)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !234}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !882, file: !883, line: 389, baseType: !234, size: 64, offset: 3200)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !882, file: !883, line: 389, baseType: !234, size: 64, offset: 3264)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !882, file: !883, line: 389, baseType: !234, size: 64, offset: 3328)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !882, file: !883, line: 389, baseType: !234, size: 64, offset: 3392)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !499, file: !500, line: 1244, baseType: !946, size: 64, offset: 2048)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !948, line: 200, size: 17024, elements: !949)
!948 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!949 = !{!950, !951, !952, !953, !1371, !1372, !1373, !1374, !1375, !1376, !1377}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !947, file: !948, line: 201, baseType: !809, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !947, file: !948, line: 202, baseType: !252, size: 128, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !947, file: !948, line: 203, baseType: !252, size: 128, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !947, file: !948, line: 206, baseType: !954, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !948, line: 190, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !948, line: 126, size: 2816, elements: !957)
!957 = !{!958, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !1053, !1054, !1055, !1056, !1333, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1370}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !948, line: 127, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !956, file: !948, line: 127, baseType: !959, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !956, file: !948, line: 128, baseType: !234, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !956, file: !948, line: 129, baseType: !234, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !956, file: !948, line: 130, baseType: !261, size: 512, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !956, file: !948, line: 132, baseType: !76, size: 32, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !956, file: !948, line: 132, baseType: !76, size: 32, offset: 800)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !956, file: !948, line: 133, baseType: !76, size: 32, offset: 832)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !956, file: !948, line: 134, baseType: !76, size: 32, offset: 864)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !956, file: !948, line: 134, baseType: !76, size: 32, offset: 896)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !956, file: !948, line: 134, baseType: !76, size: 32, offset: 928)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !956, file: !948, line: 135, baseType: !76, size: 32, offset: 960)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !956, file: !948, line: 135, baseType: !76, size: 32, offset: 992)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !956, file: !948, line: 136, baseType: !76, size: 32, offset: 1024)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !956, file: !948, line: 136, baseType: !76, size: 32, offset: 1056)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !956, file: !948, line: 137, baseType: !76, size: 32, offset: 1088)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !956, file: !948, line: 137, baseType: !76, size: 32, offset: 1120)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !956, file: !948, line: 138, baseType: !235, size: 32, offset: 1152)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !956, file: !948, line: 139, baseType: !235, size: 32, offset: 1184)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !956, file: !948, line: 139, baseType: !235, size: 32, offset: 1216)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !956, file: !948, line: 141, baseType: !277, size: 16, offset: 1248)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !956, file: !948, line: 142, baseType: !277, size: 16, offset: 1264)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !956, file: !948, line: 143, baseType: !76, size: 32, offset: 1280)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !956, file: !948, line: 144, baseType: !76, size: 32, offset: 1312)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !956, file: !948, line: 146, baseType: !984, size: 64, offset: 1344)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !948, line: 114, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !948, line: 99, size: 7232, elements: !987)
!987 = !{!988, !990, !991, !992, !993, !994, !995, !1003, !1007, !1021, !1030, !1037, !1047}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !948, line: 100, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !986, file: !948, line: 100, baseType: !989, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !986, file: !948, line: 101, baseType: !76, size: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !986, file: !948, line: 101, baseType: !76, size: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !986, file: !948, line: 102, baseType: !76, size: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !986, file: !948, line: 102, baseType: !76, size: 32, offset: 224)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !986, file: !948, line: 103, baseType: !996, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !948, line: 59, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !948, line: 56, size: 2112, elements: !999)
!999 = !{!1000, !1001, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !948, line: 57, baseType: !286, size: 2048)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !998, file: !948, line: 58, baseType: !76, size: 32, offset: 2048)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !998, file: !948, line: 58, baseType: !76, size: 32, offset: 2080)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !986, file: !948, line: 106, baseType: !1004, size: 6144, offset: 320)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 6144, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 768)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !986, file: !948, line: 107, baseType: !1008, size: 64, offset: 6464)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !948, line: 97, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !948, line: 83, size: 8320, elements: !1011)
