; ModuleID = 'blender/source/blender/blenloader/intern/versioning_defaults.c'
source_filename = "blender/source/blender/blenloader/intern/versioning_defaults.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!69 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!70 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!72 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!73 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!74 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!75 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceClip_Flag", file: !60, line: 1113, baseType: !37, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!86 = !DIEnumerator(name: "SC_SHOW_MARKER_PATTERN", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "SC_SHOW_MARKER_SEARCH", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "SC_LOCK_SELECTION", value: 4, isUnsigned: true)
!89 = !DIEnumerator(name: "SC_SHOW_TINY_MARKER", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "SC_SHOW_TRACK_PATH", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "SC_SHOW_BUNDLES", value: 32, isUnsigned: true)
!92 = !DIEnumerator(name: "SC_MUTE_FOOTAGE", value: 64, isUnsigned: true)
!93 = !DIEnumerator(name: "SC_HIDE_DISABLED", value: 128, isUnsigned: true)
!94 = !DIEnumerator(name: "SC_SHOW_NAMES", value: 256, isUnsigned: true)
!95 = !DIEnumerator(name: "SC_SHOW_GRID", value: 512, isUnsigned: true)
!96 = !DIEnumerator(name: "SC_SHOW_STABLE", value: 1024, isUnsigned: true)
!97 = !DIEnumerator(name: "SC_MANUAL_CALIBRATION", value: 2048, isUnsigned: true)
!98 = !DIEnumerator(name: "SC_SHOW_GPENCIL", value: 4096, isUnsigned: true)
!99 = !DIEnumerator(name: "SC_SHOW_FILTERS", value: 8192, isUnsigned: true)
!100 = !DIEnumerator(name: "SC_SHOW_GRAPH_FRAMES", value: 16384, isUnsigned: true)
!101 = !DIEnumerator(name: "SC_SHOW_GRAPH_TRACKS_MOTION", value: 32768, isUnsigned: true)
!102 = !DIEnumerator(name: "SC_LOCK_TIMECURSOR", value: 131072, isUnsigned: true)
!103 = !DIEnumerator(name: "SC_SHOW_SECONDS", value: 262144, isUnsigned: true)
!104 = !DIEnumerator(name: "SC_SHOW_GRAPH_SEL_ONLY", value: 524288, isUnsigned: true)
!105 = !DIEnumerator(name: "SC_SHOW_GRAPH_HIDDEN", value: 1048576, isUnsigned: true)
!106 = !DIEnumerator(name: "SC_SHOW_GRAPH_TRACKS_ERROR", value: 2097152, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushImagePaintTool", file: !108, line: 264, baseType: !37, size: 32, elements: !109)
!108 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = !{!110, !111, !112, !113, !114, !115}
!110 = !DIEnumerator(name: "PAINT_TOOL_DRAW", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "PAINT_TOOL_SOFTEN", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "PAINT_TOOL_SMEAR", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "PAINT_TOOL_CLONE", value: 3, isUnsigned: true)
!114 = !DIEnumerator(name: "PAINT_TOOL_FILL", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "PAINT_TOOL_MASK", value: 5, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !117, line: 666, baseType: !37, size: 32, elements: !118)
!117 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126}
!119 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!124 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!125 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!126 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!127 = !{!128, !150, !591}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !60, line: 1110, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !60, line: 1074, size: 3264, elements: !131)
!131 = !{!132, !156, !157, !158, !159, !160, !161, !162, !163, !164, !171, !539, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !60, line: 1075, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !60, line: 91, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !60, line: 85, size: 448, elements: !136)
!136 = !{!137, !139, !140, !148, !149, !151}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !60, line: 86, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !60, line: 86, baseType: !138, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !135, file: !60, line: 87, baseType: !141, size: 128, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !142, line: 71, baseType: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !142, line: 69, size: 128, elements: !144)
!144 = !{!145, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !143, file: !142, line: 70, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !143, file: !142, line: 70, baseType: !146, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !135, file: !60, line: 88, baseType: !5, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !135, file: !60, line: 89, baseType: !150, size: 32, offset: 288)
!150 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !135, file: !60, line: 90, baseType: !152, size: 128, offset: 320)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !154)
!153 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !130, file: !60, line: 1075, baseType: !133, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !130, file: !60, line: 1076, baseType: !141, size: 128, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !130, file: !60, line: 1077, baseType: !5, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !130, file: !60, line: 1079, baseType: !150, size: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !130, file: !60, line: 1079, baseType: !150, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !130, file: !60, line: 1080, baseType: !150, size: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !130, file: !60, line: 1080, baseType: !150, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !130, file: !60, line: 1081, baseType: !150, size: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !130, file: !60, line: 1083, baseType: !165, size: 64, offset: 448)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !166, line: 50, size: 64, elements: !167)
!166 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !165, file: !166, line: 51, baseType: !5, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !165, file: !166, line: 52, baseType: !153, size: 16, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !165, file: !166, line: 52, baseType: !153, size: 16, offset: 48)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !130, file: !60, line: 1084, baseType: !172, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !166, line: 64, size: 19136, elements: !174)
!174 = !{!175, !238, !242, !243, !244, !245, !249, !250, !251, !255, !258, !261, !522, !523, !534, !535, !536, !537, !538}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !166, line: 65, baseType: !176, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !177, line: 130, baseType: !178)
!177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !177, line: 117, size: 960, elements: !179)
!179 = !{!180, !181, !182, !184, !204, !208, !209, !210, !211, !212}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !177, line: 118, baseType: !146, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !177, line: 118, baseType: !146, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !178, file: !177, line: 119, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !178, file: !177, line: 120, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !177, line: 136, size: 17600, elements: !187)
!187 = !{!188, !189, !191, !194, !199, !200, !201}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !177, line: 137, baseType: !176, size: 960)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !186, file: !177, line: 138, baseType: !190, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !186, file: !177, line: 139, baseType: !192, size: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !177, line: 43, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !177, line: 140, baseType: !195, size: 8192, offset: 1088)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 8192, elements: !197)
!196 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !{!198}
!198 = !DISubrange(count: 1024)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !186, file: !177, line: 141, baseType: !195, size: 8192, offset: 9280)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !186, file: !177, line: 148, baseType: !185, size: 64, offset: 17472)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !186, file: !177, line: 150, baseType: !202, size: 64, offset: 17536)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !177, line: 45, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !177, line: 121, baseType: !205, size: 528, offset: 256)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 528, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 66)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !178, file: !177, line: 126, baseType: !153, size: 16, offset: 784)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !178, file: !177, line: 127, baseType: !5, size: 32, offset: 800)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !178, file: !177, line: 128, baseType: !5, size: 32, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !178, file: !177, line: 128, baseType: !5, size: 32, offset: 864)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !178, file: !177, line: 129, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !177, line: 75, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !177, line: 62, size: 1024, elements: !216)
!216 = !{!217, !219, !220, !221, !222, !223, !227, !228, !236, !237}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !177, line: 63, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !177, line: 63, baseType: !218, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !177, line: 64, baseType: !196, size: 8, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !215, file: !177, line: 64, baseType: !196, size: 8, offset: 136)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !177, line: 65, baseType: !153, size: 16, offset: 144)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !177, line: 66, baseType: !224, size: 512, offset: 160)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 512, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !215, file: !177, line: 67, baseType: !5, size: 32, offset: 672)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !177, line: 69, baseType: !229, size: 256, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !177, line: 60, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !177, line: 48, size: 256, elements: !231)
!231 = !{!232, !233, !234, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !230, file: !177, line: 49, baseType: !146, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !230, file: !177, line: 58, baseType: !141, size: 128, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !230, file: !177, line: 59, baseType: !5, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !230, file: !177, line: 59, baseType: !5, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !177, line: 70, baseType: !5, size: 32, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !215, file: !177, line: 74, baseType: !5, size: 32, offset: 992)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !173, file: !166, line: 66, baseType: !239, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !241, line: 45, flags: DIFlagFwdDecl)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !166, line: 68, baseType: !195, size: 8192, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !173, file: !166, line: 70, baseType: !5, size: 32, offset: 9216)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !173, file: !166, line: 71, baseType: !5, size: 32, offset: 9248)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !173, file: !166, line: 72, baseType: !246, size: 64, offset: 9280)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 2)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !173, file: !166, line: 74, baseType: !150, size: 32, offset: 9344)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !173, file: !166, line: 74, baseType: !150, size: 32, offset: 9376)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !173, file: !166, line: 76, baseType: !252, size: 64, offset: 9408)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !254, line: 41, flags: DIFlagFwdDecl)
!254 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !173, file: !166, line: 77, baseType: !256, size: 64, offset: 9472)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !166, line: 77, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !173, file: !166, line: 78, baseType: !259, size: 64, offset: 9536)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !36, line: 61, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !173, file: !166, line: 80, baseType: !262, size: 2624, offset: 9600)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !263, line: 340, size: 2624, elements: !264)
!263 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!264 = !{!265, !293, !312, !313, !314, !332, !393, !394, !499, !500, !501, !502, !511}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !262, file: !263, line: 341, baseType: !266, size: 576)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !263, line: 251, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !263, line: 207, size: 576, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !263, line: 208, baseType: !5, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !267, file: !263, line: 211, baseType: !153, size: 16, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !267, file: !263, line: 212, baseType: !153, size: 16, offset: 48)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !267, file: !263, line: 213, baseType: !150, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !267, file: !263, line: 214, baseType: !153, size: 16, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !267, file: !263, line: 215, baseType: !153, size: 16, offset: 112)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !267, file: !263, line: 216, baseType: !153, size: 16, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !267, file: !263, line: 217, baseType: !153, size: 16, offset: 144)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !267, file: !263, line: 218, baseType: !153, size: 16, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !267, file: !263, line: 219, baseType: !153, size: 16, offset: 176)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !267, file: !263, line: 220, baseType: !150, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !267, file: !263, line: 222, baseType: !153, size: 16, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !267, file: !263, line: 225, baseType: !153, size: 16, offset: 240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !267, file: !263, line: 228, baseType: !5, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !267, file: !263, line: 229, baseType: !5, size: 32, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !267, file: !263, line: 233, baseType: !5, size: 32, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !267, file: !263, line: 236, baseType: !153, size: 16, offset: 352)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !267, file: !263, line: 236, baseType: !153, size: 16, offset: 368)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !267, file: !263, line: 241, baseType: !150, size: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !267, file: !263, line: 244, baseType: !5, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !267, file: !263, line: 244, baseType: !5, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !267, file: !263, line: 245, baseType: !150, size: 32, offset: 480)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !267, file: !263, line: 248, baseType: !150, size: 32, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !267, file: !263, line: 250, baseType: !5, size: 32, offset: 544)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !262, file: !263, line: 342, baseType: !294, size: 448, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !263, line: 79, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !263, line: 61, size: 448, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !307, !308, !309, !310, !311}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !295, file: !263, line: 62, baseType: !146, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !295, file: !263, line: 64, baseType: !153, size: 16, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !295, file: !263, line: 65, baseType: !153, size: 16, offset: 80)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !295, file: !263, line: 67, baseType: !150, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !295, file: !263, line: 68, baseType: !150, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !295, file: !263, line: 69, baseType: !150, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !295, file: !263, line: 70, baseType: !153, size: 16, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !295, file: !263, line: 71, baseType: !153, size: 16, offset: 208)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !295, file: !263, line: 72, baseType: !306, size: 64, offset: 224)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !247)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !295, file: !263, line: 75, baseType: !150, size: 32, offset: 288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !295, file: !263, line: 75, baseType: !150, size: 32, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !295, file: !263, line: 75, baseType: !150, size: 32, offset: 352)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !295, file: !263, line: 78, baseType: !150, size: 32, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !295, file: !263, line: 78, baseType: !150, size: 32, offset: 416)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !262, file: !263, line: 343, baseType: !141, size: 128, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !262, file: !263, line: 344, baseType: !141, size: 128, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !262, file: !263, line: 345, baseType: !315, size: 192, offset: 1280)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !263, line: 278, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !263, line: 270, size: 192, elements: !317)
!317 = !{!318, !319, !320, !321, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !316, file: !263, line: 271, baseType: !5, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !316, file: !263, line: 273, baseType: !150, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !316, file: !263, line: 275, baseType: !5, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !316, file: !263, line: 276, baseType: !5, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !316, file: !263, line: 277, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !263, line: 55, size: 576, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !324, file: !263, line: 56, baseType: !5, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !324, file: !263, line: 57, baseType: !150, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !324, file: !263, line: 58, baseType: !329, size: 512, offset: 64)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !330)
!330 = !{!331, !331}
!331 = !DISubrange(count: 4)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !262, file: !263, line: 346, baseType: !333, size: 384, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !263, line: 268, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !263, line: 253, size: 384, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !387, !388, !389, !390, !391, !392}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !263, line: 254, baseType: !5, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !334, file: !263, line: 255, baseType: !5, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !334, file: !263, line: 255, baseType: !5, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !334, file: !263, line: 258, baseType: !150, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !334, file: !263, line: 259, baseType: !341, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !263, line: 164, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !263, line: 108, size: 1664, elements: !344)
!344 = !{!345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !369, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !263, line: 109, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !343, file: !263, line: 109, baseType: !346, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !263, line: 111, baseType: !224, size: 512, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !343, file: !263, line: 119, baseType: !306, size: 64, offset: 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !343, file: !263, line: 119, baseType: !306, size: 64, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !343, file: !263, line: 125, baseType: !306, size: 64, offset: 768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !343, file: !263, line: 125, baseType: !306, size: 64, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !343, file: !263, line: 127, baseType: !306, size: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !343, file: !263, line: 130, baseType: !5, size: 32, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !343, file: !263, line: 131, baseType: !5, size: 32, offset: 992)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !343, file: !263, line: 132, baseType: !357, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !263, line: 106, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !263, line: 81, size: 512, elements: !360)
!360 = !{!361, !362, !365, !366, !367, !368}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !359, file: !263, line: 82, baseType: !306, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !359, file: !263, line: 97, baseType: !363, size: 256, offset: 64)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !364)
!364 = !{!331, !248}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !359, file: !263, line: 102, baseType: !306, size: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !359, file: !263, line: 102, baseType: !306, size: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !359, file: !263, line: 104, baseType: !5, size: 32, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !359, file: !263, line: 105, baseType: !5, size: 32, offset: 480)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !343, file: !263, line: 135, baseType: !370, size: 96, offset: 1088)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 3)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !343, file: !263, line: 136, baseType: !150, size: 32, offset: 1184)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !343, file: !263, line: 139, baseType: !5, size: 32, offset: 1216)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !343, file: !263, line: 139, baseType: !5, size: 32, offset: 1248)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !343, file: !263, line: 139, baseType: !5, size: 32, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !343, file: !263, line: 140, baseType: !370, size: 96, offset: 1312)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !343, file: !263, line: 143, baseType: !153, size: 16, offset: 1408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !343, file: !263, line: 144, baseType: !153, size: 16, offset: 1424)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !343, file: !263, line: 145, baseType: !153, size: 16, offset: 1440)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !343, file: !263, line: 148, baseType: !153, size: 16, offset: 1456)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !343, file: !263, line: 149, baseType: !5, size: 32, offset: 1472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !343, file: !263, line: 150, baseType: !150, size: 32, offset: 1504)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !343, file: !263, line: 152, baseType: !259, size: 64, offset: 1536)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !343, file: !263, line: 163, baseType: !150, size: 32, offset: 1600)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !343, file: !263, line: 163, baseType: !150, size: 32, offset: 1632)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !334, file: !263, line: 261, baseType: !150, size: 32, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !334, file: !263, line: 261, baseType: !150, size: 32, offset: 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !334, file: !263, line: 261, baseType: !150, size: 32, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !334, file: !263, line: 263, baseType: !5, size: 32, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !334, file: !263, line: 266, baseType: !5, size: 32, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !334, file: !263, line: 267, baseType: !150, size: 32, offset: 352)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !262, file: !263, line: 347, baseType: !341, size: 64, offset: 1856)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !262, file: !263, line: 348, baseType: !395, size: 64, offset: 1920)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !263, line: 205, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !263, line: 186, size: 1024, elements: !398)
!398 = !{!399, !401, !402, !403, !405, !406, !407, !415, !416, !417, !497, !498}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !263, line: 187, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !397, file: !263, line: 187, baseType: !400, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !263, line: 189, baseType: !224, size: 512, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !397, file: !263, line: 191, baseType: !404, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !397, file: !263, line: 193, baseType: !5, size: 32, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !397, file: !263, line: 193, baseType: !5, size: 32, offset: 736)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !397, file: !263, line: 195, baseType: !408, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !263, line: 184, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !263, line: 166, size: 320, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !410, file: !263, line: 180, baseType: !363, size: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !410, file: !263, line: 182, baseType: !5, size: 32, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !263, line: 183, baseType: !5, size: 32, offset: 288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !397, file: !263, line: 196, baseType: !5, size: 32, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !263, line: 198, baseType: !5, size: 32, offset: 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !397, file: !263, line: 200, baseType: !418, size: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !254, line: 77, size: 15424, elements: !420)
!420 = !{!421, !422, !423, !426, !429, !430, !433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !451, !452, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !478, !479, !480, !486, !487, !491}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !419, file: !254, line: 78, baseType: !176, size: 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !419, file: !254, line: 80, baseType: !195, size: 8192, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !419, file: !254, line: 82, baseType: !424, size: 64, offset: 9152)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !254, line: 43, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !419, file: !254, line: 83, baseType: !427, size: 64, offset: 9216)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !177, line: 46, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !419, file: !254, line: 86, baseType: !252, size: 64, offset: 9280)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !419, file: !254, line: 87, baseType: !431, size: 64, offset: 9344)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !254, line: 44, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !419, file: !254, line: 89, baseType: !434, size: 512, offset: 9408)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 512, elements: !154)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !419, file: !254, line: 90, baseType: !153, size: 16, offset: 9920)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !419, file: !254, line: 90, baseType: !153, size: 16, offset: 9936)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !419, file: !254, line: 92, baseType: !153, size: 16, offset: 9952)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !254, line: 92, baseType: !153, size: 16, offset: 9968)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !419, file: !254, line: 93, baseType: !153, size: 16, offset: 9984)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !254, line: 93, baseType: !153, size: 16, offset: 10000)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !419, file: !254, line: 94, baseType: !5, size: 32, offset: 10016)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !419, file: !254, line: 97, baseType: !153, size: 16, offset: 10048)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !419, file: !254, line: 97, baseType: !153, size: 16, offset: 10064)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !419, file: !254, line: 98, baseType: !153, size: 16, offset: 10080)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !419, file: !254, line: 98, baseType: !153, size: 16, offset: 10096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !419, file: !254, line: 99, baseType: !153, size: 16, offset: 10112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !419, file: !254, line: 99, baseType: !153, size: 16, offset: 10128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !419, file: !254, line: 100, baseType: !37, size: 32, offset: 10144)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !419, file: !254, line: 101, baseType: !450, size: 64, offset: 10176)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !419, file: !254, line: 103, baseType: !202, size: 64, offset: 10240)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !419, file: !254, line: 104, baseType: !453, size: 64, offset: 10304)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !177, line: 159, size: 448, elements: !455)
!455 = !{!456, !458, !459, !461, !462, !464}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !454, file: !177, line: 161, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !247)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !454, file: !177, line: 162, baseType: !457, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !454, file: !177, line: 163, baseType: !460, size: 32, offset: 128)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 32, elements: !247)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !454, file: !177, line: 164, baseType: !460, size: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !454, file: !177, line: 165, baseType: !463, size: 128, offset: 192)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 128, elements: !247)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !454, file: !177, line: 166, baseType: !465, size: 128, offset: 320)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 128, elements: !247)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !419, file: !254, line: 107, baseType: !150, size: 32, offset: 10368)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !419, file: !254, line: 108, baseType: !5, size: 32, offset: 10400)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !419, file: !254, line: 109, baseType: !153, size: 16, offset: 10432)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !419, file: !254, line: 110, baseType: !153, size: 16, offset: 10448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !419, file: !254, line: 113, baseType: !5, size: 32, offset: 10464)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !419, file: !254, line: 113, baseType: !5, size: 32, offset: 10496)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !419, file: !254, line: 114, baseType: !196, size: 8, offset: 10528)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !419, file: !254, line: 114, baseType: !196, size: 8, offset: 10536)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !419, file: !254, line: 115, baseType: !153, size: 16, offset: 10544)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !419, file: !254, line: 116, baseType: !476, size: 128, offset: 10560)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !477)
!477 = !{!331}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !419, file: !254, line: 119, baseType: !150, size: 32, offset: 10688)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !419, file: !254, line: 119, baseType: !150, size: 32, offset: 10720)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !419, file: !254, line: 122, baseType: !481, size: 512, offset: 10752)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !482, line: 182, baseType: !483)
!482 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !482, line: 180, size: 512, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !482, line: 181, baseType: !224, size: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !419, file: !254, line: 123, baseType: !196, size: 8, offset: 11264)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !419, file: !254, line: 125, baseType: !488, size: 56, offset: 11272)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 56, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 7)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !419, file: !254, line: 126, baseType: !492, size: 4096, offset: 11328)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 4096, elements: !154)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !254, line: 69, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !254, line: 67, size: 512, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !254, line: 68, baseType: !224, size: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !397, file: !263, line: 201, baseType: !150, size: 32, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !397, file: !263, line: 204, baseType: !5, size: 32, offset: 992)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !262, file: !263, line: 350, baseType: !141, size: 128, offset: 1984)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !262, file: !263, line: 351, baseType: !5, size: 32, offset: 2112)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !262, file: !263, line: 351, baseType: !5, size: 32, offset: 2144)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !262, file: !263, line: 353, baseType: !503, size: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !263, line: 297, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !263, line: 295, size: 2048, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !505, file: !263, line: 296, baseType: !508, size: 2048)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 2048, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !262, file: !263, line: 355, baseType: !512, size: 384, offset: 2240)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !263, line: 338, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !263, line: 322, size: 384, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !513, file: !263, line: 323, baseType: !5, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !513, file: !263, line: 325, baseType: !153, size: 16, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !513, file: !263, line: 326, baseType: !153, size: 16, offset: 48)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !513, file: !263, line: 331, baseType: !141, size: 128, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !513, file: !263, line: 334, baseType: !141, size: 128, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !513, file: !263, line: 335, baseType: !5, size: 32, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !513, file: !263, line: 337, baseType: !5, size: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !173, file: !166, line: 81, baseType: !146, size: 64, offset: 12224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !173, file: !166, line: 85, baseType: !524, size: 6208, offset: 12288)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !166, line: 55, size: 6208, elements: !525)
!525 = !{!526, !530, !531, !532, !533}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !524, file: !166, line: 56, baseType: !527, size: 6144)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 6144, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 768)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !524, file: !166, line: 58, baseType: !153, size: 16, offset: 6144)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !524, file: !166, line: 59, baseType: !153, size: 16, offset: 6160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !524, file: !166, line: 60, baseType: !153, size: 16, offset: 6176)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !524, file: !166, line: 61, baseType: !153, size: 16, offset: 6192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !166, line: 86, baseType: !5, size: 32, offset: 18496)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !173, file: !166, line: 88, baseType: !5, size: 32, offset: 18528)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !173, file: !166, line: 90, baseType: !5, size: 32, offset: 18560)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !173, file: !166, line: 94, baseType: !5, size: 32, offset: 18592)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !173, file: !166, line: 100, baseType: !481, size: 512, offset: 18624)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !130, file: !60, line: 1085, baseType: !540, size: 1088, offset: 576)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !166, line: 103, size: 1088, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !551, !552, !553, !554, !555, !556, !557, !559}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !540, file: !166, line: 104, baseType: !153, size: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !540, file: !166, line: 105, baseType: !153, size: 16, offset: 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !540, file: !166, line: 106, baseType: !5, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !540, file: !166, line: 107, baseType: !5, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !540, file: !166, line: 107, baseType: !5, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !540, file: !166, line: 108, baseType: !359, size: 512, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !540, file: !166, line: 109, baseType: !549, size: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !482, line: 136, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !540, file: !166, line: 110, baseType: !549, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !540, file: !166, line: 111, baseType: !306, size: 64, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !540, file: !166, line: 112, baseType: !153, size: 16, offset: 832)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !540, file: !166, line: 113, baseType: !153, size: 16, offset: 848)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !540, file: !166, line: 114, baseType: !5, size: 32, offset: 864)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !540, file: !166, line: 115, baseType: !346, size: 64, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !540, file: !166, line: 116, baseType: !558, size: 64, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !540, file: !166, line: 117, baseType: !306, size: 64, offset: 1024)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !60, line: 1087, baseType: !5, size: 32, offset: 1664)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !130, file: !60, line: 1088, baseType: !153, size: 16, offset: 1696)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !130, file: !60, line: 1089, baseType: !153, size: 16, offset: 1712)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !130, file: !60, line: 1091, baseType: !5, size: 32, offset: 1728)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !130, file: !60, line: 1094, baseType: !306, size: 64, offset: 1760)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !130, file: !60, line: 1094, baseType: !150, size: 32, offset: 1824)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !130, file: !60, line: 1094, baseType: !150, size: 32, offset: 1856)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !130, file: !60, line: 1095, baseType: !5, size: 32, offset: 1888)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !130, file: !60, line: 1096, baseType: !329, size: 512, offset: 1920)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !130, file: !60, line: 1096, baseType: !329, size: 512, offset: 2432)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !130, file: !60, line: 1100, baseType: !5, size: 32, offset: 2944)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !130, file: !60, line: 1103, baseType: !153, size: 16, offset: 2976)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !130, file: !60, line: 1103, baseType: !153, size: 16, offset: 2992)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !130, file: !60, line: 1105, baseType: !5, size: 32, offset: 3008)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !130, file: !60, line: 1105, baseType: !5, size: 32, offset: 3040)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !130, file: !60, line: 1107, baseType: !306, size: 64, offset: 3072)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !130, file: !60, line: 1109, baseType: !577, size: 128, offset: 3136)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !60, line: 554, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !60, line: 545, size: 128, elements: !579)
!579 = !{!580, !584, !585, !586, !587}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !578, file: !60, line: 548, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !583, line: 154, flags: DIFlagFwdDecl)
!583 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!584 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !578, file: !60, line: 550, baseType: !196, size: 8, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !578, file: !60, line: 551, baseType: !196, size: 8, offset: 72)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !578, file: !60, line: 552, baseType: !196, size: 8, offset: 80)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !578, file: !60, line: 553, baseType: !588, size: 40, offset: 88)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 40, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 5)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "Brush", file: !108, line: 138, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !108, line: 54, size: 16448, elements: !594)
!594 = !{!595, !596, !603, !650, !2166, !2167, !2168, !2169, !2172, !2173, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !593, file: !108, line: 55, baseType: !176, size: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !593, file: !108, line: 57, baseType: !597, size: 192, offset: 960)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrushClone", file: !108, line: 48, size: 192, elements: !598)
!598 = !{!599, !600, !601, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !597, file: !108, line: 49, baseType: !418, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !597, file: !108, line: 50, baseType: !306, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !597, file: !108, line: 51, baseType: !150, size: 32, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !597, file: !108, line: 51, baseType: !150, size: 32, offset: 160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !593, file: !108, line: 58, baseType: !604, size: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !482, line: 72, size: 3072, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !620, !621, !646, !647, !648, !649}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !482, line: 73, baseType: !5, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !605, file: !482, line: 73, baseType: !5, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !605, file: !482, line: 74, baseType: !5, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !605, file: !482, line: 75, baseType: !5, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !605, file: !482, line: 77, baseType: !612, size: 128, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !613, line: 95, baseType: !614)
!613 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !613, line: 92, size: 128, elements: !615)
!615 = !{!616, !617, !618, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !614, file: !613, line: 93, baseType: !150, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !614, file: !613, line: 93, baseType: !150, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !614, file: !613, line: 94, baseType: !150, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !614, file: !613, line: 94, baseType: !150, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !605, file: !482, line: 77, baseType: !612, size: 128, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !605, file: !482, line: 79, baseType: !622, size: 2304, offset: 384)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 2304, elements: !477)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !482, line: 67, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !482, line: 55, size: 576, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !642, !643, !644, !645}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !624, file: !482, line: 56, baseType: !153, size: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !482, line: 56, baseType: !153, size: 16, offset: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !624, file: !482, line: 58, baseType: !150, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !624, file: !482, line: 59, baseType: !150, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !624, file: !482, line: 59, baseType: !150, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !624, file: !482, line: 60, baseType: !306, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !624, file: !482, line: 60, baseType: !306, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !624, file: !482, line: 61, baseType: !634, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !482, line: 47, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !482, line: 44, size: 96, elements: !637)
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !636, file: !482, line: 45, baseType: !150, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !636, file: !482, line: 45, baseType: !150, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !636, file: !482, line: 46, baseType: !153, size: 16, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !636, file: !482, line: 46, baseType: !153, size: 16, offset: 80)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !624, file: !482, line: 62, baseType: !634, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !624, file: !482, line: 64, baseType: !634, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !624, file: !482, line: 65, baseType: !306, size: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !624, file: !482, line: 66, baseType: !306, size: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !605, file: !482, line: 80, baseType: !370, size: 96, offset: 2688)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !605, file: !482, line: 80, baseType: !370, size: 96, offset: 2784)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !605, file: !482, line: 81, baseType: !370, size: 96, offset: 2880)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !605, file: !482, line: 83, baseType: !370, size: 96, offset: 2976)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !593, file: !108, line: 59, baseType: !651, size: 2496, offset: 1216)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !241, line: 57, size: 2496, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !1962, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !651, file: !241, line: 59, baseType: !153, size: 16)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !651, file: !241, line: 59, baseType: !153, size: 16, offset: 16)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !651, file: !241, line: 59, baseType: !153, size: 16, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !651, file: !241, line: 59, baseType: !153, size: 16, offset: 48)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !651, file: !241, line: 60, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !117, line: 115, size: 11392, elements: !660)
!660 = !{!661, !662, !663, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !680, !689, !703, !704, !746, !747, !748, !749, !765, !766, !767, !768, !769, !770, !771, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1131, !1134, !1135, !1136, !1137, !1138, !1139, !1142, !1145, !1149, !1150, !1156, !1157, !1158, !1159, !1160, !1161, !1163, !1166, !1169, !1170, !1950, !1951}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !659, file: !117, line: 116, baseType: !176, size: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !659, file: !117, line: 117, baseType: !239, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !659, file: !117, line: 119, baseType: !664, size: 64, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !117, line: 57, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !659, file: !117, line: 121, baseType: !153, size: 16, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !659, file: !117, line: 121, baseType: !153, size: 16, offset: 1104)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !659, file: !117, line: 122, baseType: !5, size: 32, offset: 1120)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !659, file: !117, line: 122, baseType: !5, size: 32, offset: 1152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !659, file: !117, line: 122, baseType: !5, size: 32, offset: 1184)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !659, file: !117, line: 123, baseType: !224, size: 512, offset: 1216)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !659, file: !117, line: 124, baseType: !658, size: 64, offset: 1728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !659, file: !117, line: 124, baseType: !658, size: 64, offset: 1792)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !659, file: !117, line: 127, baseType: !658, size: 64, offset: 1856)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !659, file: !117, line: 127, baseType: !658, size: 64, offset: 1920)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !659, file: !117, line: 127, baseType: !658, size: 64, offset: 1984)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !659, file: !117, line: 128, baseType: !678, size: 64, offset: 2048)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !241, line: 46, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !659, file: !117, line: 130, baseType: !681, size: 64, offset: 2112)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !117, line: 97, size: 832, elements: !683)
!683 = !{!684, !687, !688}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !682, file: !117, line: 98, baseType: !685, size: 768)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 768, elements: !686)
!686 = !{!155, !372}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !117, line: 99, baseType: !5, size: 32, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !117, line: 99, baseType: !5, size: 32, offset: 800)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !659, file: !117, line: 131, baseType: !690, size: 64, offset: 2176)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !692, line: 486, size: 1600, elements: !693)
!692 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !691, file: !692, line: 487, baseType: !176, size: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !691, file: !692, line: 489, baseType: !141, size: 128, offset: 960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !691, file: !692, line: 490, baseType: !141, size: 128, offset: 1088)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !691, file: !692, line: 491, baseType: !141, size: 128, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !691, file: !692, line: 492, baseType: !141, size: 128, offset: 1344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !692, line: 494, baseType: !5, size: 32, offset: 1472)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !691, file: !692, line: 495, baseType: !5, size: 32, offset: 1504)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !691, file: !692, line: 497, baseType: !5, size: 32, offset: 1536)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !691, file: !692, line: 498, baseType: !5, size: 32, offset: 1568)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !659, file: !117, line: 132, baseType: !690, size: 64, offset: 2240)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !659, file: !117, line: 133, baseType: !705, size: 64, offset: 2304)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !692, line: 334, size: 1728, elements: !707)
!707 = !{!708, !709, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !745}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !706, file: !692, line: 335, baseType: !141, size: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !706, file: !692, line: 336, baseType: !710, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !712, line: 51, flags: DIFlagFwdDecl)
!712 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !706, file: !692, line: 338, baseType: !153, size: 16, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !706, file: !692, line: 338, baseType: !153, size: 16, offset: 208)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !706, file: !692, line: 339, baseType: !37, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !706, file: !692, line: 340, baseType: !5, size: 32, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !706, file: !692, line: 342, baseType: !150, size: 32, offset: 288)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !706, file: !692, line: 343, baseType: !370, size: 96, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !706, file: !692, line: 344, baseType: !370, size: 96, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !706, file: !692, line: 347, baseType: !141, size: 128, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !706, file: !692, line: 349, baseType: !5, size: 32, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !706, file: !692, line: 350, baseType: !5, size: 32, offset: 672)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !706, file: !692, line: 351, baseType: !146, size: 64, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !706, file: !692, line: 352, baseType: !146, size: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !706, file: !692, line: 354, baseType: !726, size: 384, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !692, line: 116, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !692, line: 94, size: 384, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !727, file: !692, line: 96, baseType: !5, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !727, file: !692, line: 96, baseType: !5, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !727, file: !692, line: 97, baseType: !5, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !727, file: !692, line: 97, baseType: !5, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !727, file: !692, line: 99, baseType: !153, size: 16, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !727, file: !692, line: 100, baseType: !153, size: 16, offset: 144)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !727, file: !692, line: 102, baseType: !153, size: 16, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !727, file: !692, line: 105, baseType: !153, size: 16, offset: 176)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !727, file: !692, line: 108, baseType: !153, size: 16, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !727, file: !692, line: 109, baseType: !153, size: 16, offset: 208)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !727, file: !692, line: 111, baseType: !153, size: 16, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !727, file: !692, line: 112, baseType: !153, size: 16, offset: 240)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !727, file: !692, line: 114, baseType: !5, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !727, file: !692, line: 114, baseType: !5, size: 32, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !727, file: !692, line: 115, baseType: !5, size: 32, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !727, file: !692, line: 115, baseType: !5, size: 32, offset: 352)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !706, file: !692, line: 355, baseType: !224, size: 512, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !659, file: !117, line: 134, baseType: !146, size: 64, offset: 2368)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !659, file: !117, line: 136, baseType: !259, size: 64, offset: 2432)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !659, file: !117, line: 138, baseType: !726, size: 384, offset: 2496)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !659, file: !117, line: 139, baseType: !750, size: 64, offset: 2880)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !692, line: 80, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !692, line: 72, size: 192, elements: !753)
!753 = !{!754, !761, !762, !763, !764}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !752, file: !692, line: 73, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !692, line: 59, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !692, line: 56, size: 128, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !757, file: !692, line: 57, baseType: !370, size: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !757, file: !692, line: 58, baseType: !5, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !752, file: !692, line: 74, baseType: !5, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !752, file: !692, line: 76, baseType: !5, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !752, file: !692, line: 77, baseType: !5, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !692, line: 79, baseType: !5, size: 32, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !659, file: !117, line: 141, baseType: !141, size: 128, offset: 2944)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !659, file: !117, line: 142, baseType: !141, size: 128, offset: 3072)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !659, file: !117, line: 143, baseType: !141, size: 128, offset: 3200)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !659, file: !117, line: 144, baseType: !141, size: 128, offset: 3328)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !659, file: !117, line: 146, baseType: !5, size: 32, offset: 3456)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !659, file: !117, line: 147, baseType: !5, size: 32, offset: 3488)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !659, file: !117, line: 150, baseType: !772, size: 64, offset: 3520)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !775, line: 93, size: 7552, elements: !776)
!775 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !825, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !935, !1001, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1036, !1044}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !774, file: !775, line: 94, baseType: !176, size: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !774, file: !775, line: 95, baseType: !239, size: 64, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !774, file: !775, line: 97, baseType: !153, size: 16, offset: 1024)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !774, file: !775, line: 97, baseType: !153, size: 16, offset: 1040)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !774, file: !775, line: 99, baseType: !150, size: 32, offset: 1056)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !774, file: !775, line: 99, baseType: !150, size: 32, offset: 1088)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !774, file: !775, line: 99, baseType: !150, size: 32, offset: 1120)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !774, file: !775, line: 100, baseType: !150, size: 32, offset: 1152)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !774, file: !775, line: 100, baseType: !150, size: 32, offset: 1184)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !774, file: !775, line: 100, baseType: !150, size: 32, offset: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !774, file: !775, line: 101, baseType: !150, size: 32, offset: 1248)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !774, file: !775, line: 101, baseType: !150, size: 32, offset: 1280)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !774, file: !775, line: 101, baseType: !150, size: 32, offset: 1312)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !774, file: !775, line: 102, baseType: !150, size: 32, offset: 1344)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !774, file: !775, line: 102, baseType: !150, size: 32, offset: 1376)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !774, file: !775, line: 102, baseType: !150, size: 32, offset: 1408)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !774, file: !775, line: 103, baseType: !150, size: 32, offset: 1440)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !774, file: !775, line: 103, baseType: !150, size: 32, offset: 1472)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !774, file: !775, line: 103, baseType: !150, size: 32, offset: 1504)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !774, file: !775, line: 103, baseType: !150, size: 32, offset: 1536)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !774, file: !775, line: 103, baseType: !150, size: 32, offset: 1568)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !774, file: !775, line: 104, baseType: !150, size: 32, offset: 1600)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !774, file: !775, line: 104, baseType: !150, size: 32, offset: 1632)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !774, file: !775, line: 104, baseType: !150, size: 32, offset: 1664)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !774, file: !775, line: 104, baseType: !150, size: 32, offset: 1696)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !774, file: !775, line: 104, baseType: !150, size: 32, offset: 1728)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !774, file: !775, line: 105, baseType: !150, size: 32, offset: 1760)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !774, file: !775, line: 108, baseType: !805, size: 704, offset: 1792)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !775, line: 53, size: 704, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !805, file: !775, line: 54, baseType: !150, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !805, file: !775, line: 55, baseType: !150, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !805, file: !775, line: 56, baseType: !150, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !805, file: !775, line: 57, baseType: !150, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !805, file: !775, line: 59, baseType: !370, size: 96, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !805, file: !775, line: 60, baseType: !370, size: 96, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !805, file: !775, line: 61, baseType: !370, size: 96, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !805, file: !775, line: 63, baseType: !150, size: 32, offset: 416)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !805, file: !775, line: 64, baseType: !150, size: 32, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !805, file: !775, line: 65, baseType: !150, size: 32, offset: 480)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !805, file: !775, line: 67, baseType: !153, size: 16, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !805, file: !775, line: 68, baseType: !153, size: 16, offset: 528)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !805, file: !775, line: 69, baseType: !153, size: 16, offset: 544)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !805, file: !775, line: 70, baseType: !153, size: 16, offset: 560)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !805, file: !775, line: 72, baseType: !150, size: 32, offset: 576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !805, file: !775, line: 73, baseType: !150, size: 32, offset: 608)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !805, file: !775, line: 74, baseType: !150, size: 32, offset: 640)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !805, file: !775, line: 75, baseType: !150, size: 32, offset: 672)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !774, file: !775, line: 109, baseType: !826, size: 128, offset: 2496)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !775, line: 79, size: 128, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !826, file: !775, line: 80, baseType: !5, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !826, file: !775, line: 81, baseType: !5, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !826, file: !775, line: 82, baseType: !5, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !826, file: !775, line: 83, baseType: !5, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !774, file: !775, line: 111, baseType: !150, size: 32, offset: 2624)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !774, file: !775, line: 111, baseType: !150, size: 32, offset: 2656)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !774, file: !775, line: 112, baseType: !150, size: 32, offset: 2688)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !774, file: !775, line: 112, baseType: !150, size: 32, offset: 2720)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !774, file: !775, line: 113, baseType: !150, size: 32, offset: 2752)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !774, file: !775, line: 114, baseType: !150, size: 32, offset: 2784)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !774, file: !775, line: 114, baseType: !150, size: 32, offset: 2816)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !774, file: !775, line: 115, baseType: !153, size: 16, offset: 2848)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !774, file: !775, line: 115, baseType: !153, size: 16, offset: 2864)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !774, file: !775, line: 116, baseType: !153, size: 16, offset: 2880)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !774, file: !775, line: 117, baseType: !196, size: 8, offset: 2896)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !774, file: !775, line: 117, baseType: !196, size: 8, offset: 2904)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !774, file: !775, line: 119, baseType: !150, size: 32, offset: 2912)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !774, file: !775, line: 119, baseType: !150, size: 32, offset: 2944)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !774, file: !775, line: 120, baseType: !153, size: 16, offset: 2976)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !774, file: !775, line: 120, baseType: !153, size: 16, offset: 2992)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !774, file: !775, line: 121, baseType: !150, size: 32, offset: 3008)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !774, file: !775, line: 121, baseType: !150, size: 32, offset: 3040)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !774, file: !775, line: 122, baseType: !150, size: 32, offset: 3072)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !774, file: !775, line: 123, baseType: !150, size: 32, offset: 3104)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !774, file: !775, line: 124, baseType: !153, size: 16, offset: 3136)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !774, file: !775, line: 125, baseType: !153, size: 16, offset: 3152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !774, file: !775, line: 127, baseType: !5, size: 32, offset: 3168)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !774, file: !775, line: 127, baseType: !5, size: 32, offset: 3200)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !774, file: !775, line: 128, baseType: !5, size: 32, offset: 3232)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !774, file: !775, line: 128, baseType: !5, size: 32, offset: 3264)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !774, file: !775, line: 129, baseType: !153, size: 16, offset: 3296)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !774, file: !775, line: 129, baseType: !153, size: 16, offset: 3312)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !774, file: !775, line: 129, baseType: !153, size: 16, offset: 3328)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !774, file: !775, line: 129, baseType: !153, size: 16, offset: 3344)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !774, file: !775, line: 130, baseType: !150, size: 32, offset: 3360)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !774, file: !775, line: 130, baseType: !150, size: 32, offset: 3392)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !774, file: !775, line: 130, baseType: !150, size: 32, offset: 3424)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !774, file: !775, line: 130, baseType: !150, size: 32, offset: 3456)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !774, file: !775, line: 131, baseType: !150, size: 32, offset: 3488)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !774, file: !775, line: 131, baseType: !150, size: 32, offset: 3520)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !774, file: !775, line: 131, baseType: !150, size: 32, offset: 3552)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !774, file: !775, line: 131, baseType: !150, size: 32, offset: 3584)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !774, file: !775, line: 132, baseType: !150, size: 32, offset: 3616)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !774, file: !775, line: 132, baseType: !150, size: 32, offset: 3648)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !774, file: !775, line: 133, baseType: !224, size: 512, offset: 3680)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !774, file: !775, line: 135, baseType: !150, size: 32, offset: 4192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !774, file: !775, line: 136, baseType: !150, size: 32, offset: 4224)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !774, file: !775, line: 137, baseType: !150, size: 32, offset: 4256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !774, file: !775, line: 138, baseType: !5, size: 32, offset: 4288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !774, file: !775, line: 141, baseType: !196, size: 8, offset: 4320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !774, file: !775, line: 141, baseType: !196, size: 8, offset: 4328)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !774, file: !775, line: 141, baseType: !196, size: 8, offset: 4336)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !774, file: !775, line: 141, baseType: !196, size: 8, offset: 4344)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !774, file: !775, line: 142, baseType: !153, size: 16, offset: 4352)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !774, file: !775, line: 142, baseType: !153, size: 16, offset: 4368)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !774, file: !775, line: 142, baseType: !153, size: 16, offset: 4384)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !774, file: !775, line: 145, baseType: !196, size: 8, offset: 4400)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !774, file: !775, line: 145, baseType: !196, size: 8, offset: 4408)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !774, file: !775, line: 148, baseType: !153, size: 16, offset: 4416)
