; ModuleID = 'blender/source/blender/editors/screen/area.c'
source_filename = "blender/source/blender/editors/screen/area.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rect", scope: !2, file: !3, line: 1333, type: !1087, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ed_default_handlers", scope: !3, file: !3, line: 1311, type: !4, scopeLine: 1312, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1584, retainedNodes: !2900)
!3 = !DIFile(filename: "blender/source/blender/editors/screen/area.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !1458, !236, !48}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmWindowManager", file: !8, line: 160, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !8, line: 128, size: 2816, elements: !10)
!10 = !{!11, !83, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1437, !1438, !1439, !1440, !1441, !1452, !1453, !1454, !1455, !1456, !1457}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !8, line: 129, baseType: !12, size: 960)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !13, line: 130, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !13, line: 117, size: 960, elements: !15)
!15 = !{!16, !18, !19, !21, !41, !45, !47, !49, !50, !51}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 118, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !14, file: !13, line: 118, baseType: !17, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !14, file: !13, line: 119, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !14, file: !13, line: 120, baseType: !22, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !13, line: 136, size: 17600, elements: !24)
!24 = !{!25, !26, !28, !31, !36, !37, !38}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !23, file: !13, line: 137, baseType: !12, size: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !23, file: !13, line: 138, baseType: !27, size: 64, offset: 960)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !23, file: !13, line: 139, baseType: !29, size: 64, offset: 1024)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !13, line: 43, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !13, line: 140, baseType: !32, size: 8192, offset: 1088)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8192, elements: !34)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 1024)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !23, file: !13, line: 141, baseType: !32, size: 8192, offset: 9280)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !23, file: !13, line: 148, baseType: !22, size: 64, offset: 17472)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !23, file: !13, line: 150, baseType: !39, size: 64, offset: 17536)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !13, line: 45, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 121, baseType: !42, size: 528, offset: 256)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 528, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 66)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !14, file: !13, line: 126, baseType: !46, size: 16, offset: 784)
!46 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !14, file: !13, line: 127, baseType: !48, size: 32, offset: 800)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 864)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !14, file: !13, line: 129, baseType: !52, size: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !13, line: 75, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !13, line: 62, size: 1024, elements: !55)
!55 = !{!56, !58, !59, !60, !61, !62, !66, !67, !81, !82}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !13, line: 63, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !13, line: 63, baseType: !57, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 136)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !13, line: 65, baseType: !46, size: 16, offset: 144)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !13, line: 66, baseType: !63, size: 512, offset: 160)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !54, file: !13, line: 67, baseType: !48, size: 32, offset: 672)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !13, line: 69, baseType: !68, size: 256, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !13, line: 60, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !13, line: 48, size: 256, elements: !70)
!70 = !{!71, !72, !79, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !69, file: !13, line: 49, baseType: !17, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !69, file: !13, line: 58, baseType: !73, size: 128, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !74, line: 71, baseType: !75)
!74 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !74, line: 69, size: 128, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !75, file: !74, line: 70, baseType: !17, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !75, file: !74, line: 70, baseType: !17, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !13, line: 70, baseType: !48, size: 32, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !54, file: !13, line: 74, baseType: !48, size: 32, offset: 992)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !9, file: !8, line: 131, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !8, line: 169, size: 2048, elements: !86)
!86 = !{!87, !88, !89, !90, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1396, !1399, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !8, line: 170, baseType: !84, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !8, line: 170, baseType: !84, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !85, file: !8, line: 172, baseType: !17, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !85, file: !8, line: 174, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !93, line: 49, size: 1984, elements: !94)
!93 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = !{!95, !96, !97, !98, !99, !100, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1336}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !93, line: 50, baseType: !12, size: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !92, file: !93, line: 52, baseType: !73, size: 128, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !92, file: !93, line: 53, baseType: !73, size: 128, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !92, file: !93, line: 54, baseType: !73, size: 128, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !92, file: !93, line: 55, baseType: !73, size: 128, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !92, file: !93, line: 57, baseType: !101, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !103, line: 1216, size: 39680, elements: !104)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = !{!105, !106, !110, !113, !116, !117, !118, !131, !132, !137, !138, !139, !140, !141, !142, !143, !144, !145, !149, !230, !667, !882, !885, !1173, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1198, !1199, !1207, !1274, !1281, !1282, !1289, !1290, !1296, !1297, !1298, !1299, !1300}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !102, file: !103, line: 1217, baseType: !12, size: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !102, file: !103, line: 1218, baseType: !107, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !109, line: 45, flags: DIFlagFwdDecl)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !102, file: !103, line: 1220, baseType: !111, size: 64, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !109, line: 49, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !102, file: !103, line: 1221, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !103, line: 52, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !102, file: !103, line: 1223, baseType: !101, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !102, file: !103, line: 1225, baseType: !73, size: 128, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !102, file: !103, line: 1226, baseType: !119, size: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !103, line: 69, size: 320, elements: !121)
!121 = !{!122, !123, !124, !126, !127, !128, !129, !130}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !103, line: 70, baseType: !119, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !103, line: 70, baseType: !119, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !120, file: !103, line: 71, baseType: !125, size: 32, offset: 128)
!125 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !120, file: !103, line: 71, baseType: !125, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !120, file: !103, line: 72, baseType: !48, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !120, file: !103, line: 73, baseType: !46, size: 16, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !120, file: !103, line: 73, baseType: !46, size: 16, offset: 240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !120, file: !103, line: 74, baseType: !111, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !102, file: !103, line: 1227, baseType: !111, size: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !102, file: !103, line: 1229, baseType: !133, size: 96, offset: 1472)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 96, elements: !135)
!134 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!135 = !{!136}
!136 = !DISubrange(count: 3)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !102, file: !103, line: 1230, baseType: !133, size: 96, offset: 1568)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !102, file: !103, line: 1231, baseType: !133, size: 96, offset: 1664)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !102, file: !103, line: 1231, baseType: !133, size: 96, offset: 1760)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !102, file: !103, line: 1233, baseType: !125, size: 32, offset: 1856)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !102, file: !103, line: 1234, baseType: !48, size: 32, offset: 1888)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !102, file: !103, line: 1235, baseType: !125, size: 32, offset: 1920)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !102, file: !103, line: 1237, baseType: !46, size: 16, offset: 1952)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !102, file: !103, line: 1239, baseType: !33, size: 8, offset: 1968)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !102, file: !103, line: 1240, baseType: !146, size: 8, offset: 1976)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 1)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !102, file: !103, line: 1242, baseType: !150, size: 64, offset: 1984)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !152, line: 328, size: 3456, elements: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !{!154, !155, !156, !159, !160, !164, !168, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !195, !196, !197, !200, !205, !206, !209, !213, !218, !222, !226, !227, !228, !229}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !152, line: 329, baseType: !12, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !151, file: !152, line: 330, baseType: !107, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !151, file: !152, line: 332, baseType: !157, size: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !152, line: 332, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !151, file: !152, line: 333, baseType: !63, size: 512, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !151, file: !152, line: 335, baseType: !161, size: 64, offset: 1600)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !163, line: 41, flags: DIFlagFwdDecl)
!163 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !151, file: !152, line: 337, baseType: !165, size: 64, offset: 1664)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !167, line: 45, flags: DIFlagFwdDecl)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !151, file: !152, line: 338, baseType: !169, size: 64, offset: 1728)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 2)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !151, file: !152, line: 340, baseType: !73, size: 128, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !151, file: !152, line: 340, baseType: !73, size: 128, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !152, line: 342, baseType: !48, size: 32, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !151, file: !152, line: 342, baseType: !48, size: 32, offset: 2080)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !151, file: !152, line: 343, baseType: !48, size: 32, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !151, file: !152, line: 345, baseType: !48, size: 32, offset: 2144)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !151, file: !152, line: 346, baseType: !48, size: 32, offset: 2176)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !151, file: !152, line: 347, baseType: !46, size: 16, offset: 2208)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !151, file: !152, line: 348, baseType: !46, size: 16, offset: 2224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !151, file: !152, line: 349, baseType: !48, size: 32, offset: 2240)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !151, file: !152, line: 351, baseType: !48, size: 32, offset: 2272)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !151, file: !152, line: 353, baseType: !46, size: 16, offset: 2304)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !151, file: !152, line: 354, baseType: !46, size: 16, offset: 2320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !151, file: !152, line: 355, baseType: !48, size: 32, offset: 2336)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !151, file: !152, line: 357, baseType: !187, size: 128, offset: 2368)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !188, line: 95, baseType: !189)
!188 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !188, line: 92, size: 128, elements: !190)
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !189, file: !188, line: 93, baseType: !134, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !189, file: !188, line: 93, baseType: !134, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !189, file: !188, line: 94, baseType: !134, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !189, file: !188, line: 94, baseType: !134, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !151, file: !152, line: 363, baseType: !73, size: 128, offset: 2496)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !151, file: !152, line: 363, baseType: !73, size: 128, offset: 2624)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !151, file: !152, line: 368, baseType: !198, size: 64, offset: 2752)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !152, line: 48, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !151, file: !152, line: 372, baseType: !201, size: 32, offset: 2816)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !152, line: 274, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !152, line: 271, size: 32, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !202, file: !152, line: 273, baseType: !125, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !151, file: !152, line: 373, baseType: !48, size: 32, offset: 2848)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !151, file: !152, line: 382, baseType: !207, size: 64, offset: 2880)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !152, line: 46, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !151, file: !152, line: 385, baseType: !210, size: 64, offset: 2944)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !17, !134}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !151, file: !152, line: 386, baseType: !214, size: 64, offset: 3008)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !17, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !151, file: !152, line: 387, baseType: !219, size: 64, offset: 3072)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!48, !17}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !151, file: !152, line: 388, baseType: !223, size: 64, offset: 3136)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !17}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !151, file: !152, line: 389, baseType: !17, size: 64, offset: 3200)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !151, file: !152, line: 389, baseType: !17, size: 64, offset: 3264)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !151, file: !152, line: 389, baseType: !17, size: 64, offset: 3328)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !151, file: !152, line: 389, baseType: !17, size: 64, offset: 3392)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !102, file: !103, line: 1244, baseType: !231, size: 64, offset: 2048)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !233, line: 200, size: 17024, elements: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !{!235, !237, !238, !239, !660, !661, !662, !663, !664, !665, !666}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !232, file: !233, line: 201, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !232, file: !233, line: 202, baseType: !73, size: 128, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !232, file: !233, line: 203, baseType: !73, size: 128, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !232, file: !233, line: 206, baseType: !240, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !233, line: 190, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !233, line: 126, size: 2816, elements: !243)
!243 = !{!244, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !343, !346, !347, !348, !631, !635, !636, !637, !638, !639, !640, !641, !642, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !659}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !233, line: 127, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !233, line: 127, baseType: !245, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !242, file: !233, line: 128, baseType: !17, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !242, file: !233, line: 129, baseType: !17, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !233, line: 130, baseType: !63, size: 512, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !242, file: !233, line: 132, baseType: !48, size: 32, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !233, line: 132, baseType: !48, size: 32, offset: 800)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !242, file: !233, line: 133, baseType: !48, size: 32, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !242, file: !233, line: 134, baseType: !48, size: 32, offset: 864)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !242, file: !233, line: 134, baseType: !48, size: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !242, file: !233, line: 134, baseType: !48, size: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !242, file: !233, line: 135, baseType: !48, size: 32, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !242, file: !233, line: 135, baseType: !48, size: 32, offset: 992)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !242, file: !233, line: 136, baseType: !48, size: 32, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !242, file: !233, line: 136, baseType: !48, size: 32, offset: 1056)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !242, file: !233, line: 137, baseType: !48, size: 32, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !242, file: !233, line: 137, baseType: !48, size: 32, offset: 1120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !242, file: !233, line: 138, baseType: !134, size: 32, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !242, file: !233, line: 139, baseType: !134, size: 32, offset: 1184)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !242, file: !233, line: 139, baseType: !134, size: 32, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !242, file: !233, line: 141, baseType: !46, size: 16, offset: 1248)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !242, file: !233, line: 142, baseType: !46, size: 16, offset: 1264)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !242, file: !233, line: 143, baseType: !48, size: 32, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !242, file: !233, line: 144, baseType: !48, size: 32, offset: 1312)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !242, file: !233, line: 146, baseType: !270, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !233, line: 114, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !233, line: 99, size: 7232, elements: !273)
!273 = !{!274, !276, !277, !278, !279, !280, !281, !292, !296, !311, !320, !327, !337}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !233, line: 100, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !233, line: 100, baseType: !275, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !272, file: !233, line: 101, baseType: !48, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !272, file: !233, line: 101, baseType: !48, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !272, file: !233, line: 102, baseType: !48, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !272, file: !233, line: 102, baseType: !48, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !272, file: !233, line: 103, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !233, line: 59, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !233, line: 56, size: 2112, elements: !285)
!285 = !{!286, !290, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !233, line: 57, baseType: !287, size: 2048)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !284, file: !233, line: 58, baseType: !48, size: 32, offset: 2048)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !284, file: !233, line: 58, baseType: !48, size: 32, offset: 2080)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !272, file: !233, line: 106, baseType: !293, size: 6144, offset: 320)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 6144, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !272, file: !233, line: 107, baseType: !297, size: 64, offset: 6464)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !233, line: 97, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !233, line: 83, size: 8320, elements: !300)
!300 = !{!301, !302, !303, !307, !308, !309, !310}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !299, file: !233, line: 84, baseType: !293, size: 6144)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !299, file: !233, line: 87, baseType: !287, size: 2048, offset: 6144)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !299, file: !233, line: 88, baseType: !304, size: 64, offset: 8192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !306, line: 41, flags: DIFlagFwdDecl)
!306 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !299, file: !233, line: 90, baseType: !46, size: 16, offset: 8256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !299, file: !233, line: 92, baseType: !46, size: 16, offset: 8272)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !299, file: !233, line: 93, baseType: !46, size: 16, offset: 8288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !299, file: !233, line: 95, baseType: !46, size: 16, offset: 8304)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !272, file: !233, line: 108, baseType: !312, size: 64, offset: 6528)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !233, line: 66, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !233, line: 61, size: 128, elements: !315)
!315 = !{!316, !317, !318, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !314, file: !233, line: 62, baseType: !48, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !314, file: !233, line: 63, baseType: !48, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !314, file: !233, line: 64, baseType: !48, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !314, file: !233, line: 65, baseType: !48, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !272, file: !233, line: 109, baseType: !321, size: 64, offset: 6592)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !233, line: 71, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !233, line: 68, size: 64, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !323, file: !233, line: 69, baseType: !48, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !323, file: !233, line: 70, baseType: !48, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !272, file: !233, line: 110, baseType: !328, size: 64, offset: 6656)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !233, line: 81, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !233, line: 73, size: 352, elements: !331)
!331 = !{!332, !333, !334, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !330, file: !233, line: 74, baseType: !133, size: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !330, file: !233, line: 75, baseType: !133, size: 96, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !330, file: !233, line: 76, baseType: !133, size: 96, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !233, line: 77, baseType: !48, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !233, line: 78, baseType: !48, size: 32, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !272, file: !233, line: 113, baseType: !338, size: 512, offset: 6720)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !339, line: 182, baseType: !340)
!339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !339, line: 180, size: 512, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !340, file: !339, line: 181, baseType: !63, size: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !242, file: !233, line: 148, baseType: !344, size: 64, offset: 1408)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !109, line: 46, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !242, file: !233, line: 151, baseType: !101, size: 64, offset: 1472)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !242, file: !233, line: 152, baseType: !111, size: 64, offset: 1536)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !242, file: !233, line: 153, baseType: !349, size: 64, offset: 1600)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !351, line: 64, size: 19136, elements: !352)
!351 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355, !356, !357, !358, !360, !361, !362, !363, !366, !367, !617, !618, !626, !627, !628, !629, !630}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !350, file: !351, line: 65, baseType: !12, size: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !350, file: !351, line: 66, baseType: !107, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !351, line: 68, baseType: !32, size: 8192, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !350, file: !351, line: 70, baseType: !48, size: 32, offset: 9216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !350, file: !351, line: 71, baseType: !48, size: 32, offset: 9248)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !350, file: !351, line: 72, baseType: !359, size: 64, offset: 9280)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !170)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !350, file: !351, line: 74, baseType: !134, size: 32, offset: 9344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !350, file: !351, line: 74, baseType: !134, size: 32, offset: 9376)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !350, file: !351, line: 76, baseType: !304, size: 64, offset: 9408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !350, file: !351, line: 77, baseType: !364, size: 64, offset: 9472)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !351, line: 77, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !350, file: !351, line: 78, baseType: !165, size: 64, offset: 9536)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !350, file: !351, line: 80, baseType: !368, size: 2624, offset: 9600)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !167, line: 340, size: 2624, elements: !369)
!369 = !{!370, !398, !416, !417, !418, !436, !494, !495, !597, !598, !599, !600, !606}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !368, file: !167, line: 341, baseType: !371, size: 576)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !167, line: 251, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !167, line: 207, size: 576, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !167, line: 208, baseType: !48, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !372, file: !167, line: 211, baseType: !46, size: 16, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !372, file: !167, line: 212, baseType: !46, size: 16, offset: 48)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !372, file: !167, line: 213, baseType: !134, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !372, file: !167, line: 214, baseType: !46, size: 16, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !372, file: !167, line: 215, baseType: !46, size: 16, offset: 112)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !372, file: !167, line: 216, baseType: !46, size: 16, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !372, file: !167, line: 217, baseType: !46, size: 16, offset: 144)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !372, file: !167, line: 218, baseType: !46, size: 16, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !372, file: !167, line: 219, baseType: !46, size: 16, offset: 176)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !372, file: !167, line: 220, baseType: !134, size: 32, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !372, file: !167, line: 222, baseType: !46, size: 16, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !372, file: !167, line: 225, baseType: !46, size: 16, offset: 240)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !372, file: !167, line: 228, baseType: !48, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !372, file: !167, line: 229, baseType: !48, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !372, file: !167, line: 233, baseType: !48, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !372, file: !167, line: 236, baseType: !46, size: 16, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !372, file: !167, line: 236, baseType: !46, size: 16, offset: 368)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !372, file: !167, line: 241, baseType: !134, size: 32, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !372, file: !167, line: 244, baseType: !48, size: 32, offset: 416)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !372, file: !167, line: 244, baseType: !48, size: 32, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !372, file: !167, line: 245, baseType: !134, size: 32, offset: 480)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !372, file: !167, line: 248, baseType: !134, size: 32, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !372, file: !167, line: 250, baseType: !48, size: 32, offset: 544)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !368, file: !167, line: 342, baseType: !399, size: 448, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !167, line: 79, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !167, line: 61, size: 448, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !400, file: !167, line: 62, baseType: !17, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !400, file: !167, line: 64, baseType: !46, size: 16, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !400, file: !167, line: 65, baseType: !46, size: 16, offset: 80)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !400, file: !167, line: 67, baseType: !134, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !400, file: !167, line: 68, baseType: !134, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !400, file: !167, line: 69, baseType: !134, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !400, file: !167, line: 70, baseType: !46, size: 16, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !400, file: !167, line: 71, baseType: !46, size: 16, offset: 208)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !400, file: !167, line: 72, baseType: !169, size: 64, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !400, file: !167, line: 75, baseType: !134, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !400, file: !167, line: 75, baseType: !134, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !400, file: !167, line: 75, baseType: !134, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !400, file: !167, line: 78, baseType: !134, size: 32, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !400, file: !167, line: 78, baseType: !134, size: 32, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !368, file: !167, line: 343, baseType: !73, size: 128, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !368, file: !167, line: 344, baseType: !73, size: 128, offset: 1152)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !368, file: !167, line: 345, baseType: !419, size: 192, offset: 1280)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !167, line: 278, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !167, line: 270, size: 192, elements: !421)
!421 = !{!422, !423, !424, !425, !426}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !420, file: !167, line: 271, baseType: !48, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !420, file: !167, line: 273, baseType: !134, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !420, file: !167, line: 275, baseType: !48, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !420, file: !167, line: 276, baseType: !48, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !420, file: !167, line: 277, baseType: !427, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !167, line: 55, size: 576, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !428, file: !167, line: 56, baseType: !48, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !428, file: !167, line: 57, baseType: !134, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !428, file: !167, line: 58, baseType: !433, size: 512, offset: 64)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !434)
!434 = !{!435, !435}
!435 = !DISubrange(count: 4)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !368, file: !167, line: 346, baseType: !437, size: 384, offset: 1472)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !167, line: 268, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !167, line: 253, size: 384, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !488, !489, !490, !491, !492, !493}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !438, file: !167, line: 254, baseType: !48, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !438, file: !167, line: 255, baseType: !48, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !438, file: !167, line: 255, baseType: !48, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !438, file: !167, line: 258, baseType: !134, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !438, file: !167, line: 259, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !167, line: 164, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !167, line: 108, size: 1664, elements: !448)
!448 = !{!449, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !167, line: 109, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !167, line: 109, baseType: !450, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !167, line: 111, baseType: !63, size: 512, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !447, file: !167, line: 119, baseType: !169, size: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !447, file: !167, line: 119, baseType: !169, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !447, file: !167, line: 125, baseType: !169, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !447, file: !167, line: 125, baseType: !169, size: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !447, file: !167, line: 127, baseType: !169, size: 64, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !447, file: !167, line: 130, baseType: !48, size: 32, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !447, file: !167, line: 131, baseType: !48, size: 32, offset: 992)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !447, file: !167, line: 132, baseType: !461, size: 64, offset: 1024)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !167, line: 106, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !167, line: 81, size: 512, elements: !464)
!464 = !{!465, !466, !469, !470, !471, !472}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !463, file: !167, line: 82, baseType: !169, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !463, file: !167, line: 97, baseType: !467, size: 256, offset: 64)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 256, elements: !468)
!468 = !{!435, !171}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !463, file: !167, line: 102, baseType: !169, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !463, file: !167, line: 102, baseType: !169, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !463, file: !167, line: 104, baseType: !48, size: 32, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !463, file: !167, line: 105, baseType: !48, size: 32, offset: 480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !447, file: !167, line: 135, baseType: !133, size: 96, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !447, file: !167, line: 136, baseType: !134, size: 32, offset: 1184)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !167, line: 139, baseType: !48, size: 32, offset: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !447, file: !167, line: 139, baseType: !48, size: 32, offset: 1248)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !447, file: !167, line: 139, baseType: !48, size: 32, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !447, file: !167, line: 140, baseType: !133, size: 96, offset: 1312)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !447, file: !167, line: 143, baseType: !46, size: 16, offset: 1408)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !447, file: !167, line: 144, baseType: !46, size: 16, offset: 1424)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !447, file: !167, line: 145, baseType: !46, size: 16, offset: 1440)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !447, file: !167, line: 148, baseType: !46, size: 16, offset: 1456)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !447, file: !167, line: 149, baseType: !48, size: 32, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !447, file: !167, line: 150, baseType: !134, size: 32, offset: 1504)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !447, file: !167, line: 152, baseType: !165, size: 64, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !447, file: !167, line: 163, baseType: !134, size: 32, offset: 1600)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !167, line: 163, baseType: !134, size: 32, offset: 1632)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !438, file: !167, line: 261, baseType: !134, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !438, file: !167, line: 261, baseType: !134, size: 32, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !438, file: !167, line: 261, baseType: !134, size: 32, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !438, file: !167, line: 263, baseType: !48, size: 32, offset: 288)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !438, file: !167, line: 266, baseType: !48, size: 32, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !438, file: !167, line: 267, baseType: !134, size: 32, offset: 352)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !368, file: !167, line: 347, baseType: !445, size: 64, offset: 1856)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !368, file: !167, line: 348, baseType: !496, size: 64, offset: 1920)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !167, line: 205, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !167, line: 186, size: 1024, elements: !499)
!499 = !{!500, !502, !503, !504, !506, !507, !508, !516, !517, !518, !595, !596}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !167, line: 187, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !498, file: !167, line: 187, baseType: !501, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !498, file: !167, line: 189, baseType: !63, size: 512, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !498, file: !167, line: 191, baseType: !505, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !498, file: !167, line: 193, baseType: !48, size: 32, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !498, file: !167, line: 193, baseType: !48, size: 32, offset: 736)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !498, file: !167, line: 195, baseType: !509, size: 64, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !167, line: 184, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !167, line: 166, size: 320, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !511, file: !167, line: 180, baseType: !467, size: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !511, file: !167, line: 182, baseType: !48, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !167, line: 183, baseType: !48, size: 32, offset: 288)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !498, file: !167, line: 196, baseType: !48, size: 32, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !498, file: !167, line: 198, baseType: !48, size: 32, offset: 864)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !498, file: !167, line: 200, baseType: !519, size: 64, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !306, line: 77, size: 15424, elements: !521)
!521 = !{!522, !523, !524, !527, !530, !531, !534, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !554, !555, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !581, !582, !583, !584, !585, !589}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !520, file: !306, line: 78, baseType: !12, size: 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !520, file: !306, line: 80, baseType: !32, size: 8192, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !520, file: !306, line: 82, baseType: !525, size: 64, offset: 9152)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !306, line: 43, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !520, file: !306, line: 83, baseType: !528, size: 64, offset: 9216)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !13, line: 46, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !520, file: !306, line: 86, baseType: !304, size: 64, offset: 9280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !520, file: !306, line: 87, baseType: !532, size: 64, offset: 9344)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !306, line: 44, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !520, file: !306, line: 89, baseType: !535, size: 512, offset: 9408)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 512, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 8)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !520, file: !306, line: 90, baseType: !46, size: 16, offset: 9920)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !520, file: !306, line: 90, baseType: !46, size: 16, offset: 9936)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !520, file: !306, line: 92, baseType: !46, size: 16, offset: 9952)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !520, file: !306, line: 92, baseType: !46, size: 16, offset: 9968)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !520, file: !306, line: 93, baseType: !46, size: 16, offset: 9984)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !520, file: !306, line: 93, baseType: !46, size: 16, offset: 10000)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !520, file: !306, line: 94, baseType: !48, size: 32, offset: 10016)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !520, file: !306, line: 97, baseType: !46, size: 16, offset: 10048)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !520, file: !306, line: 97, baseType: !46, size: 16, offset: 10064)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !520, file: !306, line: 98, baseType: !46, size: 16, offset: 10080)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !520, file: !306, line: 98, baseType: !46, size: 16, offset: 10096)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !520, file: !306, line: 99, baseType: !46, size: 16, offset: 10112)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !520, file: !306, line: 99, baseType: !46, size: 16, offset: 10128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !520, file: !306, line: 100, baseType: !125, size: 32, offset: 10144)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !520, file: !306, line: 101, baseType: !553, size: 64, offset: 10176)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !520, file: !306, line: 103, baseType: !39, size: 64, offset: 10240)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !520, file: !306, line: 104, baseType: !556, size: 64, offset: 10304)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !13, line: 159, size: 448, elements: !558)
!558 = !{!559, !561, !562, !564, !565, !567}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !557, file: !13, line: 161, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !170)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !557, file: !13, line: 162, baseType: !560, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !557, file: !13, line: 163, baseType: !563, size: 32, offset: 128)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !170)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !557, file: !13, line: 164, baseType: !563, size: 32, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !557, file: !13, line: 165, baseType: !566, size: 128, offset: 192)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 128, elements: !170)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !557, file: !13, line: 166, baseType: !568, size: 128, offset: 320)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 128, elements: !170)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !520, file: !306, line: 107, baseType: !134, size: 32, offset: 10368)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !520, file: !306, line: 108, baseType: !48, size: 32, offset: 10400)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !520, file: !306, line: 109, baseType: !46, size: 16, offset: 10432)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !520, file: !306, line: 110, baseType: !46, size: 16, offset: 10448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !520, file: !306, line: 113, baseType: !48, size: 32, offset: 10464)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !520, file: !306, line: 113, baseType: !48, size: 32, offset: 10496)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !520, file: !306, line: 114, baseType: !33, size: 8, offset: 10528)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !520, file: !306, line: 114, baseType: !33, size: 8, offset: 10536)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !520, file: !306, line: 115, baseType: !46, size: 16, offset: 10544)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !520, file: !306, line: 116, baseType: !579, size: 128, offset: 10560)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 128, elements: !580)
!580 = !{!435}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !520, file: !306, line: 119, baseType: !134, size: 32, offset: 10688)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !520, file: !306, line: 119, baseType: !134, size: 32, offset: 10720)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !520, file: !306, line: 122, baseType: !338, size: 512, offset: 10752)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !520, file: !306, line: 123, baseType: !33, size: 8, offset: 11264)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !520, file: !306, line: 125, baseType: !586, size: 56, offset: 11272)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 56, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 7)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !520, file: !306, line: 126, baseType: !590, size: 4096, offset: 11328)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 4096, elements: !536)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !306, line: 69, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !306, line: 67, size: 512, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !592, file: !306, line: 68, baseType: !63, size: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !498, file: !167, line: 201, baseType: !134, size: 32, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !498, file: !167, line: 204, baseType: !48, size: 32, offset: 992)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !368, file: !167, line: 350, baseType: !73, size: 128, offset: 1984)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !368, file: !167, line: 351, baseType: !48, size: 32, offset: 2112)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !368, file: !167, line: 351, baseType: !48, size: 32, offset: 2144)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !368, file: !167, line: 353, baseType: !601, size: 64, offset: 2176)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !167, line: 297, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !167, line: 295, size: 2048, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !603, file: !167, line: 296, baseType: !287, size: 2048)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !368, file: !167, line: 355, baseType: !607, size: 384, offset: 2240)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !167, line: 338, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !167, line: 322, size: 384, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !608, file: !167, line: 323, baseType: !48, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !608, file: !167, line: 325, baseType: !46, size: 16, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !608, file: !167, line: 326, baseType: !46, size: 16, offset: 48)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !608, file: !167, line: 331, baseType: !73, size: 128, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !608, file: !167, line: 334, baseType: !73, size: 128, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !608, file: !167, line: 335, baseType: !48, size: 32, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !608, file: !167, line: 337, baseType: !48, size: 32, offset: 352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !350, file: !351, line: 81, baseType: !17, size: 64, offset: 12224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !350, file: !351, line: 85, baseType: !619, size: 6208, offset: 12288)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !351, line: 55, size: 6208, elements: !620)
!620 = !{!621, !622, !623, !624, !625}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !619, file: !351, line: 56, baseType: !293, size: 6144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !619, file: !351, line: 58, baseType: !46, size: 16, offset: 6144)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !619, file: !351, line: 59, baseType: !46, size: 16, offset: 6160)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !619, file: !351, line: 60, baseType: !46, size: 16, offset: 6176)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !619, file: !351, line: 61, baseType: !46, size: 16, offset: 6192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !351, line: 86, baseType: !48, size: 32, offset: 18496)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !350, file: !351, line: 88, baseType: !48, size: 32, offset: 18528)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !350, file: !351, line: 90, baseType: !48, size: 32, offset: 18560)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !350, file: !351, line: 94, baseType: !48, size: 32, offset: 18592)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !350, file: !351, line: 100, baseType: !338, size: 512, offset: 18624)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !242, file: !233, line: 154, baseType: !632, size: 64, offset: 1664)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !634, line: 264, flags: DIFlagFwdDecl)
!634 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!635 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !242, file: !233, line: 156, baseType: !304, size: 64, offset: 1728)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !242, file: !233, line: 158, baseType: !134, size: 32, offset: 1792)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !242, file: !233, line: 159, baseType: !134, size: 32, offset: 1824)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !242, file: !233, line: 162, baseType: !245, size: 64, offset: 1856)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !242, file: !233, line: 162, baseType: !245, size: 64, offset: 1920)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !242, file: !233, line: 162, baseType: !245, size: 64, offset: 1984)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !242, file: !233, line: 164, baseType: !73, size: 128, offset: 2048)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !242, file: !233, line: 166, baseType: !643, size: 64, offset: 2176)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !233, line: 51, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !242, file: !233, line: 167, baseType: !17, size: 64, offset: 2240)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !242, file: !233, line: 168, baseType: !134, size: 32, offset: 2304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !242, file: !233, line: 170, baseType: !134, size: 32, offset: 2336)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !242, file: !233, line: 170, baseType: !134, size: 32, offset: 2368)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !242, file: !233, line: 171, baseType: !134, size: 32, offset: 2400)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !242, file: !233, line: 173, baseType: !17, size: 64, offset: 2432)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !242, file: !233, line: 175, baseType: !48, size: 32, offset: 2496)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !242, file: !233, line: 176, baseType: !48, size: 32, offset: 2528)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !242, file: !233, line: 179, baseType: !48, size: 32, offset: 2560)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !242, file: !233, line: 180, baseType: !134, size: 32, offset: 2592)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !242, file: !233, line: 183, baseType: !48, size: 32, offset: 2624)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !242, file: !233, line: 185, baseType: !33, size: 8, offset: 2656)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !242, file: !233, line: 186, baseType: !658, size: 24, offset: 2664)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, elements: !135)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !242, file: !233, line: 189, baseType: !73, size: 128, offset: 2688)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !232, file: !233, line: 207, baseType: !32, size: 8192, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !232, file: !233, line: 208, baseType: !32, size: 8192, offset: 8576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !232, file: !233, line: 210, baseType: !48, size: 32, offset: 16768)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !232, file: !233, line: 210, baseType: !48, size: 32, offset: 16800)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !232, file: !233, line: 211, baseType: !48, size: 32, offset: 16832)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !232, file: !233, line: 211, baseType: !48, size: 32, offset: 16864)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !232, file: !233, line: 212, baseType: !187, size: 128, offset: 16896)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !102, file: !103, line: 1246, baseType: !668, size: 64, offset: 2112)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !103, line: 1067, size: 5184, elements: !670)
!670 = !{!671, !701, !702, !717, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !739, !755, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !865}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !669, file: !103, line: 1068, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !103, line: 934, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !103, line: 925, size: 576, elements: !675)
!675 = !{!676, !693, !694, !695, !696, !697, !700}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !674, file: !103, line: 926, baseType: !677, size: 320)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !103, line: 830, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !103, line: 813, size: 320, elements: !679)
!679 = !{!680, !683, !686, !687, !690, !691, !692}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !678, file: !103, line: 814, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !103, line: 51, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !678, file: !103, line: 815, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !103, line: 815, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !678, file: !103, line: 818, baseType: !17, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !678, file: !103, line: 819, baseType: !688, size: 32, offset: 192)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 32, elements: !580)
!689 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !103, line: 822, baseType: !48, size: 32, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !678, file: !103, line: 826, baseType: !48, size: 32, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !678, file: !103, line: 829, baseType: !48, size: 32, offset: 288)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !674, file: !103, line: 928, baseType: !46, size: 16, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !674, file: !103, line: 928, baseType: !46, size: 16, offset: 336)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !674, file: !103, line: 929, baseType: !48, size: 32, offset: 352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !674, file: !103, line: 930, baseType: !553, size: 64, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !674, file: !103, line: 931, baseType: !698, size: 64, offset: 448)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !103, line: 931, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !674, file: !103, line: 933, baseType: !17, size: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !669, file: !103, line: 1069, baseType: !672, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !669, file: !103, line: 1070, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !103, line: 916, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !103, line: 891, size: 704, elements: !706)
!706 = !{!707, !708, !709, !711, !712, !713, !714, !715, !716}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !705, file: !103, line: 892, baseType: !677, size: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !103, line: 896, baseType: !48, size: 32, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !705, file: !103, line: 900, baseType: !710, size: 96, offset: 352)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !135)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !705, file: !103, line: 903, baseType: !134, size: 32, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !705, file: !103, line: 906, baseType: !48, size: 32, offset: 480)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !705, file: !103, line: 909, baseType: !134, size: 32, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !705, file: !103, line: 912, baseType: !134, size: 32, offset: 544)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !705, file: !103, line: 914, baseType: !111, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !705, file: !103, line: 915, baseType: !17, size: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !669, file: !103, line: 1071, baseType: !718, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !103, line: 920, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !103, line: 918, size: 320, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !720, file: !103, line: 919, baseType: !677, size: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !669, file: !103, line: 1075, baseType: !134, size: 32, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !669, file: !103, line: 1077, baseType: !134, size: 32, offset: 288)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !669, file: !103, line: 1078, baseType: !134, size: 32, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !669, file: !103, line: 1079, baseType: !46, size: 16, offset: 352)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !669, file: !103, line: 1082, baseType: !46, size: 16, offset: 368)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !669, file: !103, line: 1085, baseType: !33, size: 8, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !669, file: !103, line: 1086, baseType: !33, size: 8, offset: 392)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !669, file: !103, line: 1087, baseType: !33, size: 8, offset: 400)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !669, file: !103, line: 1088, baseType: !33, size: 8, offset: 408)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !669, file: !103, line: 1090, baseType: !134, size: 32, offset: 416)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !669, file: !103, line: 1093, baseType: !46, size: 16, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !669, file: !103, line: 1096, baseType: !33, size: 8, offset: 464)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !669, file: !103, line: 1098, baseType: !736, size: 40, offset: 472)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 40, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 5)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !669, file: !103, line: 1101, baseType: !740, size: 832, offset: 512)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !103, line: 836, size: 832, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !740, file: !103, line: 837, baseType: !677, size: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !740, file: !103, line: 839, baseType: !46, size: 16, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !740, file: !103, line: 839, baseType: !46, size: 16, offset: 336)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !740, file: !103, line: 842, baseType: !46, size: 16, offset: 352)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !740, file: !103, line: 842, baseType: !46, size: 16, offset: 368)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !740, file: !103, line: 843, baseType: !563, size: 32, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !740, file: !103, line: 845, baseType: !48, size: 32, offset: 416)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !740, file: !103, line: 847, baseType: !17, size: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !740, file: !103, line: 848, baseType: !519, size: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !740, file: !103, line: 849, baseType: !519, size: 64, offset: 576)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !740, file: !103, line: 850, baseType: !519, size: 64, offset: 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !740, file: !103, line: 851, baseType: !133, size: 96, offset: 704)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !740, file: !103, line: 852, baseType: !134, size: 32, offset: 800)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !669, file: !103, line: 1104, baseType: !756, size: 1344, offset: 1344)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !103, line: 867, size: 1344, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !756, file: !103, line: 868, baseType: !46, size: 16)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !756, file: !103, line: 869, baseType: !46, size: 16, offset: 16)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !756, file: !103, line: 870, baseType: !46, size: 16, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !756, file: !103, line: 871, baseType: !46, size: 16, offset: 48)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !756, file: !103, line: 873, baseType: !763, size: 896, offset: 64)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 896, elements: !587)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !103, line: 864, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !103, line: 859, size: 128, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !765, file: !103, line: 860, baseType: !46, size: 16)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !765, file: !103, line: 861, baseType: !46, size: 16, offset: 16)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !765, file: !103, line: 861, baseType: !46, size: 16, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !765, file: !103, line: 861, baseType: !46, size: 16, offset: 48)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !765, file: !103, line: 862, baseType: !48, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !765, file: !103, line: 863, baseType: !134, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !756, file: !103, line: 874, baseType: !17, size: 64, offset: 960)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !756, file: !103, line: 876, baseType: !134, size: 32, offset: 1024)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !756, file: !103, line: 876, baseType: !134, size: 32, offset: 1056)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !756, file: !103, line: 878, baseType: !48, size: 32, offset: 1088)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !756, file: !103, line: 879, baseType: !48, size: 32, offset: 1120)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !756, file: !103, line: 881, baseType: !48, size: 32, offset: 1152)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !756, file: !103, line: 881, baseType: !48, size: 32, offset: 1184)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !756, file: !103, line: 883, baseType: !101, size: 64, offset: 1216)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !756, file: !103, line: 884, baseType: !111, size: 64, offset: 1280)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !669, file: !103, line: 1107, baseType: !134, size: 32, offset: 2688)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !669, file: !103, line: 1110, baseType: !134, size: 32, offset: 2720)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !669, file: !103, line: 1113, baseType: !46, size: 16, offset: 2752)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !669, file: !103, line: 1113, baseType: !46, size: 16, offset: 2768)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !669, file: !103, line: 1116, baseType: !33, size: 8, offset: 2784)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !669, file: !103, line: 1117, baseType: !146, size: 8, offset: 2792)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !669, file: !103, line: 1120, baseType: !46, size: 16, offset: 2800)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !669, file: !103, line: 1121, baseType: !134, size: 32, offset: 2816)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !669, file: !103, line: 1122, baseType: !134, size: 32, offset: 2848)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !669, file: !103, line: 1123, baseType: !134, size: 32, offset: 2880)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !669, file: !103, line: 1124, baseType: !134, size: 32, offset: 2912)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !669, file: !103, line: 1125, baseType: !134, size: 32, offset: 2944)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !669, file: !103, line: 1126, baseType: !134, size: 32, offset: 2976)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !669, file: !103, line: 1127, baseType: !134, size: 32, offset: 3008)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !669, file: !103, line: 1128, baseType: !134, size: 32, offset: 3040)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !669, file: !103, line: 1129, baseType: !134, size: 32, offset: 3072)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !669, file: !103, line: 1130, baseType: !134, size: 32, offset: 3104)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !669, file: !103, line: 1131, baseType: !46, size: 16, offset: 3136)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !669, file: !103, line: 1132, baseType: !33, size: 8, offset: 3152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !669, file: !103, line: 1133, baseType: !33, size: 8, offset: 3160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !669, file: !103, line: 1134, baseType: !658, size: 24, offset: 3168)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !669, file: !103, line: 1135, baseType: !33, size: 8, offset: 3192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !669, file: !103, line: 1138, baseType: !111, size: 64, offset: 3200)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !669, file: !103, line: 1139, baseType: !33, size: 8, offset: 3264)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !669, file: !103, line: 1140, baseType: !33, size: 8, offset: 3272)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !669, file: !103, line: 1141, baseType: !33, size: 8, offset: 3280)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !669, file: !103, line: 1142, baseType: !33, size: 8, offset: 3288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !669, file: !103, line: 1143, baseType: !33, size: 8, offset: 3296)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !669, file: !103, line: 1144, baseType: !811, size: 64, offset: 3304)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !536)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !669, file: !103, line: 1145, baseType: !811, size: 64, offset: 3368)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !669, file: !103, line: 1148, baseType: !33, size: 8, offset: 3432)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !669, file: !103, line: 1149, baseType: !33, size: 8, offset: 3440)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !669, file: !103, line: 1152, baseType: !33, size: 8, offset: 3448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !669, file: !103, line: 1152, baseType: !33, size: 8, offset: 3456)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !669, file: !103, line: 1153, baseType: !33, size: 8, offset: 3464)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !669, file: !103, line: 1154, baseType: !46, size: 16, offset: 3472)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !669, file: !103, line: 1154, baseType: !46, size: 16, offset: 3488)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !669, file: !103, line: 1155, baseType: !46, size: 16, offset: 3504)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !669, file: !103, line: 1155, baseType: !46, size: 16, offset: 3520)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !669, file: !103, line: 1156, baseType: !33, size: 8, offset: 3536)
