; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_screen_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_screen_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 292, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "SCREENNORMAL", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "SCREENMAXIMIZED", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "SCREENFULL", value: 2, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 123, baseType: !7, size: 32, elements: !64)
!63 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73}
!65 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!70 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!71 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!72 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!73 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !75, line: 1163, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!77 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!87 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!88 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!89 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!90 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!91 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!92 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!93 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!95 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!96 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!97 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!98 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!99 = !{!100, !264, !1728, !48, !1774, !1733, !405, !1845, !1779, !1846, !296, !1808, !110}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !57, line: 80, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !57, line: 49, size: 1984, elements: !103)
!103 = !{!104, !175, !176, !177, !178, !179, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !102, file: !57, line: 50, baseType: !105, size: 960)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !106, line: 130, baseType: !107)
!106 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !106, line: 117, size: 960, elements: !108)
!108 = !{!109, !111, !112, !114, !134, !138, !140, !141, !142, !143}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !107, file: !106, line: 118, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !107, file: !106, line: 118, baseType: !110, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !107, file: !106, line: 119, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !107, file: !106, line: 120, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !106, line: 136, size: 17600, elements: !117)
!117 = !{!118, !119, !121, !124, !129, !130, !131}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !116, file: !106, line: 137, baseType: !105, size: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !116, file: !106, line: 138, baseType: !120, size: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !116, file: !106, line: 139, baseType: !122, size: 64, offset: 1024)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !106, line: 43, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !106, line: 140, baseType: !125, size: 8192, offset: 1088)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8192, elements: !127)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!127 = !{!128}
!128 = !DISubrange(count: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !116, file: !106, line: 141, baseType: !125, size: 8192, offset: 9280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !116, file: !106, line: 148, baseType: !115, size: 64, offset: 17472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !116, file: !106, line: 150, baseType: !132, size: 64, offset: 17536)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !106, line: 45, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !106, line: 121, baseType: !135, size: 528, offset: 256)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 528, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 66)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !107, file: !106, line: 126, baseType: !139, size: 16, offset: 784)
!139 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !107, file: !106, line: 127, baseType: !48, size: 32, offset: 800)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !107, file: !106, line: 128, baseType: !48, size: 32, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !107, file: !106, line: 128, baseType: !48, size: 32, offset: 864)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !107, file: !106, line: 129, baseType: !144, size: 64, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !106, line: 75, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !106, line: 62, size: 1024, elements: !147)
!147 = !{!148, !150, !151, !152, !153, !154, !158, !159, !173, !174}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !106, line: 63, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !106, line: 63, baseType: !149, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !106, line: 64, baseType: !126, size: 8, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !146, file: !106, line: 64, baseType: !126, size: 8, offset: 136)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !106, line: 65, baseType: !139, size: 16, offset: 144)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !106, line: 66, baseType: !155, size: 512, offset: 160)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !146, file: !106, line: 67, baseType: !48, size: 32, offset: 672)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !106, line: 69, baseType: !160, size: 256, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !106, line: 60, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !106, line: 48, size: 256, elements: !162)
!162 = !{!163, !164, !171, !172}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !161, file: !106, line: 49, baseType: !110, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !161, file: !106, line: 58, baseType: !165, size: 128, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !166, line: 71, baseType: !167)
!166 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !166, line: 69, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !167, file: !166, line: 70, baseType: !110, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !167, file: !166, line: 70, baseType: !110, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !161, file: !106, line: 59, baseType: !48, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !161, file: !106, line: 59, baseType: !48, size: 32, offset: 224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !146, file: !106, line: 70, baseType: !48, size: 32, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !146, file: !106, line: 74, baseType: !48, size: 32, offset: 992)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !102, file: !57, line: 52, baseType: !165, size: 128, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !102, file: !57, line: 53, baseType: !165, size: 128, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !102, file: !57, line: 54, baseType: !165, size: 128, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !102, file: !57, line: 55, baseType: !165, size: 128, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !102, file: !57, line: 57, baseType: !180, size: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !182, line: 1216, size: 39680, elements: !183)
!182 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !{!184, !185, !188, !191, !194, !195, !196, !208, !209, !214, !215, !216, !217, !218, !219, !220, !221, !222, !226, !649, !1083, !1297, !1300, !1586, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1608, !1609, !1610, !1611, !1612, !1620, !1687, !1694, !1695, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !181, file: !182, line: 1217, baseType: !105, size: 960)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !181, file: !182, line: 1218, baseType: !186, size: 64, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !182, line: 58, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !181, file: !182, line: 1220, baseType: !189, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !182, line: 50, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !181, file: !182, line: 1221, baseType: !192, size: 64, offset: 1088)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !182, line: 52, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !181, file: !182, line: 1223, baseType: !180, size: 64, offset: 1152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !181, file: !182, line: 1225, baseType: !165, size: 128, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !181, file: !182, line: 1226, baseType: !197, size: 64, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !182, line: 69, size: 320, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !182, line: 70, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !182, line: 70, baseType: !197, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !198, file: !182, line: 71, baseType: !7, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !198, file: !182, line: 71, baseType: !7, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !182, line: 72, baseType: !48, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !198, file: !182, line: 73, baseType: !139, size: 16, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !198, file: !182, line: 73, baseType: !139, size: 16, offset: 240)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !198, file: !182, line: 74, baseType: !189, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !181, file: !182, line: 1227, baseType: !189, size: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !181, file: !182, line: 1229, baseType: !210, size: 96, offset: 1472)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 96, elements: !212)
!211 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!212 = !{!213}
!213 = !DISubrange(count: 3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !181, file: !182, line: 1230, baseType: !210, size: 96, offset: 1568)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !181, file: !182, line: 1231, baseType: !210, size: 96, offset: 1664)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !181, file: !182, line: 1231, baseType: !210, size: 96, offset: 1760)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !181, file: !182, line: 1233, baseType: !7, size: 32, offset: 1856)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !181, file: !182, line: 1234, baseType: !48, size: 32, offset: 1888)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !181, file: !182, line: 1235, baseType: !7, size: 32, offset: 1920)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !182, line: 1237, baseType: !139, size: 16, offset: 1952)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !181, file: !182, line: 1239, baseType: !126, size: 8, offset: 1968)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !181, file: !182, line: 1240, baseType: !223, size: 8, offset: 1976)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 1)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !181, file: !182, line: 1242, baseType: !227, size: 64, offset: 1984)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !229, line: 328, size: 3456, elements: !230)
!229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = !{!231, !232, !233, !237, !238, !590, !593, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !618, !619, !620, !623, !628, !629, !632, !636, !640, !644, !645, !646, !647, !648}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !228, file: !229, line: 329, baseType: !105, size: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !228, file: !229, line: 330, baseType: !186, size: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !228, file: !229, line: 332, baseType: !234, size: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !236, line: 32, flags: DIFlagFwdDecl)
!236 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !228, file: !229, line: 333, baseType: !155, size: 512, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !228, file: !229, line: 335, baseType: !239, size: 64, offset: 1600)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !241, line: 339, size: 1600, elements: !242)
!241 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !{!243, !253, !256, !257, !258, !259, !260, !261, !262, !263, !392, !393, !394, !395, !400, !406, !572, !577, !583, !589}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !240, file: !241, line: 341, baseType: !244, size: 320)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !241, line: 135, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !241, line: 130, size: 320, elements: !246)
!246 = !{!247, !248, !249, !252}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !241, line: 131, baseType: !110, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !241, line: 131, baseType: !110, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !245, file: !241, line: 133, baseType: !250, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !241, line: 46, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !245, file: !241, line: 134, baseType: !165, size: 128, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !240, file: !241, line: 344, baseType: !254, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !240, file: !241, line: 348, baseType: !110, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !240, file: !241, line: 349, baseType: !110, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !240, file: !241, line: 352, baseType: !48, size: 32, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !241, line: 355, baseType: !254, size: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !240, file: !241, line: 357, baseType: !254, size: 64, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !240, file: !241, line: 359, baseType: !254, size: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !240, file: !241, line: 361, baseType: !48, size: 32, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !240, file: !241, line: 364, baseType: !264, size: 64, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !241, line: 157, size: 1344, elements: !267)
!267 = !{!268, !270, !271, !272, !273, !274, !275, !276, !277, !278, !280, !282, !297, !298, !300, !301, !376, !377, !382, !387, !388, !390, !391}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !241, line: 158, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !241, line: 158, baseType: !269, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !266, file: !241, line: 161, baseType: !48, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !266, file: !241, line: 164, baseType: !254, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !241, line: 166, baseType: !48, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !241, line: 169, baseType: !254, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !266, file: !241, line: 171, baseType: !254, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !266, file: !241, line: 173, baseType: !48, size: 32, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !266, file: !241, line: 175, baseType: !254, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !241, line: 178, baseType: !279, size: 32, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !266, file: !241, line: 180, baseType: !281, size: 32, offset: 608)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !266, file: !241, line: 182, baseType: !283, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !241, line: 73, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!48, !287, !296}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !289)
!289 = !{!290, !294, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !288, file: !6, line: 58, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !6, line: 56, size: 64, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !291, file: !6, line: 57, baseType: !110, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !6, line: 60, baseType: !239, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !288, file: !6, line: 61, baseType: !110, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !266, file: !241, line: 184, baseType: !7, size: 32, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !266, file: !241, line: 186, baseType: !299, size: 96, offset: 736)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !212)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !266, file: !241, line: 187, baseType: !7, size: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !266, file: !241, line: 190, baseType: !302, size: 64, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !241, line: 64, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306, !180, !287}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !308, line: 53, size: 15232, elements: !309)
!308 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !323, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !367, !373}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !308, line: 54, baseType: !306, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !308, line: 54, baseType: !306, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 55, baseType: !125, size: 8192, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !307, file: !308, line: 56, baseType: !139, size: 16, offset: 8320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !307, file: !308, line: 56, baseType: !139, size: 16, offset: 8336)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !307, file: !308, line: 57, baseType: !139, size: 16, offset: 8352)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !307, file: !308, line: 57, baseType: !139, size: 16, offset: 8368)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !307, file: !308, line: 58, baseType: !318, size: 64, offset: 8384)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !319, line: 27, baseType: !320)
!319 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !321, line: 45, baseType: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!322 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !307, file: !308, line: 59, baseType: !324, size: 128, offset: 8448)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !307, file: !308, line: 60, baseType: !139, size: 16, offset: 8576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !307, file: !308, line: 62, baseType: !115, size: 64, offset: 8640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !307, file: !308, line: 63, baseType: !165, size: 128, offset: 8704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !307, file: !308, line: 64, baseType: !165, size: 128, offset: 8832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !307, file: !308, line: 65, baseType: !165, size: 128, offset: 8960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !307, file: !308, line: 66, baseType: !165, size: 128, offset: 9088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !307, file: !308, line: 67, baseType: !165, size: 128, offset: 9216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !307, file: !308, line: 68, baseType: !165, size: 128, offset: 9344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !307, file: !308, line: 69, baseType: !165, size: 128, offset: 9472)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !307, file: !308, line: 70, baseType: !165, size: 128, offset: 9600)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !307, file: !308, line: 71, baseType: !165, size: 128, offset: 9728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !307, file: !308, line: 72, baseType: !165, size: 128, offset: 9856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !307, file: !308, line: 73, baseType: !165, size: 128, offset: 9984)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !307, file: !308, line: 74, baseType: !165, size: 128, offset: 10112)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !307, file: !308, line: 75, baseType: !165, size: 128, offset: 10240)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !307, file: !308, line: 76, baseType: !165, size: 128, offset: 10368)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !307, file: !308, line: 77, baseType: !165, size: 128, offset: 10496)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !307, file: !308, line: 78, baseType: !165, size: 128, offset: 10624)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !307, file: !308, line: 79, baseType: !165, size: 128, offset: 10752)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !307, file: !308, line: 80, baseType: !165, size: 128, offset: 10880)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !307, file: !308, line: 81, baseType: !165, size: 128, offset: 11008)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !307, file: !308, line: 82, baseType: !165, size: 128, offset: 11136)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !307, file: !308, line: 83, baseType: !165, size: 128, offset: 11264)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !307, file: !308, line: 84, baseType: !165, size: 128, offset: 11392)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !307, file: !308, line: 85, baseType: !165, size: 128, offset: 11520)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !307, file: !308, line: 86, baseType: !165, size: 128, offset: 11648)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !307, file: !308, line: 87, baseType: !165, size: 128, offset: 11776)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !307, file: !308, line: 88, baseType: !165, size: 128, offset: 11904)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !307, file: !308, line: 89, baseType: !165, size: 128, offset: 12032)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !307, file: !308, line: 90, baseType: !165, size: 128, offset: 12160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !307, file: !308, line: 91, baseType: !165, size: 128, offset: 12288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !307, file: !308, line: 92, baseType: !165, size: 128, offset: 12416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !307, file: !308, line: 93, baseType: !165, size: 128, offset: 12544)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !307, file: !308, line: 94, baseType: !165, size: 128, offset: 12672)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !307, file: !308, line: 95, baseType: !165, size: 128, offset: 12800)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !307, file: !308, line: 96, baseType: !165, size: 128, offset: 12928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !307, file: !308, line: 98, baseType: !364, size: 2048, offset: 13056)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !307, file: !308, line: 101, baseType: !368, size: 64, offset: 15104)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !370, line: 58, size: 32, elements: !371)
!370 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !369, file: !370, line: 59, baseType: !48, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !307, file: !308, line: 103, baseType: !374, size: 64, offset: 15168)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !308, line: 51, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "noteflag", scope: !266, file: !241, line: 191, baseType: !48, size: 32, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "editable", scope: !266, file: !241, line: 194, baseType: !378, size: 64, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditableFunc", file: !241, line: 67, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!48, !287}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "itemeditable", scope: !266, file: !241, line: 196, baseType: !383, size: 64, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ItemEditableFunc", file: !241, line: 68, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!48, !287, !48}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rawoffset", scope: !266, file: !241, line: 199, baseType: !48, size: 32, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "rawtype", scope: !266, file: !241, line: 200, baseType: !389, size: 32, offset: 1184)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "RawPropertyType", file: !6, line: 293, baseType: !47)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !266, file: !241, line: 205, baseType: !239, size: 64, offset: 1216)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "py_data", scope: !266, file: !241, line: 209, baseType: !110, size: 64, offset: 1280)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !240, file: !241, line: 367, baseType: !264, size: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !240, file: !241, line: 370, baseType: !239, size: 64, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !240, file: !241, line: 376, baseType: !239, size: 64, offset: 1024)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !240, file: !241, line: 379, baseType: !396, size: 64, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !241, line: 70, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!239, !287}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !240, file: !241, line: 382, baseType: !401, size: 64, offset: 1152)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !241, line: 71, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!405, !287}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !240, file: !241, line: 385, baseType: !407, size: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!239, !306, !411, !110, !254, !534, !538, !568}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !413, line: 106, size: 320, elements: !414)
!413 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !412, file: !413, line: 107, baseType: !165, size: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !412, file: !413, line: 108, baseType: !48, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !412, file: !413, line: 109, baseType: !48, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !413, line: 110, baseType: !48, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !412, file: !413, line: 110, baseType: !48, size: 32, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !412, file: !413, line: 111, baseType: !421, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !423, line: 490, size: 768, elements: !424)
!423 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !{!425, !426, !427, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !423, line: 491, baseType: !421, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !423, line: 491, baseType: !421, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !422, file: !423, line: 493, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !413, line: 169, size: 2048, elements: !430)
!430 = !{!431, !432, !433, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !500, !503, !517, !518, !519, !520, !521, !522, !523, !524}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !413, line: 170, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !413, line: 170, baseType: !428, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !429, file: !413, line: 172, baseType: !110, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !429, file: !413, line: 174, baseType: !435, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !429, file: !413, line: 175, baseType: !435, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !429, file: !413, line: 176, baseType: !155, size: 512, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !429, file: !413, line: 178, baseType: !139, size: 16, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !429, file: !413, line: 178, baseType: !139, size: 16, offset: 848)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !429, file: !413, line: 178, baseType: !139, size: 16, offset: 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !429, file: !413, line: 178, baseType: !139, size: 16, offset: 880)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !429, file: !413, line: 179, baseType: !139, size: 16, offset: 896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !429, file: !413, line: 180, baseType: !139, size: 16, offset: 912)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !429, file: !413, line: 181, baseType: !139, size: 16, offset: 928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !429, file: !413, line: 182, baseType: !139, size: 16, offset: 944)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !429, file: !413, line: 183, baseType: !139, size: 16, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !429, file: !413, line: 184, baseType: !139, size: 16, offset: 976)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !429, file: !413, line: 185, baseType: !139, size: 16, offset: 992)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !429, file: !413, line: 186, baseType: !139, size: 16, offset: 1008)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !429, file: !413, line: 188, baseType: !48, size: 32, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !429, file: !413, line: 190, baseType: !139, size: 16, offset: 1056)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !429, file: !413, line: 191, baseType: !139, size: 16, offset: 1072)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !429, file: !413, line: 194, baseType: !454, size: 64, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !423, line: 421, size: 960, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !467, !471, !472, !473, !474, !475, !476, !477, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !496, !497, !498, !499}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !423, line: 422, baseType: !454, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !455, file: !423, line: 422, baseType: !454, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !423, line: 424, baseType: !139, size: 16, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !455, file: !423, line: 425, baseType: !139, size: 16, offset: 144)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !455, file: !423, line: 426, baseType: !48, size: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !455, file: !423, line: 426, baseType: !48, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !455, file: !423, line: 427, baseType: !464, size: 64, offset: 224)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 2)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !455, file: !423, line: 428, baseType: !468, size: 48, offset: 288)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 48, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 6)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !455, file: !423, line: 431, baseType: !126, size: 8, offset: 336)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !455, file: !423, line: 432, baseType: !126, size: 8, offset: 344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !455, file: !423, line: 435, baseType: !139, size: 16, offset: 352)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !455, file: !423, line: 436, baseType: !139, size: 16, offset: 368)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !455, file: !423, line: 437, baseType: !48, size: 32, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !455, file: !423, line: 437, baseType: !48, size: 32, offset: 416)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !455, file: !423, line: 438, baseType: !478, size: 64, offset: 448)
!478 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !455, file: !423, line: 439, baseType: !48, size: 32, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !455, file: !423, line: 439, baseType: !48, size: 32, offset: 544)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !455, file: !423, line: 442, baseType: !139, size: 16, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !455, file: !423, line: 442, baseType: !139, size: 16, offset: 592)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !455, file: !423, line: 442, baseType: !139, size: 16, offset: 608)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !455, file: !423, line: 442, baseType: !139, size: 16, offset: 624)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !455, file: !423, line: 443, baseType: !139, size: 16, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !455, file: !423, line: 446, baseType: !139, size: 16, offset: 656)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !455, file: !423, line: 449, baseType: !254, size: 64, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !455, file: !423, line: 452, baseType: !489, size: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !423, line: 463, size: 128, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !490, file: !423, line: 464, baseType: !48, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !490, file: !423, line: 465, baseType: !211, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !490, file: !423, line: 466, baseType: !211, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !490, file: !423, line: 467, baseType: !211, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !455, file: !423, line: 455, baseType: !139, size: 16, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !455, file: !423, line: 456, baseType: !139, size: 16, offset: 848)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !455, file: !423, line: 457, baseType: !48, size: 32, offset: 864)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !455, file: !423, line: 458, baseType: !110, size: 64, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !429, file: !413, line: 196, baseType: !501, size: 64, offset: 1152)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !413, line: 55, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !429, file: !413, line: 198, baseType: !504, size: 64, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !423, line: 398, size: 448, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !423, line: 399, baseType: !504, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !505, file: !423, line: 399, baseType: !504, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !505, file: !423, line: 400, baseType: !48, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !505, file: !423, line: 401, baseType: !48, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !505, file: !423, line: 402, baseType: !48, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !505, file: !423, line: 403, baseType: !48, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !505, file: !423, line: 404, baseType: !48, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !505, file: !423, line: 405, baseType: !48, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !505, file: !423, line: 407, baseType: !110, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !505, file: !423, line: 414, baseType: !110, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !429, file: !413, line: 200, baseType: !48, size: 32, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !429, file: !413, line: 200, baseType: !48, size: 32, offset: 1312)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !429, file: !413, line: 201, baseType: !110, size: 64, offset: 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !429, file: !413, line: 203, baseType: !165, size: 128, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !429, file: !413, line: 204, baseType: !165, size: 128, offset: 1536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !429, file: !413, line: 205, baseType: !165, size: 128, offset: 1664)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !429, file: !413, line: 207, baseType: !165, size: 128, offset: 1792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !429, file: !413, line: 208, baseType: !165, size: 128, offset: 1920)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !422, file: !423, line: 495, baseType: !478, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !422, file: !423, line: 496, baseType: !48, size: 32, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !422, file: !423, line: 497, baseType: !110, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !422, file: !423, line: 499, baseType: !478, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !422, file: !423, line: 500, baseType: !478, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !422, file: !423, line: 502, baseType: !478, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !422, file: !423, line: 503, baseType: !478, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !422, file: !423, line: 504, baseType: !478, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !422, file: !423, line: 505, baseType: !48, size: 32, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!48, !287, !110, !296}
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!48, !542, !287, !544, !558}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !241, line: 137, size: 640, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !567}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !545, file: !241, line: 139, baseType: !244, size: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !545, file: !241, line: 142, baseType: !254, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !545, file: !241, line: 144, baseType: !48, size: 32, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !545, file: !241, line: 147, baseType: !254, size: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !545, file: !241, line: 150, baseType: !552, size: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !542, !411, !556, !558}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !288)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !561)
!561 = !{!562, !563, !564, !565, !566}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !6, line: 339, baseType: !110, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !560, file: !6, line: 342, baseType: !544, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !560, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !560, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !560, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !545, file: !241, line: 154, baseType: !264, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !110}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !240, file: !241, line: 386, baseType: !573, size: 64, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !306, !239}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !240, file: !241, line: 387, baseType: !578, size: 64, offset: 1344)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!582, !556}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !240, file: !241, line: 390, baseType: !584, size: 64, offset: 1408)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !241, line: 69, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!149, !287, !588}
!588 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !240, file: !241, line: 393, baseType: !165, size: 128, offset: 1472)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !228, file: !229, line: 337, baseType: !591, size: 64, offset: 1664)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !182, line: 61, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !228, file: !229, line: 338, baseType: !594, size: 64, offset: 1728)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, elements: !465)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !228, file: !229, line: 340, baseType: !165, size: 128, offset: 1792)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !228, file: !229, line: 340, baseType: !165, size: 128, offset: 1920)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !229, line: 342, baseType: !48, size: 32, offset: 2048)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !228, file: !229, line: 342, baseType: !48, size: 32, offset: 2080)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !228, file: !229, line: 343, baseType: !48, size: 32, offset: 2112)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !228, file: !229, line: 345, baseType: !48, size: 32, offset: 2144)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !228, file: !229, line: 346, baseType: !48, size: 32, offset: 2176)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !228, file: !229, line: 347, baseType: !139, size: 16, offset: 2208)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !228, file: !229, line: 348, baseType: !139, size: 16, offset: 2224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !228, file: !229, line: 349, baseType: !48, size: 32, offset: 2240)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !228, file: !229, line: 351, baseType: !48, size: 32, offset: 2272)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !228, file: !229, line: 353, baseType: !139, size: 16, offset: 2304)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !228, file: !229, line: 354, baseType: !139, size: 16, offset: 2320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !228, file: !229, line: 355, baseType: !48, size: 32, offset: 2336)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !228, file: !229, line: 357, baseType: !610, size: 128, offset: 2368)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !611, line: 95, baseType: !612)
!611 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !611, line: 92, size: 128, elements: !613)
!613 = !{!614, !615, !616, !617}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !612, file: !611, line: 93, baseType: !211, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !612, file: !611, line: 93, baseType: !211, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !612, file: !611, line: 94, baseType: !211, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !612, file: !611, line: 94, baseType: !211, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !228, file: !229, line: 363, baseType: !165, size: 128, offset: 2496)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !228, file: !229, line: 363, baseType: !165, size: 128, offset: 2624)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !228, file: !229, line: 368, baseType: !621, size: 64, offset: 2752)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !229, line: 48, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !228, file: !229, line: 372, baseType: !624, size: 32, offset: 2816)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !229, line: 274, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !229, line: 271, size: 32, elements: !626)
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !625, file: !229, line: 273, baseType: !7, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !228, file: !229, line: 373, baseType: !48, size: 32, offset: 2848)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !228, file: !229, line: 382, baseType: !630, size: 64, offset: 2880)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !229, line: 46, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !228, file: !229, line: 385, baseType: !633, size: 64, offset: 2944)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !110, !211}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !228, file: !229, line: 386, baseType: !637, size: 64, offset: 3008)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !110, !405}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !228, file: !229, line: 387, baseType: !641, size: 64, offset: 3072)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!48, !110}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !228, file: !229, line: 388, baseType: !569, size: 64, offset: 3136)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !228, file: !229, line: 389, baseType: !110, size: 64, offset: 3200)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !228, file: !229, line: 389, baseType: !110, size: 64, offset: 3264)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !228, file: !229, line: 389, baseType: !110, size: 64, offset: 3328)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !228, file: !229, line: 389, baseType: !110, size: 64, offset: 3392)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !181, file: !182, line: 1244, baseType: !650, size: 64, offset: 2048)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !652, line: 200, size: 17024, elements: !653)
!652 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!653 = !{!654, !656, !657, !658, !1076, !1077, !1078, !1079, !1080, !1081, !1082}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !651, file: !652, line: 201, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !651, file: !652, line: 202, baseType: !165, size: 128, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !651, file: !652, line: 203, baseType: !165, size: 128, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !651, file: !652, line: 206, baseType: !659, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !652, line: 190, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !652, line: 126, size: 2816, elements: !662)
!662 = !{!663, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !759, !762, !763, !764, !1047, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1075}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !661, file: !652, line: 127, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !661, file: !652, line: 127, baseType: !664, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !661, file: !652, line: 128, baseType: !110, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !661, file: !652, line: 129, baseType: !110, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !652, line: 130, baseType: !155, size: 512, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !661, file: !652, line: 132, baseType: !48, size: 32, offset: 768)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !652, line: 132, baseType: !48, size: 32, offset: 800)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !661, file: !652, line: 133, baseType: !48, size: 32, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !661, file: !652, line: 134, baseType: !48, size: 32, offset: 864)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !661, file: !652, line: 134, baseType: !48, size: 32, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !661, file: !652, line: 134, baseType: !48, size: 32, offset: 928)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !661, file: !652, line: 135, baseType: !48, size: 32, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !661, file: !652, line: 135, baseType: !48, size: 32, offset: 992)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !661, file: !652, line: 136, baseType: !48, size: 32, offset: 1024)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !661, file: !652, line: 136, baseType: !48, size: 32, offset: 1056)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !661, file: !652, line: 137, baseType: !48, size: 32, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !661, file: !652, line: 137, baseType: !48, size: 32, offset: 1120)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !661, file: !652, line: 138, baseType: !211, size: 32, offset: 1152)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !661, file: !652, line: 139, baseType: !211, size: 32, offset: 1184)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !661, file: !652, line: 139, baseType: !211, size: 32, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !661, file: !652, line: 141, baseType: !139, size: 16, offset: 1248)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !661, file: !652, line: 142, baseType: !139, size: 16, offset: 1264)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !661, file: !652, line: 143, baseType: !48, size: 32, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !661, file: !652, line: 144, baseType: !48, size: 32, offset: 1312)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !661, file: !652, line: 146, baseType: !689, size: 64, offset: 1344)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !652, line: 114, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !652, line: 99, size: 7232, elements: !692)
!692 = !{!693, !695, !696, !697, !698, !699, !700, !708, !712, !727, !736, !743, !753}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !652, line: 100, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !691, file: !652, line: 100, baseType: !694, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !691, file: !652, line: 101, baseType: !48, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !691, file: !652, line: 101, baseType: !48, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !691, file: !652, line: 102, baseType: !48, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !691, file: !652, line: 102, baseType: !48, size: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !691, file: !652, line: 103, baseType: !701, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !652, line: 59, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !652, line: 56, size: 2112, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !703, file: !652, line: 57, baseType: !364, size: 2048)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !703, file: !652, line: 58, baseType: !48, size: 32, offset: 2048)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !703, file: !652, line: 58, baseType: !48, size: 32, offset: 2080)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !691, file: !652, line: 106, baseType: !709, size: 6144, offset: 320)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 6144, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 768)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !691, file: !652, line: 107, baseType: !713, size: 64, offset: 6464)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !652, line: 97, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !652, line: 83, size: 8320, elements: !716)
!716 = !{!717, !718, !719, !723, !724, !725, !726}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !715, file: !652, line: 84, baseType: !709, size: 6144)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !715, file: !652, line: 87, baseType: !364, size: 2048, offset: 6144)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !715, file: !652, line: 88, baseType: !720, size: 64, offset: 8192)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !722, line: 41, flags: DIFlagFwdDecl)
!722 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !715, file: !652, line: 90, baseType: !139, size: 16, offset: 8256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !715, file: !652, line: 92, baseType: !139, size: 16, offset: 8272)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !715, file: !652, line: 93, baseType: !139, size: 16, offset: 8288)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !715, file: !652, line: 95, baseType: !139, size: 16, offset: 8304)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !691, file: !652, line: 108, baseType: !728, size: 64, offset: 6528)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !652, line: 66, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !652, line: 61, size: 128, elements: !731)
!731 = !{!732, !733, !734, !735}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !730, file: !652, line: 62, baseType: !48, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !730, file: !652, line: 63, baseType: !48, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !730, file: !652, line: 64, baseType: !48, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !730, file: !652, line: 65, baseType: !48, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !691, file: !652, line: 109, baseType: !737, size: 64, offset: 6592)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !652, line: 71, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !652, line: 68, size: 64, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !739, file: !652, line: 69, baseType: !48, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !739, file: !652, line: 70, baseType: !48, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !691, file: !652, line: 110, baseType: !744, size: 64, offset: 6656)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !652, line: 81, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !652, line: 73, size: 352, elements: !747)
!747 = !{!748, !749, !750, !751, !752}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !746, file: !652, line: 74, baseType: !210, size: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !746, file: !652, line: 75, baseType: !210, size: 96, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !746, file: !652, line: 76, baseType: !210, size: 96, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !746, file: !652, line: 77, baseType: !48, size: 32, offset: 288)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !746, file: !652, line: 78, baseType: !48, size: 32, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !691, file: !652, line: 113, baseType: !754, size: 512, offset: 6720)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !755, line: 182, baseType: !756)
!755 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !755, line: 180, size: 512, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !755, line: 181, baseType: !155, size: 512)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !661, file: !652, line: 148, baseType: !760, size: 64, offset: 1408)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !652, line: 49, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !661, file: !652, line: 151, baseType: !180, size: 64, offset: 1472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !661, file: !652, line: 152, baseType: !189, size: 64, offset: 1536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !661, file: !652, line: 153, baseType: !765, size: 64, offset: 1600)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !767, line: 64, size: 19136, elements: !768)
!767 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !781, !782, !1033, !1034, !1042, !1043, !1044, !1045, !1046}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !766, file: !767, line: 65, baseType: !105, size: 960)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !766, file: !767, line: 66, baseType: !186, size: 64, offset: 960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !767, line: 68, baseType: !125, size: 8192, offset: 1024)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !766, file: !767, line: 70, baseType: !48, size: 32, offset: 9216)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !766, file: !767, line: 71, baseType: !48, size: 32, offset: 9248)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !766, file: !767, line: 72, baseType: !464, size: 64, offset: 9280)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !766, file: !767, line: 74, baseType: !211, size: 32, offset: 9344)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !766, file: !767, line: 74, baseType: !211, size: 32, offset: 9376)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !766, file: !767, line: 76, baseType: !720, size: 64, offset: 9408)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !766, file: !767, line: 77, baseType: !779, size: 64, offset: 9472)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !767, line: 77, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !766, file: !767, line: 78, baseType: !591, size: 64, offset: 9536)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !766, file: !767, line: 80, baseType: !783, size: 2624, offset: 9600)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !784, line: 340, size: 2624, elements: !785)
!784 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!785 = !{!786, !814, !832, !833, !834, !852, !910, !911, !1013, !1014, !1015, !1016, !1022}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !783, file: !784, line: 341, baseType: !787, size: 576)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !784, line: 251, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !784, line: 207, size: 576, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !784, line: 208, baseType: !48, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !788, file: !784, line: 211, baseType: !139, size: 16, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !788, file: !784, line: 212, baseType: !139, size: 16, offset: 48)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !788, file: !784, line: 213, baseType: !211, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !788, file: !784, line: 214, baseType: !139, size: 16, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !788, file: !784, line: 215, baseType: !139, size: 16, offset: 112)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !788, file: !784, line: 216, baseType: !139, size: 16, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !788, file: !784, line: 217, baseType: !139, size: 16, offset: 144)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !788, file: !784, line: 218, baseType: !139, size: 16, offset: 160)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !788, file: !784, line: 219, baseType: !139, size: 16, offset: 176)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !788, file: !784, line: 220, baseType: !211, size: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !788, file: !784, line: 222, baseType: !139, size: 16, offset: 224)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !788, file: !784, line: 225, baseType: !139, size: 16, offset: 240)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !788, file: !784, line: 228, baseType: !48, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !788, file: !784, line: 229, baseType: !48, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !788, file: !784, line: 233, baseType: !48, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !788, file: !784, line: 236, baseType: !139, size: 16, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !788, file: !784, line: 236, baseType: !139, size: 16, offset: 368)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !788, file: !784, line: 241, baseType: !211, size: 32, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !788, file: !784, line: 244, baseType: !48, size: 32, offset: 416)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !788, file: !784, line: 244, baseType: !48, size: 32, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !788, file: !784, line: 245, baseType: !211, size: 32, offset: 480)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !788, file: !784, line: 248, baseType: !211, size: 32, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !788, file: !784, line: 250, baseType: !48, size: 32, offset: 544)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !783, file: !784, line: 342, baseType: !815, size: 448, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !784, line: 79, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !784, line: 61, size: 448, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !816, file: !784, line: 62, baseType: !110, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !816, file: !784, line: 64, baseType: !139, size: 16, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !816, file: !784, line: 65, baseType: !139, size: 16, offset: 80)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !816, file: !784, line: 67, baseType: !211, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !816, file: !784, line: 68, baseType: !211, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !816, file: !784, line: 69, baseType: !211, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !816, file: !784, line: 70, baseType: !139, size: 16, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !816, file: !784, line: 71, baseType: !139, size: 16, offset: 208)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !816, file: !784, line: 72, baseType: !594, size: 64, offset: 224)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !816, file: !784, line: 75, baseType: !211, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !816, file: !784, line: 75, baseType: !211, size: 32, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !816, file: !784, line: 75, baseType: !211, size: 32, offset: 352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !816, file: !784, line: 78, baseType: !211, size: 32, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !816, file: !784, line: 78, baseType: !211, size: 32, offset: 416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !783, file: !784, line: 343, baseType: !165, size: 128, offset: 1024)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !783, file: !784, line: 344, baseType: !165, size: 128, offset: 1152)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !783, file: !784, line: 345, baseType: !835, size: 192, offset: 1280)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !784, line: 278, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !784, line: 270, size: 192, elements: !837)
!837 = !{!838, !839, !840, !841, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !784, line: 271, baseType: !48, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !836, file: !784, line: 273, baseType: !211, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !836, file: !784, line: 275, baseType: !48, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !836, file: !784, line: 276, baseType: !48, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !836, file: !784, line: 277, baseType: !843, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !784, line: 55, size: 576, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !844, file: !784, line: 56, baseType: !48, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !844, file: !784, line: 57, baseType: !211, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !844, file: !784, line: 58, baseType: !849, size: 512, offset: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 512, elements: !850)
!850 = !{!851, !851}
!851 = !DISubrange(count: 4)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !783, file: !784, line: 346, baseType: !853, size: 384, offset: 1472)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !784, line: 268, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !784, line: 253, size: 384, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !904, !905, !906, !907, !908, !909}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !854, file: !784, line: 254, baseType: !48, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !854, file: !784, line: 255, baseType: !48, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !854, file: !784, line: 255, baseType: !48, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !854, file: !784, line: 258, baseType: !211, size: 32, offset: 96)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !854, file: !784, line: 259, baseType: !861, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !784, line: 164, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !784, line: 108, size: 1664, elements: !864)
!864 = !{!865, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !784, line: 109, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !863, file: !784, line: 109, baseType: !866, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !863, file: !784, line: 111, baseType: !155, size: 512, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !863, file: !784, line: 119, baseType: !594, size: 64, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !863, file: !784, line: 119, baseType: !594, size: 64, offset: 704)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !863, file: !784, line: 125, baseType: !594, size: 64, offset: 768)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !863, file: !784, line: 125, baseType: !594, size: 64, offset: 832)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !863, file: !784, line: 127, baseType: !594, size: 64, offset: 896)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !863, file: !784, line: 130, baseType: !48, size: 32, offset: 960)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !863, file: !784, line: 131, baseType: !48, size: 32, offset: 992)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !863, file: !784, line: 132, baseType: !877, size: 64, offset: 1024)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !784, line: 106, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !784, line: 81, size: 512, elements: !880)
!880 = !{!881, !882, !885, !886, !887, !888}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !879, file: !784, line: 82, baseType: !594, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !879, file: !784, line: 97, baseType: !883, size: 256, offset: 64)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 256, elements: !884)
!884 = !{!851, !466}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !879, file: !784, line: 102, baseType: !594, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !879, file: !784, line: 102, baseType: !594, size: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !879, file: !784, line: 104, baseType: !48, size: 32, offset: 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !879, file: !784, line: 105, baseType: !48, size: 32, offset: 480)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !863, file: !784, line: 135, baseType: !210, size: 96, offset: 1088)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !863, file: !784, line: 136, baseType: !211, size: 32, offset: 1184)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !863, file: !784, line: 139, baseType: !48, size: 32, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !863, file: !784, line: 139, baseType: !48, size: 32, offset: 1248)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !863, file: !784, line: 139, baseType: !48, size: 32, offset: 1280)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !863, file: !784, line: 140, baseType: !210, size: 96, offset: 1312)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !863, file: !784, line: 143, baseType: !139, size: 16, offset: 1408)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !863, file: !784, line: 144, baseType: !139, size: 16, offset: 1424)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !863, file: !784, line: 145, baseType: !139, size: 16, offset: 1440)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !863, file: !784, line: 148, baseType: !139, size: 16, offset: 1456)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !863, file: !784, line: 149, baseType: !48, size: 32, offset: 1472)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !863, file: !784, line: 150, baseType: !211, size: 32, offset: 1504)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !863, file: !784, line: 152, baseType: !591, size: 64, offset: 1536)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !863, file: !784, line: 163, baseType: !211, size: 32, offset: 1600)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !863, file: !784, line: 163, baseType: !211, size: 32, offset: 1632)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !854, file: !784, line: 261, baseType: !211, size: 32, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !854, file: !784, line: 261, baseType: !211, size: 32, offset: 224)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !854, file: !784, line: 261, baseType: !211, size: 32, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !854, file: !784, line: 263, baseType: !48, size: 32, offset: 288)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !854, file: !784, line: 266, baseType: !48, size: 32, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !854, file: !784, line: 267, baseType: !211, size: 32, offset: 352)
