; ModuleID = 'blender/source/blender/blenlib/intern/freetypefont.c'
source_filename = "blender/source/blender/blenlib/intern/freetypefont.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FT_LibraryRec_ = type opaque
%struct.VFontData = type { %struct.GHash*, [128 x i8], float }
%struct.GHash = type opaque
%struct.PackedFile = type { i32, i32, i8* }
%struct.FT_FaceRec_ = type { i64, i64, i64, i64, i64, i8*, i8*, i32, %struct.FT_Bitmap_Size_*, i32, %struct.FT_CharMapRec_**, %struct.FT_Generic_, %struct.FT_BBox_, i16, i16, i16, i16, i16, i16, i16, i16, %struct.FT_GlyphSlotRec_*, %struct.FT_SizeRec_*, %struct.FT_CharMapRec_*, %struct.FT_DriverRec_*, %struct.FT_MemoryRec_*, %struct.FT_StreamRec_*, %struct.FT_ListRec_, %struct.FT_Generic_, i8*, %struct.FT_Face_InternalRec_* }
%struct.FT_Bitmap_Size_ = type { i16, i16, i64, i64, i64 }
%struct.FT_BBox_ = type { i64, i64, i64, i64 }
%struct.FT_GlyphSlotRec_ = type { %struct.FT_LibraryRec_*, %struct.FT_FaceRec_*, %struct.FT_GlyphSlotRec_*, i32, %struct.FT_Generic_, %struct.FT_Glyph_Metrics_, i64, i64, %struct.FT_Vector_, i32, %struct.FT_Bitmap_, i32, i32, %struct.FT_Outline_, i32, %struct.FT_SubGlyphRec_*, i8*, i64, i64, i64, i8*, %struct.FT_Slot_InternalRec_* }
%struct.FT_Glyph_Metrics_ = type { i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.FT_Vector_ = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "library", scope: !2, file: !3, line: 57, type: !144, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !139, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenlib/intern/freetypefont.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !28, !36}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Encoding_", file: !6, line: 742, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/freetype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!9 = !DIEnumerator(name: "FT_ENCODING_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "FT_ENCODING_MS_SYMBOL", value: 1937337698, isUnsigned: true)
!11 = !DIEnumerator(name: "FT_ENCODING_UNICODE", value: 1970170211, isUnsigned: true)
!12 = !DIEnumerator(name: "FT_ENCODING_SJIS", value: 1936353651, isUnsigned: true)
!13 = !DIEnumerator(name: "FT_ENCODING_GB2312", value: 1734484000, isUnsigned: true)
!14 = !DIEnumerator(name: "FT_ENCODING_BIG5", value: 1651074869, isUnsigned: true)
!15 = !DIEnumerator(name: "FT_ENCODING_WANSUNG", value: 2002873971, isUnsigned: true)
!16 = !DIEnumerator(name: "FT_ENCODING_JOHAB", value: 1785686113, isUnsigned: true)
!17 = !DIEnumerator(name: "FT_ENCODING_MS_SJIS", value: 1936353651, isUnsigned: true)
!18 = !DIEnumerator(name: "FT_ENCODING_MS_GB2312", value: 1734484000, isUnsigned: true)
!19 = !DIEnumerator(name: "FT_ENCODING_MS_BIG5", value: 1651074869, isUnsigned: true)
!20 = !DIEnumerator(name: "FT_ENCODING_MS_WANSUNG", value: 2002873971, isUnsigned: true)
!21 = !DIEnumerator(name: "FT_ENCODING_MS_JOHAB", value: 1785686113, isUnsigned: true)
!22 = !DIEnumerator(name: "FT_ENCODING_ADOBE_STANDARD", value: 1094995778, isUnsigned: true)
!23 = !DIEnumerator(name: "FT_ENCODING_ADOBE_EXPERT", value: 1094992453, isUnsigned: true)
!24 = !DIEnumerator(name: "FT_ENCODING_ADOBE_CUSTOM", value: 1094992451, isUnsigned: true)
!25 = !DIEnumerator(name: "FT_ENCODING_ADOBE_LATIN_1", value: 1818326065, isUnsigned: true)
!26 = !DIEnumerator(name: "FT_ENCODING_OLD_LATIN_2", value: 1818326066, isUnsigned: true)
!27 = !DIEnumerator(name: "FT_ENCODING_APPLE_ROMAN", value: 1634889070, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Glyph_Format_", file: !29, line: 720, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "include/ftimage.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIEnumerator(name: "FT_GLYPH_FORMAT_NONE", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "FT_GLYPH_FORMAT_COMPOSITE", value: 1668246896, isUnsigned: true)
!33 = !DIEnumerator(name: "FT_GLYPH_FORMAT_BITMAP", value: 1651078259, isUnsigned: true)
!34 = !DIEnumerator(name: "FT_GLYPH_FORMAT_OUTLINE", value: 1869968492, isUnsigned: true)
!35 = !DIEnumerator(name: "FT_GLYPH_FORMAT_PLOTTER", value: 1886154612, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Handle", file: !37, line: 361, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = !{!39, !40, !41, !42, !43, !44}
!39 = !DIEnumerator(name: "HD_FREE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "HD_AUTO", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "HD_VECT", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "HD_ALIGN", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "HD_AUTO_ANIM", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "HD_ALIGN_DOUBLESIDE", value: 5, isUnsigned: true)
!45 = !{!46, !47, !48, !49, !63, !66, !68, !111}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!48 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "VChar", file: !51, line: 52, baseType: !52)
!51 = !DIFile(filename: "blender/source/blender/blenlib/BLI_vfontdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VChar", file: !51, line: 48, size: 192, elements: !53)
!53 = !{!54, !61, !62}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nurbsbase", scope: !52, file: !51, line: 49, baseType: !55, size: 128)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !56, line: 71, baseType: !57)
!56 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !56, line: 69, size: 128, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !57, file: !56, line: 70, baseType: !46, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !57, file: !56, line: 70, baseType: !46, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !52, file: !51, line: 50, baseType: !7, size: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !52, file: !51, line: 51, baseType: !47, size: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !64, line: 90, baseType: !65)
!64 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!65 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nurb", file: !37, line: 166, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Nurb", file: !37, line: 147, size: 704, elements: !71)
!71 = !{!72, !74, !75, !77, !78, !79, !80, !81, !82, !86, !87, !88, !89, !90, !91, !92, !94, !95, !110, !136, !137, !138}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !37, line: 148, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !70, file: !37, line: 148, baseType: !73, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !37, line: 149, baseType: !76, size: 16, offset: 128)
!76 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !70, file: !37, line: 150, baseType: !76, size: 16, offset: 144)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !70, file: !37, line: 151, baseType: !76, size: 16, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !70, file: !37, line: 151, baseType: !76, size: 16, offset: 176)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pntsu", scope: !70, file: !37, line: 152, baseType: !67, size: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pntsv", scope: !70, file: !37, line: 152, baseType: !67, size: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !70, file: !37, line: 153, baseType: !83, size: 32, offset: 256)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 2)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "resolu", scope: !70, file: !37, line: 154, baseType: !76, size: 16, offset: 288)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "resolv", scope: !70, file: !37, line: 154, baseType: !76, size: 16, offset: 304)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "orderu", scope: !70, file: !37, line: 155, baseType: !76, size: 16, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "orderv", scope: !70, file: !37, line: 155, baseType: !76, size: 16, offset: 336)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flagu", scope: !70, file: !37, line: 156, baseType: !76, size: 16, offset: 352)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flagv", scope: !70, file: !37, line: 156, baseType: !76, size: 16, offset: 368)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "knotsu", scope: !70, file: !37, line: 158, baseType: !93, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "knotsv", scope: !70, file: !37, line: 158, baseType: !93, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !70, file: !37, line: 159, baseType: !96, size: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPoint", file: !37, line: 141, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BPoint", file: !37, line: 136, size: 288, elements: !99)
!99 = !{!100, !104, !105, !106, !107, !108, !109}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !98, file: !37, line: 137, baseType: !101, size: 128)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 128, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 4)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !98, file: !37, line: 138, baseType: !47, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !98, file: !37, line: 138, baseType: !47, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !98, file: !37, line: 139, baseType: !76, size: 16, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !98, file: !37, line: 139, baseType: !76, size: 16, offset: 208)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !98, file: !37, line: 140, baseType: !47, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !98, file: !37, line: 140, baseType: !47, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !70, file: !37, line: 160, baseType: !111, size: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !37, line: 133, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !37, line: 117, size: 576, elements: !114)
!114 = !{!115, !119, !120, !121, !122, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !113, file: !37, line: 118, baseType: !116, size: 288)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 288, elements: !117)
!117 = !{!118, !118}
!118 = !DISubrange(count: 3)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !113, file: !37, line: 119, baseType: !47, size: 32, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !113, file: !37, line: 119, baseType: !47, size: 32, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !113, file: !37, line: 119, baseType: !47, size: 32, offset: 352)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !113, file: !37, line: 121, baseType: !123, size: 8, offset: 384)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !113, file: !37, line: 123, baseType: !123, size: 8, offset: 392)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !113, file: !37, line: 123, baseType: !123, size: 8, offset: 400)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !113, file: !37, line: 124, baseType: !123, size: 8, offset: 408)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !113, file: !37, line: 124, baseType: !123, size: 8, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !113, file: !37, line: 124, baseType: !123, size: 8, offset: 424)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !113, file: !37, line: 126, baseType: !123, size: 8, offset: 432)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !113, file: !37, line: 128, baseType: !123, size: 8, offset: 440)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !113, file: !37, line: 129, baseType: !47, size: 32, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !113, file: !37, line: 130, baseType: !47, size: 32, offset: 480)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !113, file: !37, line: 130, baseType: !47, size: 32, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !113, file: !37, line: 132, baseType: !135, size: 32, offset: 544)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 32, elements: !102)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tilt_interp", scope: !70, file: !37, line: 162, baseType: !76, size: 16, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "radius_interp", scope: !70, file: !37, line: 163, baseType: !76, size: 16, offset: 656)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "charidx", scope: !70, file: !37, line: 165, baseType: !67, size: 32, offset: 672)
!139 = !{!0, !140}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "err", scope: !2, file: !3, line: 58, type: !142, isLocal: true, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Error", file: !143, line: 300, baseType: !67)
!143 = !DIFile(filename: "include/fttypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Library", file: !6, line: 406, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_LibraryRec_", file: !6, line: 406, flags: DIFlagFwdDecl)
!147 = !{i32 7, !"Dwarf Version", i32 4}
!148 = !{i32 2, !"Debug Info Version", i32 3}
!149 = !{i32 1, !"wchar_size", i32 4}
!150 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!151 = distinct !DISubprogram(name: "BLI_vfontdata_from_freetypefont", scope: !3, file: !3, line: 460, type: !152, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !166}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "VFontData", file: !51, line: 46, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VFontData", file: !51, line: 42, size: 1152, elements: !157)
!157 = !{!158, !161, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "characters", scope: !156, file: !51, line: 43, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !51, line: 43, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !51, line: 44, baseType: !162, size: 1024, offset: 64)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1024, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !156, file: !51, line: 45, baseType: !47, size: 32, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PackedFile", file: !168, line: 41, baseType: !169)
!168 = !DIFile(filename: "blender/source/blender/makesdna/DNA_packedFile_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !168, line: 37, size: 128, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !169, file: !168, line: 38, baseType: !67, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !169, file: !168, line: 39, baseType: !67, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !168, line: 40, baseType: !46, size: 64, offset: 64)
!174 = !{}
!175 = !DILocalVariable(name: "pf", arg: 1, scope: !151, file: !3, line: 460, type: !166)
!176 = !DILocation(line: 460, column: 56, scope: !151)
!177 = !DILocalVariable(name: "vfd", scope: !151, file: !3, line: 462, type: !154)
!178 = !DILocation(line: 462, column: 13, scope: !151)
!179 = !DILocalVariable(name: "success", scope: !151, file: !3, line: 463, type: !67)
!180 = !DILocation(line: 463, column: 6, scope: !151)
!181 = !DILocation(line: 466, column: 8, scope: !151)
!182 = !DILocation(line: 466, column: 6, scope: !151)
!183 = !DILocation(line: 467, column: 6, scope: !184)
!184 = distinct !DILexicalBlock(scope: !151, file: !3, line: 467, column: 6)
!185 = !DILocation(line: 467, column: 6, scope: !151)
!186 = !DILocation(line: 469, column: 3, scope: !187)
!187 = distinct !DILexicalBlock(scope: !184, file: !3, line: 467, column: 11)
!188 = !DILocation(line: 472, column: 31, scope: !151)
!189 = !DILocation(line: 472, column: 12, scope: !151)
!190 = !DILocation(line: 472, column: 10, scope: !151)
!191 = !DILocation(line: 474, column: 6, scope: !192)
!192 = distinct !DILexicalBlock(scope: !151, file: !3, line: 474, column: 6)
!193 = !DILocation(line: 474, column: 6, scope: !151)
!194 = !DILocation(line: 475, column: 31, scope: !195)
!195 = distinct !DILexicalBlock(scope: !192, file: !3, line: 474, column: 15)
!196 = !DILocation(line: 475, column: 9, scope: !195)
!197 = !DILocation(line: 475, column: 7, scope: !195)
!198 = !DILocation(line: 476, column: 2, scope: !195)
!199 = !DILocation(line: 479, column: 19, scope: !151)
!200 = !DILocation(line: 479, column: 2, scope: !151)
!201 = !DILocation(line: 481, column: 9, scope: !151)
!202 = !DILocation(line: 481, column: 2, scope: !151)
!203 = !DILocation(line: 482, column: 1, scope: !151)
!204 = distinct !DISubprogram(name: "check_freetypefont", scope: !3, file: !3, line: 391, type: !205, scopeLine: 392, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!205 = !DISubroutineType(types: !206)
!206 = !{!67, !166}
!207 = !DILocalVariable(name: "pf", arg: 1, scope: !204, file: !3, line: 391, type: !166)
!208 = !DILocation(line: 391, column: 43, scope: !204)
!209 = !DILocalVariable(name: "face", scope: !204, file: !3, line: 393, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face", file: !6, line: 484, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_FaceRec_", file: !6, line: 995, size: 1984, elements: !213)
!213 = !{!214, !217, !218, !219, !220, !221, !224, !225, !227, !239, !240, !253, !263, !271, !272, !273, !274, !275, !276, !277, !278, !279, !356, !379, !380, !384, !406, !434, !447, !448, !449}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_faces", scope: !212, file: !6, line: 997, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Long", file: !143, line: 242, baseType: !216)
!216 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "face_index", scope: !212, file: !6, line: 998, baseType: !215, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "face_flags", scope: !212, file: !6, line: 1000, baseType: !215, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "style_flags", scope: !212, file: !6, line: 1001, baseType: !215, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_glyphs", scope: !212, file: !6, line: 1003, baseType: !215, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "family_name", scope: !212, file: !6, line: 1005, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_String", file: !143, line: 187, baseType: !123)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "style_name", scope: !212, file: !6, line: 1006, baseType: !222, size: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num_fixed_sizes", scope: !212, file: !6, line: 1008, baseType: !226, size: 32, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Int", file: !143, line: 220, baseType: !67)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "available_sizes", scope: !212, file: !6, line: 1009, baseType: !228, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap_Size", file: !6, line: 373, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_Size_", file: !6, line: 363, size: 256, elements: !231)
!231 = !{!232, !234, !235, !237, !238}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !230, file: !6, line: 365, baseType: !233, size: 16)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Short", file: !143, line: 198, baseType: !76)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !230, file: !6, line: 366, baseType: !233, size: 16, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !6, line: 368, baseType: !236, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Pos", file: !29, line: 58, baseType: !216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !230, file: !6, line: 370, baseType: !236, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !230, file: !6, line: 371, baseType: !236, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "num_charmaps", scope: !212, file: !6, line: 1011, baseType: !226, size: 32, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "charmaps", scope: !212, file: !6, line: 1012, baseType: !241, size: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_CharMap", file: !6, line: 568, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_CharMapRec_", file: !6, line: 816, size: 128, elements: !245)
!245 = !{!246, !247, !249, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !244, file: !6, line: 818, baseType: !210, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !244, file: !6, line: 819, baseType: !248, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Encoding", file: !6, line: 771, baseType: !5)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "platform_id", scope: !244, file: !6, line: 820, baseType: !250, size: 16, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UShort", file: !143, line: 209, baseType: !251)
!251 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_id", scope: !244, file: !6, line: 821, baseType: !250, size: 16, offset: 112)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !212, file: !6, line: 1014, baseType: !254, size: 128, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic", file: !143, line: 464, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Generic_", file: !143, line: 459, size: 128, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !255, file: !143, line: 461, baseType: !46, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "finalizer", scope: !255, file: !143, line: 462, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic_Finalizer", file: !143, line: 428, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !46}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !212, file: !6, line: 1019, baseType: !264, size: 256, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_BBox", file: !29, line: 120, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_BBox_", file: !29, line: 115, size: 256, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "xMin", scope: !265, file: !29, line: 117, baseType: !236, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "yMin", scope: !265, file: !29, line: 117, baseType: !236, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "xMax", scope: !265, file: !29, line: 118, baseType: !236, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "yMax", scope: !265, file: !29, line: 118, baseType: !236, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "units_per_EM", scope: !212, file: !6, line: 1021, baseType: !250, size: 16, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !212, file: !6, line: 1022, baseType: !233, size: 16, offset: 1104)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !212, file: !6, line: 1023, baseType: !233, size: 16, offset: 1120)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !212, file: !6, line: 1024, baseType: !233, size: 16, offset: 1136)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_width", scope: !212, file: !6, line: 1026, baseType: !233, size: 16, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_height", scope: !212, file: !6, line: 1027, baseType: !233, size: 16, offset: 1168)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "underline_position", scope: !212, file: !6, line: 1029, baseType: !233, size: 16, offset: 1184)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "underline_thickness", scope: !212, file: !6, line: 1030, baseType: !233, size: 16, offset: 1200)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !212, file: !6, line: 1032, baseType: !280, size: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_GlyphSlot", file: !6, line: 536, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_GlyphSlotRec_", file: !6, line: 1706, size: 2432, elements: !283)
!283 = !{!284, !285, !286, !287, !289, !290, !302, !304, !305, !311, !313, !327, !328, !329, !342, !343, !347, !348, !349, !350, !351, !352}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !282, file: !6, line: 1708, baseType: !144, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !282, file: !6, line: 1709, baseType: !210, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !6, line: 1710, baseType: !280, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !282, file: !6, line: 1711, baseType: !288, size: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UInt", file: !143, line: 231, baseType: !7)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !282, file: !6, line: 1712, baseType: !254, size: 128, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !282, file: !6, line: 1714, baseType: !291, size: 512, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Metrics", file: !6, line: 322, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Glyph_Metrics_", file: !6, line: 309, size: 512, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !292, file: !6, line: 311, baseType: !236, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !292, file: !6, line: 312, baseType: !236, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingX", scope: !292, file: !6, line: 314, baseType: !236, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingY", scope: !292, file: !6, line: 315, baseType: !236, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "horiAdvance", scope: !292, file: !6, line: 316, baseType: !236, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingX", scope: !292, file: !6, line: 318, baseType: !236, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingY", scope: !292, file: !6, line: 319, baseType: !236, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vertAdvance", scope: !292, file: !6, line: 320, baseType: !236, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "linearHoriAdvance", scope: !282, file: !6, line: 1715, baseType: !303, size: 64, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Fixed", file: !143, line: 288, baseType: !216)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "linearVertAdvance", scope: !282, file: !6, line: 1716, baseType: !303, size: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !282, file: !6, line: 1717, baseType: !306, size: 128, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Vector", file: !29, line: 79, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Vector_", file: !29, line: 74, size: 128, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !307, file: !29, line: 76, baseType: !236, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !307, file: !29, line: 77, baseType: !236, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !282, file: !6, line: 1719, baseType: !312, size: 32, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Format", file: !29, line: 729, baseType: !28)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !282, file: !6, line: 1721, baseType: !314, size: 320, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap", file: !29, line: 277, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_", file: !29, line: 266, size: 320, elements: !316)
!316 = !{!317, !318, !319, !320, !323, !324, !325, !326}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !315, file: !29, line: 268, baseType: !7, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !315, file: !29, line: 269, baseType: !7, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !315, file: !29, line: 270, baseType: !67, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !315, file: !29, line: 271, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_grays", scope: !315, file: !29, line: 272, baseType: !251, size: 16, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_mode", scope: !315, file: !29, line: 273, baseType: !322, size: 8, offset: 208)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "palette_mode", scope: !315, file: !29, line: 274, baseType: !322, size: 8, offset: 216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !315, file: !29, line: 275, baseType: !46, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_left", scope: !282, file: !6, line: 1722, baseType: !226, size: 32, offset: 1536)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_top", scope: !282, file: !6, line: 1723, baseType: !226, size: 32, offset: 1568)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !282, file: !6, line: 1725, baseType: !330, size: 320, offset: 1600)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Outline", file: !29, line: 350, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Outline_", file: !29, line: 339, size: 320, elements: !332)
!332 = !{!333, !334, !335, !337, !339, !341}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "n_contours", scope: !331, file: !29, line: 341, baseType: !76, size: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "n_points", scope: !331, file: !29, line: 342, baseType: !76, size: 16, offset: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !331, file: !29, line: 344, baseType: !336, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !331, file: !29, line: 345, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "contours", scope: !331, file: !29, line: 346, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !331, file: !29, line: 348, baseType: !67, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "num_subglyphs", scope: !282, file: !6, line: 1727, baseType: !288, size: 32, offset: 1920)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "subglyphs", scope: !282, file: !6, line: 1728, baseType: !344, size: 64, offset: 1984)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_SubGlyph", file: !6, line: 1523, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SubGlyphRec_", file: !6, line: 1523, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "control_data", scope: !282, file: !6, line: 1730, baseType: !46, size: 64, offset: 2048)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "control_len", scope: !282, file: !6, line: 1731, baseType: !216, size: 64, offset: 2112)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lsb_delta", scope: !282, file: !6, line: 1733, baseType: !236, size: 64, offset: 2176)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rsb_delta", scope: !282, file: !6, line: 1734, baseType: !236, size: 64, offset: 2240)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !282, file: !6, line: 1736, baseType: !46, size: 64, offset: 2304)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !282, file: !6, line: 1738, baseType: !353, size: 64, offset: 2368)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Slot_Internal", file: !6, line: 1535, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Slot_InternalRec_", file: !6, line: 1535, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !212, file: !6, line: 1033, baseType: !357, size: 64, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size", file: !6, line: 515, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SizeRec_", file: !6, line: 1497, size: 704, elements: !360)
!360 = !{!361, !362, !363, !375}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !359, file: !6, line: 1499, baseType: !210, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !359, file: !6, line: 1500, baseType: !254, size: 128, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !359, file: !6, line: 1501, baseType: !364, size: 448, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Metrics", file: !6, line: 1475, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_Metrics_", file: !6, line: 1462, size: 448, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !365, file: !6, line: 1464, baseType: !250, size: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !365, file: !6, line: 1465, baseType: !250, size: 16, offset: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "x_scale", scope: !365, file: !6, line: 1467, baseType: !303, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "y_scale", scope: !365, file: !6, line: 1468, baseType: !303, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !365, file: !6, line: 1470, baseType: !236, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !365, file: !6, line: 1471, baseType: !236, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !365, file: !6, line: 1472, baseType: !236, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance", scope: !365, file: !6, line: 1473, baseType: !236, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !359, file: !6, line: 1502, baseType: !376, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Internal", file: !6, line: 1404, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_InternalRec_", file: !6, line: 1404, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "charmap", scope: !212, file: !6, line: 1034, baseType: !242, size: 64, offset: 1344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !212, file: !6, line: 1038, baseType: !381, size: 64, offset: 1408)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Driver", file: !6, line: 438, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_DriverRec_", file: !6, line: 438, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !212, file: !6, line: 1039, baseType: !385, size: 64, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Memory", file: !386, line: 66, baseType: !387)
!386 = !DIFile(filename: "include/ftsystem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_MemoryRec_", file: !386, line: 171, size: 256, elements: !389)
!389 = !{!390, !391, !396, !401}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !388, file: !386, line: 173, baseType: !46, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !388, file: !386, line: 174, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Alloc_Func", file: !386, line: 89, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!46, !385, !216}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !388, file: !386, line: 175, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Free_Func", file: !386, line: 110, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !385, !46}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !388, file: !386, line: 176, baseType: !402, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Realloc_Func", file: !386, line: 143, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!46, !385, !216, !216, !46}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !212, file: !6, line: 1040, baseType: !407, size: 64, offset: 1536)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream", file: !386, line: 196, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_StreamRec_", file: !386, line: 321, size: 640, elements: !410)
!410 = !{!411, !412, !413, !414, !420, !421, !426, !431, !432, !433}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !409, file: !386, line: 323, baseType: !321, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !386, line: 324, baseType: !65, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !409, file: !386, line: 325, baseType: !65, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !409, file: !386, line: 327, baseType: !415, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_StreamDesc", file: !386, line: 214, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FT_StreamDesc_", file: !386, line: 209, size: 64, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !416, file: !386, line: 211, baseType: !216, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !416, file: !386, line: 212, baseType: !46, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !409, file: !386, line: 328, baseType: !415, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !409, file: !386, line: 329, baseType: !422, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_IoFunc", file: !386, line: 248, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!65, !407, !65, !321, !65}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !409, file: !386, line: 330, baseType: !427, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_CloseFunc", file: !386, line: 268, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !407}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !409, file: !386, line: 332, baseType: !385, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !409, file: !386, line: 333, baseType: !321, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !409, file: !386, line: 334, baseType: !321, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sizes_list", scope: !212, file: !6, line: 1042, baseType: !435, size: 128, offset: 1600)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListRec", file: !143, line: 572, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListRec_", file: !143, line: 567, size: 128, elements: !437)
!437 = !{!438, !446}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !436, file: !143, line: 569, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListNode", file: !143, line: 515, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListNodeRec_", file: !143, line: 544, size: 192, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !441, file: !143, line: 546, baseType: !439, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !143, line: 547, baseType: !439, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !143, line: 548, baseType: !46, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !436, file: !143, line: 570, baseType: !439, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "autohint", scope: !212, file: !6, line: 1044, baseType: !254, size: 128, offset: 1728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !212, file: !6, line: 1045, baseType: !46, size: 64, offset: 1856)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !212, file: !6, line: 1047, baseType: !450, size: 64, offset: 1920)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face_Internal", file: !6, line: 847, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Face_InternalRec_", file: !6, line: 847, flags: DIFlagFwdDecl)
!453 = !DILocation(line: 393, column: 10, scope: !204)
!454 = !DILocalVariable(name: "glyph", scope: !204, file: !3, line: 394, type: !280)
!455 = !DILocation(line: 394, column: 15, scope: !204)
!456 = !DILocalVariable(name: "glyph_index", scope: !204, file: !3, line: 395, type: !288)
!457 = !DILocation(line: 395, column: 10, scope: !204)
!458 = !DILocalVariable(name: "success", scope: !204, file: !3, line: 403, type: !67)
!459 = !DILocation(line: 403, column: 6, scope: !204)
!460 = !DILocation(line: 405, column: 27, scope: !204)
!461 = !DILocation(line: 406, column: 27, scope: !204)
!462 = !DILocation(line: 406, column: 31, scope: !204)
!463 = !DILocation(line: 407, column: 27, scope: !204)
!464 = !DILocation(line: 407, column: 31, scope: !204)
!465 = !DILocation(line: 405, column: 8, scope: !204)
!466 = !DILocation(line: 405, column: 6, scope: !204)
!467 = !DILocation(line: 410, column: 6, scope: !468)
!468 = distinct !DILexicalBlock(scope: !204, file: !3, line: 410, column: 6)
!469 = !DILocation(line: 410, column: 6, scope: !204)
!470 = !DILocation(line: 411, column: 11, scope: !471)
!471 = distinct !DILexicalBlock(scope: !468, file: !3, line: 410, column: 11)
!472 = !DILocation(line: 413, column: 2, scope: !471)
!473 = !DILocation(line: 432, column: 35, scope: !474)
!474 = distinct !DILexicalBlock(scope: !468, file: !3, line: 414, column: 7)
!475 = !DILocation(line: 432, column: 17, scope: !474)
!476 = !DILocation(line: 432, column: 15, scope: !474)
!477 = !DILocation(line: 433, column: 23, scope: !474)
!478 = !DILocation(line: 433, column: 29, scope: !474)
!479 = !DILocation(line: 433, column: 9, scope: !474)
!480 = !DILocation(line: 433, column: 7, scope: !474)
!481 = !DILocation(line: 434, column: 7, scope: !482)
!482 = distinct !DILexicalBlock(scope: !474, file: !3, line: 434, column: 7)
!483 = !DILocation(line: 434, column: 7, scope: !474)
!484 = !DILocation(line: 435, column: 12, scope: !485)
!485 = distinct !DILexicalBlock(scope: !482, file: !3, line: 434, column: 12)
!486 = !DILocation(line: 436, column: 3, scope: !485)
!487 = !DILocation(line: 438, column: 12, scope: !488)
!488 = distinct !DILexicalBlock(scope: !482, file: !3, line: 437, column: 8)
!489 = !DILocation(line: 438, column: 18, scope: !488)
!490 = !DILocation(line: 438, column: 10, scope: !488)
!491 = !DILocation(line: 439, column: 8, scope: !492)
!492 = distinct !DILexicalBlock(scope: !488, file: !3, line: 439, column: 8)
!493 = !DILocation(line: 439, column: 15, scope: !492)
!494 = !DILocation(line: 439, column: 22, scope: !492)
!495 = !DILocation(line: 439, column: 8, scope: !488)
!496 = !DILocation(line: 440, column: 13, scope: !497)
!497 = distinct !DILexicalBlock(scope: !492, file: !3, line: 439, column: 50)
!498 = !DILocation(line: 441, column: 4, scope: !497)
!499 = !DILocation(line: 444, column: 13, scope: !500)
!500 = distinct !DILexicalBlock(scope: !492, file: !3, line: 442, column: 9)
!501 = !DILocation(line: 449, column: 9, scope: !204)
!502 = !DILocation(line: 449, column: 2, scope: !204)
!503 = distinct !DISubprogram(name: "objfnt_to_ftvfontdata", scope: !3, file: !3, line: 284, type: !152, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!504 = !DILocalVariable(name: "pf", arg: 1, scope: !503, file: !3, line: 284, type: !166)
!505 = !DILocation(line: 284, column: 53, scope: !503)
!506 = !DILocalVariable(name: "face", scope: !503, file: !3, line: 287, type: !210)
!507 = !DILocation(line: 287, column: 10, scope: !503)
!508 = !DILocalVariable(name: "charcode_reserve", scope: !503, file: !3, line: 288, type: !509)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ULong", file: !143, line: 253, baseType: !65)
!511 = !DILocation(line: 288, column: 17, scope: !503)
!512 = !DILocalVariable(name: "charcode", scope: !503, file: !3, line: 289, type: !510)
!513 = !DILocation(line: 289, column: 11, scope: !503)
!514 = !DILocalVariable(name: "lcode", scope: !503, file: !3, line: 289, type: !510)
!515 = !DILocation(line: 289, column: 25, scope: !503)
!516 = !DILocalVariable(name: "glyph_index", scope: !503, file: !3, line: 290, type: !288)
!517 = !DILocation(line: 290, column: 10, scope: !503)
!518 = !DILocalVariable(name: "fontname", scope: !503, file: !3, line: 291, type: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!521 = !DILocation(line: 291, column: 14, scope: !503)
!522 = !DILocalVariable(name: "vfd", scope: !503, file: !3, line: 292, type: !154)
!523 = !DILocation(line: 292, column: 13, scope: !503)
!524 = !DILocation(line: 303, column: 27, scope: !503)
!525 = !DILocation(line: 304, column: 27, scope: !503)
!526 = !DILocation(line: 304, column: 31, scope: !503)
!527 = !DILocation(line: 305, column: 27, scope: !503)
!528 = !DILocation(line: 305, column: 31, scope: !503)
!529 = !DILocation(line: 303, column: 8, scope: !503)
!530 = !DILocation(line: 303, column: 6, scope: !503)
!531 = !DILocation(line: 309, column: 6, scope: !532)
!532 = distinct !DILexicalBlock(scope: !503, file: !3, line: 309, column: 6)
!533 = !DILocation(line: 309, column: 6, scope: !503)
!534 = !DILocation(line: 309, column: 11, scope: !532)
!535 = !DILocation(line: 331, column: 8, scope: !503)
!536 = !DILocation(line: 331, column: 6, scope: !503)
!537 = !DILocation(line: 334, column: 36, scope: !503)
!538 = !DILocation(line: 334, column: 13, scope: !503)
!539 = !DILocation(line: 334, column: 11, scope: !503)
!540 = !DILocation(line: 335, column: 14, scope: !503)
!541 = !DILocation(line: 335, column: 19, scope: !503)
!542 = !DILocation(line: 335, column: 26, scope: !503)
!543 = !DILocation(line: 335, column: 35, scope: !503)
!544 = !DILocation(line: 335, column: 25, scope: !503)
!545 = !DILocation(line: 335, column: 51, scope: !503)
!546 = !DILocation(line: 335, column: 2, scope: !503)
!547 = !DILocation(line: 338, column: 39, scope: !503)
!548 = !DILocation(line: 338, column: 21, scope: !503)
!549 = !DILocation(line: 338, column: 19, scope: !503)
!550 = !DILocation(line: 338, column: 8, scope: !503)
!551 = !DILocation(line: 341, column: 6, scope: !552)
!552 = distinct !DILexicalBlock(scope: !503, file: !3, line: 341, column: 6)
!553 = !DILocation(line: 341, column: 18, scope: !552)
!554 = !DILocation(line: 341, column: 6, scope: !503)
!555 = !DILocalVariable(name: "found", scope: !556, file: !3, line: 342, type: !242)
!556 = distinct !DILexicalBlock(scope: !552, file: !3, line: 341, column: 24)
!557 = !DILocation(line: 342, column: 14, scope: !556)
!558 = !DILocalVariable(name: "charmap", scope: !556, file: !3, line: 343, type: !242)
!559 = !DILocation(line: 343, column: 14, scope: !556)
!560 = !DILocalVariable(name: "n", scope: !556, file: !3, line: 344, type: !67)
!561 = !DILocation(line: 344, column: 7, scope: !556)
!562 = !DILocation(line: 346, column: 10, scope: !563)
!563 = distinct !DILexicalBlock(scope: !556, file: !3, line: 346, column: 3)
!564 = !DILocation(line: 346, column: 8, scope: !563)
!565 = !DILocation(line: 346, column: 15, scope: !566)
!566 = distinct !DILexicalBlock(scope: !563, file: !3, line: 346, column: 3)
!567 = !DILocation(line: 346, column: 19, scope: !566)
!568 = !DILocation(line: 346, column: 25, scope: !566)
!569 = !DILocation(line: 346, column: 17, scope: !566)
!570 = !DILocation(line: 346, column: 3, scope: !563)
!571 = !DILocation(line: 347, column: 14, scope: !572)
!572 = distinct !DILexicalBlock(scope: !566, file: !3, line: 346, column: 44)
!573 = !DILocation(line: 347, column: 20, scope: !572)
!574 = !DILocation(line: 347, column: 29, scope: !572)
!575 = !DILocation(line: 347, column: 12, scope: !572)
!576 = !DILocation(line: 348, column: 8, scope: !577)
!577 = distinct !DILexicalBlock(scope: !572, file: !3, line: 348, column: 8)
!578 = !DILocation(line: 348, column: 17, scope: !577)
!579 = !DILocation(line: 348, column: 26, scope: !577)
!580 = !DILocation(line: 348, column: 8, scope: !572)
!581 = !DILocation(line: 349, column: 13, scope: !582)
!582 = distinct !DILexicalBlock(scope: !577, file: !3, line: 348, column: 54)
!583 = !DILocation(line: 349, column: 11, scope: !582)
!584 = !DILocation(line: 350, column: 5, scope: !582)
!585 = !DILocation(line: 352, column: 3, scope: !572)
!586 = !DILocation(line: 346, column: 40, scope: !566)
!587 = !DILocation(line: 346, column: 3, scope: !566)
!588 = distinct !{!588, !570, !589}
!589 = !DILocation(line: 352, column: 3, scope: !563)
!590 = !DILocation(line: 354, column: 24, scope: !556)
!591 = !DILocation(line: 354, column: 30, scope: !556)
!592 = !DILocation(line: 354, column: 9, scope: !556)
!593 = !DILocation(line: 354, column: 7, scope: !556)
!594 = !DILocation(line: 356, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !556, file: !3, line: 356, column: 7)
!596 = !DILocation(line: 356, column: 7, scope: !556)
!597 = !DILocation(line: 357, column: 4, scope: !595)
!598 = !DILocation(line: 359, column: 40, scope: !556)
!599 = !DILocation(line: 359, column: 22, scope: !556)
!600 = !DILocation(line: 359, column: 20, scope: !556)
!601 = !DILocation(line: 359, column: 9, scope: !556)
!602 = !DILocation(line: 360, column: 2, scope: !556)
!603 = !DILocation(line: 364, column: 6, scope: !604)
!604 = distinct !DILexicalBlock(scope: !503, file: !3, line: 364, column: 6)
!605 = !DILocation(line: 364, column: 12, scope: !604)
!606 = !DILocation(line: 364, column: 17, scope: !604)
!607 = !DILocation(line: 364, column: 25, scope: !604)
!608 = !DILocation(line: 364, column: 31, scope: !604)
!609 = !DILocation(line: 364, column: 36, scope: !604)
!610 = !DILocation(line: 364, column: 22, scope: !604)
!611 = !DILocation(line: 364, column: 6, scope: !503)
!612 = !DILocation(line: 365, column: 39, scope: !613)
!613 = distinct !DILexicalBlock(scope: !604, file: !3, line: 364, column: 42)
!614 = !DILocation(line: 365, column: 45, scope: !613)
!615 = !DILocation(line: 365, column: 50, scope: !613)
!616 = !DILocation(line: 365, column: 57, scope: !613)
!617 = !DILocation(line: 365, column: 63, scope: !613)
!618 = !DILocation(line: 365, column: 68, scope: !613)
!619 = !DILocation(line: 365, column: 55, scope: !613)
!620 = !DILocation(line: 365, column: 30, scope: !613)
!621 = !DILocation(line: 365, column: 28, scope: !613)
!622 = !DILocation(line: 365, column: 16, scope: !613)
!623 = !DILocation(line: 365, column: 3, scope: !613)
!624 = !DILocation(line: 365, column: 8, scope: !613)
!625 = !DILocation(line: 365, column: 14, scope: !613)
!626 = !DILocation(line: 366, column: 2, scope: !613)
!627 = !DILocation(line: 368, column: 3, scope: !628)
!628 = distinct !DILexicalBlock(scope: !604, file: !3, line: 367, column: 7)
!629 = !DILocation(line: 368, column: 8, scope: !628)
!630 = !DILocation(line: 368, column: 14, scope: !628)
!631 = !DILocation(line: 372, column: 20, scope: !503)
!632 = !DILocation(line: 372, column: 2, scope: !503)
!633 = !DILocation(line: 372, column: 7, scope: !503)
!634 = !DILocation(line: 372, column: 18, scope: !503)
!635 = !DILocation(line: 374, column: 2, scope: !503)
!636 = !DILocation(line: 374, column: 9, scope: !503)
!637 = !DILocation(line: 374, column: 18, scope: !503)
!638 = !DILocation(line: 376, column: 25, scope: !639)
!639 = distinct !DILexicalBlock(scope: !503, file: !3, line: 374, column: 38)
!640 = !DILocation(line: 376, column: 31, scope: !639)
!641 = !DILocation(line: 376, column: 41, scope: !639)
!642 = !DILocation(line: 376, column: 3, scope: !639)
!643 = !DILocation(line: 379, column: 31, scope: !639)
!644 = !DILocation(line: 379, column: 37, scope: !639)
!645 = !DILocation(line: 379, column: 14, scope: !639)
!646 = !DILocation(line: 379, column: 12, scope: !639)
!647 = !DILocation(line: 382, column: 7, scope: !648)
!648 = distinct !DILexicalBlock(scope: !639, file: !3, line: 382, column: 7)
!649 = !DILocation(line: 382, column: 19, scope: !648)
!650 = !DILocation(line: 382, column: 16, scope: !648)
!651 = !DILocation(line: 382, column: 7, scope: !639)
!652 = !DILocation(line: 383, column: 4, scope: !648)
!653 = !DILocation(line: 384, column: 11, scope: !639)
!654 = !DILocation(line: 384, column: 9, scope: !639)
!655 = distinct !{!655, !635, !656}
!656 = !DILocation(line: 385, column: 2, scope: !503)
!657 = !DILocation(line: 387, column: 9, scope: !503)
!658 = !DILocation(line: 387, column: 2, scope: !503)
!659 = !DILocation(line: 388, column: 1, scope: !503)
!660 = distinct !DISubprogram(name: "BLI_vfontchar_from_freetypefont", scope: !3, file: !3, line: 484, type: !661, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!661 = !DISubroutineType(types: !662)
!662 = !{!49, !663, !65}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "VFont", file: !665, line: 56, baseType: !666)
!665 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vfont_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VFont", file: !665, line: 45, size: 9344, elements: !667)
!667 = !{!668, !729, !730, !732, !733}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !666, file: !665, line: 46, baseType: !669, size: 960)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !670, line: 130, baseType: !671)
!670 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !670, line: 117, size: 960, elements: !672)
!672 = !{!673, !674, !675, !677, !695, !699, !700, !701, !702, !703}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !671, file: !670, line: 118, baseType: !46, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !671, file: !670, line: 118, baseType: !46, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !671, file: !670, line: 119, baseType: !676, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !671, file: !670, line: 120, baseType: !678, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !670, line: 136, size: 17600, elements: !680)
!680 = !{!681, !682, !684, !687, !691, !692, !693}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !679, file: !670, line: 137, baseType: !669, size: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !679, file: !670, line: 138, baseType: !683, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !679, file: !670, line: 139, baseType: !685, size: 64, offset: 1024)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !670, line: 43, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !670, line: 140, baseType: !688, size: 8192, offset: 1088)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8192, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 1024)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !679, file: !670, line: 141, baseType: !688, size: 8192, offset: 9280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !679, file: !670, line: 148, baseType: !678, size: 64, offset: 17472)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !679, file: !670, line: 150, baseType: !694, size: 64, offset: 17536)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !670, line: 121, baseType: !696, size: 528, offset: 256)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 528, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 66)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !670, line: 126, baseType: !76, size: 16, offset: 784)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !671, file: !670, line: 127, baseType: !67, size: 32, offset: 800)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !671, file: !670, line: 128, baseType: !67, size: 32, offset: 832)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !671, file: !670, line: 128, baseType: !67, size: 32, offset: 864)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !671, file: !670, line: 129, baseType: !704, size: 64, offset: 896)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !670, line: 75, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !670, line: 62, size: 1024, elements: !707)
!707 = !{!708, !710, !711, !712, !713, !714, !718, !719, !727, !728}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !670, line: 63, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !706, file: !670, line: 63, baseType: !709, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !670, line: 64, baseType: !123, size: 8, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !706, file: !670, line: 64, baseType: !123, size: 8, offset: 136)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !706, file: !670, line: 65, baseType: !76, size: 16, offset: 144)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !670, line: 66, baseType: !715, size: 512, offset: 160)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !706, file: !670, line: 67, baseType: !67, size: 32, offset: 672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !706, file: !670, line: 69, baseType: !720, size: 256, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !670, line: 60, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !670, line: 48, size: 256, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !721, file: !670, line: 49, baseType: !46, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !721, file: !670, line: 58, baseType: !55, size: 128, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !721, file: !670, line: 59, baseType: !67, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !721, file: !670, line: 59, baseType: !67, size: 32, offset: 224)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !706, file: !670, line: 70, baseType: !67, size: 32, offset: 960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !706, file: !670, line: 74, baseType: !67, size: 32, offset: 992)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !666, file: !665, line: 48, baseType: !688, size: 8192, offset: 960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !666, file: !665, line: 50, baseType: !731, size: 64, offset: 9152)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !666, file: !665, line: 51, baseType: !694, size: 64, offset: 9216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pf", scope: !666, file: !665, line: 55, baseType: !694, size: 64, offset: 9280)
!734 = !DILocalVariable(name: "vfont", arg: 1, scope: !660, file: !3, line: 484, type: !663)
!735 = !DILocation(line: 484, column: 47, scope: !660)
!736 = !DILocalVariable(name: "character", arg: 2, scope: !660, file: !3, line: 484, type: !65)
!737 = !DILocation(line: 484, column: 68, scope: !660)
!738 = !DILocalVariable(name: "che", scope: !660, file: !3, line: 486, type: !49)
!739 = !DILocation(line: 486, column: 9, scope: !660)
!740 = !DILocation(line: 488, column: 7, scope: !741)
!741 = distinct !DILexicalBlock(scope: !660, file: !3, line: 488, column: 6)
!742 = !DILocation(line: 488, column: 6, scope: !660)
!743 = !DILocation(line: 488, column: 14, scope: !741)
!744 = !DILocation(line: 491, column: 8, scope: !660)
!745 = !DILocation(line: 491, column: 6, scope: !660)
!746 = !DILocation(line: 492, column: 6, scope: !747)
!747 = distinct !DILexicalBlock(scope: !660, file: !3, line: 492, column: 6)
!748 = !DILocation(line: 492, column: 6, scope: !660)
!749 = !DILocation(line: 494, column: 3, scope: !750)
!750 = distinct !DILexicalBlock(scope: !747, file: !3, line: 492, column: 11)
!751 = !DILocation(line: 498, column: 30, scope: !660)
!752 = !DILocation(line: 498, column: 37, scope: !660)
!753 = !DILocation(line: 498, column: 8, scope: !660)
!754 = !DILocation(line: 498, column: 6, scope: !660)
!755 = !DILocation(line: 501, column: 19, scope: !660)
!756 = !DILocation(line: 501, column: 2, scope: !660)
!757 = !DILocation(line: 503, column: 9, scope: !660)
!758 = !DILocation(line: 503, column: 2, scope: !660)
!759 = !DILocation(line: 504, column: 1, scope: !660)
!760 = distinct !DISubprogram(name: "objchr_to_ftvfontdata", scope: !3, file: !3, line: 253, type: !761, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!761 = !DISubroutineType(types: !762)
!762 = !{!49, !663, !510}
!763 = !DILocalVariable(name: "vfont", arg: 1, scope: !760, file: !3, line: 253, type: !663)
!764 = !DILocation(line: 253, column: 44, scope: !760)
!765 = !DILocalVariable(name: "charcode", arg: 2, scope: !760, file: !3, line: 253, type: !510)
!766 = !DILocation(line: 253, column: 60, scope: !760)
!767 = !DILocalVariable(name: "che", scope: !760, file: !3, line: 255, type: !49)
!768 = !DILocation(line: 255, column: 9, scope: !760)
!769 = !DILocalVariable(name: "face", scope: !760, file: !3, line: 258, type: !210)
!770 = !DILocation(line: 258, column: 10, scope: !760)
!771 = !DILocation(line: 261, column: 6, scope: !772)
!772 = distinct !DILexicalBlock(scope: !760, file: !3, line: 261, column: 6)
!773 = !DILocation(line: 261, column: 13, scope: !772)
!774 = !DILocation(line: 261, column: 6, scope: !760)
!775 = !DILocation(line: 262, column: 28, scope: !776)
!776 = distinct !DILexicalBlock(scope: !772, file: !3, line: 261, column: 22)
!777 = !DILocation(line: 263, column: 28, scope: !776)
!778 = !DILocation(line: 263, column: 35, scope: !776)
!779 = !DILocation(line: 263, column: 44, scope: !776)
!780 = !DILocation(line: 264, column: 28, scope: !776)
!781 = !DILocation(line: 264, column: 35, scope: !776)
!782 = !DILocation(line: 264, column: 44, scope: !776)
!783 = !DILocation(line: 262, column: 9, scope: !776)
!784 = !DILocation(line: 262, column: 7, scope: !776)
!785 = !DILocation(line: 267, column: 7, scope: !786)
!786 = distinct !DILexicalBlock(scope: !776, file: !3, line: 267, column: 7)
!787 = !DILocation(line: 267, column: 7, scope: !776)
!788 = !DILocation(line: 268, column: 4, scope: !789)
!789 = distinct !DILexicalBlock(scope: !786, file: !3, line: 267, column: 12)
!790 = !DILocation(line: 270, column: 2, scope: !776)
!791 = !DILocation(line: 272, column: 7, scope: !792)
!792 = distinct !DILexicalBlock(scope: !772, file: !3, line: 271, column: 7)
!793 = !DILocation(line: 273, column: 3, scope: !792)
!794 = !DILocation(line: 277, column: 30, scope: !760)
