; ModuleID = 'blender/source/blender/editors/armature/pose_transform.c'
source_filename = "blender/source/blender/editors/armature/pose_transform.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bPose = type { %struct.ListBase, %struct.GHash*, i16, i16, i32, i32, float, [3 x float], [3 x float], %struct.ListBase, i32, i32, i8*, i8*, %struct.bAnimVizSettings, [64 x i8] }
%struct.GHash = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.bAnimVizSettings = type { i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i32, i32 }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }

!134 = !DIEnumerator(name: "POSE_HAS_IKS", value: 16384, isUnsigned: true)
!135 = !DIEnumerator(name: "POSE_IKSPLINE", value: 32768, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRotationModes", file: !118, line: 306, baseType: !137, size: 32, elements: !138)
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!139 = !DIEnumerator(name: "ROT_MODE_QUAT", value: 0)
!140 = !DIEnumerator(name: "ROT_MODE_EUL", value: 1)
!141 = !DIEnumerator(name: "ROT_MODE_XYZ", value: 1)
!142 = !DIEnumerator(name: "ROT_MODE_XZY", value: 2)
!143 = !DIEnumerator(name: "ROT_MODE_YXZ", value: 3)
!144 = !DIEnumerator(name: "ROT_MODE_YZX", value: 4)
!145 = !DIEnumerator(name: "ROT_MODE_ZXY", value: 5)
!146 = !DIEnumerator(name: "ROT_MODE_ZYX", value: 6)
!147 = !DIEnumerator(name: "ROT_MODE_AXISANGLE", value: -1)
!148 = !DIEnumerator(name: "ROT_MODE_MIN", value: -1)
!149 = !DIEnumerator(name: "ROT_MODE_MAX", value: 6)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEulerRotationOrders", file: !151, line: 142, baseType: !7, size: 32, elements: !152)
!151 = !DIFile(filename: "blender/source/blender/blenlib/BLI_math_rotation.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!152 = !{!153, !154, !155, !156, !157, !158, !159}
!153 = !DIEnumerator(name: "EULER_ORDER_DEFAULT", value: 1, isUnsigned: true)
!154 = !DIEnumerator(name: "EULER_ORDER_XYZ", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "EULER_ORDER_XZY", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "EULER_ORDER_YXZ", value: 3, isUnsigned: true)
!157 = !DIEnumerator(name: "EULER_ORDER_YZX", value: 4, isUnsigned: true)
!158 = !DIEnumerator(name: "EULER_ORDER_ZXY", value: 5, isUnsigned: true)
!159 = !DIEnumerator(name: "EULER_ORDER_ZYX", value: 6, isUnsigned: true)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eModifyKey_Modes", file: !161, line: 178, baseType: !7, size: 32, elements: !162)
!161 = !DIFile(filename: "blender/source/blender/editors/include/ED_keyframing.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !{!163, !164}
!163 = !DIEnumerator(name: "MODIFYKEY_MODE_INSERT", value: 0, isUnsigned: true)
!164 = !DIEnumerator(name: "MODIFYKEY_MODE_DELETE", value: 1, isUnsigned: true)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eMotionPaths_BakeFlag", file: !118, line: 168, baseType: !7, size: 32, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIEnumerator(name: "MOTIONPATH_BAKE_NEEDS_RECALC", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "MOTIONPATH_BAKE_HEADS", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "MOTIONPATH_BAKE_HAS_PATHS", value: 4, isUnsigned: true)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 648, baseType: !7, size: 32, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!172 = !DIEnumerator(name: "OB_LOCK_LOCX", value: 1, isUnsigned: true)
!173 = !DIEnumerator(name: "OB_LOCK_LOCY", value: 2, isUnsigned: true)
!174 = !DIEnumerator(name: "OB_LOCK_LOCZ", value: 4, isUnsigned: true)
!175 = !DIEnumerator(name: "OB_LOCK_LOC", value: 7, isUnsigned: true)
!176 = !DIEnumerator(name: "OB_LOCK_ROTX", value: 8, isUnsigned: true)
!177 = !DIEnumerator(name: "OB_LOCK_ROTY", value: 16, isUnsigned: true)
!178 = !DIEnumerator(name: "OB_LOCK_ROTZ", value: 32, isUnsigned: true)
!179 = !DIEnumerator(name: "OB_LOCK_ROT", value: 56, isUnsigned: true)
!180 = !DIEnumerator(name: "OB_LOCK_SCALEX", value: 64, isUnsigned: true)
!181 = !DIEnumerator(name: "OB_LOCK_SCALEY", value: 128, isUnsigned: true)
!182 = !DIEnumerator(name: "OB_LOCK_SCALEZ", value: 256, isUnsigned: true)
!183 = !DIEnumerator(name: "OB_LOCK_SCALE", value: 448, isUnsigned: true)
!184 = !DIEnumerator(name: "OB_LOCK_ROTW", value: 512, isUnsigned: true)
!185 = !DIEnumerator(name: "OB_LOCK_ROT4D", value: 1024, isUnsigned: true)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimData_Recalc", file: !187, line: 899, baseType: !7, size: 32, elements: !188)
!187 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !{!189, !190, !191}
!189 = !DIEnumerator(name: "ADT_RECALC_DRIVERS", value: 1, isUnsigned: true)
!190 = !DIEnumerator(name: "ADT_RECALC_ANIM", value: 2, isUnsigned: true)
!191 = !DIEnumerator(name: "ADT_RECALC_ALL", value: 3, isUnsigned: true)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!194 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!195 = !{!0}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "bPose", file: !118, line: 356, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !118, line: 334, size: 1728, elements: !199)
!199 = !{!200, !207, !210, !212, !213, !214, !215, !216, !220, !221, !222, !223, !224, !225, !226, !246}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !198, file: !118, line: 335, baseType: !201, size: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !202, line: 71, baseType: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !202, line: 69, size: 128, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !203, file: !202, line: 70, baseType: !193, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !203, file: !202, line: 70, baseType: !193, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !198, file: !118, line: 336, baseType: !208, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !118, line: 47, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !118, line: 338, baseType: !211, size: 16, offset: 192)
!211 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !198, file: !118, line: 338, baseType: !211, size: 16, offset: 208)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !198, file: !118, line: 339, baseType: !7, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !198, file: !118, line: 340, baseType: !137, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !198, file: !118, line: 342, baseType: !194, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !198, file: !118, line: 343, baseType: !217, size: 96, offset: 320)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 96, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 3)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !198, file: !118, line: 344, baseType: !217, size: 96, offset: 416)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !198, file: !118, line: 347, baseType: !201, size: 128, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !198, file: !118, line: 349, baseType: !137, size: 32, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !198, file: !118, line: 350, baseType: !137, size: 32, offset: 672)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !198, file: !118, line: 351, baseType: !193, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !198, file: !118, line: 352, baseType: !193, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !198, file: !118, line: 354, baseType: !227, size: 384, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !118, line: 116, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !118, line: 94, size: 384, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !228, file: !118, line: 96, baseType: !137, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !228, file: !118, line: 96, baseType: !137, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !228, file: !118, line: 97, baseType: !137, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !228, file: !118, line: 97, baseType: !137, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !228, file: !118, line: 99, baseType: !211, size: 16, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !228, file: !118, line: 100, baseType: !211, size: 16, offset: 144)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !228, file: !118, line: 102, baseType: !211, size: 16, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !228, file: !118, line: 105, baseType: !211, size: 16, offset: 176)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !228, file: !118, line: 108, baseType: !211, size: 16, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !228, file: !118, line: 109, baseType: !211, size: 16, offset: 208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !228, file: !118, line: 111, baseType: !211, size: 16, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !228, file: !118, line: 112, baseType: !211, size: 16, offset: 240)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !228, file: !118, line: 114, baseType: !137, size: 32, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !228, file: !118, line: 114, baseType: !137, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !228, file: !118, line: 115, baseType: !137, size: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !228, file: !118, line: 115, baseType: !137, size: 32, offset: 352)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !198, file: !118, line: 355, baseType: !247, size: 512, offset: 1216)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 512, elements: !249)
!248 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!249 = !{!250}
!250 = !DISubrange(count: 64)
!251 = !{i32 7, !"Dwarf Version", i32 4}
!252 = !{i32 2, !"Debug Info Version", i32 3}
!253 = !{i32 1, !"wchar_size", i32 4}
!254 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!255 = distinct !DISubprogram(name: "POSE_OT_armature_apply", scope: !3, file: !3, line: 178, type: !256, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !2052)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !260, line: 568, baseType: !261)
!260 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !260, line: 508, size: 1536, elements: !262)
!262 = !{!263, !266, !267, !268, !269, !1978, !1982, !1988, !1992, !1993, !1997, !1998, !1999, !2000, !2004, !2005, !2020, !2021, !2025, !2051}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !260, line: 509, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !261, file: !260, line: 510, baseType: !264, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !261, file: !260, line: 511, baseType: !264, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !261, file: !260, line: 512, baseType: !264, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !261, file: !260, line: 518, baseType: !270, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!137, !273, !276}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !275, line: 40, flags: DIFlagFwdDecl)
!275 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_animsys.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !55, line: 328, size: 1344, elements: !278)
!278 = !{!279, !280, !281, !282, !306, !308, !309, !310, !322, !1971, !1972, !1973, !1976, !1977}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !55, line: 329, baseType: !276, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !277, file: !55, line: 329, baseType: !276, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !277, file: !55, line: 332, baseType: !247, size: 512, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !277, file: !55, line: 333, baseType: !283, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !285, line: 75, baseType: !286)
!285 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !285, line: 62, size: 1024, elements: !287)
!287 = !{!288, !290, !291, !292, !293, !294, !295, !296, !304, !305}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !285, line: 63, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !286, file: !285, line: 63, baseType: !289, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !285, line: 64, baseType: !248, size: 8, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !286, file: !285, line: 64, baseType: !248, size: 8, offset: 136)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !285, line: 65, baseType: !211, size: 16, offset: 144)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !286, file: !285, line: 66, baseType: !247, size: 512, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !286, file: !285, line: 67, baseType: !137, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !285, line: 69, baseType: !297, size: 256, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !285, line: 60, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !285, line: 48, size: 256, elements: !299)
!299 = !{!300, !301, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !298, file: !285, line: 49, baseType: !193, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !298, file: !285, line: 58, baseType: !201, size: 128, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !298, file: !285, line: 59, baseType: !137, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !298, file: !285, line: 59, baseType: !137, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !286, file: !285, line: 70, baseType: !137, size: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !286, file: !285, line: 74, baseType: !137, size: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !55, line: 336, baseType: !307, size: 64, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !277, file: !55, line: 337, baseType: !193, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !277, file: !55, line: 338, baseType: !193, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !277, file: !55, line: 340, baseType: !311, size: 64, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !313)
!313 = !{!314, !318, !321}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !312, file: !6, line: 58, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !6, line: 56, size: 64, elements: !316)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !6, line: 57, baseType: !193, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !6, line: 60, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !6, line: 41, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !6, line: 61, baseType: !193, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !277, file: !55, line: 341, baseType: !323, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !55, line: 106, size: 320, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !324, file: !55, line: 107, baseType: !201, size: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !324, file: !55, line: 108, baseType: !137, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !324, file: !55, line: 109, baseType: !137, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !55, line: 110, baseType: !137, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !324, file: !55, line: 110, baseType: !137, size: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !324, file: !55, line: 111, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !260, line: 490, size: 768, elements: !334)
!334 = !{!335, !336, !337, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !260, line: 491, baseType: !332, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !260, line: 491, baseType: !332, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !333, file: !260, line: 493, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !55, line: 169, size: 2048, elements: !340)
!340 = !{!341, !342, !343, !344, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1937, !1940, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !55, line: 170, baseType: !338, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !55, line: 170, baseType: !338, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !339, file: !55, line: 172, baseType: !193, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !339, file: !55, line: 174, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !347, line: 49, size: 1984, elements: !348)
!347 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!348 = !{!349, !385, !386, !387, !388, !389, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !346, file: !347, line: 50, baseType: !350, size: 960)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !285, line: 130, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !285, line: 117, size: 960, elements: !352)
!352 = !{!353, !354, !355, !357, !376, !380, !381, !382, !383, !384}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !285, line: 118, baseType: !193, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !351, file: !285, line: 118, baseType: !193, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !351, file: !285, line: 119, baseType: !356, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !351, file: !285, line: 120, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !285, line: 136, size: 17600, elements: !360)
!360 = !{!361, !362, !364, !367, !371, !372, !373}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !359, file: !285, line: 137, baseType: !350, size: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !359, file: !285, line: 138, baseType: !363, size: 64, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !359, file: !285, line: 139, baseType: !365, size: 64, offset: 1024)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !285, line: 43, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !359, file: !285, line: 140, baseType: !368, size: 8192, offset: 1088)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8192, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 1024)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !359, file: !285, line: 141, baseType: !368, size: 8192, offset: 9280)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !359, file: !285, line: 148, baseType: !358, size: 64, offset: 17472)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !359, file: !285, line: 150, baseType: !374, size: 64, offset: 17536)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !285, line: 45, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !351, file: !285, line: 121, baseType: !377, size: 528, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 528, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 66)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !351, file: !285, line: 126, baseType: !211, size: 16, offset: 784)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !351, file: !285, line: 127, baseType: !137, size: 32, offset: 800)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !351, file: !285, line: 128, baseType: !137, size: 32, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !351, file: !285, line: 128, baseType: !137, size: 32, offset: 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !351, file: !285, line: 129, baseType: !283, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !346, file: !347, line: 52, baseType: !201, size: 128, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !346, file: !347, line: 53, baseType: !201, size: 128, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !346, file: !347, line: 54, baseType: !201, size: 128, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !346, file: !347, line: 55, baseType: !201, size: 128, offset: 1344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !346, file: !347, line: 57, baseType: !390, size: 64, offset: 1472)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !392, line: 1216, size: 39680, elements: !393)
!392 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!393 = !{!394, !395, !463, !701, !704, !705, !706, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !732, !803, !1231, !1446, !1449, !1737, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1759, !1760, !1761, !1762, !1763, !1771, !1838, !1845, !1846, !1853, !1854, !1855, !1856, !1857, !1858, !1859}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !391, file: !392, line: 1217, baseType: !350, size: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !391, file: !392, line: 1218, baseType: !396, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !187, line: 838, size: 768, elements: !398)
!398 = !{!399, !413, !414, !424, !425, !456, !457, !458, !459, !460, !461, !462}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !397, file: !187, line: 840, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !118, line: 499, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !118, line: 486, size: 1600, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !118, line: 487, baseType: !350, size: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !402, file: !118, line: 489, baseType: !201, size: 128, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !402, file: !118, line: 490, baseType: !201, size: 128, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !402, file: !118, line: 491, baseType: !201, size: 128, offset: 1216)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !402, file: !118, line: 492, baseType: !201, size: 128, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !118, line: 494, baseType: !137, size: 32, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !402, file: !118, line: 495, baseType: !137, size: 32, offset: 1504)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !402, file: !118, line: 497, baseType: !137, size: 32, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !118, line: 498, baseType: !137, size: 32, offset: 1568)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !397, file: !187, line: 844, baseType: !400, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !397, file: !187, line: 848, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !187, line: 549, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !187, line: 544, size: 320, elements: !418)
!418 = !{!419, !421, !422, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !187, line: 545, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !187, line: 545, baseType: !420, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !417, file: !187, line: 547, baseType: !400, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !417, file: !187, line: 548, baseType: !201, size: 128, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !397, file: !187, line: 851, baseType: !201, size: 128, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !397, file: !187, line: 853, baseType: !426, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !187, line: 594, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !187, line: 561, size: 1664, elements: !429)
!429 = !{!430, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !187, line: 562, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !428, file: !187, line: 562, baseType: !431, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !428, file: !187, line: 564, baseType: !201, size: 128, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !428, file: !187, line: 565, baseType: !400, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !428, file: !187, line: 566, baseType: !415, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !428, file: !187, line: 568, baseType: !201, size: 128, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !428, file: !187, line: 569, baseType: !201, size: 128, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !428, file: !187, line: 571, baseType: !247, size: 512, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !428, file: !187, line: 573, baseType: !194, size: 32, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !428, file: !187, line: 574, baseType: !194, size: 32, offset: 1184)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !428, file: !187, line: 576, baseType: !194, size: 32, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !428, file: !187, line: 576, baseType: !194, size: 32, offset: 1248)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !428, file: !187, line: 577, baseType: !194, size: 32, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !428, file: !187, line: 577, baseType: !194, size: 32, offset: 1312)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !428, file: !187, line: 579, baseType: !194, size: 32, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !428, file: !187, line: 580, baseType: !194, size: 32, offset: 1376)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !428, file: !187, line: 582, baseType: !194, size: 32, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !428, file: !187, line: 582, baseType: !194, size: 32, offset: 1440)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !428, file: !187, line: 583, baseType: !211, size: 16, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !428, file: !187, line: 585, baseType: !211, size: 16, offset: 1488)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !428, file: !187, line: 586, baseType: !211, size: 16, offset: 1504)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, file: !187, line: 588, baseType: !211, size: 16, offset: 1520)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !428, file: !187, line: 590, baseType: !193, size: 64, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !187, line: 592, baseType: !137, size: 32, offset: 1600)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !428, file: !187, line: 593, baseType: !137, size: 32, offset: 1632)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !397, file: !187, line: 858, baseType: !201, size: 128, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !397, file: !187, line: 859, baseType: !201, size: 128, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !187, line: 862, baseType: !137, size: 32, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !397, file: !187, line: 863, baseType: !137, size: 32, offset: 672)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !397, file: !187, line: 866, baseType: !211, size: 16, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !397, file: !187, line: 867, baseType: !211, size: 16, offset: 720)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !397, file: !187, line: 868, baseType: !194, size: 32, offset: 736)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !391, file: !392, line: 1220, baseType: !464, size: 64, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !41, line: 115, size: 11392, elements: !466)
!466 = !{!467, !468, !469, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !487, !497, !499, !500, !502, !503, !506, !507, !523, !524, !525, !526, !527, !528, !529, !534, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !550, !551, !552, !553, !554, !555, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !626, !629, !632, !633, !634, !635, !636, !639, !642, !645, !646, !652, !653, !654, !655, !656, !657, !659, !662, !665, !669, !689, !690}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !41, line: 116, baseType: !350, size: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !465, file: !41, line: 117, baseType: !396, size: 64, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !465, file: !41, line: 119, baseType: !470, size: 64, offset: 1024)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !41, line: 57, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !41, line: 121, baseType: !211, size: 16, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !465, file: !41, line: 121, baseType: !211, size: 16, offset: 1104)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !465, file: !41, line: 122, baseType: !137, size: 32, offset: 1120)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !465, file: !41, line: 122, baseType: !137, size: 32, offset: 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !465, file: !41, line: 122, baseType: !137, size: 32, offset: 1184)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !465, file: !41, line: 123, baseType: !247, size: 512, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !465, file: !41, line: 124, baseType: !464, size: 64, offset: 1728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !465, file: !41, line: 124, baseType: !464, size: 64, offset: 1792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !465, file: !41, line: 127, baseType: !464, size: 64, offset: 1856)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !465, file: !41, line: 127, baseType: !464, size: 64, offset: 1920)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !465, file: !41, line: 127, baseType: !464, size: 64, offset: 1984)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !465, file: !41, line: 128, baseType: !484, size: 64, offset: 2048)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !486, line: 46, flags: DIFlagFwdDecl)
!486 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !465, file: !41, line: 130, baseType: !488, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !41, line: 97, size: 832, elements: !490)
!490 = !{!491, !495, !496}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !489, file: !41, line: 98, baseType: !492, size: 768)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 768, elements: !493)
!493 = !{!494, !219}
!494 = !DISubrange(count: 8)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !41, line: 99, baseType: !137, size: 32, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !489, file: !41, line: 99, baseType: !137, size: 32, offset: 800)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !465, file: !41, line: 131, baseType: !498, size: 64, offset: 2176)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !465, file: !41, line: 132, baseType: !498, size: 64, offset: 2240)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !465, file: !41, line: 133, baseType: !501, size: 64, offset: 2304)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !465, file: !41, line: 134, baseType: !193, size: 64, offset: 2368)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !465, file: !41, line: 136, baseType: !504, size: 64, offset: 2432)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !41, line: 58, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !465, file: !41, line: 138, baseType: !227, size: 384, offset: 2496)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !465, file: !41, line: 139, baseType: !508, size: 64, offset: 2880)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !118, line: 80, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !118, line: 72, size: 192, elements: !511)
!511 = !{!512, !519, !520, !521, !522}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !510, file: !118, line: 73, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !118, line: 59, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !118, line: 56, size: 128, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !515, file: !118, line: 57, baseType: !217, size: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !515, file: !118, line: 58, baseType: !137, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !510, file: !118, line: 74, baseType: !137, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !510, file: !118, line: 76, baseType: !137, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !510, file: !118, line: 77, baseType: !137, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !118, line: 79, baseType: !137, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !465, file: !41, line: 141, baseType: !201, size: 128, offset: 2944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !465, file: !41, line: 142, baseType: !201, size: 128, offset: 3072)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !465, file: !41, line: 143, baseType: !201, size: 128, offset: 3200)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !465, file: !41, line: 144, baseType: !201, size: 128, offset: 3328)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !465, file: !41, line: 146, baseType: !137, size: 32, offset: 3456)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !465, file: !41, line: 147, baseType: !137, size: 32, offset: 3488)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !465, file: !41, line: 150, baseType: !530, size: 64, offset: 3520)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !533, line: 46, flags: DIFlagFwdDecl)
!533 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!534 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !465, file: !41, line: 151, baseType: !535, size: 64, offset: 3584)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !465, file: !41, line: 152, baseType: !137, size: 32, offset: 3648)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !465, file: !41, line: 153, baseType: !137, size: 32, offset: 3680)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !465, file: !41, line: 156, baseType: !217, size: 96, offset: 3712)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !465, file: !41, line: 156, baseType: !217, size: 96, offset: 3808)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !465, file: !41, line: 156, baseType: !217, size: 96, offset: 3904)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !465, file: !41, line: 157, baseType: !217, size: 96, offset: 4000)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !465, file: !41, line: 158, baseType: !217, size: 96, offset: 4096)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !465, file: !41, line: 159, baseType: !217, size: 96, offset: 4192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !465, file: !41, line: 160, baseType: !217, size: 96, offset: 4288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !465, file: !41, line: 160, baseType: !217, size: 96, offset: 4384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !465, file: !41, line: 161, baseType: !547, size: 128, offset: 4480)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 128, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 4)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !465, file: !41, line: 161, baseType: !547, size: 128, offset: 4608)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !465, file: !41, line: 162, baseType: !217, size: 96, offset: 4736)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !465, file: !41, line: 162, baseType: !217, size: 96, offset: 4832)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !465, file: !41, line: 163, baseType: !194, size: 32, offset: 4928)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !465, file: !41, line: 163, baseType: !194, size: 32, offset: 4960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !465, file: !41, line: 164, baseType: !556, size: 512, offset: 4992)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 512, elements: !557)
!557 = !{!549, !549}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !465, file: !41, line: 165, baseType: !556, size: 512, offset: 5504)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !465, file: !41, line: 166, baseType: !556, size: 512, offset: 6016)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !465, file: !41, line: 167, baseType: !556, size: 512, offset: 6528)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !465, file: !41, line: 176, baseType: !556, size: 512, offset: 7040)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !465, file: !41, line: 178, baseType: !7, size: 32, offset: 7552)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !41, line: 180, baseType: !211, size: 16, offset: 7584)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !465, file: !41, line: 181, baseType: !211, size: 16, offset: 7600)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !465, file: !41, line: 183, baseType: !211, size: 16, offset: 7616)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !465, file: !41, line: 183, baseType: !211, size: 16, offset: 7632)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !465, file: !41, line: 184, baseType: !211, size: 16, offset: 7648)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !465, file: !41, line: 184, baseType: !211, size: 16, offset: 7664)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !465, file: !41, line: 185, baseType: !211, size: 16, offset: 7680)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !465, file: !41, line: 186, baseType: !211, size: 16, offset: 7696)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !465, file: !41, line: 187, baseType: !211, size: 16, offset: 7712)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !465, file: !41, line: 188, baseType: !248, size: 8, offset: 7728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !465, file: !41, line: 189, baseType: !248, size: 8, offset: 7736)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !465, file: !41, line: 192, baseType: !137, size: 32, offset: 7744)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !465, file: !41, line: 192, baseType: !137, size: 32, offset: 7776)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !465, file: !41, line: 192, baseType: !137, size: 32, offset: 7808)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !465, file: !41, line: 192, baseType: !137, size: 32, offset: 7840)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !41, line: 194, baseType: !137, size: 32, offset: 7872)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !465, file: !41, line: 202, baseType: !194, size: 32, offset: 7904)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !465, file: !41, line: 202, baseType: !194, size: 32, offset: 7936)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !465, file: !41, line: 202, baseType: !194, size: 32, offset: 7968)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !465, file: !41, line: 211, baseType: !194, size: 32, offset: 8000)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !465, file: !41, line: 212, baseType: !194, size: 32, offset: 8032)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !465, file: !41, line: 213, baseType: !194, size: 32, offset: 8064)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !465, file: !41, line: 214, baseType: !194, size: 32, offset: 8096)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !465, file: !41, line: 215, baseType: !194, size: 32, offset: 8128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !465, file: !41, line: 216, baseType: !194, size: 32, offset: 8160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !465, file: !41, line: 219, baseType: !194, size: 32, offset: 8192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !465, file: !41, line: 220, baseType: !194, size: 32, offset: 8224)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !465, file: !41, line: 221, baseType: !194, size: 32, offset: 8256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !465, file: !41, line: 224, baseType: !592, size: 16, offset: 8288)
!592 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !465, file: !41, line: 224, baseType: !592, size: 16, offset: 8304)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !465, file: !41, line: 226, baseType: !211, size: 16, offset: 8320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !465, file: !41, line: 228, baseType: !248, size: 8, offset: 8336)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !465, file: !41, line: 229, baseType: !248, size: 8, offset: 8344)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !465, file: !41, line: 231, baseType: !211, size: 16, offset: 8352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !465, file: !41, line: 232, baseType: !248, size: 8, offset: 8368)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !465, file: !41, line: 233, baseType: !248, size: 8, offset: 8376)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !465, file: !41, line: 234, baseType: !194, size: 32, offset: 8384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !465, file: !41, line: 235, baseType: !194, size: 32, offset: 8416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !465, file: !41, line: 237, baseType: !201, size: 128, offset: 8448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !465, file: !41, line: 238, baseType: !201, size: 128, offset: 8576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !465, file: !41, line: 239, baseType: !201, size: 128, offset: 8704)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !465, file: !41, line: 240, baseType: !201, size: 128, offset: 8832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !465, file: !41, line: 242, baseType: !194, size: 32, offset: 8960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !465, file: !41, line: 244, baseType: !211, size: 16, offset: 8992)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !465, file: !41, line: 245, baseType: !592, size: 16, offset: 9008)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !465, file: !41, line: 246, baseType: !547, size: 128, offset: 9024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !465, file: !41, line: 248, baseType: !137, size: 32, offset: 9152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !465, file: !41, line: 249, baseType: !137, size: 32, offset: 9184)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !465, file: !41, line: 251, baseType: !613, size: 64, offset: 9216)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !41, line: 251, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !465, file: !41, line: 253, baseType: !248, size: 8, offset: 9280)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !465, file: !41, line: 254, baseType: !248, size: 8, offset: 9288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !465, file: !41, line: 255, baseType: !211, size: 16, offset: 9296)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !465, file: !41, line: 256, baseType: !217, size: 96, offset: 9312)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !465, file: !41, line: 258, baseType: !201, size: 128, offset: 9408)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !465, file: !41, line: 259, baseType: !201, size: 128, offset: 9536)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !465, file: !41, line: 260, baseType: !201, size: 128, offset: 9664)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !465, file: !41, line: 261, baseType: !201, size: 128, offset: 9792)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !465, file: !41, line: 263, baseType: !624, size: 64, offset: 9920)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !41, line: 52, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !465, file: !41, line: 264, baseType: !627, size: 64, offset: 9984)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !41, line: 53, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !465, file: !41, line: 265, baseType: !630, size: 64, offset: 10048)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !118, line: 46, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !465, file: !41, line: 267, baseType: !248, size: 8, offset: 10112)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !465, file: !41, line: 268, baseType: !248, size: 8, offset: 10120)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !465, file: !41, line: 269, baseType: !211, size: 16, offset: 10128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !465, file: !41, line: 270, baseType: !194, size: 32, offset: 10144)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !465, file: !41, line: 272, baseType: !637, size: 64, offset: 10176)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !41, line: 54, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !465, file: !41, line: 275, baseType: !640, size: 64, offset: 10240)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !41, line: 275, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !465, file: !41, line: 277, baseType: !643, size: 64, offset: 10304)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !41, line: 56, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !465, file: !41, line: 277, baseType: !643, size: 64, offset: 10368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !465, file: !41, line: 278, baseType: !647, size: 64, offset: 10432)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !648, line: 27, baseType: !649)
!648 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !650, line: 45, baseType: !651)
!650 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!651 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !465, file: !41, line: 279, baseType: !647, size: 64, offset: 10496)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !465, file: !41, line: 280, baseType: !7, size: 32, offset: 10560)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !465, file: !41, line: 281, baseType: !7, size: 32, offset: 10592)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !465, file: !41, line: 283, baseType: !201, size: 128, offset: 10624)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !465, file: !41, line: 284, baseType: !201, size: 128, offset: 10752)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !465, file: !41, line: 285, baseType: !658, size: 64, offset: 10880)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !465, file: !41, line: 287, baseType: !660, size: 64, offset: 10944)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !41, line: 59, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !465, file: !41, line: 288, baseType: !663, size: 64, offset: 11008)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !41, line: 288, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !465, file: !41, line: 290, baseType: !666, size: 64, offset: 11072)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 2)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !465, file: !41, line: 291, baseType: !670, size: 64, offset: 11136)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !672, line: 65, baseType: !673)
!672 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !672, line: 50, size: 320, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !673, file: !672, line: 51, baseType: !390, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !673, file: !672, line: 53, baseType: !137, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !673, file: !672, line: 54, baseType: !137, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !673, file: !672, line: 55, baseType: !137, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !673, file: !672, line: 55, baseType: !137, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !673, file: !672, line: 56, baseType: !248, size: 8, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !673, file: !672, line: 56, baseType: !248, size: 8, offset: 200)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !673, file: !672, line: 57, baseType: !248, size: 8, offset: 208)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !673, file: !672, line: 57, baseType: !248, size: 8, offset: 216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !673, file: !672, line: 59, baseType: !211, size: 16, offset: 224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !673, file: !672, line: 59, baseType: !211, size: 16, offset: 240)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !673, file: !672, line: 59, baseType: !211, size: 16, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !673, file: !672, line: 61, baseType: !211, size: 16, offset: 272)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !673, file: !672, line: 63, baseType: !137, size: 32, offset: 288)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !465, file: !41, line: 293, baseType: !201, size: 128, offset: 11200)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !465, file: !41, line: 294, baseType: !691, size: 64, offset: 11328)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !41, line: 113, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !41, line: 108, size: 256, elements: !694)
!694 = !{!695, !697, !698, !699, !700}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !41, line: 109, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !693, file: !41, line: 109, baseType: !696, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !693, file: !41, line: 110, baseType: !464, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !41, line: 111, baseType: !137, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !693, file: !41, line: 112, baseType: !194, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !391, file: !392, line: 1221, baseType: !702, size: 64, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !392, line: 52, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !391, file: !392, line: 1223, baseType: !390, size: 64, offset: 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !392, line: 1225, baseType: !201, size: 128, offset: 1216)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !391, file: !392, line: 1226, baseType: !707, size: 64, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !392, line: 69, size: 320, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !708, file: !392, line: 70, baseType: !707, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !708, file: !392, line: 70, baseType: !707, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !708, file: !392, line: 71, baseType: !7, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !708, file: !392, line: 71, baseType: !7, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !708, file: !392, line: 72, baseType: !137, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !708, file: !392, line: 73, baseType: !211, size: 16, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !708, file: !392, line: 73, baseType: !211, size: 16, offset: 240)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !708, file: !392, line: 74, baseType: !464, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !391, file: !392, line: 1227, baseType: !464, size: 64, offset: 1408)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !391, file: !392, line: 1229, baseType: !217, size: 96, offset: 1472)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !391, file: !392, line: 1230, baseType: !217, size: 96, offset: 1568)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !391, file: !392, line: 1231, baseType: !217, size: 96, offset: 1664)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !391, file: !392, line: 1231, baseType: !217, size: 96, offset: 1760)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !391, file: !392, line: 1233, baseType: !7, size: 32, offset: 1856)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !391, file: !392, line: 1234, baseType: !137, size: 32, offset: 1888)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !391, file: !392, line: 1235, baseType: !7, size: 32, offset: 1920)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !392, line: 1237, baseType: !211, size: 16, offset: 1952)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !391, file: !392, line: 1239, baseType: !248, size: 8, offset: 1968)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !391, file: !392, line: 1240, baseType: !729, size: 8, offset: 1976)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 1)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !391, file: !392, line: 1242, baseType: !733, size: 64, offset: 1984)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !735, line: 328, size: 3456, elements: !736)
!735 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!736 = !{!737, !738, !739, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !769, !770, !771, !774, !779, !780, !783, !787, !791, !795, !799, !800, !801, !802}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !734, file: !735, line: 329, baseType: !350, size: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !734, file: !735, line: 330, baseType: !396, size: 64, offset: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !734, file: !735, line: 332, baseType: !740, size: 64, offset: 1024)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !735, line: 332, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !734, file: !735, line: 333, baseType: !247, size: 512, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !734, file: !735, line: 335, baseType: !319, size: 64, offset: 1600)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !734, file: !735, line: 337, baseType: !504, size: 64, offset: 1664)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !734, file: !735, line: 338, baseType: !666, size: 64, offset: 1728)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !734, file: !735, line: 340, baseType: !201, size: 128, offset: 1792)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !734, file: !735, line: 340, baseType: !201, size: 128, offset: 1920)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !735, line: 342, baseType: !137, size: 32, offset: 2048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !734, file: !735, line: 342, baseType: !137, size: 32, offset: 2080)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !734, file: !735, line: 343, baseType: !137, size: 32, offset: 2112)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !734, file: !735, line: 345, baseType: !137, size: 32, offset: 2144)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !734, file: !735, line: 346, baseType: !137, size: 32, offset: 2176)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !734, file: !735, line: 347, baseType: !211, size: 16, offset: 2208)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !734, file: !735, line: 348, baseType: !211, size: 16, offset: 2224)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !734, file: !735, line: 349, baseType: !137, size: 32, offset: 2240)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !734, file: !735, line: 351, baseType: !137, size: 32, offset: 2272)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !734, file: !735, line: 353, baseType: !211, size: 16, offset: 2304)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !734, file: !735, line: 354, baseType: !211, size: 16, offset: 2320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !734, file: !735, line: 355, baseType: !137, size: 32, offset: 2336)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !734, file: !735, line: 357, baseType: !761, size: 128, offset: 2368)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !762, line: 95, baseType: !763)
!762 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !762, line: 92, size: 128, elements: !764)
!764 = !{!765, !766, !767, !768}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !763, file: !762, line: 93, baseType: !194, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !763, file: !762, line: 93, baseType: !194, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !763, file: !762, line: 94, baseType: !194, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !763, file: !762, line: 94, baseType: !194, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !734, file: !735, line: 363, baseType: !201, size: 128, offset: 2496)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !734, file: !735, line: 363, baseType: !201, size: 128, offset: 2624)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !734, file: !735, line: 368, baseType: !772, size: 64, offset: 2752)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !735, line: 48, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !734, file: !735, line: 372, baseType: !775, size: 32, offset: 2816)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !735, line: 274, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !735, line: 271, size: 32, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !776, file: !735, line: 273, baseType: !7, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !734, file: !735, line: 373, baseType: !137, size: 32, offset: 2848)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !734, file: !735, line: 382, baseType: !781, size: 64, offset: 2880)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !735, line: 46, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !734, file: !735, line: 385, baseType: !784, size: 64, offset: 2944)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !193, !194}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !734, file: !735, line: 386, baseType: !788, size: 64, offset: 3008)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !193, !535}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !734, file: !735, line: 387, baseType: !792, size: 64, offset: 3072)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!137, !193}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !734, file: !735, line: 388, baseType: !796, size: 64, offset: 3136)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !193}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !734, file: !735, line: 389, baseType: !193, size: 64, offset: 3200)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !734, file: !735, line: 389, baseType: !193, size: 64, offset: 3264)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !734, file: !735, line: 389, baseType: !193, size: 64, offset: 3328)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !734, file: !735, line: 389, baseType: !193, size: 64, offset: 3392)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !391, file: !392, line: 1244, baseType: !804, size: 64, offset: 2048)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !806, line: 200, size: 17024, elements: !807)
!806 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!807 = !{!808, !809, !810, !811, !1224, !1225, !1226, !1227, !1228, !1229, !1230}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !805, file: !806, line: 201, baseType: !658, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !805, file: !806, line: 202, baseType: !201, size: 128, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !805, file: !806, line: 203, baseType: !201, size: 128, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !805, file: !806, line: 206, baseType: !812, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !806, line: 190, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !806, line: 126, size: 2816, elements: !815)
!815 = !{!816, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !914, !915, !916, !917, !1195, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1223}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !814, file: !806, line: 127, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !814, file: !806, line: 127, baseType: !817, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !814, file: !806, line: 128, baseType: !193, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !814, file: !806, line: 129, baseType: !193, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !806, line: 130, baseType: !247, size: 512, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !806, line: 132, baseType: !137, size: 32, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !814, file: !806, line: 132, baseType: !137, size: 32, offset: 800)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !814, file: !806, line: 133, baseType: !137, size: 32, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !814, file: !806, line: 134, baseType: !137, size: 32, offset: 864)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !814, file: !806, line: 134, baseType: !137, size: 32, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !814, file: !806, line: 134, baseType: !137, size: 32, offset: 928)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !814, file: !806, line: 135, baseType: !137, size: 32, offset: 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !814, file: !806, line: 135, baseType: !137, size: 32, offset: 992)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !814, file: !806, line: 136, baseType: !137, size: 32, offset: 1024)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !814, file: !806, line: 136, baseType: !137, size: 32, offset: 1056)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !814, file: !806, line: 137, baseType: !137, size: 32, offset: 1088)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !814, file: !806, line: 137, baseType: !137, size: 32, offset: 1120)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !814, file: !806, line: 138, baseType: !194, size: 32, offset: 1152)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !814, file: !806, line: 139, baseType: !194, size: 32, offset: 1184)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !814, file: !806, line: 139, baseType: !194, size: 32, offset: 1216)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !814, file: !806, line: 141, baseType: !211, size: 16, offset: 1248)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !814, file: !806, line: 142, baseType: !211, size: 16, offset: 1264)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !814, file: !806, line: 143, baseType: !137, size: 32, offset: 1280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !814, file: !806, line: 144, baseType: !137, size: 32, offset: 1312)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !814, file: !806, line: 146, baseType: !842, size: 64, offset: 1344)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !806, line: 114, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !806, line: 99, size: 7232, elements: !845)
!845 = !{!846, !848, !849, !850, !851, !852, !853, !864, !868, !882, !891, !898, !908}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !844, file: !806, line: 100, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !844, file: !806, line: 100, baseType: !847, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !844, file: !806, line: 101, baseType: !137, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !844, file: !806, line: 101, baseType: !137, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !844, file: !806, line: 102, baseType: !137, size: 32, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !844, file: !806, line: 102, baseType: !137, size: 32, offset: 224)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !844, file: !806, line: 103, baseType: !854, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !806, line: 59, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !806, line: 56, size: 2112, elements: !857)
!857 = !{!858, !862, !863}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !856, file: !806, line: 57, baseType: !859, size: 2048)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 2048, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !856, file: !806, line: 58, baseType: !137, size: 32, offset: 2048)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !856, file: !806, line: 58, baseType: !137, size: 32, offset: 2080)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !844, file: !806, line: 106, baseType: !865, size: 6144, offset: 320)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 6144, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !844, file: !806, line: 107, baseType: !869, size: 64, offset: 6464)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !806, line: 97, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !806, line: 83, size: 8320, elements: !872)
!872 = !{!873, !874, !875, !878, !879, !880, !881}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !871, file: !806, line: 84, baseType: !865, size: 6144)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !871, file: !806, line: 87, baseType: !859, size: 2048, offset: 6144)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !871, file: !806, line: 88, baseType: !876, size: 64, offset: 8192)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !672, line: 41, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !871, file: !806, line: 90, baseType: !211, size: 16, offset: 8256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !871, file: !806, line: 92, baseType: !211, size: 16, offset: 8272)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !871, file: !806, line: 93, baseType: !211, size: 16, offset: 8288)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !871, file: !806, line: 95, baseType: !211, size: 16, offset: 8304)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !844, file: !806, line: 108, baseType: !883, size: 64, offset: 6528)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !806, line: 66, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !806, line: 61, size: 128, elements: !886)
!886 = !{!887, !888, !889, !890}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !885, file: !806, line: 62, baseType: !137, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !885, file: !806, line: 63, baseType: !137, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !885, file: !806, line: 64, baseType: !137, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !885, file: !806, line: 65, baseType: !137, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !844, file: !806, line: 109, baseType: !892, size: 64, offset: 6592)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !806, line: 71, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !806, line: 68, size: 64, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !894, file: !806, line: 69, baseType: !137, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !894, file: !806, line: 70, baseType: !137, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !844, file: !806, line: 110, baseType: !899, size: 64, offset: 6656)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !806, line: 81, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !806, line: 73, size: 352, elements: !902)
!902 = !{!903, !904, !905, !906, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !901, file: !806, line: 74, baseType: !217, size: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !901, file: !806, line: 75, baseType: !217, size: 96, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !901, file: !806, line: 76, baseType: !217, size: 96, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !901, file: !806, line: 77, baseType: !137, size: 32, offset: 288)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !901, file: !806, line: 78, baseType: !137, size: 32, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !844, file: !806, line: 113, baseType: !909, size: 512, offset: 6720)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !910, line: 182, baseType: !911)
!910 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !910, line: 180, size: 512, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !911, file: !910, line: 181, baseType: !247, size: 512)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !814, file: !806, line: 148, baseType: !484, size: 64, offset: 1408)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !814, file: !806, line: 151, baseType: !390, size: 64, offset: 1472)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !814, file: !806, line: 152, baseType: !464, size: 64, offset: 1536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !814, file: !806, line: 153, baseType: !918, size: 64, offset: 1600)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !920, line: 64, size: 19136, elements: !921)
!920 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!921 = !{!922, !923, !924, !925, !926, !927, !929, !930, !931, !932, !935, !936, !1181, !1182, !1190, !1191, !1192, !1193, !1194}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !919, file: !920, line: 65, baseType: !350, size: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !919, file: !920, line: 66, baseType: !396, size: 64, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !919, file: !920, line: 68, baseType: !368, size: 8192, offset: 1024)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !919, file: !920, line: 70, baseType: !137, size: 32, offset: 9216)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !919, file: !920, line: 71, baseType: !137, size: 32, offset: 9248)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !919, file: !920, line: 72, baseType: !928, size: 64, offset: 9280)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !667)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !919, file: !920, line: 74, baseType: !194, size: 32, offset: 9344)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !919, file: !920, line: 74, baseType: !194, size: 32, offset: 9376)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !919, file: !920, line: 76, baseType: !876, size: 64, offset: 9408)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !919, file: !920, line: 77, baseType: !933, size: 64, offset: 9472)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !920, line: 77, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !919, file: !920, line: 78, baseType: !504, size: 64, offset: 9536)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !919, file: !920, line: 80, baseType: !937, size: 2624, offset: 9600)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !938, line: 340, size: 2624, elements: !939)
!938 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!939 = !{!940, !968, !986, !987, !988, !1003, !1061, !1062, !1161, !1162, !1163, !1164, !1170}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !937, file: !938, line: 341, baseType: !941, size: 576)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !938, line: 251, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !938, line: 207, size: 576, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !942, file: !938, line: 208, baseType: !137, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !942, file: !938, line: 211, baseType: !211, size: 16, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !942, file: !938, line: 212, baseType: !211, size: 16, offset: 48)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !942, file: !938, line: 213, baseType: !194, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !942, file: !938, line: 214, baseType: !211, size: 16, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !942, file: !938, line: 215, baseType: !211, size: 16, offset: 112)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !942, file: !938, line: 216, baseType: !211, size: 16, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !942, file: !938, line: 217, baseType: !211, size: 16, offset: 144)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !942, file: !938, line: 218, baseType: !211, size: 16, offset: 160)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !942, file: !938, line: 219, baseType: !211, size: 16, offset: 176)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !942, file: !938, line: 220, baseType: !194, size: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !942, file: !938, line: 222, baseType: !211, size: 16, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !942, file: !938, line: 225, baseType: !211, size: 16, offset: 240)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !942, file: !938, line: 228, baseType: !137, size: 32, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !942, file: !938, line: 229, baseType: !137, size: 32, offset: 288)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !942, file: !938, line: 233, baseType: !137, size: 32, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !942, file: !938, line: 236, baseType: !211, size: 16, offset: 352)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !942, file: !938, line: 236, baseType: !211, size: 16, offset: 368)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !942, file: !938, line: 241, baseType: !194, size: 32, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !942, file: !938, line: 244, baseType: !137, size: 32, offset: 416)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !942, file: !938, line: 244, baseType: !137, size: 32, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !942, file: !938, line: 245, baseType: !194, size: 32, offset: 480)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !942, file: !938, line: 248, baseType: !194, size: 32, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !942, file: !938, line: 250, baseType: !137, size: 32, offset: 544)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !937, file: !938, line: 342, baseType: !969, size: 448, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !938, line: 79, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !938, line: 61, size: 448, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !970, file: !938, line: 62, baseType: !193, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !970, file: !938, line: 64, baseType: !211, size: 16, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !970, file: !938, line: 65, baseType: !211, size: 16, offset: 80)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !970, file: !938, line: 67, baseType: !194, size: 32, offset: 96)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !970, file: !938, line: 68, baseType: !194, size: 32, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !970, file: !938, line: 69, baseType: !194, size: 32, offset: 160)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !970, file: !938, line: 70, baseType: !211, size: 16, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !970, file: !938, line: 71, baseType: !211, size: 16, offset: 208)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !970, file: !938, line: 72, baseType: !666, size: 64, offset: 224)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !970, file: !938, line: 75, baseType: !194, size: 32, offset: 288)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !970, file: !938, line: 75, baseType: !194, size: 32, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !970, file: !938, line: 75, baseType: !194, size: 32, offset: 352)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !970, file: !938, line: 78, baseType: !194, size: 32, offset: 384)
