; ModuleID = 'blender/source/blender/editors/space_nla/nla_draw.c'
source_filename = "blender/source/blender/editors/space_nla/nla_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!222 = !DIEnumerator(name: "ANIMFILTER_ACTGROUPED", value: 32)
!223 = !DIEnumerator(name: "ANIMFILTER_SEL", value: 64)
!224 = !DIEnumerator(name: "ANIMFILTER_UNSEL", value: 128)
!225 = !DIEnumerator(name: "ANIMFILTER_FOREDIT", value: 256)
!226 = !DIEnumerator(name: "ANIMFILTER_SELEDIT", value: 512)
!227 = !DIEnumerator(name: "ANIMFILTER_ANIMDATA", value: 1024)
!228 = !DIEnumerator(name: "ANIMFILTER_NODUPLIS", value: 2048)
!229 = !DIEnumerator(name: "ANIMFILTER_TMP_PEEK", value: 1073741824)
!230 = !DIEnumerator(name: "ANIMFILTER_TMP_IGNORE_ONLYSEL", value: -2147483648)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceNla_Flag", file: !232, line: 402, baseType: !5, size: 32, elements: !233)
!232 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !235, !236, !237}
!234 = !DIEnumerator(name: "SNLA_DRAWTIME", value: 4, isUnsigned: true)
!235 = !DIEnumerator(name: "SNLA_NODRAWCFRANUM", value: 16, isUnsigned: true)
!236 = !DIEnumerator(name: "SNLA_NOSTRIPCURVES", value: 32, isUnsigned: true)
!237 = !DIEnumerator(name: "SNLA_NOREALTIMEUPDATES", value: 64, isUnsigned: true)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Flag", file: !4, line: 615, baseType: !215, size: 32, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!240 = !DIEnumerator(name: "NLASTRIP_FLAG_ACTIVE", value: 1)
!241 = !DIEnumerator(name: "NLASTRIP_FLAG_SELECT", value: 2)
!242 = !DIEnumerator(name: "NLASTRIP_FLAG_TWEAKUSER", value: 16)
!243 = !DIEnumerator(name: "NLASTRIP_FLAG_USR_INFLUENCE", value: 32)
!244 = !DIEnumerator(name: "NLASTRIP_FLAG_USR_TIME", value: 64)
!245 = !DIEnumerator(name: "NLASTRIP_FLAG_USR_TIME_CYCLIC", value: 128)
!246 = !DIEnumerator(name: "NLASTRIP_FLAG_SYNC_LENGTH", value: 512)
!247 = !DIEnumerator(name: "NLASTRIP_FLAG_AUTO_BLENDS", value: 1024)
!248 = !DIEnumerator(name: "NLASTRIP_FLAG_REVERSE", value: 2048)
!249 = !DIEnumerator(name: "NLASTRIP_FLAG_MUTED", value: 4096)
!250 = !DIEnumerator(name: "NLASTRIP_FLAG_MIRROR", value: 8192)
!251 = !DIEnumerator(name: "NLASTRIP_FLAG_TEMP_META", value: 1073741824)
!252 = !DIEnumerator(name: "NLASTRIP_FLAG_EDIT_TOUCHED", value: -2147483648)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaTrack_Flag", file: !4, line: 685, baseType: !5, size: 32, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260}
!255 = !DIEnumerator(name: "NLATRACK_ACTIVE", value: 1, isUnsigned: true)
!256 = !DIEnumerator(name: "NLATRACK_SELECTED", value: 2, isUnsigned: true)
!257 = !DIEnumerator(name: "NLATRACK_MUTED", value: 4, isUnsigned: true)
!258 = !DIEnumerator(name: "NLATRACK_SOLO", value: 8, isUnsigned: true)
!259 = !DIEnumerator(name: "NLATRACK_PROTECTED", value: 16, isUnsigned: true)
!260 = !DIEnumerator(name: "NLATRACK_DISABLED", value: 1024, isUnsigned: true)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Extrapolate_Mode", file: !4, line: 605, baseType: !5, size: 32, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIEnumerator(name: "NLASTRIP_EXTEND_HOLD", value: 0, isUnsigned: true)
!264 = !DIEnumerator(name: "NLASTRIP_EXTEND_HOLD_FORWARD", value: 1, isUnsigned: true)
!265 = !DIEnumerator(name: "NLASTRIP_EXTEND_NOTHING", value: 2, isUnsigned: true)
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !267, line: 787, baseType: !5, size: 32, elements: !268)
!267 = !DIFile(filename: "blender/source/blender/editors/include/UI_interface.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !{!269, !270, !271, !272, !273, !274}
!269 = !DIEnumerator(name: "UI_CNR_TOP_LEFT", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "UI_CNR_TOP_RIGHT", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "UI_CNR_BOTTOM_RIGHT", value: 4, isUnsigned: true)
!272 = !DIEnumerator(name: "UI_CNR_BOTTOM_LEFT", value: 8, isUnsigned: true)
!273 = !DIEnumerator(name: "UI_CNR_NONE", value: 0, isUnsigned: true)
!274 = !DIEnumerator(name: "UI_CNR_ALL", value: 15, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Type", file: !4, line: 652, baseType: !5, size: 32, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIEnumerator(name: "NLASTRIP_TYPE_CLIP", value: 0, isUnsigned: true)
!278 = !DIEnumerator(name: "NLASTRIP_TYPE_TRANSITION", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "NLASTRIP_TYPE_META", value: 2, isUnsigned: true)
!280 = !DIEnumerator(name: "NLASTRIP_TYPE_SOUND", value: 3, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eKeyframeShapeDrawOpts", file: !282, line: 96, baseType: !5, size: 32, elements: !283)
!282 = !DIFile(filename: "blender/source/blender/editors/include/ED_keyframes_draw.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!283 = !{!284, !285, !286}
!284 = !DIEnumerator(name: "KEYFRAME_SHAPE_FRAME", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "KEYFRAME_SHAPE_INSIDE", value: 1, isUnsigned: true)
!286 = !DIEnumerator(name: "KEYFRAME_SHAPE_BOTH", value: 2, isUnsigned: true)
!287 = !{!288, !289, !311, !302, !1841}
!288 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaTrack", file: !4, line: 682, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaTrack", file: !4, line: 673, size: 832, elements: !292)
!292 = !{!293, !295, !296, !304, !305, !306}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !4, line: 674, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !291, file: !4, line: 674, baseType: !294, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !291, file: !4, line: 676, baseType: !297, size: 128, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !298, line: 71, baseType: !299)
!298 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !298, line: 69, size: 128, elements: !300)
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !299, file: !298, line: 70, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !299, file: !298, line: 70, baseType: !302, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !291, file: !4, line: 678, baseType: !215, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !291, file: !4, line: 679, baseType: !215, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !4, line: 681, baseType: !307, size: 512, offset: 320)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 512, elements: !309)
!308 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!309 = !{!310}
!310 = !DISubrange(count: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceNla", file: !232, line: 399, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNla", file: !232, line: 386, size: 1856, elements: !314)
!314 = !{!315, !329, !330, !331, !332, !333, !334, !335, !336, !337, !410}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !232, line: 387, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !232, line: 85, size: 448, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !232, line: 86, baseType: !316, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !232, line: 86, baseType: !316, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !317, file: !232, line: 87, baseType: !297, size: 128, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !317, file: !232, line: 88, baseType: !215, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !317, file: !232, line: 89, baseType: !288, size: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !317, file: !232, line: 90, baseType: !325, size: 128, offset: 320)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 128, elements: !327)
!326 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!327 = !{!328}
!328 = !DISubrange(count: 8)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !232, line: 387, baseType: !316, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !313, file: !232, line: 388, baseType: !297, size: 128, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !313, file: !232, line: 389, baseType: !215, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !313, file: !232, line: 390, baseType: !288, size: 32, offset: 288)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !313, file: !232, line: 391, baseType: !325, size: 128, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "autosnap", scope: !313, file: !232, line: 393, baseType: !326, size: 16, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !232, line: 394, baseType: !326, size: 16, offset: 464)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !313, file: !232, line: 395, baseType: !215, size: 32, offset: 480)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !313, file: !232, line: 397, baseType: !338, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDopeSheet", file: !340, line: 519, size: 896, elements: !341)
!340 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!341 = !{!342, !401, !402, !405, !406, !407, !408, !409}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !339, file: !340, line: 520, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !345, line: 130, baseType: !346)
!345 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !345, line: 117, size: 960, elements: !347)
!347 = !{!348, !349, !350, !352, !370, !374, !375, !376, !377, !378}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !345, line: 118, baseType: !302, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !346, file: !345, line: 118, baseType: !302, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !346, file: !345, line: 119, baseType: !351, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !346, file: !345, line: 120, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !345, line: 136, size: 17600, elements: !355)
!355 = !{!356, !357, !358, !361, !365, !366, !367}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !354, file: !345, line: 137, baseType: !344, size: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !354, file: !345, line: 138, baseType: !343, size: 64, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !354, file: !345, line: 139, baseType: !359, size: 64, offset: 1024)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !345, line: 43, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !345, line: 140, baseType: !362, size: 8192, offset: 1088)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 8192, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 1024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !354, file: !345, line: 141, baseType: !362, size: 8192, offset: 9280)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !354, file: !345, line: 148, baseType: !353, size: 64, offset: 17472)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !354, file: !345, line: 150, baseType: !368, size: 64, offset: 17536)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !345, line: 45, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !346, file: !345, line: 121, baseType: !371, size: 528, offset: 256)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 528, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 66)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !346, file: !345, line: 126, baseType: !326, size: 16, offset: 784)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !346, file: !345, line: 127, baseType: !215, size: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !346, file: !345, line: 128, baseType: !215, size: 32, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !346, file: !345, line: 128, baseType: !215, size: 32, offset: 864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !346, file: !345, line: 129, baseType: !379, size: 64, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !345, line: 75, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !345, line: 62, size: 1024, elements: !382)
!382 = !{!383, !385, !386, !387, !388, !389, !390, !391, !399, !400}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !345, line: 63, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !381, file: !345, line: 63, baseType: !384, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !345, line: 64, baseType: !308, size: 8, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !381, file: !345, line: 64, baseType: !308, size: 8, offset: 136)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !381, file: !345, line: 65, baseType: !326, size: 16, offset: 144)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !345, line: 66, baseType: !307, size: 512, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !381, file: !345, line: 67, baseType: !215, size: 32, offset: 672)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !345, line: 69, baseType: !392, size: 256, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !345, line: 60, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !345, line: 48, size: 256, elements: !394)
!394 = !{!395, !396, !397, !398}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !393, file: !345, line: 49, baseType: !302, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !393, file: !345, line: 58, baseType: !297, size: 128, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !393, file: !345, line: 59, baseType: !215, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !393, file: !345, line: 59, baseType: !215, size: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !381, file: !345, line: 70, baseType: !215, size: 32, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !381, file: !345, line: 74, baseType: !215, size: 32, offset: 992)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !339, file: !340, line: 521, baseType: !297, size: 128, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "filter_grp", scope: !339, file: !340, line: 523, baseType: !403, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !340, line: 46, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "searchstr", scope: !339, file: !340, line: 524, baseType: !307, size: 512, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "filterflag", scope: !339, file: !340, line: 526, baseType: !215, size: 32, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !340, line: 527, baseType: !215, size: 32, offset: 800)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "renameIndex", scope: !339, file: !340, line: 529, baseType: !215, size: 32, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !339, file: !340, line: 530, baseType: !215, size: 32, offset: 864)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !313, file: !232, line: 398, baseType: !411, size: 1280, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !412, line: 71, baseType: !413)
!412 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !412, line: 40, size: 1280, elements: !414)
!414 = !{!415, !424, !425, !433, !434, !435, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !456, !457, !458, !461}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !413, file: !412, line: 41, baseType: !416, size: 128)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !417, line: 95, baseType: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !417, line: 92, size: 128, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !418, file: !417, line: 93, baseType: !288, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !418, file: !417, line: 93, baseType: !288, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !418, file: !417, line: 94, baseType: !288, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !418, file: !417, line: 94, baseType: !288, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !413, file: !412, line: 41, baseType: !416, size: 128, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !413, file: !412, line: 42, baseType: !426, size: 128, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !417, line: 89, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !417, line: 86, size: 128, elements: !428)
!428 = !{!429, !430, !431, !432}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !427, file: !417, line: 87, baseType: !215, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !427, file: !417, line: 87, baseType: !215, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !427, file: !417, line: 88, baseType: !215, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !427, file: !417, line: 88, baseType: !215, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !413, file: !412, line: 42, baseType: !426, size: 128, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !413, file: !412, line: 43, baseType: !426, size: 128, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !413, file: !412, line: 45, baseType: !436, size: 64, offset: 640)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 64, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 2)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !413, file: !412, line: 45, baseType: !436, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !413, file: !412, line: 46, baseType: !288, size: 32, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !413, file: !412, line: 46, baseType: !288, size: 32, offset: 800)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !413, file: !412, line: 48, baseType: !326, size: 16, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !413, file: !412, line: 49, baseType: !326, size: 16, offset: 848)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !413, file: !412, line: 51, baseType: !326, size: 16, offset: 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !413, file: !412, line: 52, baseType: !326, size: 16, offset: 880)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !413, file: !412, line: 53, baseType: !326, size: 16, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !412, line: 55, baseType: !326, size: 16, offset: 912)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !413, file: !412, line: 56, baseType: !326, size: 16, offset: 928)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !413, file: !412, line: 58, baseType: !326, size: 16, offset: 944)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !413, file: !412, line: 58, baseType: !326, size: 16, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !413, file: !412, line: 59, baseType: !326, size: 16, offset: 976)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !413, file: !412, line: 59, baseType: !326, size: 16, offset: 992)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !413, file: !412, line: 61, baseType: !326, size: 16, offset: 1008)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !413, file: !412, line: 63, baseType: !455, size: 64, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !413, file: !412, line: 64, baseType: !215, size: 32, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !413, file: !412, line: 65, baseType: !215, size: 32, offset: 1120)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !413, file: !412, line: 68, baseType: !459, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !412, line: 68, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !413, file: !412, line: 69, baseType: !462, size: 64, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !464, line: 490, size: 768, elements: !465)
!464 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!465 = !{!466, !467, !468, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !464, line: 491, baseType: !462, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !464, line: 491, baseType: !462, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !463, file: !464, line: 493, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !471, line: 169, size: 2048, elements: !472)
!471 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!472 = !{!473, !474, !475, !476, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1807, !1810, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !471, line: 170, baseType: !469, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !470, file: !471, line: 170, baseType: !469, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !470, file: !471, line: 172, baseType: !302, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !470, file: !471, line: 174, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !479, line: 49, size: 1984, elements: !480)
!479 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!480 = !{!481, !482, !483, !484, !485, !486, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !478, file: !479, line: 50, baseType: !344, size: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !478, file: !479, line: 52, baseType: !297, size: 128, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !478, file: !479, line: 53, baseType: !297, size: 128, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !478, file: !479, line: 54, baseType: !297, size: 128, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !478, file: !479, line: 55, baseType: !297, size: 128, offset: 1344)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !478, file: !479, line: 57, baseType: !487, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !489, line: 1216, size: 39680, elements: !490)
!489 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!490 = !{!491, !492, !560, !564, !567, !568, !569, !581, !582, !586, !587, !588, !589, !590, !591, !592, !593, !594, !598, !666, !1101, !1316, !1319, !1600, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1622, !1623, !1624, !1625, !1626, !1634, !1701, !1708, !1709, !1716, !1717, !1723, !1724, !1725, !1726, !1727}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !488, file: !489, line: 1217, baseType: !344, size: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !488, file: !489, line: 1218, baseType: !493, size: 64, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !4, line: 838, size: 768, elements: !495)
!495 = !{!496, !510, !511, !521, !522, !553, !554, !555, !556, !557, !558, !559}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !494, file: !4, line: 840, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !340, line: 499, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !340, line: 486, size: 1600, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !499, file: !340, line: 487, baseType: !344, size: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !499, file: !340, line: 489, baseType: !297, size: 128, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !499, file: !340, line: 490, baseType: !297, size: 128, offset: 1088)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !499, file: !340, line: 491, baseType: !297, size: 128, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !499, file: !340, line: 492, baseType: !297, size: 128, offset: 1344)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !499, file: !340, line: 494, baseType: !215, size: 32, offset: 1472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !499, file: !340, line: 495, baseType: !215, size: 32, offset: 1504)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !499, file: !340, line: 497, baseType: !215, size: 32, offset: 1536)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !499, file: !340, line: 498, baseType: !215, size: 32, offset: 1568)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !494, file: !4, line: 844, baseType: !497, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !494, file: !4, line: 848, baseType: !512, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !4, line: 549, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !4, line: 544, size: 320, elements: !515)
!515 = !{!516, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !4, line: 545, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !514, file: !4, line: 545, baseType: !517, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !514, file: !4, line: 547, baseType: !497, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !514, file: !4, line: 548, baseType: !297, size: 128, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !494, file: !4, line: 851, baseType: !297, size: 128, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !494, file: !4, line: 853, baseType: !523, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !4, line: 594, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !4, line: 561, size: 1664, elements: !526)
!526 = !{!527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !4, line: 562, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !525, file: !4, line: 562, baseType: !528, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !525, file: !4, line: 564, baseType: !297, size: 128, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !525, file: !4, line: 565, baseType: !497, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !525, file: !4, line: 566, baseType: !512, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !525, file: !4, line: 568, baseType: !297, size: 128, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !525, file: !4, line: 569, baseType: !297, size: 128, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !525, file: !4, line: 571, baseType: !307, size: 512, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !525, file: !4, line: 573, baseType: !288, size: 32, offset: 1152)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !525, file: !4, line: 574, baseType: !288, size: 32, offset: 1184)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !525, file: !4, line: 576, baseType: !288, size: 32, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !525, file: !4, line: 576, baseType: !288, size: 32, offset: 1248)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !525, file: !4, line: 577, baseType: !288, size: 32, offset: 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !525, file: !4, line: 577, baseType: !288, size: 32, offset: 1312)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !525, file: !4, line: 579, baseType: !288, size: 32, offset: 1344)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !525, file: !4, line: 580, baseType: !288, size: 32, offset: 1376)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !525, file: !4, line: 582, baseType: !288, size: 32, offset: 1408)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !525, file: !4, line: 582, baseType: !288, size: 32, offset: 1440)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !525, file: !4, line: 583, baseType: !326, size: 16, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !525, file: !4, line: 585, baseType: !326, size: 16, offset: 1488)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !525, file: !4, line: 586, baseType: !326, size: 16, offset: 1504)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !4, line: 588, baseType: !326, size: 16, offset: 1520)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !525, file: !4, line: 590, baseType: !302, size: 64, offset: 1536)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !525, file: !4, line: 592, baseType: !215, size: 32, offset: 1600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !525, file: !4, line: 593, baseType: !215, size: 32, offset: 1632)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !494, file: !4, line: 858, baseType: !297, size: 128, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !494, file: !4, line: 859, baseType: !297, size: 128, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !4, line: 862, baseType: !215, size: 32, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !494, file: !4, line: 863, baseType: !215, size: 32, offset: 672)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !494, file: !4, line: 866, baseType: !326, size: 16, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !494, file: !4, line: 867, baseType: !326, size: 16, offset: 720)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !494, file: !4, line: 868, baseType: !288, size: 32, offset: 736)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !488, file: !489, line: 1220, baseType: !561, size: 64, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !563, line: 49, flags: DIFlagFwdDecl)
!563 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!564 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !488, file: !489, line: 1221, baseType: !565, size: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !489, line: 52, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !488, file: !489, line: 1223, baseType: !487, size: 64, offset: 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !488, file: !489, line: 1225, baseType: !297, size: 128, offset: 1216)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !488, file: !489, line: 1226, baseType: !570, size: 64, offset: 1344)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !489, line: 69, size: 320, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !571, file: !489, line: 70, baseType: !570, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !571, file: !489, line: 70, baseType: !570, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !571, file: !489, line: 71, baseType: !5, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !571, file: !489, line: 71, baseType: !5, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !489, line: 72, baseType: !215, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !571, file: !489, line: 73, baseType: !326, size: 16, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !571, file: !489, line: 73, baseType: !326, size: 16, offset: 240)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !571, file: !489, line: 74, baseType: !561, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !488, file: !489, line: 1227, baseType: !561, size: 64, offset: 1408)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !488, file: !489, line: 1229, baseType: !583, size: 96, offset: 1472)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 96, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 3)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !488, file: !489, line: 1230, baseType: !583, size: 96, offset: 1568)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !488, file: !489, line: 1231, baseType: !583, size: 96, offset: 1664)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !488, file: !489, line: 1231, baseType: !583, size: 96, offset: 1760)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !488, file: !489, line: 1233, baseType: !5, size: 32, offset: 1856)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !488, file: !489, line: 1234, baseType: !215, size: 32, offset: 1888)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !488, file: !489, line: 1235, baseType: !5, size: 32, offset: 1920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !489, line: 1237, baseType: !326, size: 16, offset: 1952)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !488, file: !489, line: 1239, baseType: !308, size: 8, offset: 1968)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !488, file: !489, line: 1240, baseType: !595, size: 8, offset: 1976)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 8, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 1)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !488, file: !489, line: 1242, baseType: !599, size: 64, offset: 1984)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !601, line: 328, size: 3456, elements: !602)
!601 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!602 = !{!603, !604, !605, !608, !609, !612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !636, !641, !642, !645, !649, !654, !658, !662, !663, !664, !665}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !600, file: !601, line: 329, baseType: !344, size: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !600, file: !601, line: 330, baseType: !493, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !600, file: !601, line: 332, baseType: !606, size: 64, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !601, line: 332, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !600, file: !601, line: 333, baseType: !307, size: 512, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !600, file: !601, line: 335, baseType: !610, size: 64, offset: 1600)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !601, line: 335, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !600, file: !601, line: 337, baseType: !613, size: 64, offset: 1664)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !489, line: 61, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !600, file: !601, line: 338, baseType: !436, size: 64, offset: 1728)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !600, file: !601, line: 340, baseType: !297, size: 128, offset: 1792)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !600, file: !601, line: 340, baseType: !297, size: 128, offset: 1920)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !601, line: 342, baseType: !215, size: 32, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !600, file: !601, line: 342, baseType: !215, size: 32, offset: 2080)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !600, file: !601, line: 343, baseType: !215, size: 32, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !600, file: !601, line: 345, baseType: !215, size: 32, offset: 2144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !600, file: !601, line: 346, baseType: !215, size: 32, offset: 2176)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !600, file: !601, line: 347, baseType: !326, size: 16, offset: 2208)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !600, file: !601, line: 348, baseType: !326, size: 16, offset: 2224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !600, file: !601, line: 349, baseType: !215, size: 32, offset: 2240)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !600, file: !601, line: 351, baseType: !215, size: 32, offset: 2272)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !600, file: !601, line: 353, baseType: !326, size: 16, offset: 2304)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !600, file: !601, line: 354, baseType: !326, size: 16, offset: 2320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !600, file: !601, line: 355, baseType: !215, size: 32, offset: 2336)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !600, file: !601, line: 357, baseType: !416, size: 128, offset: 2368)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !600, file: !601, line: 363, baseType: !297, size: 128, offset: 2496)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !600, file: !601, line: 363, baseType: !297, size: 128, offset: 2624)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !600, file: !601, line: 368, baseType: !634, size: 64, offset: 2752)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !601, line: 48, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !600, file: !601, line: 372, baseType: !637, size: 32, offset: 2816)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !601, line: 274, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !601, line: 271, size: 32, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !638, file: !601, line: 273, baseType: !5, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !600, file: !601, line: 373, baseType: !215, size: 32, offset: 2848)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !600, file: !601, line: 382, baseType: !643, size: 64, offset: 2880)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !601, line: 46, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !600, file: !601, line: 385, baseType: !646, size: 64, offset: 2944)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !302, !288}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !600, file: !601, line: 386, baseType: !650, size: 64, offset: 3008)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !302, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !600, file: !601, line: 387, baseType: !655, size: 64, offset: 3072)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!215, !302}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !600, file: !601, line: 388, baseType: !659, size: 64, offset: 3136)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !302}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !600, file: !601, line: 389, baseType: !302, size: 64, offset: 3200)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !600, file: !601, line: 389, baseType: !302, size: 64, offset: 3264)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !600, file: !601, line: 389, baseType: !302, size: 64, offset: 3328)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !600, file: !601, line: 389, baseType: !302, size: 64, offset: 3392)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !488, file: !489, line: 1244, baseType: !667, size: 64, offset: 2048)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !669, line: 200, size: 17024, elements: !670)
!669 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!670 = !{!671, !673, !674, !675, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !668, file: !669, line: 201, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !668, file: !669, line: 202, baseType: !297, size: 128, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !668, file: !669, line: 203, baseType: !297, size: 128, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !668, file: !669, line: 206, baseType: !676, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !669, line: 190, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !669, line: 126, size: 2816, elements: !679)
!679 = !{!680, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !779, !782, !783, !784, !1066, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1093}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !678, file: !669, line: 127, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !678, file: !669, line: 127, baseType: !681, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !678, file: !669, line: 128, baseType: !302, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !678, file: !669, line: 129, baseType: !302, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !669, line: 130, baseType: !307, size: 512, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !678, file: !669, line: 132, baseType: !215, size: 32, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !678, file: !669, line: 132, baseType: !215, size: 32, offset: 800)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !678, file: !669, line: 133, baseType: !215, size: 32, offset: 832)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !678, file: !669, line: 134, baseType: !215, size: 32, offset: 864)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !678, file: !669, line: 134, baseType: !215, size: 32, offset: 896)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !678, file: !669, line: 134, baseType: !215, size: 32, offset: 928)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !678, file: !669, line: 135, baseType: !215, size: 32, offset: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !678, file: !669, line: 135, baseType: !215, size: 32, offset: 992)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !678, file: !669, line: 136, baseType: !215, size: 32, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !678, file: !669, line: 136, baseType: !215, size: 32, offset: 1056)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !678, file: !669, line: 137, baseType: !215, size: 32, offset: 1088)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !678, file: !669, line: 137, baseType: !215, size: 32, offset: 1120)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !678, file: !669, line: 138, baseType: !288, size: 32, offset: 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !678, file: !669, line: 139, baseType: !288, size: 32, offset: 1184)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !678, file: !669, line: 139, baseType: !288, size: 32, offset: 1216)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !678, file: !669, line: 141, baseType: !326, size: 16, offset: 1248)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !678, file: !669, line: 142, baseType: !326, size: 16, offset: 1264)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !678, file: !669, line: 143, baseType: !215, size: 32, offset: 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !678, file: !669, line: 144, baseType: !215, size: 32, offset: 1312)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !678, file: !669, line: 146, baseType: !706, size: 64, offset: 1344)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !669, line: 114, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !669, line: 99, size: 7232, elements: !709)
!709 = !{!710, !712, !713, !714, !715, !716, !717, !728, !732, !747, !756, !763, !773}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !708, file: !669, line: 100, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !708, file: !669, line: 100, baseType: !711, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !708, file: !669, line: 101, baseType: !215, size: 32, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !708, file: !669, line: 101, baseType: !215, size: 32, offset: 160)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !708, file: !669, line: 102, baseType: !215, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !708, file: !669, line: 102, baseType: !215, size: 32, offset: 224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !708, file: !669, line: 103, baseType: !718, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !669, line: 59, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !669, line: 56, size: 2112, elements: !721)
!721 = !{!722, !726, !727}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !669, line: 57, baseType: !723, size: 2048)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 2048, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !720, file: !669, line: 58, baseType: !215, size: 32, offset: 2048)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !720, file: !669, line: 58, baseType: !215, size: 32, offset: 2080)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !708, file: !669, line: 106, baseType: !729, size: 6144, offset: 320)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 6144, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 768)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !708, file: !669, line: 107, baseType: !733, size: 64, offset: 6464)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !669, line: 97, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !669, line: 83, size: 8320, elements: !736)
!736 = !{!737, !738, !739, !743, !744, !745, !746}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !735, file: !669, line: 84, baseType: !729, size: 6144)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !735, file: !669, line: 87, baseType: !723, size: 2048, offset: 6144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !735, file: !669, line: 88, baseType: !740, size: 64, offset: 8192)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !742, line: 41, flags: DIFlagFwdDecl)
!742 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !735, file: !669, line: 90, baseType: !326, size: 16, offset: 8256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !735, file: !669, line: 92, baseType: !326, size: 16, offset: 8272)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !735, file: !669, line: 93, baseType: !326, size: 16, offset: 8288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !735, file: !669, line: 95, baseType: !326, size: 16, offset: 8304)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !708, file: !669, line: 108, baseType: !748, size: 64, offset: 6528)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !669, line: 66, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !669, line: 61, size: 128, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !750, file: !669, line: 62, baseType: !215, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !750, file: !669, line: 63, baseType: !215, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !750, file: !669, line: 64, baseType: !215, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !750, file: !669, line: 65, baseType: !215, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !708, file: !669, line: 109, baseType: !757, size: 64, offset: 6592)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !669, line: 71, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !669, line: 68, size: 64, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !759, file: !669, line: 69, baseType: !215, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !759, file: !669, line: 70, baseType: !215, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !708, file: !669, line: 110, baseType: !764, size: 64, offset: 6656)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !669, line: 81, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !669, line: 73, size: 352, elements: !767)
!767 = !{!768, !769, !770, !771, !772}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !766, file: !669, line: 74, baseType: !583, size: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !766, file: !669, line: 75, baseType: !583, size: 96, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !766, file: !669, line: 76, baseType: !583, size: 96, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !766, file: !669, line: 77, baseType: !215, size: 32, offset: 288)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !766, file: !669, line: 78, baseType: !215, size: 32, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !708, file: !669, line: 113, baseType: !774, size: 512, offset: 6720)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !775, line: 182, baseType: !776)
!775 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !775, line: 180, size: 512, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !775, line: 181, baseType: !307, size: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !678, file: !669, line: 148, baseType: !780, size: 64, offset: 1408)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !563, line: 46, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !678, file: !669, line: 151, baseType: !487, size: 64, offset: 1472)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !678, file: !669, line: 152, baseType: !561, size: 64, offset: 1536)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !678, file: !669, line: 153, baseType: !785, size: 64, offset: 1600)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !787, line: 64, size: 19136, elements: !788)
!787 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!788 = !{!789, !790, !791, !792, !793, !794, !796, !797, !798, !799, !802, !803, !1052, !1053, !1061, !1062, !1063, !1064, !1065}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !786, file: !787, line: 65, baseType: !344, size: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !786, file: !787, line: 66, baseType: !493, size: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !787, line: 68, baseType: !362, size: 8192, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !786, file: !787, line: 70, baseType: !215, size: 32, offset: 9216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !786, file: !787, line: 71, baseType: !215, size: 32, offset: 9248)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !786, file: !787, line: 72, baseType: !795, size: 64, offset: 9280)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !437)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !786, file: !787, line: 74, baseType: !288, size: 32, offset: 9344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !786, file: !787, line: 74, baseType: !288, size: 32, offset: 9376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !786, file: !787, line: 76, baseType: !740, size: 64, offset: 9408)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !786, file: !787, line: 77, baseType: !800, size: 64, offset: 9472)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !787, line: 77, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !786, file: !787, line: 78, baseType: !613, size: 64, offset: 9536)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !786, file: !787, line: 80, baseType: !804, size: 2624, offset: 9600)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !805, line: 340, size: 2624, elements: !806)
!805 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!806 = !{!807, !835, !853, !854, !855, !873, !931, !932, !1032, !1033, !1034, !1035, !1041}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !804, file: !805, line: 341, baseType: !808, size: 576)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !805, line: 251, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !805, line: 207, size: 576, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !805, line: 208, baseType: !215, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !809, file: !805, line: 211, baseType: !326, size: 16, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !809, file: !805, line: 212, baseType: !326, size: 16, offset: 48)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !809, file: !805, line: 213, baseType: !288, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !809, file: !805, line: 214, baseType: !326, size: 16, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !809, file: !805, line: 215, baseType: !326, size: 16, offset: 112)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !809, file: !805, line: 216, baseType: !326, size: 16, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !809, file: !805, line: 217, baseType: !326, size: 16, offset: 144)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !809, file: !805, line: 218, baseType: !326, size: 16, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !809, file: !805, line: 219, baseType: !326, size: 16, offset: 176)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !809, file: !805, line: 220, baseType: !288, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !809, file: !805, line: 222, baseType: !326, size: 16, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !809, file: !805, line: 225, baseType: !326, size: 16, offset: 240)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !809, file: !805, line: 228, baseType: !215, size: 32, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !809, file: !805, line: 229, baseType: !215, size: 32, offset: 288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !809, file: !805, line: 233, baseType: !215, size: 32, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !809, file: !805, line: 236, baseType: !326, size: 16, offset: 352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !809, file: !805, line: 236, baseType: !326, size: 16, offset: 368)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !809, file: !805, line: 241, baseType: !288, size: 32, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !809, file: !805, line: 244, baseType: !215, size: 32, offset: 416)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !809, file: !805, line: 244, baseType: !215, size: 32, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !809, file: !805, line: 245, baseType: !288, size: 32, offset: 480)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !809, file: !805, line: 248, baseType: !288, size: 32, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !809, file: !805, line: 250, baseType: !215, size: 32, offset: 544)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !804, file: !805, line: 342, baseType: !836, size: 448, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !805, line: 79, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !805, line: 61, size: 448, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !837, file: !805, line: 62, baseType: !302, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !837, file: !805, line: 64, baseType: !326, size: 16, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !837, file: !805, line: 65, baseType: !326, size: 16, offset: 80)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !837, file: !805, line: 67, baseType: !288, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !837, file: !805, line: 68, baseType: !288, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !837, file: !805, line: 69, baseType: !288, size: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !837, file: !805, line: 70, baseType: !326, size: 16, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !837, file: !805, line: 71, baseType: !326, size: 16, offset: 208)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !837, file: !805, line: 72, baseType: !436, size: 64, offset: 224)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !837, file: !805, line: 75, baseType: !288, size: 32, offset: 288)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !837, file: !805, line: 75, baseType: !288, size: 32, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !837, file: !805, line: 75, baseType: !288, size: 32, offset: 352)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !837, file: !805, line: 78, baseType: !288, size: 32, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !837, file: !805, line: 78, baseType: !288, size: 32, offset: 416)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !804, file: !805, line: 343, baseType: !297, size: 128, offset: 1024)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !804, file: !805, line: 344, baseType: !297, size: 128, offset: 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !804, file: !805, line: 345, baseType: !856, size: 192, offset: 1280)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !805, line: 278, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !805, line: 270, size: 192, elements: !858)
!858 = !{!859, !860, !861, !862, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !857, file: !805, line: 271, baseType: !215, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !857, file: !805, line: 273, baseType: !288, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !857, file: !805, line: 275, baseType: !215, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !857, file: !805, line: 276, baseType: !215, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !857, file: !805, line: 277, baseType: !864, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !805, line: 55, size: 576, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !865, file: !805, line: 56, baseType: !215, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !865, file: !805, line: 57, baseType: !288, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !865, file: !805, line: 58, baseType: !870, size: 512, offset: 64)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 512, elements: !871)
!871 = !{!872, !872}
!872 = !DISubrange(count: 4)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !804, file: !805, line: 346, baseType: !874, size: 384, offset: 1472)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !805, line: 268, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !805, line: 253, size: 384, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !925, !926, !927, !928, !929, !930}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !875, file: !805, line: 254, baseType: !215, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !875, file: !805, line: 255, baseType: !215, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !875, file: !805, line: 255, baseType: !215, size: 32, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !875, file: !805, line: 258, baseType: !288, size: 32, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !875, file: !805, line: 259, baseType: !882, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !805, line: 164, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !805, line: 108, size: 1664, elements: !885)
!885 = !{!886, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !884, file: !805, line: 109, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !884, file: !805, line: 109, baseType: !887, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !884, file: !805, line: 111, baseType: !307, size: 512, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !884, file: !805, line: 119, baseType: !436, size: 64, offset: 640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !884, file: !805, line: 119, baseType: !436, size: 64, offset: 704)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !884, file: !805, line: 125, baseType: !436, size: 64, offset: 768)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !884, file: !805, line: 125, baseType: !436, size: 64, offset: 832)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !884, file: !805, line: 127, baseType: !436, size: 64, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !884, file: !805, line: 130, baseType: !215, size: 32, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !884, file: !805, line: 131, baseType: !215, size: 32, offset: 992)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !884, file: !805, line: 132, baseType: !898, size: 64, offset: 1024)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !805, line: 106, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !805, line: 81, size: 512, elements: !901)
!901 = !{!902, !903, !906, !907, !908, !909}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !900, file: !805, line: 82, baseType: !436, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !900, file: !805, line: 97, baseType: !904, size: 256, offset: 64)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 256, elements: !905)
!905 = !{!872, !438}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !900, file: !805, line: 102, baseType: !436, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !900, file: !805, line: 102, baseType: !436, size: 64, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !900, file: !805, line: 104, baseType: !215, size: 32, offset: 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !900, file: !805, line: 105, baseType: !215, size: 32, offset: 480)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !884, file: !805, line: 135, baseType: !583, size: 96, offset: 1088)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !884, file: !805, line: 136, baseType: !288, size: 32, offset: 1184)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !884, file: !805, line: 139, baseType: !215, size: 32, offset: 1216)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !884, file: !805, line: 139, baseType: !215, size: 32, offset: 1248)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !884, file: !805, line: 139, baseType: !215, size: 32, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !884, file: !805, line: 140, baseType: !583, size: 96, offset: 1312)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !884, file: !805, line: 143, baseType: !326, size: 16, offset: 1408)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !884, file: !805, line: 144, baseType: !326, size: 16, offset: 1424)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !884, file: !805, line: 145, baseType: !326, size: 16, offset: 1440)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !884, file: !805, line: 148, baseType: !326, size: 16, offset: 1456)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !884, file: !805, line: 149, baseType: !215, size: 32, offset: 1472)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !884, file: !805, line: 150, baseType: !288, size: 32, offset: 1504)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !884, file: !805, line: 152, baseType: !613, size: 64, offset: 1536)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !884, file: !805, line: 163, baseType: !288, size: 32, offset: 1600)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !884, file: !805, line: 163, baseType: !288, size: 32, offset: 1632)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !875, file: !805, line: 261, baseType: !288, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !875, file: !805, line: 261, baseType: !288, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !875, file: !805, line: 261, baseType: !288, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !875, file: !805, line: 263, baseType: !215, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !875, file: !805, line: 266, baseType: !215, size: 32, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !875, file: !805, line: 267, baseType: !288, size: 32, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !804, file: !805, line: 347, baseType: !882, size: 64, offset: 1856)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !804, file: !805, line: 348, baseType: !933, size: 64, offset: 1920)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !805, line: 205, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !805, line: 186, size: 1024, elements: !936)
!936 = !{!937, !939, !940, !941, !943, !944, !945, !953, !954, !955, !1030, !1031}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !805, line: 187, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !935, file: !805, line: 187, baseType: !938, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !805, line: 189, baseType: !307, size: 512, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !935, file: !805, line: 191, baseType: !942, size: 64, offset: 640)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !935, file: !805, line: 193, baseType: !215, size: 32, offset: 704)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !935, file: !805, line: 193, baseType: !215, size: 32, offset: 736)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !935, file: !805, line: 195, baseType: !946, size: 64, offset: 768)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !805, line: 184, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !805, line: 166, size: 320, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !948, file: !805, line: 180, baseType: !904, size: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !948, file: !805, line: 182, baseType: !215, size: 32, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !948, file: !805, line: 183, baseType: !215, size: 32, offset: 288)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !935, file: !805, line: 196, baseType: !215, size: 32, offset: 832)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !935, file: !805, line: 198, baseType: !215, size: 32, offset: 864)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !935, file: !805, line: 200, baseType: !956, size: 64, offset: 896)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !742, line: 77, size: 15424, elements: !958)
!958 = !{!959, !960, !961, !964, !967, !968, !971, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !989, !990, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1016, !1017, !1018, !1019, !1020, !1024}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !957, file: !742, line: 78, baseType: !344, size: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !957, file: !742, line: 80, baseType: !362, size: 8192, offset: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !957, file: !742, line: 82, baseType: !962, size: 64, offset: 9152)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !742, line: 43, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !957, file: !742, line: 83, baseType: !965, size: 64, offset: 9216)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !345, line: 46, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !957, file: !742, line: 86, baseType: !740, size: 64, offset: 9280)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !957, file: !742, line: 87, baseType: !969, size: 64, offset: 9344)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !742, line: 44, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !957, file: !742, line: 89, baseType: !972, size: 512, offset: 9408)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 512, elements: !327)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !957, file: !742, line: 90, baseType: !326, size: 16, offset: 9920)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !957, file: !742, line: 90, baseType: !326, size: 16, offset: 9936)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !957, file: !742, line: 92, baseType: !326, size: 16, offset: 9952)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !957, file: !742, line: 92, baseType: !326, size: 16, offset: 9968)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !957, file: !742, line: 93, baseType: !326, size: 16, offset: 9984)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !957, file: !742, line: 93, baseType: !326, size: 16, offset: 10000)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !957, file: !742, line: 94, baseType: !215, size: 32, offset: 10016)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !957, file: !742, line: 97, baseType: !326, size: 16, offset: 10048)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !957, file: !742, line: 97, baseType: !326, size: 16, offset: 10064)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !957, file: !742, line: 98, baseType: !326, size: 16, offset: 10080)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !957, file: !742, line: 98, baseType: !326, size: 16, offset: 10096)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !957, file: !742, line: 99, baseType: !326, size: 16, offset: 10112)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !957, file: !742, line: 99, baseType: !326, size: 16, offset: 10128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !957, file: !742, line: 100, baseType: !5, size: 32, offset: 10144)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !957, file: !742, line: 101, baseType: !988, size: 64, offset: 10176)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !957, file: !742, line: 103, baseType: !368, size: 64, offset: 10240)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !957, file: !742, line: 104, baseType: !991, size: 64, offset: 10304)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !345, line: 159, size: 448, elements: !993)
!993 = !{!994, !996, !997, !999, !1000, !1002}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !992, file: !345, line: 161, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !437)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !992, file: !345, line: 162, baseType: !995, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !992, file: !345, line: 163, baseType: !998, size: 32, offset: 128)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 32, elements: !437)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !992, file: !345, line: 164, baseType: !998, size: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !992, file: !345, line: 165, baseType: !1001, size: 128, offset: 192)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 128, elements: !437)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !992, file: !345, line: 166, baseType: !1003, size: 128, offset: 320)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 128, elements: !437)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !957, file: !742, line: 107, baseType: !288, size: 32, offset: 10368)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !957, file: !742, line: 108, baseType: !215, size: 32, offset: 10400)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !957, file: !742, line: 109, baseType: !326, size: 16, offset: 10432)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !957, file: !742, line: 110, baseType: !326, size: 16, offset: 10448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !957, file: !742, line: 113, baseType: !215, size: 32, offset: 10464)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !957, file: !742, line: 113, baseType: !215, size: 32, offset: 10496)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !957, file: !742, line: 114, baseType: !308, size: 8, offset: 10528)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !957, file: !742, line: 114, baseType: !308, size: 8, offset: 10536)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !957, file: !742, line: 115, baseType: !326, size: 16, offset: 10544)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !957, file: !742, line: 116, baseType: !1014, size: 128, offset: 10560)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 128, elements: !1015)
!1015 = !{!872}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !957, file: !742, line: 119, baseType: !288, size: 32, offset: 10688)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !957, file: !742, line: 119, baseType: !288, size: 32, offset: 10720)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !957, file: !742, line: 122, baseType: !774, size: 512, offset: 10752)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !957, file: !742, line: 123, baseType: !308, size: 8, offset: 11264)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !957, file: !742, line: 125, baseType: !1021, size: 56, offset: 11272)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 56, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 7)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !957, file: !742, line: 126, baseType: !1025, size: 4096, offset: 11328)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 4096, elements: !327)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !742, line: 69, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !742, line: 67, size: 512, elements: !1028)
!1028 = !{!1029}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !742, line: 68, baseType: !307, size: 512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !935, file: !805, line: 201, baseType: !288, size: 32, offset: 960)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !935, file: !805, line: 204, baseType: !215, size: 32, offset: 992)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !804, file: !805, line: 350, baseType: !297, size: 128, offset: 1984)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !804, file: !805, line: 351, baseType: !215, size: 32, offset: 2112)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !804, file: !805, line: 351, baseType: !215, size: 32, offset: 2144)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !804, file: !805, line: 353, baseType: !1036, size: 64, offset: 2176)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !805, line: 297, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !805, line: 295, size: 2048, elements: !1039)
!1039 = !{!1040}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1038, file: !805, line: 296, baseType: !723, size: 2048)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !804, file: !805, line: 355, baseType: !1042, size: 384, offset: 2240)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !805, line: 338, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !805, line: 322, size: 384, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050, !1051}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1043, file: !805, line: 323, baseType: !215, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1043, file: !805, line: 325, baseType: !326, size: 16, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1043, file: !805, line: 326, baseType: !326, size: 16, offset: 48)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1043, file: !805, line: 331, baseType: !297, size: 128, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1043, file: !805, line: 334, baseType: !297, size: 128, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1043, file: !805, line: 335, baseType: !215, size: 32, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1043, file: !805, line: 337, baseType: !215, size: 32, offset: 352)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !786, file: !787, line: 81, baseType: !302, size: 64, offset: 12224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !786, file: !787, line: 85, baseType: !1054, size: 6208, offset: 12288)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !787, line: 55, size: 6208, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1054, file: !787, line: 56, baseType: !729, size: 6144)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1054, file: !787, line: 58, baseType: !326, size: 16, offset: 6144)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1054, file: !787, line: 59, baseType: !326, size: 16, offset: 6160)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1054, file: !787, line: 60, baseType: !326, size: 16, offset: 6176)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1054, file: !787, line: 61, baseType: !326, size: 16, offset: 6192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !786, file: !787, line: 86, baseType: !215, size: 32, offset: 18496)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !786, file: !787, line: 88, baseType: !215, size: 32, offset: 18528)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !786, file: !787, line: 90, baseType: !215, size: 32, offset: 18560)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !786, file: !787, line: 94, baseType: !215, size: 32, offset: 18592)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !786, file: !787, line: 100, baseType: !774, size: 512, offset: 18624)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !678, file: !669, line: 154, baseType: !1067, size: 64, offset: 1664)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !669, line: 154, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !678, file: !669, line: 156, baseType: !740, size: 64, offset: 1728)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !678, file: !669, line: 158, baseType: !288, size: 32, offset: 1792)
