; ModuleID = 'blender/source/blender/editors/interface/interface_icons.c'
source_filename = "blender/source/blender/editors/interface/interface_icons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ListBase = type { i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }

!858 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!859 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!860 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!861 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!862 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!863 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!864 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!865 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!866 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!867 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eIconSizes", file: !869, line: 153, baseType: !7, size: 32, elements: !870)
!869 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!870 = !{!871, !872}
!871 = !DIEnumerator(name: "ICON_SIZE_ICON", value: 0, isUnsigned: true)
!872 = !DIEnumerator(name: "ICON_SIZE_PREVIEW", value: 1, isUnsigned: true)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushFlags", file: !874, line: 187, baseType: !875, size: 32, elements: !876)
!874 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!875 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!877 = !DIEnumerator(name: "BRUSH_AIRBRUSH", value: 1)
!878 = !DIEnumerator(name: "BRUSH_TORUS", value: 2)
!879 = !DIEnumerator(name: "BRUSH_ALPHA_PRESSURE", value: 4)
!880 = !DIEnumerator(name: "BRUSH_SIZE_PRESSURE", value: 8)
!881 = !DIEnumerator(name: "BRUSH_JITTER_PRESSURE", value: 16)
!882 = !DIEnumerator(name: "BRUSH_SPACING_PRESSURE", value: 32)
!883 = !DIEnumerator(name: "BRUSH_UNUSED", value: 64)
!884 = !DIEnumerator(name: "BRUSH_RAKE", value: 128)
!885 = !DIEnumerator(name: "BRUSH_ANCHORED", value: 256)
!886 = !DIEnumerator(name: "BRUSH_DIR_IN", value: 512)
!887 = !DIEnumerator(name: "BRUSH_SPACE", value: 1024)
!888 = !DIEnumerator(name: "BRUSH_SMOOTH_STROKE", value: 2048)
!889 = !DIEnumerator(name: "BRUSH_PERSISTENT", value: 4096)
!890 = !DIEnumerator(name: "BRUSH_ACCUMULATE", value: 8192)
!891 = !DIEnumerator(name: "BRUSH_LOCK_ALPHA", value: 16384)
!892 = !DIEnumerator(name: "BRUSH_ORIGINAL_NORMAL", value: 32768)
!893 = !DIEnumerator(name: "BRUSH_OFFSET_PRESSURE", value: 65536)
!894 = !DIEnumerator(name: "BRUSH_SPACE_ATTEN", value: 262144)
!895 = !DIEnumerator(name: "BRUSH_ADAPTIVE_SPACE", value: 524288)
!896 = !DIEnumerator(name: "BRUSH_LOCK_SIZE", value: 1048576)
!897 = !DIEnumerator(name: "BRUSH_USE_GRADIENT", value: 2097152)
!898 = !DIEnumerator(name: "BRUSH_EDGE_TO_EDGE", value: 4194304)
!899 = !DIEnumerator(name: "BRUSH_DRAG_DOT", value: 8388608)
!900 = !DIEnumerator(name: "BRUSH_INVERSE_SMOOTH_PRESSURE", value: 16777216)
!901 = !DIEnumerator(name: "BRUSH_RANDOM_ROTATION", value: 33554432)
!902 = !DIEnumerator(name: "BRUSH_PLANE_TRIM", value: 67108864)
!903 = !DIEnumerator(name: "BRUSH_FRONTFACE", value: 134217728)
!904 = !DIEnumerator(name: "BRUSH_CUSTOM_ICON", value: 268435456)
!905 = !DIEnumerator(name: "BRUSH_LINE", value: 536870912)
!906 = !DIEnumerator(name: "BRUSH_ABSOLUTE_JITTER", value: 1073741824)
!907 = !DIEnumerator(name: "BRUSH_CURVE", value: -2147483648)
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !909, line: 666, baseType: !7, size: 32, elements: !910)
!909 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918}
!911 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!912 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!913 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!914 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!915 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!916 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!917 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!918 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceImage_Mode", file: !920, line: 761, baseType: !7, size: 32, elements: !921)
!920 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!921 = !{!922, !923, !924}
!922 = !DIEnumerator(name: "SI_MODE_VIEW", value: 0, isUnsigned: true)
!923 = !DIEnumerator(name: "SI_MODE_PAINT", value: 1, isUnsigned: true)
!924 = !DIEnumerator(name: "SI_MODE_MASK", value: 2, isUnsigned: true)
!925 = !{!926, !927, !967, !969, !971, !943, !2972, !875, !1055}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !3, line: 108, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DrawInfo", file: !3, line: 93, size: 192, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !929, file: !3, line: 94, baseType: !875, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !929, file: !3, line: 107, baseType: !933, size: 128, offset: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !929, file: !3, line: 96, size: 128, elements: !934)
!934 = !{!935, !944, !960}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !933, file: !3, line: 100, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !3, line: 98, size: 64, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !936, file: !3, line: 99, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "VectorDrawFunc", file: !3, line: 86, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !875, !875, !875, !875, !943}
!943 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !933, file: !3, line: 103, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !3, line: 101, size: 64, elements: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !945, file: !3, line: 102, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "IconImage", file: !3, line: 84, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IconImage", file: !3, line: 78, size: 256, elements: !951)
!951 = !{!952, !953, !954, !956, !959}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !950, file: !3, line: 79, baseType: !875, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !950, file: !3, line: 80, baseType: !875, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !950, file: !3, line: 81, baseType: !955, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "datatoc_rect", scope: !950, file: !3, line: 82, baseType: !957, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "datatoc_size", scope: !950, file: !3, line: 83, baseType: !875, size: 32, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !933, file: !3, line: 106, baseType: !961, size: 128)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !3, line: 104, size: 128, elements: !962)
!962 = !{!963, !964, !965, !966}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !961, file: !3, line: 105, baseType: !875, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !961, file: !3, line: 105, baseType: !875, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !961, file: !3, line: 105, baseType: !875, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !961, file: !3, line: 105, baseType: !875, size: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynamicPaintSurface", file: !973, line: 136, baseType: !974)
!973 = !DIFile(filename: "blender/source/blender/makesdna/DNA_dynamicpaint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicPaintSurface", file: !973, line: 86, size: 12480, elements: !975)
!975 = !{!976, !978, !979, !1002, !1005, !1008, !1011, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1036, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !974, file: !973, line: 88, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !974, file: !973, line: 88, baseType: !977, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !974, file: !973, line: 89, baseType: !980, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicPaintCanvasSettings", file: !973, line: 146, size: 832, elements: !982)
!982 = !{!983, !986, !989, !995, !996, !997, !998}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pmd", scope: !981, file: !973, line: 147, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicPaintModifierData", file: !973, line: 147, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !981, file: !973, line: 148, baseType: !987, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !973, line: 148, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "surfaces", scope: !981, file: !973, line: 150, baseType: !990, size: 128, offset: 128)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !991, line: 69, size: 128, elements: !992)
!991 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !990, file: !991, line: 70, baseType: !926, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !990, file: !991, line: 70, baseType: !926, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "active_sur", scope: !981, file: !973, line: 151, baseType: !970, size: 16, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !973, line: 151, baseType: !970, size: 16, offset: 272)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !981, file: !973, line: 152, baseType: !875, size: 32, offset: 288)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !981, file: !973, line: 154, baseType: !999, size: 512, offset: 320)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 512, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !974, file: !973, line: 90, baseType: !1003, size: 64, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "PaintSurfaceData", file: !973, line: 33, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "brush_group", scope: !974, file: !973, line: 92, baseType: !1006, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !973, line: 92, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "effector_weights", scope: !974, file: !973, line: 93, baseType: !1009, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "EffectorWeights", file: !973, line: 93, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pointcache", scope: !974, file: !973, line: 96, baseType: !1012, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointCache", file: !973, line: 96, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ptcaches", scope: !974, file: !973, line: 97, baseType: !990, size: 128, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame", scope: !974, file: !973, line: 98, baseType: !875, size: 32, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !974, file: !973, line: 101, baseType: !999, size: 512, offset: 608)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !974, file: !973, line: 102, baseType: !970, size: 16, offset: 1120)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !974, file: !973, line: 102, baseType: !970, size: 16, offset: 1136)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "disp_type", scope: !974, file: !973, line: 103, baseType: !970, size: 16, offset: 1152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "image_fileformat", scope: !974, file: !973, line: 103, baseType: !970, size: 16, offset: 1168)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "effect_ui", scope: !974, file: !973, line: 104, baseType: !970, size: 16, offset: 1184)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "preview_id", scope: !974, file: !973, line: 105, baseType: !970, size: 16, offset: 1200)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init_color_type", scope: !974, file: !973, line: 106, baseType: !970, size: 16, offset: 1216)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pad_s", scope: !974, file: !973, line: 106, baseType: !970, size: 16, offset: 1232)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !974, file: !973, line: 107, baseType: !875, size: 32, offset: 1248)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !974, file: !973, line: 107, baseType: !875, size: 32, offset: 1280)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "image_resolution", scope: !974, file: !973, line: 109, baseType: !875, size: 32, offset: 1312)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "substeps", scope: !974, file: !973, line: 109, baseType: !875, size: 32, offset: 1344)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !974, file: !973, line: 110, baseType: !875, size: 32, offset: 1376)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !974, file: !973, line: 110, baseType: !875, size: 32, offset: 1408)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !974, file: !973, line: 110, baseType: !875, size: 32, offset: 1440)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "init_color", scope: !974, file: !973, line: 113, baseType: !1033, size: 128, offset: 1472)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 4)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "init_texture", scope: !974, file: !973, line: 114, baseType: !1037, size: 64, offset: 1600)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1039, line: 202, size: 3328, elements: !1040)
!1039 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1040 = !{!1041, !1100, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !2863, !2864, !2865, !2866, !2867, !2889, !2890, !2919, !2939, !2947, !2948}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1038, file: !1039, line: 203, baseType: !1042, size: 960)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !869, line: 130, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !869, line: 117, size: 960, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1049, !1068, !1072, !1073, !1074, !1075, !1076}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1043, file: !869, line: 118, baseType: !926, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1043, file: !869, line: 118, baseType: !926, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1043, file: !869, line: 119, baseType: !1048, size: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1043, file: !869, line: 120, baseType: !1050, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !869, line: 136, size: 17600, elements: !1052)
!1052 = !{!1053, !1054, !1056, !1059, !1063, !1064, !1065}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1051, file: !869, line: 137, baseType: !1042, size: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1051, file: !869, line: 138, baseType: !1055, size: 64, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1051, file: !869, line: 139, baseType: !1057, size: 64, offset: 1024)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !869, line: 43, flags: DIFlagFwdDecl)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1051, file: !869, line: 140, baseType: !1060, size: 8192, offset: 1088)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 8192, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 1024)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1051, file: !869, line: 141, baseType: !1060, size: 8192, offset: 9280)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1051, file: !869, line: 148, baseType: !1050, size: 64, offset: 17472)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1051, file: !869, line: 150, baseType: !1066, size: 64, offset: 17536)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !869, line: 45, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1043, file: !869, line: 121, baseType: !1069, size: 528, offset: 256)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 528, elements: !1070)
!1070 = !{!1071}
!1071 = !DISubrange(count: 66)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1043, file: !869, line: 126, baseType: !970, size: 16, offset: 784)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1043, file: !869, line: 127, baseType: !875, size: 32, offset: 800)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1043, file: !869, line: 128, baseType: !875, size: 32, offset: 832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1043, file: !869, line: 128, baseType: !875, size: 32, offset: 864)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1043, file: !869, line: 129, baseType: !1077, size: 64, offset: 896)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !869, line: 75, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !869, line: 62, size: 1024, elements: !1080)
!1080 = !{!1081, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1098, !1099}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !869, line: 63, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1079, file: !869, line: 63, baseType: !1082, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1079, file: !869, line: 64, baseType: !968, size: 8, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1079, file: !869, line: 64, baseType: !968, size: 8, offset: 136)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1079, file: !869, line: 65, baseType: !970, size: 16, offset: 144)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1079, file: !869, line: 66, baseType: !999, size: 512, offset: 160)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1079, file: !869, line: 67, baseType: !875, size: 32, offset: 672)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !869, line: 69, baseType: !1090, size: 256, offset: 704)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !869, line: 60, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !869, line: 48, size: 256, elements: !1092)
!1092 = !{!1093, !1094, !1096, !1097}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1091, file: !869, line: 49, baseType: !926, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1091, file: !869, line: 58, baseType: !1095, size: 128, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !991, line: 71, baseType: !990)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1091, file: !869, line: 59, baseType: !875, size: 32, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1091, file: !869, line: 59, baseType: !875, size: 32, offset: 224)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1079, file: !869, line: 70, baseType: !875, size: 32, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1079, file: !869, line: 74, baseType: !875, size: 32, offset: 992)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1038, file: !1039, line: 204, baseType: !1101, size: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1039, line: 45, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1038, file: !1039, line: 206, baseType: !943, size: 32, offset: 1024)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1038, file: !1039, line: 206, baseType: !943, size: 32, offset: 1056)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1038, file: !1039, line: 207, baseType: !943, size: 32, offset: 1088)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1038, file: !1039, line: 207, baseType: !943, size: 32, offset: 1120)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1038, file: !1039, line: 207, baseType: !943, size: 32, offset: 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1038, file: !1039, line: 207, baseType: !943, size: 32, offset: 1184)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1038, file: !1039, line: 207, baseType: !943, size: 32, offset: 1216)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1038, file: !1039, line: 207, baseType: !943, size: 32, offset: 1248)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1038, file: !1039, line: 208, baseType: !943, size: 32, offset: 1280)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1038, file: !1039, line: 208, baseType: !943, size: 32, offset: 1312)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1038, file: !1039, line: 211, baseType: !943, size: 32, offset: 1344)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1038, file: !1039, line: 211, baseType: !943, size: 32, offset: 1376)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1038, file: !1039, line: 211, baseType: !943, size: 32, offset: 1408)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1038, file: !1039, line: 211, baseType: !943, size: 32, offset: 1440)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1038, file: !1039, line: 211, baseType: !943, size: 32, offset: 1472)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1038, file: !1039, line: 214, baseType: !943, size: 32, offset: 1504)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1038, file: !1039, line: 214, baseType: !943, size: 32, offset: 1536)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1038, file: !1039, line: 217, baseType: !943, size: 32, offset: 1568)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1038, file: !1039, line: 218, baseType: !943, size: 32, offset: 1600)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1038, file: !1039, line: 219, baseType: !943, size: 32, offset: 1632)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1038, file: !1039, line: 220, baseType: !943, size: 32, offset: 1664)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1038, file: !1039, line: 221, baseType: !943, size: 32, offset: 1696)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1038, file: !1039, line: 222, baseType: !970, size: 16, offset: 1728)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1038, file: !1039, line: 222, baseType: !970, size: 16, offset: 1744)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1038, file: !1039, line: 224, baseType: !970, size: 16, offset: 1760)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1038, file: !1039, line: 224, baseType: !970, size: 16, offset: 1776)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1038, file: !1039, line: 227, baseType: !970, size: 16, offset: 1792)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1038, file: !1039, line: 227, baseType: !970, size: 16, offset: 1808)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1038, file: !1039, line: 229, baseType: !970, size: 16, offset: 1824)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1038, file: !1039, line: 229, baseType: !970, size: 16, offset: 1840)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1038, file: !1039, line: 230, baseType: !970, size: 16, offset: 1856)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1038, file: !1039, line: 230, baseType: !970, size: 16, offset: 1872)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1038, file: !1039, line: 232, baseType: !943, size: 32, offset: 1888)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1038, file: !1039, line: 232, baseType: !943, size: 32, offset: 1920)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1038, file: !1039, line: 232, baseType: !943, size: 32, offset: 1952)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1038, file: !1039, line: 232, baseType: !943, size: 32, offset: 1984)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1038, file: !1039, line: 233, baseType: !875, size: 32, offset: 2016)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1038, file: !1039, line: 234, baseType: !875, size: 32, offset: 2048)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1038, file: !1039, line: 235, baseType: !970, size: 16, offset: 2080)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1038, file: !1039, line: 235, baseType: !970, size: 16, offset: 2096)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1038, file: !1039, line: 236, baseType: !970, size: 16, offset: 2112)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1038, file: !1039, line: 239, baseType: !970, size: 16, offset: 2128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1038, file: !1039, line: 240, baseType: !875, size: 32, offset: 2144)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1038, file: !1039, line: 241, baseType: !875, size: 32, offset: 2176)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1038, file: !1039, line: 241, baseType: !875, size: 32, offset: 2208)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1038, file: !1039, line: 241, baseType: !875, size: 32, offset: 2240)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1038, file: !1039, line: 243, baseType: !943, size: 32, offset: 2272)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1038, file: !1039, line: 243, baseType: !943, size: 32, offset: 2304)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1038, file: !1039, line: 244, baseType: !943, size: 32, offset: 2336)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1038, file: !1039, line: 246, baseType: !1153, size: 320, offset: 2368)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1154, line: 50, size: 320, elements: !1155)
!1154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1155 = !{!1156, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1153, file: !1154, line: 51, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1159, line: 1216, size: 39680, elements: !1160)
!1159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1160 = !{!1161, !1162, !1163, !1429, !1432, !1433, !1434, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1460, !1533, !1960, !2480, !2483, !2725, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2747, !2748, !2749, !2750, !2751, !2759, !2826, !2833, !2834, !2841, !2842, !2843, !2844, !2845, !2846, !2847}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1158, file: !1159, line: 1217, baseType: !1042, size: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1158, file: !1159, line: 1218, baseType: !1101, size: 64, offset: 960)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1158, file: !1159, line: 1220, baseType: !1164, size: 64, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !909, line: 115, size: 11392, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1186, !1197, !1211, !1212, !1256, !1257, !1260, !1261, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1375, !1378, !1379, !1380, !1381, !1382, !1383, !1386, !1389, !1390, !1391, !1397, !1398, !1399, !1400, !1401, !1402, !1404, !1407, !1410, !1414, !1417, !1418}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1165, file: !909, line: 116, baseType: !1042, size: 960)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1165, file: !909, line: 117, baseType: !1101, size: 64, offset: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1165, file: !909, line: 119, baseType: !1170, size: 64, offset: 1024)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !909, line: 57, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1165, file: !909, line: 121, baseType: !970, size: 16, offset: 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1165, file: !909, line: 121, baseType: !970, size: 16, offset: 1104)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1165, file: !909, line: 122, baseType: !875, size: 32, offset: 1120)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1165, file: !909, line: 122, baseType: !875, size: 32, offset: 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1165, file: !909, line: 122, baseType: !875, size: 32, offset: 1184)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1165, file: !909, line: 123, baseType: !999, size: 512, offset: 1216)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1165, file: !909, line: 124, baseType: !1164, size: 64, offset: 1728)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1165, file: !909, line: 124, baseType: !1164, size: 64, offset: 1792)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1165, file: !909, line: 127, baseType: !1164, size: 64, offset: 1856)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1165, file: !909, line: 127, baseType: !1164, size: 64, offset: 1920)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1165, file: !909, line: 127, baseType: !1164, size: 64, offset: 1984)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1165, file: !909, line: 128, baseType: !1184, size: 64, offset: 2048)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1039, line: 46, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1165, file: !909, line: 130, baseType: !1187, size: 64, offset: 2112)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !909, line: 97, size: 832, elements: !1189)
!1189 = !{!1190, !1195, !1196}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1188, file: !909, line: 98, baseType: !1191, size: 768)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 768, elements: !1192)
!1192 = !{!1193, !1194}
!1193 = !DISubrange(count: 8)
!1194 = !DISubrange(count: 3)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1188, file: !909, line: 99, baseType: !875, size: 32, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1188, file: !909, line: 99, baseType: !875, size: 32, offset: 800)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1165, file: !909, line: 131, baseType: !1198, size: 64, offset: 2176)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1200, line: 486, size: 1600, elements: !1201)
!1200 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1199, file: !1200, line: 487, baseType: !1042, size: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1199, file: !1200, line: 489, baseType: !1095, size: 128, offset: 960)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1199, file: !1200, line: 490, baseType: !1095, size: 128, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1199, file: !1200, line: 491, baseType: !1095, size: 128, offset: 1216)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1199, file: !1200, line: 492, baseType: !1095, size: 128, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1199, file: !1200, line: 494, baseType: !875, size: 32, offset: 1472)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1199, file: !1200, line: 495, baseType: !875, size: 32, offset: 1504)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1199, file: !1200, line: 497, baseType: !875, size: 32, offset: 1536)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1199, file: !1200, line: 498, baseType: !875, size: 32, offset: 1568)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1165, file: !909, line: 132, baseType: !1198, size: 64, offset: 2240)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1165, file: !909, line: 133, baseType: !1213, size: 64, offset: 2304)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1200, line: 334, size: 1728, elements: !1215)
!1215 = !{!1216, !1217, !1221, !1222, !1223, !1224, !1225, !1226, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1255}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1214, file: !1200, line: 335, baseType: !1095, size: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1214, file: !1200, line: 336, baseType: !1218, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1220, line: 51, flags: DIFlagFwdDecl)
!1220 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1214, file: !1200, line: 338, baseType: !970, size: 16, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1214, file: !1200, line: 338, baseType: !970, size: 16, offset: 208)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1214, file: !1200, line: 339, baseType: !7, size: 32, offset: 224)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1214, file: !1200, line: 340, baseType: !875, size: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1214, file: !1200, line: 342, baseType: !943, size: 32, offset: 288)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1214, file: !1200, line: 343, baseType: !1227, size: 96, offset: 320)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 96, elements: !1228)
!1228 = !{!1194}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1214, file: !1200, line: 344, baseType: !1227, size: 96, offset: 416)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1214, file: !1200, line: 347, baseType: !1095, size: 128, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1214, file: !1200, line: 349, baseType: !875, size: 32, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1214, file: !1200, line: 350, baseType: !875, size: 32, offset: 672)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1214, file: !1200, line: 351, baseType: !926, size: 64, offset: 704)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1214, file: !1200, line: 352, baseType: !926, size: 64, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1214, file: !1200, line: 354, baseType: !1236, size: 384, offset: 832)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1200, line: 116, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1200, line: 94, size: 384, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1237, file: !1200, line: 96, baseType: !875, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1237, file: !1200, line: 96, baseType: !875, size: 32, offset: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1237, file: !1200, line: 97, baseType: !875, size: 32, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1237, file: !1200, line: 97, baseType: !875, size: 32, offset: 96)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1237, file: !1200, line: 99, baseType: !970, size: 16, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1237, file: !1200, line: 100, baseType: !970, size: 16, offset: 144)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1237, file: !1200, line: 102, baseType: !970, size: 16, offset: 160)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1237, file: !1200, line: 105, baseType: !970, size: 16, offset: 176)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1237, file: !1200, line: 108, baseType: !970, size: 16, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1237, file: !1200, line: 109, baseType: !970, size: 16, offset: 208)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1237, file: !1200, line: 111, baseType: !970, size: 16, offset: 224)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1237, file: !1200, line: 112, baseType: !970, size: 16, offset: 240)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1237, file: !1200, line: 114, baseType: !875, size: 32, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1237, file: !1200, line: 114, baseType: !875, size: 32, offset: 288)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1237, file: !1200, line: 115, baseType: !875, size: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1237, file: !1200, line: 115, baseType: !875, size: 32, offset: 352)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1214, file: !1200, line: 355, baseType: !999, size: 512, offset: 1216)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1165, file: !909, line: 134, baseType: !926, size: 64, offset: 2368)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1165, file: !909, line: 136, baseType: !1258, size: 64, offset: 2432)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !909, line: 58, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1165, file: !909, line: 138, baseType: !1236, size: 384, offset: 2496)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1165, file: !909, line: 139, baseType: !1262, size: 64, offset: 2880)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1200, line: 80, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1200, line: 72, size: 192, elements: !1265)
!1265 = !{!1266, !1273, !1274, !1275, !1276}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1264, file: !1200, line: 73, baseType: !1267, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1200, line: 59, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1200, line: 56, size: 128, elements: !1270)
!1270 = !{!1271, !1272}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1269, file: !1200, line: 57, baseType: !1227, size: 96)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1269, file: !1200, line: 58, baseType: !875, size: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1264, file: !1200, line: 74, baseType: !875, size: 32, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1264, file: !1200, line: 76, baseType: !875, size: 32, offset: 96)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1264, file: !1200, line: 77, baseType: !875, size: 32, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1264, file: !1200, line: 79, baseType: !875, size: 32, offset: 160)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1165, file: !909, line: 141, baseType: !1095, size: 128, offset: 2944)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1165, file: !909, line: 142, baseType: !1095, size: 128, offset: 3072)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1165, file: !909, line: 143, baseType: !1095, size: 128, offset: 3200)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1165, file: !909, line: 144, baseType: !1095, size: 128, offset: 3328)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1165, file: !909, line: 146, baseType: !875, size: 32, offset: 3456)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1165, file: !909, line: 147, baseType: !875, size: 32, offset: 3488)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1165, file: !909, line: 150, baseType: !1284, size: 64, offset: 3520)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1220, line: 46, flags: DIFlagFwdDecl)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1165, file: !909, line: 151, baseType: !967, size: 64, offset: 3584)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1165, file: !909, line: 152, baseType: !875, size: 32, offset: 3648)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1165, file: !909, line: 153, baseType: !875, size: 32, offset: 3680)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1165, file: !909, line: 156, baseType: !1227, size: 96, offset: 3712)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1165, file: !909, line: 156, baseType: !1227, size: 96, offset: 3808)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1165, file: !909, line: 156, baseType: !1227, size: 96, offset: 3904)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1165, file: !909, line: 157, baseType: !1227, size: 96, offset: 4000)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1165, file: !909, line: 158, baseType: !1227, size: 96, offset: 4096)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1165, file: !909, line: 159, baseType: !1227, size: 96, offset: 4192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1165, file: !909, line: 160, baseType: !1227, size: 96, offset: 4288)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1165, file: !909, line: 160, baseType: !1227, size: 96, offset: 4384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1165, file: !909, line: 161, baseType: !1033, size: 128, offset: 4480)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1165, file: !909, line: 161, baseType: !1033, size: 128, offset: 4608)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1165, file: !909, line: 162, baseType: !1227, size: 96, offset: 4736)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1165, file: !909, line: 162, baseType: !1227, size: 96, offset: 4832)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1165, file: !909, line: 163, baseType: !943, size: 32, offset: 4928)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1165, file: !909, line: 163, baseType: !943, size: 32, offset: 4960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1165, file: !909, line: 164, baseType: !1305, size: 512, offset: 4992)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 512, elements: !1306)
!1306 = !{!1035, !1035}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1165, file: !909, line: 165, baseType: !1305, size: 512, offset: 5504)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1165, file: !909, line: 166, baseType: !1305, size: 512, offset: 6016)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1165, file: !909, line: 167, baseType: !1305, size: 512, offset: 6528)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1165, file: !909, line: 176, baseType: !1305, size: 512, offset: 7040)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1165, file: !909, line: 178, baseType: !7, size: 32, offset: 7552)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1165, file: !909, line: 180, baseType: !970, size: 16, offset: 7584)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1165, file: !909, line: 181, baseType: !970, size: 16, offset: 7600)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1165, file: !909, line: 183, baseType: !970, size: 16, offset: 7616)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1165, file: !909, line: 183, baseType: !970, size: 16, offset: 7632)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1165, file: !909, line: 184, baseType: !970, size: 16, offset: 7648)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1165, file: !909, line: 184, baseType: !970, size: 16, offset: 7664)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1165, file: !909, line: 185, baseType: !970, size: 16, offset: 7680)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1165, file: !909, line: 186, baseType: !970, size: 16, offset: 7696)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1165, file: !909, line: 187, baseType: !970, size: 16, offset: 7712)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1165, file: !909, line: 188, baseType: !968, size: 8, offset: 7728)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1165, file: !909, line: 189, baseType: !968, size: 8, offset: 7736)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1165, file: !909, line: 192, baseType: !875, size: 32, offset: 7744)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1165, file: !909, line: 192, baseType: !875, size: 32, offset: 7776)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1165, file: !909, line: 192, baseType: !875, size: 32, offset: 7808)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1165, file: !909, line: 192, baseType: !875, size: 32, offset: 7840)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1165, file: !909, line: 194, baseType: !875, size: 32, offset: 7872)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1165, file: !909, line: 202, baseType: !943, size: 32, offset: 7904)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1165, file: !909, line: 202, baseType: !943, size: 32, offset: 7936)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1165, file: !909, line: 202, baseType: !943, size: 32, offset: 7968)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1165, file: !909, line: 211, baseType: !943, size: 32, offset: 8000)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1165, file: !909, line: 212, baseType: !943, size: 32, offset: 8032)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1165, file: !909, line: 213, baseType: !943, size: 32, offset: 8064)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1165, file: !909, line: 214, baseType: !943, size: 32, offset: 8096)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1165, file: !909, line: 215, baseType: !943, size: 32, offset: 8128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1165, file: !909, line: 216, baseType: !943, size: 32, offset: 8160)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1165, file: !909, line: 219, baseType: !943, size: 32, offset: 8192)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1165, file: !909, line: 220, baseType: !943, size: 32, offset: 8224)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1165, file: !909, line: 221, baseType: !943, size: 32, offset: 8256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1165, file: !909, line: 224, baseType: !1341, size: 16, offset: 8288)
!1341 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1165, file: !909, line: 224, baseType: !1341, size: 16, offset: 8304)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1165, file: !909, line: 226, baseType: !970, size: 16, offset: 8320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1165, file: !909, line: 228, baseType: !968, size: 8, offset: 8336)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1165, file: !909, line: 229, baseType: !968, size: 8, offset: 8344)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1165, file: !909, line: 231, baseType: !970, size: 16, offset: 8352)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1165, file: !909, line: 232, baseType: !968, size: 8, offset: 8368)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1165, file: !909, line: 233, baseType: !968, size: 8, offset: 8376)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1165, file: !909, line: 234, baseType: !943, size: 32, offset: 8384)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1165, file: !909, line: 235, baseType: !943, size: 32, offset: 8416)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1165, file: !909, line: 237, baseType: !1095, size: 128, offset: 8448)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1165, file: !909, line: 238, baseType: !1095, size: 128, offset: 8576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1165, file: !909, line: 239, baseType: !1095, size: 128, offset: 8704)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1165, file: !909, line: 240, baseType: !1095, size: 128, offset: 8832)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1165, file: !909, line: 242, baseType: !943, size: 32, offset: 8960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1165, file: !909, line: 244, baseType: !970, size: 16, offset: 8992)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1165, file: !909, line: 245, baseType: !1341, size: 16, offset: 9008)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1165, file: !909, line: 246, baseType: !1033, size: 128, offset: 9024)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1165, file: !909, line: 248, baseType: !875, size: 32, offset: 9152)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1165, file: !909, line: 249, baseType: !875, size: 32, offset: 9184)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1165, file: !909, line: 251, baseType: !1362, size: 64, offset: 9216)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !909, line: 251, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1165, file: !909, line: 253, baseType: !968, size: 8, offset: 9280)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1165, file: !909, line: 254, baseType: !968, size: 8, offset: 9288)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1165, file: !909, line: 255, baseType: !970, size: 16, offset: 9296)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1165, file: !909, line: 256, baseType: !1227, size: 96, offset: 9312)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1165, file: !909, line: 258, baseType: !1095, size: 128, offset: 9408)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1165, file: !909, line: 259, baseType: !1095, size: 128, offset: 9536)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1165, file: !909, line: 260, baseType: !1095, size: 128, offset: 9664)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1165, file: !909, line: 261, baseType: !1095, size: 128, offset: 9792)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1165, file: !909, line: 263, baseType: !1373, size: 64, offset: 9920)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !909, line: 52, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1165, file: !909, line: 264, baseType: !1376, size: 64, offset: 9984)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !909, line: 53, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1165, file: !909, line: 265, baseType: !1006, size: 64, offset: 10048)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1165, file: !909, line: 267, baseType: !968, size: 8, offset: 10112)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1165, file: !909, line: 268, baseType: !968, size: 8, offset: 10120)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1165, file: !909, line: 269, baseType: !970, size: 16, offset: 10128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1165, file: !909, line: 270, baseType: !943, size: 32, offset: 10144)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1165, file: !909, line: 272, baseType: !1384, size: 64, offset: 10176)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !909, line: 54, flags: DIFlagFwdDecl)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1165, file: !909, line: 275, baseType: !1387, size: 64, offset: 10240)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !909, line: 275, flags: DIFlagFwdDecl)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1165, file: !909, line: 277, baseType: !987, size: 64, offset: 10304)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1165, file: !909, line: 277, baseType: !987, size: 64, offset: 10368)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1165, file: !909, line: 278, baseType: !1392, size: 64, offset: 10432)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1393, line: 27, baseType: !1394)
!1393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1395, line: 45, baseType: !1396)
!1395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1396 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1165, file: !909, line: 279, baseType: !1392, size: 64, offset: 10496)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1165, file: !909, line: 280, baseType: !7, size: 32, offset: 10560)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1165, file: !909, line: 281, baseType: !7, size: 32, offset: 10592)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1165, file: !909, line: 283, baseType: !1095, size: 128, offset: 10624)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1165, file: !909, line: 284, baseType: !1095, size: 128, offset: 10752)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1165, file: !909, line: 285, baseType: !1403, size: 64, offset: 10880)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1165, file: !909, line: 287, baseType: !1405, size: 64, offset: 10944)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !909, line: 59, flags: DIFlagFwdDecl)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1165, file: !909, line: 288, baseType: !1408, size: 64, offset: 11008)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !909, line: 288, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1165, file: !909, line: 290, baseType: !1411, size: 64, offset: 11072)
!1411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 64, elements: !1412)
!1412 = !{!1413}
!1413 = !DISubrange(count: 2)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1165, file: !909, line: 291, baseType: !1415, size: 64, offset: 11136)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1154, line: 65, baseType: !1153)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1165, file: !909, line: 293, baseType: !1095, size: 128, offset: 11200)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1165, file: !909, line: 294, baseType: !1419, size: 64, offset: 11328)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !909, line: 113, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !909, line: 108, size: 256, elements: !1422)
!1422 = !{!1423, !1425, !1426, !1427, !1428}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1421, file: !909, line: 109, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1421, file: !909, line: 109, baseType: !1424, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1421, file: !909, line: 110, baseType: !1164, size: 64, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1421, file: !909, line: 111, baseType: !875, size: 32, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1421, file: !909, line: 112, baseType: !943, size: 32, offset: 224)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1158, file: !1159, line: 1221, baseType: !1430, size: 64, offset: 1088)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1159, line: 52, flags: DIFlagFwdDecl)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1158, file: !1159, line: 1223, baseType: !1157, size: 64, offset: 1152)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1158, file: !1159, line: 1225, baseType: !1095, size: 128, offset: 1216)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1158, file: !1159, line: 1226, baseType: !1435, size: 64, offset: 1344)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1159, line: 69, size: 320, elements: !1437)
!1437 = !{!1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1436, file: !1159, line: 70, baseType: !1435, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1436, file: !1159, line: 70, baseType: !1435, size: 64, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1436, file: !1159, line: 71, baseType: !7, size: 32, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1436, file: !1159, line: 71, baseType: !7, size: 32, offset: 160)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1436, file: !1159, line: 72, baseType: !875, size: 32, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1436, file: !1159, line: 73, baseType: !970, size: 16, offset: 224)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1436, file: !1159, line: 73, baseType: !970, size: 16, offset: 240)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1436, file: !1159, line: 74, baseType: !1164, size: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1158, file: !1159, line: 1227, baseType: !1164, size: 64, offset: 1408)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1158, file: !1159, line: 1229, baseType: !1227, size: 96, offset: 1472)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1158, file: !1159, line: 1230, baseType: !1227, size: 96, offset: 1568)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1158, file: !1159, line: 1231, baseType: !1227, size: 96, offset: 1664)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1158, file: !1159, line: 1231, baseType: !1227, size: 96, offset: 1760)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1158, file: !1159, line: 1233, baseType: !7, size: 32, offset: 1856)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1158, file: !1159, line: 1234, baseType: !875, size: 32, offset: 1888)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1158, file: !1159, line: 1235, baseType: !7, size: 32, offset: 1920)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1158, file: !1159, line: 1237, baseType: !970, size: 16, offset: 1952)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1158, file: !1159, line: 1239, baseType: !968, size: 8, offset: 1968)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1158, file: !1159, line: 1240, baseType: !1457, size: 8, offset: 1976)
!1457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 8, elements: !1458)
!1458 = !{!1459}
!1459 = !DISubrange(count: 1)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1158, file: !1159, line: 1242, baseType: !1461, size: 64, offset: 1984)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1463, line: 328, size: 3456, elements: !1464)
!1463 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1464 = !{!1465, !1466, !1467, !1470, !1471, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1499, !1500, !1501, !1504, !1509, !1510, !1513, !1517, !1521, !1525, !1529, !1530, !1531, !1532}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1462, file: !1463, line: 329, baseType: !1042, size: 960)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1462, file: !1463, line: 330, baseType: !1101, size: 64, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1462, file: !1463, line: 332, baseType: !1468, size: 64, offset: 1024)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1463, line: 332, flags: DIFlagFwdDecl)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1462, file: !1463, line: 333, baseType: !999, size: 512, offset: 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1462, file: !1463, line: 335, baseType: !1472, size: 64, offset: 1600)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1463, line: 335, flags: DIFlagFwdDecl)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1462, file: !1463, line: 337, baseType: !1258, size: 64, offset: 1664)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1462, file: !1463, line: 338, baseType: !1411, size: 64, offset: 1728)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1462, file: !1463, line: 340, baseType: !1095, size: 128, offset: 1792)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1462, file: !1463, line: 340, baseType: !1095, size: 128, offset: 1920)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1462, file: !1463, line: 342, baseType: !875, size: 32, offset: 2048)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1462, file: !1463, line: 342, baseType: !875, size: 32, offset: 2080)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1462, file: !1463, line: 343, baseType: !875, size: 32, offset: 2112)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1462, file: !1463, line: 345, baseType: !875, size: 32, offset: 2144)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1462, file: !1463, line: 346, baseType: !875, size: 32, offset: 2176)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1462, file: !1463, line: 347, baseType: !970, size: 16, offset: 2208)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1462, file: !1463, line: 348, baseType: !970, size: 16, offset: 2224)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1462, file: !1463, line: 349, baseType: !875, size: 32, offset: 2240)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1462, file: !1463, line: 351, baseType: !875, size: 32, offset: 2272)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1462, file: !1463, line: 353, baseType: !970, size: 16, offset: 2304)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1462, file: !1463, line: 354, baseType: !970, size: 16, offset: 2320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1462, file: !1463, line: 355, baseType: !875, size: 32, offset: 2336)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1462, file: !1463, line: 357, baseType: !1491, size: 128, offset: 2368)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1492, line: 95, baseType: !1493)
!1492 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1492, line: 92, size: 128, elements: !1494)
!1494 = !{!1495, !1496, !1497, !1498}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1493, file: !1492, line: 93, baseType: !943, size: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1493, file: !1492, line: 93, baseType: !943, size: 32, offset: 32)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1493, file: !1492, line: 94, baseType: !943, size: 32, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1493, file: !1492, line: 94, baseType: !943, size: 32, offset: 96)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1462, file: !1463, line: 363, baseType: !1095, size: 128, offset: 2496)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1462, file: !1463, line: 363, baseType: !1095, size: 128, offset: 2624)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1462, file: !1463, line: 368, baseType: !1502, size: 64, offset: 2752)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1463, line: 48, flags: DIFlagFwdDecl)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1462, file: !1463, line: 372, baseType: !1505, size: 32, offset: 2816)
!1505 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1463, line: 274, baseType: !1506)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1463, line: 271, size: 32, elements: !1507)
!1507 = !{!1508}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1506, file: !1463, line: 273, baseType: !7, size: 32)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1462, file: !1463, line: 373, baseType: !875, size: 32, offset: 2848)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1462, file: !1463, line: 382, baseType: !1511, size: 64, offset: 2880)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64)
!1512 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1463, line: 46, flags: DIFlagFwdDecl)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1462, file: !1463, line: 385, baseType: !1514, size: 64, offset: 2944)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{null, !926, !943}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1462, file: !1463, line: 386, baseType: !1518, size: 64, offset: 3008)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{null, !926, !967}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1462, file: !1463, line: 387, baseType: !1522, size: 64, offset: 3072)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!875, !926}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1462, file: !1463, line: 388, baseType: !1526, size: 64, offset: 3136)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{null, !926}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1462, file: !1463, line: 389, baseType: !926, size: 64, offset: 3200)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1462, file: !1463, line: 389, baseType: !926, size: 64, offset: 3264)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1462, file: !1463, line: 389, baseType: !926, size: 64, offset: 3328)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1462, file: !1463, line: 389, baseType: !926, size: 64, offset: 3392)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1158, file: !1159, line: 1244, baseType: !1534, size: 64, offset: 2048)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64)
!1535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1536, line: 200, size: 17024, elements: !1537)
!1536 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1537 = !{!1538, !1539, !1540, !1541, !1953, !1954, !1955, !1956, !1957, !1958, !1959}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1535, file: !1536, line: 201, baseType: !1403, size: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1535, file: !1536, line: 202, baseType: !1095, size: 128, offset: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1535, file: !1536, line: 203, baseType: !1095, size: 128, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1535, file: !1536, line: 206, baseType: !1542, size: 64, offset: 320)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1536, line: 190, baseType: !1544)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1536, line: 126, size: 2816, elements: !1545)
!1545 = !{!1546, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1644, !1645, !1646, !1647, !1925, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1952}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1544, file: !1536, line: 127, baseType: !1547, size: 64)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1544, file: !1536, line: 127, baseType: !1547, size: 64, offset: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1544, file: !1536, line: 128, baseType: !926, size: 64, offset: 128)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1544, file: !1536, line: 129, baseType: !926, size: 64, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1544, file: !1536, line: 130, baseType: !999, size: 512, offset: 256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1544, file: !1536, line: 132, baseType: !875, size: 32, offset: 768)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1544, file: !1536, line: 132, baseType: !875, size: 32, offset: 800)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1544, file: !1536, line: 133, baseType: !875, size: 32, offset: 832)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1544, file: !1536, line: 134, baseType: !875, size: 32, offset: 864)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1544, file: !1536, line: 134, baseType: !875, size: 32, offset: 896)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1544, file: !1536, line: 134, baseType: !875, size: 32, offset: 928)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1544, file: !1536, line: 135, baseType: !875, size: 32, offset: 960)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1544, file: !1536, line: 135, baseType: !875, size: 32, offset: 992)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1544, file: !1536, line: 136, baseType: !875, size: 32, offset: 1024)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1544, file: !1536, line: 136, baseType: !875, size: 32, offset: 1056)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1544, file: !1536, line: 137, baseType: !875, size: 32, offset: 1088)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1544, file: !1536, line: 137, baseType: !875, size: 32, offset: 1120)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1544, file: !1536, line: 138, baseType: !943, size: 32, offset: 1152)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1544, file: !1536, line: 139, baseType: !943, size: 32, offset: 1184)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1544, file: !1536, line: 139, baseType: !943, size: 32, offset: 1216)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1544, file: !1536, line: 141, baseType: !970, size: 16, offset: 1248)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1544, file: !1536, line: 142, baseType: !970, size: 16, offset: 1264)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1544, file: !1536, line: 143, baseType: !875, size: 32, offset: 1280)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1544, file: !1536, line: 144, baseType: !875, size: 32, offset: 1312)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1544, file: !1536, line: 146, baseType: !1572, size: 64, offset: 1344)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1536, line: 114, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1536, line: 99, size: 7232, elements: !1575)
!1575 = !{!1576, !1578, !1579, !1580, !1581, !1582, !1583, !1594, !1598, !1612, !1621, !1628, !1638}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1574, file: !1536, line: 100, baseType: !1577, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1574, file: !1536, line: 100, baseType: !1577, size: 64, offset: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1574, file: !1536, line: 101, baseType: !875, size: 32, offset: 128)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1574, file: !1536, line: 101, baseType: !875, size: 32, offset: 160)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1574, file: !1536, line: 102, baseType: !875, size: 32, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1574, file: !1536, line: 102, baseType: !875, size: 32, offset: 224)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1574, file: !1536, line: 103, baseType: !1584, size: 64, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64)
!1585 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1536, line: 59, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1536, line: 56, size: 2112, elements: !1587)
!1587 = !{!1588, !1592, !1593}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1586, file: !1536, line: 57, baseType: !1589, size: 2048)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 2048, elements: !1590)
!1590 = !{!1591}
!1591 = !DISubrange(count: 256)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1586, file: !1536, line: 58, baseType: !875, size: 32, offset: 2048)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1586, file: !1536, line: 58, baseType: !875, size: 32, offset: 2080)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1574, file: !1536, line: 106, baseType: !1595, size: 6144, offset: 320)
!1595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 6144, elements: !1596)
!1596 = !{!1597}
!1597 = !DISubrange(count: 768)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1574, file: !1536, line: 107, baseType: !1599, size: 64, offset: 6464)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64)
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1536, line: 97, baseType: !1601)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1536, line: 83, size: 8320, elements: !1602)
!1602 = !{!1603, !1604, !1605, !1608, !1609, !1610, !1611}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1601, file: !1536, line: 84, baseType: !1595, size: 6144)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1601, file: !1536, line: 87, baseType: !1589, size: 2048, offset: 6144)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1601, file: !1536, line: 88, baseType: !1606, size: 64, offset: 8192)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64)
!1607 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1154, line: 41, flags: DIFlagFwdDecl)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1601, file: !1536, line: 90, baseType: !970, size: 16, offset: 8256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1601, file: !1536, line: 92, baseType: !970, size: 16, offset: 8272)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1601, file: !1536, line: 93, baseType: !970, size: 16, offset: 8288)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1601, file: !1536, line: 95, baseType: !970, size: 16, offset: 8304)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1574, file: !1536, line: 108, baseType: !1613, size: 64, offset: 6528)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1536, line: 66, baseType: !1615)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1536, line: 61, size: 128, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1615, file: !1536, line: 62, baseType: !875, size: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1615, file: !1536, line: 63, baseType: !875, size: 32, offset: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1615, file: !1536, line: 64, baseType: !875, size: 32, offset: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1615, file: !1536, line: 65, baseType: !875, size: 32, offset: 96)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1574, file: !1536, line: 109, baseType: !1622, size: 64, offset: 6592)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1536, line: 71, baseType: !1624)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1536, line: 68, size: 64, elements: !1625)
!1625 = !{!1626, !1627}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1624, file: !1536, line: 69, baseType: !875, size: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1624, file: !1536, line: 70, baseType: !875, size: 32, offset: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1574, file: !1536, line: 110, baseType: !1629, size: 64, offset: 6656)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64)
!1630 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1536, line: 81, baseType: !1631)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1536, line: 73, size: 352, elements: !1632)
!1632 = !{!1633, !1634, !1635, !1636, !1637}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1631, file: !1536, line: 74, baseType: !1227, size: 96)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1631, file: !1536, line: 75, baseType: !1227, size: 96, offset: 96)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1631, file: !1536, line: 76, baseType: !1227, size: 96, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1631, file: !1536, line: 77, baseType: !875, size: 32, offset: 288)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1631, file: !1536, line: 78, baseType: !875, size: 32, offset: 320)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1574, file: !1536, line: 113, baseType: !1639, size: 512, offset: 6720)
!1639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1640, line: 182, baseType: !1641)
!1640 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1640, line: 180, size: 512, elements: !1642)
!1642 = !{!1643}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1641, file: !1640, line: 181, baseType: !999, size: 512)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1544, file: !1536, line: 148, baseType: !1184, size: 64, offset: 1408)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1544, file: !1536, line: 151, baseType: !1157, size: 64, offset: 1472)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1544, file: !1536, line: 152, baseType: !1164, size: 64, offset: 1536)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1544, file: !1536, line: 153, baseType: !1648, size: 64, offset: 1600)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1650, line: 64, size: 19136, elements: !1651)
!1650 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1659, !1660, !1661, !1662, !1665, !1666, !1911, !1912, !1920, !1921, !1922, !1923, !1924}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1649, file: !1650, line: 65, baseType: !1042, size: 960)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1649, file: !1650, line: 66, baseType: !1101, size: 64, offset: 960)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1649, file: !1650, line: 68, baseType: !1060, size: 8192, offset: 1024)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1649, file: !1650, line: 70, baseType: !875, size: 32, offset: 9216)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1649, file: !1650, line: 71, baseType: !875, size: 32, offset: 9248)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1649, file: !1650, line: 72, baseType: !1658, size: 64, offset: 9280)
!1658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 64, elements: !1412)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1649, file: !1650, line: 74, baseType: !943, size: 32, offset: 9344)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1649, file: !1650, line: 74, baseType: !943, size: 32, offset: 9376)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1649, file: !1650, line: 76, baseType: !1606, size: 64, offset: 9408)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1649, file: !1650, line: 77, baseType: !1663, size: 64, offset: 9472)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64)
!1664 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1650, line: 77, flags: DIFlagFwdDecl)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1649, file: !1650, line: 78, baseType: !1258, size: 64, offset: 9536)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1649, file: !1650, line: 80, baseType: !1667, size: 2624, offset: 9600)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1668, line: 340, size: 2624, elements: !1669)
!1668 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1669 = !{!1670, !1698, !1716, !1717, !1718, !1733, !1791, !1792, !1891, !1892, !1893, !1894, !1900}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1667, file: !1668, line: 341, baseType: !1671, size: 576)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1668, line: 251, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1668, line: 207, size: 576, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1672, file: !1668, line: 208, baseType: !875, size: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1672, file: !1668, line: 211, baseType: !970, size: 16, offset: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1672, file: !1668, line: 212, baseType: !970, size: 16, offset: 48)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1672, file: !1668, line: 213, baseType: !943, size: 32, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1672, file: !1668, line: 214, baseType: !970, size: 16, offset: 96)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1672, file: !1668, line: 215, baseType: !970, size: 16, offset: 112)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1672, file: !1668, line: 216, baseType: !970, size: 16, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1672, file: !1668, line: 217, baseType: !970, size: 16, offset: 144)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1672, file: !1668, line: 218, baseType: !970, size: 16, offset: 160)
