; ModuleID = 'blender/source/blender/imbuf/intern/filter.c'
source_filename = "blender/source/blender/imbuf/intern/filter.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

@MEM_dupallocN = external dso_local global i8* (i8*)*, align 8
@MEM_freeN = external dso_local global void (i8*)*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local void @IMB_filtery(%struct.ImBuf* %ibuf) #0 !dbg !19 {
entry:
  %ibuf.addr = alloca %struct.ImBuf*, align 8
  %point = alloca i8*, align 8
  %pointf = alloca float*, align 8
  %x = alloca i32, align 4
  %y = alloca i32, align 4
  %skip = alloca i32, align 4
  store %struct.ImBuf* %ibuf, %struct.ImBuf** %ibuf.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/filter.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !6, !7, !9, !11, !12, !14, !5, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!19 = distinct !DISubprogram(name: "IMB_filtery", scope: !1, file: !1, line: 131, type: !20, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !24, line: 70, size: 19840, elements: !25)
!24 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!25 = !{!26, !27, !28, !30, !31, !32, !33, !34, !35, !38, !39, !44, !45, !46, !47, !48, !50, !52, !53, !54, !58, !59, !60, !61, !62, !65, !66, !67, !71, !72, !75, !76, !77, !78, !79, !82, !83, !84, !87, !88, !97}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !24, line: 71, baseType: !22, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !23, file: !24, line: 71, baseType: !22, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !24, line: 74, baseType: !29, size: 32, offset: 128)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !24, line: 74, baseType: !29, size: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !23, file: !24, line: 79, baseType: !5, size: 8, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !23, file: !24, line: 80, baseType: !29, size: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !24, line: 83, baseType: !29, size: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !23, file: !24, line: 84, baseType: !29, size: 32, offset: 288)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !23, file: !24, line: 87, baseType: !36, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !23, file: !24, line: 88, baseType: !14, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !23, file: !24, line: 93, baseType: !40, size: 128, offset: 448)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !42)
!41 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!42 = !{!43}
!43 = !DISubrange(count: 2)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !23, file: !24, line: 96, baseType: !29, size: 32, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !23, file: !24, line: 96, baseType: !29, size: 32, offset: 608)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !23, file: !24, line: 97, baseType: !29, size: 32, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !23, file: !24, line: 97, baseType: !29, size: 32, offset: 672)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !23, file: !24, line: 98, baseType: !49, size: 64, offset: 704)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !23, file: !24, line: 101, baseType: !51, size: 64, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !23, file: !24, line: 102, baseType: !14, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !23, file: !24, line: 105, baseType: !11, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !23, file: !24, line: 108, baseType: !55, size: 1280, offset: 960)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1280, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 20)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !23, file: !24, line: 109, baseType: !29, size: 32, offset: 2240)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !23, file: !24, line: 109, baseType: !29, size: 32, offset: 2272)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !23, file: !24, line: 112, baseType: !29, size: 32, offset: 2304)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !23, file: !24, line: 113, baseType: !29, size: 32, offset: 2336)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !23, file: !24, line: 114, baseType: !63, size: 64, offset: 2368)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !24, line: 50, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !23, file: !24, line: 115, baseType: !6, size: 64, offset: 2432)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !23, file: !24, line: 118, baseType: !29, size: 32, offset: 2496)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !24, line: 119, baseType: !68, size: 8192, offset: 2528)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1024)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !23, file: !24, line: 120, baseType: !68, size: 8192, offset: 10720)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !23, file: !24, line: 123, baseType: !73, size: 64, offset: 18944)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !24, line: 123, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !23, file: !24, line: 124, baseType: !29, size: 32, offset: 19008)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !23, file: !24, line: 127, baseType: !4, size: 64, offset: 19072)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !23, file: !24, line: 128, baseType: !37, size: 32, offset: 19136)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !23, file: !24, line: 129, baseType: !37, size: 32, offset: 19168)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !23, file: !24, line: 132, baseType: !80, size: 64, offset: 19200)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !24, line: 132, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !23, file: !24, line: 133, baseType: !80, size: 64, offset: 19264)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !23, file: !24, line: 134, baseType: !36, size: 64, offset: 19328)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !23, file: !24, line: 135, baseType: !85, size: 64, offset: 19392)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !24, line: 135, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !23, file: !24, line: 136, baseType: !29, size: 32, offset: 19456)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !23, file: !24, line: 137, baseType: !89, size: 128, offset: 19488)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !90, line: 89, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !90, line: 86, size: 128, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !91, file: !90, line: 87, baseType: !29, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !91, file: !90, line: 87, baseType: !29, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !91, file: !90, line: 88, baseType: !29, size: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !91, file: !90, line: 88, baseType: !29, size: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !23, file: !24, line: 140, baseType: !98, size: 192, offset: 19648)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !24, line: 55, size: 192, elements: !99)
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !98, file: !24, line: 56, baseType: !37, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !98, file: !24, line: 57, baseType: !37, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !24, line: 58, baseType: !4, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !98, file: !24, line: 59, baseType: !37, size: 32, offset: 128)
!104 = !DILocalVariable(name: "ibuf", arg: 1, scope: !19, file: !1, line: 131, type: !22)
!105 = !DILocation(line: 131, column: 32, scope: !19)
!106 = !DILocalVariable(name: "point", scope: !19, file: !1, line: 133, type: !4)
!107 = !DILocation(line: 133, column: 17, scope: !19)
!108 = !DILocalVariable(name: "pointf", scope: !19, file: !1, line: 134, type: !14)
!109 = !DILocation(line: 134, column: 9, scope: !19)
!110 = !DILocalVariable(name: "x", scope: !19, file: !1, line: 135, type: !29)
!111 = !DILocation(line: 135, column: 6, scope: !19)
!112 = !DILocalVariable(name: "y", scope: !19, file: !1, line: 135, type: !29)
!113 = !DILocation(line: 135, column: 9, scope: !19)
!114 = !DILocalVariable(name: "skip", scope: !19, file: !1, line: 135, type: !29)
!115 = !DILocation(line: 135, column: 12, scope: !19)
!116 = !DILocation(line: 137, column: 27, scope: !19)
!117 = !DILocation(line: 137, column: 33, scope: !19)
!118 = !DILocation(line: 137, column: 10, scope: !19)
!119 = !DILocation(line: 137, column: 8, scope: !19)
!120 = !DILocation(line: 138, column: 11, scope: !19)
!121 = !DILocation(line: 138, column: 17, scope: !19)
!122 = !DILocation(line: 138, column: 9, scope: !19)
!123 = !DILocation(line: 140, column: 6, scope: !19)
!124 = !DILocation(line: 140, column: 12, scope: !19)
!125 = !DILocation(line: 140, column: 4, scope: !19)
!126 = !DILocation(line: 141, column: 6, scope: !19)
!127 = !DILocation(line: 141, column: 12, scope: !19)
!128 = !DILocation(line: 141, column: 4, scope: !19)
!129 = !DILocation(line: 142, column: 9, scope: !19)
!130 = !DILocation(line: 142, column: 11, scope: !19)
!131 = !DILocation(line: 142, column: 7, scope: !19)
!132 = !DILocation(line: 144, column: 2, scope: !19)
!133 = !DILocation(line: 144, column: 9, scope: !134)
!134 = distinct !DILexicalBlock(scope: !135, file: !1, line: 144, column: 2)
!135 = distinct !DILexicalBlock(scope: !19, file: !1, line: 144, column: 2)
!136 = !DILocation(line: 144, column: 11, scope: !134)
!137 = !DILocation(line: 144, column: 2, scope: !135)
!138 = !DILocation(line: 145, column: 7, scope: !139)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 145, column: 7)
!140 = distinct !DILexicalBlock(scope: !134, file: !1, line: 144, column: 21)
!141 = !DILocation(line: 145, column: 7, scope: !140)
!142 = !DILocation(line: 146, column: 8, scope: !143)
!143 = distinct !DILexicalBlock(scope: !144, file: !1, line: 146, column: 8)
!144 = distinct !DILexicalBlock(scope: !139, file: !1, line: 145, column: 14)
!145 = !DILocation(line: 146, column: 14, scope: !143)
!146 = !DILocation(line: 146, column: 21, scope: !143)
!147 = !DILocation(line: 146, column: 8, scope: !144)
!148 = !DILocation(line: 146, column: 37, scope: !143)
!149 = !DILocation(line: 146, column: 44, scope: !143)
!150 = !DILocation(line: 146, column: 47, scope: !143)
!151 = !DILocation(line: 146, column: 27, scope: !143)
!152 = !DILocation(line: 147, column: 9, scope: !144)
!153 = !DILocation(line: 148, column: 14, scope: !144)
!154 = !DILocation(line: 148, column: 21, scope: !144)
!155 = !DILocation(line: 148, column: 24, scope: !144)
!156 = !DILocation(line: 148, column: 4, scope: !144)
!157 = !DILocation(line: 149, column: 9, scope: !144)
!158 = !DILocation(line: 150, column: 14, scope: !144)
!159 = !DILocation(line: 150, column: 21, scope: !144)
!160 = !DILocation(line: 150, column: 24, scope: !144)
!161 = !DILocation(line: 150, column: 4, scope: !144)
!162 = !DILocation(line: 151, column: 9, scope: !144)
!163 = !DILocation(line: 152, column: 14, scope: !144)
!164 = !DILocation(line: 152, column: 21, scope: !144)
!165 = !DILocation(line: 152, column: 24, scope: !144)
!166 = !DILocation(line: 152, column: 4, scope: !144)
!167 = !DILocation(line: 153, column: 9, scope: !144)
!168 = !DILocation(line: 154, column: 3, scope: !144)
!169 = !DILocation(line: 155, column: 7, scope: !170)
