; ModuleID = 'blender/source/blender/editors/space_text/text_format_lua.c'
source_filename = "blender/source/blender/editors/space_text/text_format_lua.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TextFormatType = type { %struct.TextFormatType*, %struct.TextFormatType*, i8 (i8*)*, void (%struct.SpaceText*, %struct.TextLine*, i8)*, i8** }
%struct.SpaceText = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16], %struct.Text*, i32, i32, i16, i16, i16, i8, i8, i32, i32, i32, i16, i16, i16, i16, float, %struct.rcti, %struct.rcti, i32, i32, [256 x i8], [256 x i8], i16, i16, [4 x i8], i8*, [2 x float] }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.ListBase = type { i8*, i8* }
%struct.Text = type { %struct.ID, i8*, i32, i32, %struct.ListBase, %struct.TextLine*, %struct.TextLine*, i32, i32, i8*, i32, i32, i8*, double }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "tft", scope: !2, file: !3, line: 303, type: !44, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ED_text_format_register_lua", scope: !3, file: !3, line: 301, type: !4, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!3 = !DIFile(filename: "blender/source/blender/editors/space_text/text_format_lua.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !31, globals: !34, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 85, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/editors/space_text/text_format.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "FMT_TYPE_WHITESPACE", value: 95, isUnsigned: true)
!13 = !DIEnumerator(name: "FMT_TYPE_COMMENT", value: 35, isUnsigned: true)
!14 = !DIEnumerator(name: "FMT_TYPE_SYMBOL", value: 33, isUnsigned: true)
!15 = !DIEnumerator(name: "FMT_TYPE_NUMERAL", value: 110, isUnsigned: true)
!16 = !DIEnumerator(name: "FMT_TYPE_STRING", value: 108, isUnsigned: true)
!17 = !DIEnumerator(name: "FMT_TYPE_DIRECTIVE", value: 100, isUnsigned: true)
!18 = !DIEnumerator(name: "FMT_TYPE_SPECIAL", value: 118, isUnsigned: true)
!19 = !DIEnumerator(name: "FMT_TYPE_RESERVED", value: 114, isUnsigned: true)
!20 = !DIEnumerator(name: "FMT_TYPE_KEYWORD", value: 98, isUnsigned: true)
!21 = !DIEnumerator(name: "FMT_TYPE_DEFAULT", value: 113, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 45, baseType: !10, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !29, !30}
!24 = !DIEnumerator(name: "FMT_CONT_NOP", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "FMT_CONT_QUOTESINGLE", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "FMT_CONT_QUOTEDOUBLE", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "FMT_CONT_TRIPLE", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "FMT_CONT_QUOTESINGLE_TRIPLE", value: 5, isUnsigned: true)
!29 = !DIEnumerator(name: "FMT_CONT_QUOTEDOUBLE_TRIPLE", value: 6, isUnsigned: true)
!30 = !DIEnumerator(name: "FMT_CONT_COMMENT_C", value: 8, isUnsigned: true)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !{!0, !35}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "ext", scope: !2, file: !3, line: 304, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !41)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !{!42}
!42 = !DISubrange(count: 2)
!43 = !{}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextFormatType", file: !9, line: 83, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextFormatType", file: !9, line: 66, size: 320, elements: !46)
!46 = !{!47, !49, !50, !54, !226}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !45, file: !9, line: 67, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !45, file: !9, line: 67, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "format_identifier", scope: !45, file: !9, line: 69, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!40, !38}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "format_line", scope: !45, file: !9, line: 80, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !164, !224}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceText", file: !60, line: 856, baseType: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceText", file: !60, line: 818, size: 5440, elements: !62)
!62 = !{!63, !86, !87, !88, !89, !90, !91, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !207, !208, !209, !210, !214, !215, !216, !217, !221, !222}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !60, line: 819, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !60, line: 91, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !60, line: 85, size: 448, elements: !67)
!67 = !{!68, !70, !71, !78, !79, !81}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !60, line: 86, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !60, line: 86, baseType: !69, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !66, file: !60, line: 87, baseType: !72, size: 128, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !73, line: 71, baseType: !74)
!73 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !73, line: 69, size: 128, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !74, file: !73, line: 70, baseType: !32, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !74, file: !73, line: 70, baseType: !32, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !66, file: !60, line: 88, baseType: !33, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !66, file: !60, line: 89, baseType: !80, size: 32, offset: 288)
!80 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !66, file: !60, line: 90, baseType: !82, size: 128, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !84)
!83 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!84 = !{!85}
!85 = !DISubrange(count: 8)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !61, file: !60, line: 819, baseType: !64, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !61, file: !60, line: 820, baseType: !72, size: 128, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !61, file: !60, line: 821, baseType: !33, size: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !61, file: !60, line: 822, baseType: !80, size: 32, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !61, file: !60, line: 823, baseType: !82, size: 128, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !61, file: !60, line: 825, baseType: !92, size: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !94, line: 50, size: 1664, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_text_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !158, !160, !161, !162, !163, !175, !176, !177, !178, !179, !180, !181, !182}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !93, file: !94, line: 51, baseType: !97, size: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !98, line: 130, baseType: !99)
!98 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !98, line: 117, size: 960, elements: !100)
!100 = !{!101, !102, !103, !105, !124, !128, !129, !130, !131, !132}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !98, line: 118, baseType: !32, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !99, file: !98, line: 118, baseType: !32, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !99, file: !98, line: 119, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !99, file: !98, line: 120, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !98, line: 136, size: 17600, elements: !108)
!108 = !{!109, !110, !112, !115, !119, !120, !121}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !98, line: 137, baseType: !97, size: 960)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !107, file: !98, line: 138, baseType: !111, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !107, file: !98, line: 139, baseType: !113, size: 64, offset: 1024)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !98, line: 43, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !98, line: 140, baseType: !116, size: 8192, offset: 1088)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !107, file: !98, line: 141, baseType: !116, size: 8192, offset: 9280)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !107, file: !98, line: 148, baseType: !106, size: 64, offset: 17472)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !107, file: !98, line: 150, baseType: !122, size: 64, offset: 17536)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !98, line: 45, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !98, line: 121, baseType: !125, size: 528, offset: 256)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 528, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 66)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !99, file: !98, line: 126, baseType: !83, size: 16, offset: 784)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !99, file: !98, line: 127, baseType: !33, size: 32, offset: 800)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !99, file: !98, line: 128, baseType: !33, size: 32, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !99, file: !98, line: 128, baseType: !33, size: 32, offset: 864)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !99, file: !98, line: 129, baseType: !133, size: 64, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !98, line: 75, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !98, line: 62, size: 1024, elements: !136)
!136 = !{!137, !139, !140, !141, !142, !143, !147, !148, !156, !157}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !98, line: 63, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !98, line: 63, baseType: !138, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !98, line: 64, baseType: !40, size: 8, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !135, file: !98, line: 64, baseType: !40, size: 8, offset: 136)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !98, line: 65, baseType: !83, size: 16, offset: 144)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !98, line: 66, baseType: !144, size: 512, offset: 160)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 512, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !135, file: !98, line: 67, baseType: !33, size: 32, offset: 672)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !135, file: !98, line: 69, baseType: !149, size: 256, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !98, line: 60, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !98, line: 48, size: 256, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !150, file: !98, line: 49, baseType: !32, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !150, file: !98, line: 58, baseType: !72, size: 128, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !150, file: !98, line: 59, baseType: !33, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !150, file: !98, line: 59, baseType: !33, size: 32, offset: 224)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !135, file: !98, line: 70, baseType: !33, size: 32, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !135, file: !98, line: 74, baseType: !33, size: 32, offset: 992)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !94, line: 53, baseType: !159, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !94, line: 55, baseType: !33, size: 32, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !93, file: !94, line: 55, baseType: !33, size: 32, offset: 1056)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !93, file: !94, line: 57, baseType: !72, size: 128, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "curl", scope: !93, file: !94, line: 58, baseType: !164, size: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextLine", file: !94, line: 48, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextLine", file: !94, line: 42, size: 320, elements: !167)
!167 = !{!168, !170, !171, !172, !173, !174}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !94, line: 43, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !94, line: 43, baseType: !169, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !166, file: !94, line: 45, baseType: !159, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !166, file: !94, line: 46, baseType: !159, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !94, line: 47, baseType: !33, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "blen", scope: !166, file: !94, line: 47, baseType: !33, size: 32, offset: 288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sell", scope: !93, file: !94, line: 58, baseType: !164, size: 64, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "curc", scope: !93, file: !94, line: 59, baseType: !33, size: 32, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "selc", scope: !93, file: !94, line: 59, baseType: !33, size: 32, offset: 1376)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "undo_buf", scope: !93, file: !94, line: 61, baseType: !159, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "undo_pos", scope: !93, file: !94, line: 62, baseType: !33, size: 32, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "undo_len", scope: !93, file: !94, line: 62, baseType: !33, size: 32, offset: 1504)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "compiled", scope: !93, file: !94, line: 64, baseType: !32, size: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !93, file: !94, line: 65, baseType: !183, size: 64, offset: 1600)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !61, file: !60, line: 827, baseType: !33, size: 32, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "viewlines", scope: !61, file: !60, line: 827, baseType: !33, size: 32, offset: 544)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !60, line: 828, baseType: !83, size: 16, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !61, file: !60, line: 828, baseType: !83, size: 16, offset: 592)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !61, file: !60, line: 830, baseType: !83, size: 16, offset: 608)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !61, file: !60, line: 831, baseType: !40, size: 8, offset: 624)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "linenrs_tot", scope: !61, file: !60, line: 831, baseType: !40, size: 8, offset: 632)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !61, file: !60, line: 832, baseType: !33, size: 32, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "showlinenrs", scope: !61, file: !60, line: 833, baseType: !33, size: 32, offset: 672)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tabnumber", scope: !61, file: !60, line: 834, baseType: !33, size: 32, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "showsyntax", scope: !61, file: !60, line: 836, baseType: !83, size: 16, offset: 736)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "line_hlight", scope: !61, file: !60, line: 837, baseType: !83, size: 16, offset: 752)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "overwrite", scope: !61, file: !60, line: 838, baseType: !83, size: 16, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "live_edit", scope: !61, file: !60, line: 839, baseType: !83, size: 16, offset: 784)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pix_per_line", scope: !61, file: !60, line: 840, baseType: !80, size: 32, offset: 800)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "txtscroll", scope: !61, file: !60, line: 842, baseType: !200, size: 128, offset: 832)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !201, line: 86, size: 128, elements: !202)
!201 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !{!203, !204, !205, !206}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !200, file: !201, line: 87, baseType: !33, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !200, file: !201, line: 87, baseType: !33, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !200, file: !201, line: 88, baseType: !33, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !200, file: !201, line: 88, baseType: !33, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "txtbar", scope: !61, file: !60, line: 842, baseType: !200, size: 128, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "wordwrap", scope: !61, file: !60, line: 844, baseType: !33, size: 32, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "doplugins", scope: !61, file: !60, line: 844, baseType: !33, size: 32, offset: 1120)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "findstr", scope: !61, file: !60, line: 846, baseType: !211, size: 2048, offset: 1152)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "replacestr", scope: !61, file: !60, line: 847, baseType: !211, size: 2048, offset: 3200)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "margin_column", scope: !61, file: !60, line: 849, baseType: !83, size: 16, offset: 5248)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lheight_dpi", scope: !61, file: !60, line: 850, baseType: !83, size: 16, offset: 5264)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !61, file: !60, line: 851, baseType: !218, size: 32, offset: 5280)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 4)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "drawcache", scope: !61, file: !60, line: 853, baseType: !32, size: 64, offset: 5312)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_accum", scope: !61, file: !60, line: 855, baseType: !223, size: 64, offset: 5376)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, elements: !41)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !45, file: !9, line: 82, baseType: !227, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!228 = !{i32 7, !"Dwarf Version", i32 4}
!229 = !{i32 2, !"Debug Info Version", i32 3}
!230 = !{i32 1, !"wchar_size", i32 4}
!231 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!232 = !DILocation(line: 306, column: 24, scope: !2)
!233 = !DILocation(line: 307, column: 24, scope: !2)
!234 = !DILocation(line: 308, column: 10, scope: !2)
!235 = !DILocation(line: 310, column: 2, scope: !2)
!236 = !DILocation(line: 311, column: 1, scope: !2)
!237 = distinct !DISubprogram(name: "txtfmt_lua_format_identifier", scope: !3, file: !3, line: 144, type: !52, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!238 = !DILocalVariable(name: "str", arg: 1, scope: !237, file: !3, line: 144, type: !38)
!239 = !DILocation(line: 144, column: 54, scope: !237)
!240 = !DILocalVariable(name: "fmt", scope: !237, file: !3, line: 146, type: !40)
!241 = !DILocation(line: 146, column: 7, scope: !237)
!242 = !DILocation(line: 147, column: 39, scope: !243)
!243 = distinct !DILexicalBlock(scope: !237, file: !3, line: 147, column: 11)
!244 = !DILocation(line: 147, column: 12, scope: !243)
!245 = !DILocation(line: 147, column: 46, scope: !243)
!246 = !DILocation(line: 147, column: 11, scope: !237)
!247 = !DILocation(line: 147, column: 57, scope: !243)
!248 = !DILocation(line: 147, column: 53, scope: !243)
!249 = !DILocation(line: 148, column: 36, scope: !250)
!250 = distinct !DILexicalBlock(scope: !243, file: !3, line: 148, column: 11)
!251 = !DILocation(line: 148, column: 12, scope: !250)
!252 = !DILocation(line: 148, column: 46, scope: !250)
!253 = !DILocation(line: 148, column: 11, scope: !243)
!254 = !DILocation(line: 148, column: 57, scope: !250)
!255 = !DILocation(line: 148, column: 53, scope: !250)
!256 = !DILocation(line: 149, column: 57, scope: !250)
!257 = !DILocation(line: 150, column: 9, scope: !237)
!258 = !DILocation(line: 150, column: 2, scope: !237)
!259 = distinct !DISubprogram(name: "txtfmt_lua_format_line", scope: !3, file: !3, line: 153, type: !56, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!260 = !DILocalVariable(name: "st", arg: 1, scope: !259, file: !3, line: 153, type: !58)
!261 = !DILocation(line: 153, column: 47, scope: !259)
!262 = !DILocalVariable(name: "line", arg: 2, scope: !259, file: !3, line: 153, type: !164)
!263 = !DILocation(line: 153, column: 61, scope: !259)
!264 = !DILocalVariable(name: "do_next", arg: 3, scope: !259, file: !3, line: 153, type: !224)
!265 = !DILocation(line: 153, column: 78, scope: !259)
!266 = !DILocalVariable(name: "fs", scope: !259, file: !3, line: 155, type: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlattenString", file: !9, line: 42, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenString", file: !9, line: 35, size: 10432, elements: !269)
!269 = !{!270, !271, !273, !274, !276, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fixedbuf", scope: !268, file: !9, line: 36, baseType: !211, size: 2048)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fixedaccum", scope: !268, file: !9, line: 37, baseType: !272, size: 8192, offset: 2048)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8192, elements: !212)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !268, file: !9, line: 39, baseType: !159, size: 64, offset: 10240)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !268, file: !9, line: 40, baseType: !275, size: 64, offset: 10304)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !268, file: !9, line: 41, baseType: !33, size: 32, offset: 10368)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !268, file: !9, line: 41, baseType: !33, size: 32, offset: 10400)
!278 = !DILocation(line: 155, column: 16, scope: !259)
!279 = !DILocalVariable(name: "str", scope: !259, file: !3, line: 156, type: !38)
!280 = !DILocation(line: 156, column: 14, scope: !259)
!281 = !DILocalVariable(name: "fmt", scope: !259, file: !3, line: 157, type: !159)
!282 = !DILocation(line: 157, column: 8, scope: !259)
!283 = !DILocalVariable(name: "cont_orig", scope: !259, file: !3, line: 158, type: !40)
!284 = !DILocation(line: 158, column: 7, scope: !259)
!285 = !DILocalVariable(name: "cont", scope: !259, file: !3, line: 158, type: !40)
!286 = !DILocation(line: 158, column: 18, scope: !259)
!287 = !DILocalVariable(name: "find", scope: !259, file: !3, line: 158, type: !40)
!288 = !DILocation(line: 158, column: 24, scope: !259)
!289 = !DILocalVariable(name: "prev", scope: !259, file: !3, line: 158, type: !40)
!290 = !DILocation(line: 158, column: 30, scope: !259)
!291 = !DILocalVariable(name: "len", scope: !259, file: !3, line: 159, type: !33)
!292 = !DILocation(line: 159, column: 6, scope: !259)
!293 = !DILocalVariable(name: "i", scope: !259, file: !3, line: 159, type: !33)
!294 = !DILocation(line: 159, column: 11, scope: !259)
!295 = !DILocation(line: 162, column: 6, scope: !296)
!296 = distinct !DILexicalBlock(scope: !259, file: !3, line: 162, column: 6)
!297 = !DILocation(line: 162, column: 12, scope: !296)
!298 = !DILocation(line: 162, column: 17, scope: !296)
!299 = !DILocation(line: 162, column: 20, scope: !296)
!300 = !DILocation(line: 162, column: 26, scope: !296)
!301 = !DILocation(line: 162, column: 32, scope: !296)
!302 = !DILocation(line: 162, column: 39, scope: !296)
!303 = !DILocation(line: 162, column: 6, scope: !259)
!304 = !DILocation(line: 163, column: 9, scope: !305)
!305 = distinct !DILexicalBlock(scope: !296, file: !3, line: 162, column: 48)
!306 = !DILocation(line: 163, column: 15, scope: !305)
!307 = !DILocation(line: 163, column: 21, scope: !305)
!308 = !DILocation(line: 163, column: 7, scope: !305)
!309 = !DILocation(line: 164, column: 10, scope: !305)
!310 = !DILocation(line: 164, column: 21, scope: !305)
!311 = !DILocation(line: 164, column: 14, scope: !305)
!312 = !DILocation(line: 164, column: 26, scope: !305)
!313 = !DILocation(line: 164, column: 8, scope: !305)
!314 = !DILocation(line: 166, column: 2, scope: !305)
!315 = !DILocation(line: 168, column: 8, scope: !316)
!316 = distinct !DILexicalBlock(scope: !296, file: !3, line: 167, column: 7)
!317 = !DILocation(line: 172, column: 6, scope: !318)
!318 = distinct !DILexicalBlock(scope: !259, file: !3, line: 172, column: 6)
!319 = !DILocation(line: 172, column: 12, scope: !318)
!320 = !DILocation(line: 172, column: 19, scope: !318)
!321 = !DILocation(line: 172, column: 6, scope: !259)
!322 = !DILocation(line: 173, column: 9, scope: !323)
!323 = distinct !DILexicalBlock(scope: !318, file: !3, line: 172, column: 28)
!324 = !DILocation(line: 173, column: 15, scope: !323)
!325 = !DILocation(line: 173, column: 7, scope: !323)
!326 = !DILocation(line: 174, column: 15, scope: !323)
!327 = !DILocation(line: 174, column: 26, scope: !323)
!328 = !DILocation(line: 174, column: 19, scope: !323)
!329 = !DILocation(line: 174, column: 31, scope: !323)
!330 = !DILocation(line: 174, column: 13, scope: !323)
!331 = !DILocation(line: 176, column: 2, scope: !323)
!332 = !DILocation(line: 178, column: 13, scope: !333)
!333 = distinct !DILexicalBlock(scope: !318, file: !3, line: 177, column: 7)
!334 = !DILocation(line: 181, column: 23, scope: !259)
!335 = !DILocation(line: 181, column: 32, scope: !259)
!336 = !DILocation(line: 181, column: 38, scope: !259)
!337 = !DILocation(line: 181, column: 8, scope: !259)
!338 = !DILocation(line: 181, column: 6, scope: !259)
!339 = !DILocation(line: 182, column: 11, scope: !259)
!340 = !DILocation(line: 182, column: 6, scope: !259)
!341 = !DILocation(line: 183, column: 29, scope: !342)
