; ModuleID = 'blender/source/blender/blenkernel/intern/tracking_stabilize.c'
source_filename = "blender/source/blender/blenkernel/intern/tracking_stabilize.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MovieTracking = type { %struct.MovieTrackingSettings, %struct.MovieTrackingCamera, %struct.ListBase, %struct.ListBase, %struct.MovieTrackingReconstruction, %struct.MovieTrackingStabilization, %struct.MovieTrackingTrack*, %struct.MovieTrackingPlaneTrack*, %struct.ListBase, i32, i32, %struct.MovieTrackingStats*, %struct.MovieTrackingDopesheet }
%struct.MovieTrackingSettings = type { i32, i16, i16, float, i16, i16, i16, i16, i16, i16, float, i16, i16, i32, i32, i32, i16, i16, float, i32, i32, float, float, i32 }
%struct.MovieTrackingCamera = type { i8*, i16, i16, float, float, float, i16, i16, [2 x float], float, float, float, float, float }
%struct.MovieTrackingReconstruction = type { i32, float, i32, i32, %struct.MovieReconstructedCamera* }
%struct.MovieReconstructedCamera = type { i32, float, [4 x [4 x float]] }
%struct.MovieTrackingStabilization = type { i32, i32, i32, float, %struct.MovieTrackingTrack*, float, float, float, i32, i32, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !28, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/tracking_stabilize.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 454, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "TRACKING_2D_STABILIZATION", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "TRACKING_AUTOSCALE", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "TRACKING_STABILIZE_ROTATION", value: 4, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 461, baseType: !5, size: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "TRACKING_FILTER_NEAREST", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "TRACKING_FILTER_BILINEAR", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "TRACKING_FILTER_BICUBIC", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 380, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!21 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!22 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!23 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!24 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!25 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!26 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!27 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!28 = !{!29}
!29 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!30 = !{i32 7, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 1, !"wchar_size", i32 4}
!33 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!34 = distinct !DISubprogram(name: "BKE_tracking_stabilization_data_get", scope: !1, file: !1, line: 255, type: !35, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !239)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !46, !46, !46, !238, !238, !238}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTracking", file: !4, line: 356, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !4, line: 340, size: 2624, elements: !40)
!40 = !{!41, !71, !93, !100, !101, !119, !186, !187, !215, !216, !217, !218, !227}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !39, file: !4, line: 341, baseType: !42, size: 576)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !4, line: 251, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !4, line: 207, size: 576, elements: !44)
!44 = !{!45, !47, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !43, file: !4, line: 208, baseType: !46, size: 32)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !43, file: !4, line: 211, baseType: !48, size: 16, offset: 32)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !43, file: !4, line: 212, baseType: !48, size: 16, offset: 48)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !43, file: !4, line: 213, baseType: !29, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !43, file: !4, line: 214, baseType: !48, size: 16, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !43, file: !4, line: 215, baseType: !48, size: 16, offset: 112)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !43, file: !4, line: 216, baseType: !48, size: 16, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !43, file: !4, line: 217, baseType: !48, size: 16, offset: 144)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !43, file: !4, line: 218, baseType: !48, size: 16, offset: 160)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !43, file: !4, line: 219, baseType: !48, size: 16, offset: 176)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !43, file: !4, line: 220, baseType: !29, size: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !43, file: !4, line: 222, baseType: !48, size: 16, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !43, file: !4, line: 225, baseType: !48, size: 16, offset: 240)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !43, file: !4, line: 228, baseType: !46, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !43, file: !4, line: 229, baseType: !46, size: 32, offset: 288)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !43, file: !4, line: 233, baseType: !46, size: 32, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !43, file: !4, line: 236, baseType: !48, size: 16, offset: 352)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !43, file: !4, line: 236, baseType: !48, size: 16, offset: 368)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !43, file: !4, line: 241, baseType: !29, size: 32, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !43, file: !4, line: 244, baseType: !46, size: 32, offset: 416)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !43, file: !4, line: 244, baseType: !46, size: 32, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !43, file: !4, line: 245, baseType: !29, size: 32, offset: 480)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !43, file: !4, line: 248, baseType: !29, size: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !43, file: !4, line: 250, baseType: !46, size: 32, offset: 544)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !39, file: !4, line: 342, baseType: !72, size: 448, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !4, line: 79, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !4, line: 61, size: 448, elements: !74)
!74 = !{!75, !77, !78, !79, !80, !81, !82, !83, !84, !88, !89, !90, !91, !92}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !73, file: !4, line: 62, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !73, file: !4, line: 64, baseType: !48, size: 16, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !73, file: !4, line: 65, baseType: !48, size: 16, offset: 80)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !73, file: !4, line: 67, baseType: !29, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !73, file: !4, line: 68, baseType: !29, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !73, file: !4, line: 69, baseType: !29, size: 32, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !73, file: !4, line: 70, baseType: !48, size: 16, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !73, file: !4, line: 71, baseType: !48, size: 16, offset: 208)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !73, file: !4, line: 72, baseType: !85, size: 64, offset: 224)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 2)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !73, file: !4, line: 75, baseType: !29, size: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !73, file: !4, line: 75, baseType: !29, size: 32, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !73, file: !4, line: 75, baseType: !29, size: 32, offset: 352)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !73, file: !4, line: 78, baseType: !29, size: 32, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !73, file: !4, line: 78, baseType: !29, size: 32, offset: 416)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !39, file: !4, line: 343, baseType: !94, size: 128, offset: 1024)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !95, line: 71, baseType: !96)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !95, line: 69, size: 128, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !96, file: !95, line: 70, baseType: !76, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !96, file: !95, line: 70, baseType: !76, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !39, file: !4, line: 344, baseType: !94, size: 128, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !39, file: !4, line: 345, baseType: !102, size: 192, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !4, line: 278, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !4, line: 270, size: 192, elements: !104)
!104 = !{!105, !106, !107, !108, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !103, file: !4, line: 271, baseType: !46, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !103, file: !4, line: 273, baseType: !29, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !103, file: !4, line: 275, baseType: !46, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !103, file: !4, line: 276, baseType: !46, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !103, file: !4, line: 277, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !4, line: 55, size: 576, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !111, file: !4, line: 56, baseType: !46, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !111, file: !4, line: 57, baseType: !29, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !111, file: !4, line: 58, baseType: !116, size: 512, offset: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !117)
!117 = !{!118, !118}
!118 = !DISubrange(count: 4)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !39, file: !4, line: 346, baseType: !120, size: 384, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !4, line: 268, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !4, line: 253, size: 384, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !180, !181, !182, !183, !184, !185}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !4, line: 254, baseType: !46, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !121, file: !4, line: 255, baseType: !46, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !121, file: !4, line: 255, baseType: !46, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !121, file: !4, line: 258, baseType: !29, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !121, file: !4, line: 259, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !4, line: 164, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !4, line: 108, size: 1664, elements: !131)
!131 = !{!132, !134, !135, !140, !141, !142, !143, !144, !145, !146, !147, !160, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !178, !179}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !4, line: 109, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !130, file: !4, line: 109, baseType: !133, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !4, line: 111, baseType: !136, size: 512, offset: 128)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 512, elements: !138)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !{!139}
!139 = !DISubrange(count: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !130, file: !4, line: 119, baseType: !85, size: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !130, file: !4, line: 119, baseType: !85, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !130, file: !4, line: 125, baseType: !85, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !130, file: !4, line: 125, baseType: !85, size: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !130, file: !4, line: 127, baseType: !85, size: 64, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !130, file: !4, line: 130, baseType: !46, size: 32, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !130, file: !4, line: 131, baseType: !46, size: 32, offset: 992)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !130, file: !4, line: 132, baseType: !148, size: 64, offset: 1024)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !4, line: 106, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !4, line: 81, size: 512, elements: !151)
!151 = !{!152, !153, !156, !157, !158, !159}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !150, file: !4, line: 82, baseType: !85, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !150, file: !4, line: 97, baseType: !154, size: 256, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !155)
!155 = !{!118, !87}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !150, file: !4, line: 102, baseType: !85, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !150, file: !4, line: 102, baseType: !85, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !150, file: !4, line: 104, baseType: !46, size: 32, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !4, line: 105, baseType: !46, size: 32, offset: 480)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !130, file: !4, line: 135, baseType: !161, size: 96, offset: 1088)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 96, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !130, file: !4, line: 136, baseType: !29, size: 32, offset: 1184)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !4, line: 139, baseType: !46, size: 32, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !130, file: !4, line: 139, baseType: !46, size: 32, offset: 1248)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !130, file: !4, line: 139, baseType: !46, size: 32, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !130, file: !4, line: 140, baseType: !161, size: 96, offset: 1312)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !130, file: !4, line: 143, baseType: !48, size: 16, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !130, file: !4, line: 144, baseType: !48, size: 16, offset: 1424)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !130, file: !4, line: 145, baseType: !48, size: 16, offset: 1440)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !130, file: !4, line: 148, baseType: !48, size: 16, offset: 1456)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !130, file: !4, line: 149, baseType: !46, size: 32, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !130, file: !4, line: 150, baseType: !29, size: 32, offset: 1504)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !130, file: !4, line: 152, baseType: !176, size: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 45, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !130, file: !4, line: 163, baseType: !29, size: 32, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !130, file: !4, line: 163, baseType: !29, size: 32, offset: 1632)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !121, file: !4, line: 261, baseType: !29, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !121, file: !4, line: 261, baseType: !29, size: 32, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !121, file: !4, line: 261, baseType: !29, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !121, file: !4, line: 263, baseType: !46, size: 32, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !121, file: !4, line: 266, baseType: !46, size: 32, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !121, file: !4, line: 267, baseType: !29, size: 32, offset: 352)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !39, file: !4, line: 347, baseType: !128, size: 64, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !39, file: !4, line: 348, baseType: !188, size: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !4, line: 205, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !4, line: 186, size: 1024, elements: !191)
!191 = !{!192, !194, !195, !196, !198, !199, !200, !208, !209, !210, !213, !214}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !4, line: 187, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !4, line: 187, baseType: !193, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !4, line: 189, baseType: !136, size: 512, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !190, file: !4, line: 191, baseType: !197, size: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !190, file: !4, line: 193, baseType: !46, size: 32, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !190, file: !4, line: 193, baseType: !46, size: 32, offset: 736)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !190, file: !4, line: 195, baseType: !201, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !4, line: 184, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !4, line: 166, size: 320, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !203, file: !4, line: 180, baseType: !154, size: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !203, file: !4, line: 182, baseType: !46, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !203, file: !4, line: 183, baseType: !46, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !190, file: !4, line: 196, baseType: !46, size: 32, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !4, line: 198, baseType: !46, size: 32, offset: 864)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !190, file: !4, line: 200, baseType: !211, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !4, line: 47, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !190, file: !4, line: 201, baseType: !29, size: 32, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !190, file: !4, line: 204, baseType: !46, size: 32, offset: 992)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !39, file: !4, line: 350, baseType: !94, size: 128, offset: 1984)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !39, file: !4, line: 351, baseType: !46, size: 32, offset: 2112)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !39, file: !4, line: 351, baseType: !46, size: 32, offset: 2144)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !39, file: !4, line: 353, baseType: !219, size: 64, offset: 2176)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !4, line: 297, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !4, line: 295, size: 2048, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !221, file: !4, line: 296, baseType: !224, size: 2048)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2048, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !39, file: !4, line: 355, baseType: !228, size: 384, offset: 2240)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !4, line: 338, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !4, line: 322, size: 384, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !229, file: !4, line: 323, baseType: !46, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !229, file: !4, line: 325, baseType: !48, size: 16, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !4, line: 326, baseType: !48, size: 16, offset: 48)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !229, file: !4, line: 331, baseType: !94, size: 128, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !229, file: !4, line: 334, baseType: !94, size: 128, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !229, file: !4, line: 335, baseType: !46, size: 32, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !229, file: !4, line: 337, baseType: !46, size: 32, offset: 352)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!239 = !{}
!240 = !DILocalVariable(name: "tracking", arg: 1, scope: !34, file: !1, line: 255, type: !37)
!241 = !DILocation(line: 255, column: 57, scope: !34)
!242 = !DILocalVariable(name: "framenr", arg: 2, scope: !34, file: !1, line: 255, type: !46)
!243 = !DILocation(line: 255, column: 71, scope: !34)
!244 = !DILocalVariable(name: "width", arg: 3, scope: !34, file: !1, line: 255, type: !46)
!245 = !DILocation(line: 255, column: 84, scope: !34)
!246 = !DILocalVariable(name: "height", arg: 4, scope: !34, file: !1, line: 255, type: !46)
!247 = !DILocation(line: 255, column: 95, scope: !34)
!248 = !DILocalVariable(name: "translation", arg: 5, scope: !34, file: !1, line: 256, type: !238)
!249 = !DILocation(line: 256, column: 48, scope: !34)
!250 = !DILocalVariable(name: "scale", arg: 6, scope: !34, file: !1, line: 256, type: !238)
!251 = !DILocation(line: 256, column: 71, scope: !34)
!252 = !DILocalVariable(name: "angle", arg: 7, scope: !34, file: !1, line: 256, type: !238)
!253 = !DILocation(line: 256, column: 85, scope: !34)
!254 = !DILocalVariable(name: "firstmedian", scope: !34, file: !1, line: 258, type: !85)
!255 = !DILocation(line: 258, column: 8, scope: !34)
!256 = !DILocalVariable(name: "median", scope: !34, file: !1, line: 258, type: !85)
!257 = !DILocation(line: 258, column: 24, scope: !34)
!258 = !DILocalVariable(name: "stab", scope: !34, file: !1, line: 259, type: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!260 = !DILocation(line: 259, column: 30, scope: !34)
!261 = !DILocation(line: 259, column: 38, scope: !34)
!262 = !DILocation(line: 259, column: 48, scope: !34)
!263 = !DILocation(line: 262, column: 7, scope: !264)
!264 = distinct !DILexicalBlock(scope: !34, file: !1, line: 262, column: 6)
!265 = !DILocation(line: 262, column: 13, scope: !264)
!266 = !DILocation(line: 262, column: 18, scope: !264)
!267 = !DILocation(line: 262, column: 47, scope: !264)
!268 = !DILocation(line: 262, column: 6, scope: !34)
!269 = !DILocation(line: 263, column: 11, scope: !270)
!270 = distinct !DILexicalBlock(scope: !264, file: !1, line: 262, column: 53)
!271 = !DILocation(line: 263, column: 3, scope: !270)
!272 = !DILocation(line: 264, column: 4, scope: !270)
!273 = !DILocation(line: 264, column: 10, scope: !270)
!274 = !DILocation(line: 265, column: 4, scope: !270)
!275 = !DILocation(line: 265, column: 10, scope: !270)
!276 = !DILocation(line: 267, column: 3, scope: !270)
!277 = !DILocation(line: 277, column: 37, scope: !278)
!278 = distinct !DILexicalBlock(scope: !34, file: !1, line: 277, column: 6)
!279 = !DILocation(line: 277, column: 50, scope: !278)
!280 = !DILocation(line: 277, column: 6, scope: !278)
!281 = !DILocation(line: 277, column: 6, scope: !34)
!282 = !DILocation(line: 278, column: 34, scope: !283)
!283 = distinct !DILexicalBlock(scope: !278, file: !1, line: 277, column: 64)
!284 = !DILocation(line: 278, column: 44, scope: !283)
!285 = !DILocation(line: 278, column: 53, scope: !283)
!286 = !DILocation(line: 278, column: 3, scope: !283)
!287 = !DILocation(line: 280, column: 8, scope: !288)
!288 = distinct !DILexicalBlock(scope: !283, file: !1, line: 280, column: 7)
!289 = !DILocation(line: 280, column: 14, scope: !288)
!290 = !DILocation(line: 280, column: 19, scope: !288)
!291 = !DILocation(line: 280, column: 41, scope: !288)
!292 = !DILocation(line: 280, column: 7, scope: !283)
!293 = !DILocation(line: 281, column: 4, scope: !288)
!294 = !DILocation(line: 281, column: 10, scope: !288)
!295 = !DILocation(line: 281, column: 16, scope: !288)
!296 = !DILocation(line: 283, column: 8, scope: !297)
!297 = distinct !DILexicalBlock(scope: !283, file: !1, line: 283, column: 7)
!298 = !DILocation(line: 283, column: 14, scope: !297)
!299 = !DILocation(line: 283, column: 7, scope: !283)
!300 = !DILocation(line: 284, column: 8, scope: !301)
!301 = distinct !DILexicalBlock(scope: !302, file: !1, line: 284, column: 8)
!302 = distinct !DILexicalBlock(scope: !297, file: !1, line: 283, column: 18)
!303 = !DILocation(line: 284, column: 14, scope: !301)
!304 = !DILocation(line: 284, column: 19, scope: !301)
!305 = !DILocation(line: 284, column: 8, scope: !302)
!306 = !DILocation(line: 285, column: 46, scope: !301)
!307 = !DILocation(line: 285, column: 56, scope: !301)
!308 = !DILocation(line: 285, column: 63, scope: !301)
!309 = !DILocation(line: 285, column: 5, scope: !301)
!310 = !DILocation(line: 287, column: 33, scope: !302)
!311 = !DILocation(line: 287, column: 43, scope: !302)
!312 = !DILocation(line: 287, column: 52, scope: !302)
!313 = !DILocation(line: 287, column: 59, scope: !302)
!314 = !DILocation(line: 287, column: 67, scope: !302)
!315 = !DILocation(line: 287, column: 80, scope: !302)
!316 = !DILocation(line: 288, column: 33, scope: !302)
!317 = !DILocation(line: 288, column: 46, scope: !302)
!318 = !DILocation(line: 288, column: 53, scope: !302)
!319 = !DILocation(line: 287, column: 4, scope: !302)
!320 = !DILocation(line: 290, column: 4, scope: !302)
!321 = !DILocation(line: 290, column: 10, scope: !302)
!322 = !DILocation(line: 290, column: 13, scope: !302)
!323 = !DILocation(line: 291, column: 3, scope: !302)
!324 = !DILocation(line: 293, column: 33, scope: !325)
!325 = distinct !DILexicalBlock(scope: !297, file: !1, line: 292, column: 8)
!326 = !DILocation(line: 293, column: 43, scope: !325)
!327 = !DILocation(line: 293, column: 52, scope: !325)
!328 = !DILocation(line: 293, column: 59, scope: !325)
!329 = !DILocation(line: 293, column: 67, scope: !325)
!330 = !DILocation(line: 293, column: 80, scope: !325)
!331 = !DILocation(line: 294, column: 33, scope: !325)
!332 = !DILocation(line: 294, column: 46, scope: !325)
!333 = !DILocation(line: 294, column: 53, scope: !325)
!334 = !DILocation(line: 293, column: 4, scope: !325)
!335 = !DILocation(line: 296, column: 2, scope: !283)
!336 = !DILocation(line: 298, column: 11, scope: !337)
!337 = distinct !DILexicalBlock(scope: !278, file: !1, line: 297, column: 7)
!338 = !DILocation(line: 298, column: 3, scope: !337)
!339 = !DILocation(line: 299, column: 4, scope: !337)
!340 = !DILocation(line: 299, column: 10, scope: !337)
!341 = !DILocation(line: 300, column: 4, scope: !337)
!342 = !DILocation(line: 300, column: 10, scope: !337)
!343 = !DILocation(line: 302, column: 1, scope: !34)
!344 = distinct !DISubprogram(name: "zero_v2", scope: !345, file: !345, line: 37, type: !346, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !239)
!345 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!346 = !DISubroutineType(types: !347)
!347 = !{null, !238}
!348 = !DILocalVariable(name: "r", arg: 1, scope: !344, file: !345, line: 37, type: !238)
!349 = !DILocation(line: 37, column: 28, scope: !344)
!350 = !DILocation(line: 39, column: 2, scope: !344)
!351 = !DILocation(line: 39, column: 7, scope: !344)
!352 = !DILocation(line: 40, column: 2, scope: !344)
!353 = !DILocation(line: 40, column: 7, scope: !344)
!354 = !DILocation(line: 41, column: 1, scope: !344)
!355 = distinct !DISubprogram(name: "stabilization_median_point_get", scope: !1, file: !1, line: 51, type: !356, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !239)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !37, !46, !238}
!358 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!359 = !DILocalVariable(name: "tracking", arg: 1, scope: !355, file: !1, line: 51, type: !37)
!360 = !DILocation(line: 51, column: 59, scope: !355)
!361 = !DILocalVariable(name: "framenr", arg: 2, scope: !355, file: !1, line: 51, type: !46)
!362 = !DILocation(line: 51, column: 73, scope: !355)
!363 = !DILocalVariable(name: "median", arg: 3, scope: !355, file: !1, line: 51, type: !238)
!364 = !DILocation(line: 51, column: 88, scope: !355)
!365 = !DILocalVariable(name: "ok", scope: !355, file: !1, line: 53, type: !358)
!366 = !DILocation(line: 53, column: 7, scope: !355)
!367 = !DILocalVariable(name: "min", scope: !355, file: !1, line: 54, type: !85)
!368 = !DILocation(line: 54, column: 8, scope: !355)
!369 = !DILocalVariable(name: "max", scope: !355, file: !1, line: 54, type: !85)
!370 = !DILocation(line: 54, column: 16, scope: !355)
!371 = !DILocalVariable(name: "track", scope: !355, file: !1, line: 55, type: !128)
!372 = !DILocation(line: 55, column: 22, scope: !355)
!373 = !DILocation(line: 57, column: 2, scope: !374)
!374 = distinct !DILexicalBlock(scope: !355, file: !1, line: 57, column: 2)
!375 = !DILocation(line: 59, column: 10, scope: !355)
!376 = !DILocation(line: 59, column: 20, scope: !355)
!377 = !DILocation(line: 59, column: 27, scope: !355)
!378 = !DILocation(line: 59, column: 8, scope: !355)
!379 = !DILocation(line: 60, column: 2, scope: !355)
!380 = !DILocation(line: 60, column: 9, scope: !355)
!381 = !DILocation(line: 61, column: 7, scope: !382)
!382 = distinct !DILexicalBlock(scope: !383, file: !1, line: 61, column: 7)
!383 = distinct !DILexicalBlock(scope: !355, file: !1, line: 60, column: 16)
!384 = !DILocation(line: 61, column: 14, scope: !382)
!385 = !DILocation(line: 61, column: 19, scope: !382)
!386 = !DILocation(line: 61, column: 7, scope: !383)
!387 = !DILocalVariable(name: "marker", scope: !388, file: !1, line: 62, type: !148)
!388 = distinct !DILexicalBlock(scope: !382, file: !1, line: 61, column: 40)
!389 = !DILocation(line: 62, column: 25, scope: !388)
!390 = !DILocation(line: 62, column: 58, scope: !388)
!391 = !DILocation(line: 62, column: 65, scope: !388)
!392 = !DILocation(line: 62, column: 34, scope: !388)
!393 = !DILocation(line: 64, column: 19, scope: !388)
!394 = !DILocation(line: 64, column: 24, scope: !388)
!395 = !DILocation(line: 64, column: 29, scope: !388)
!396 = !DILocation(line: 64, column: 37, scope: !388)
!397 = !DILocation(line: 64, column: 4, scope: !388)
!398 = !DILocation(line: 66, column: 7, scope: !388)
!399 = !DILocation(line: 67, column: 3, scope: !388)
!400 = !DILocation(line: 69, column: 11, scope: !383)
!401 = !DILocation(line: 69, column: 18, scope: !383)
!402 = !DILocation(line: 69, column: 9, scope: !383)
!403 = distinct !{!403, !379, !404}
!404 = !DILocation(line: 70, column: 2, scope: !355)
!405 = !DILocation(line: 72, column: 15, scope: !355)
!406 = !DILocation(line: 72, column: 24, scope: !355)
!407 = !DILocation(line: 72, column: 22, scope: !355)
!408 = !DILocation(line: 72, column: 32, scope: !355)
!409 = !DILocation(line: 72, column: 2, scope: !355)
!410 = !DILocation(line: 72, column: 12, scope: !355)
!411 = !DILocation(line: 73, column: 15, scope: !355)
!412 = !DILocation(line: 73, column: 24, scope: !355)
!413 = !DILocation(line: 73, column: 22, scope: !355)
!414 = !DILocation(line: 73, column: 32, scope: !355)
!415 = !DILocation(line: 73, column: 2, scope: !355)
!416 = !DILocation(line: 73, column: 12, scope: !355)
!417 = !DILocation(line: 75, column: 9, scope: !355)
!418 = !DILocation(line: 75, column: 2, scope: !355)
!419 = distinct !DISubprogram(name: "stabilization_calculate_autoscale_factor", scope: !1, file: !1, line: 126, type: !420, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !239)
!420 = !DISubroutineType(types: !421)
!421 = !{!29, !37, !46, !46}
!422 = !DILocalVariable(name: "tracking", arg: 1, scope: !419, file: !1, line: 126, type: !37)
!423 = !DILocation(line: 126, column: 70, scope: !419)
!424 = !DILocalVariable(name: "width", arg: 2, scope: !419, file: !1, line: 126, type: !46)
!425 = !DILocation(line: 126, column: 84, scope: !419)
!426 = !DILocalVariable(name: "height", arg: 3, scope: !419, file: !1, line: 126, type: !46)
!427 = !DILocation(line: 126, column: 95, scope: !419)
!428 = !DILocalVariable(name: "firstmedian", scope: !419, file: !1, line: 128, type: !85)
!429 = !DILocation(line: 128, column: 8, scope: !419)
!430 = !DILocalVariable(name: "stab", scope: !419, file: !1, line: 129, type: !259)
!431 = !DILocation(line: 129, column: 30, scope: !419)
!432 = !DILocation(line: 129, column: 38, scope: !419)
!433 = !DILocation(line: 129, column: 48, scope: !419)
!434 = !DILocalVariable(name: "aspect", scope: !419, file: !1, line: 130, type: !29)
!435 = !DILocation(line: 130, column: 8, scope: !419)
!436 = !DILocation(line: 130, column: 17, scope: !419)
!437 = !DILocation(line: 130, column: 27, scope: !419)
!438 = !DILocation(line: 130, column: 34, scope: !419)
!439 = !DILocation(line: 133, column: 6, scope: !440)
!440 = distinct !DILexicalBlock(scope: !419, file: !1, line: 133, column: 6)
!441 = !DILocation(line: 133, column: 12, scope: !440)
!442 = !DILocation(line: 133, column: 6, scope: !419)
!443 = !DILocation(line: 134, column: 10, scope: !440)
!444 = !DILocation(line: 134, column: 16, scope: !440)
!445 = !DILocation(line: 134, column: 3, scope: !440)
!446 = !DILocation(line: 137, column: 37, scope: !447)
!447 = distinct !DILexicalBlock(scope: !419, file: !1, line: 137, column: 6)
!448 = !DILocation(line: 137, column: 50, scope: !447)
!449 = !DILocation(line: 137, column: 6, scope: !447)
!450 = !DILocation(line: 137, column: 6, scope: !419)
!451 = !DILocalVariable(name: "sfra", scope: !452, file: !1, line: 138, type: !46)
!452 = distinct !DILexicalBlock(scope: !447, file: !1, line: 137, column: 64)
!453 = !DILocation(line: 138, column: 7, scope: !452)
!454 = !DILocalVariable(name: "efra", scope: !452, file: !1, line: 138, type: !46)
!455 = !DILocation(line: 138, column: 23, scope: !452)
!456 = !DILocalVariable(name: "cfra", scope: !452, file: !1, line: 138, type: !46)
!457 = !DILocation(line: 138, column: 39, scope: !452)
!458 = !DILocalVariable(name: "scale", scope: !452, file: !1, line: 139, type: !29)
!459 = !DILocation(line: 139, column: 9, scope: !452)
!460 = !DILocalVariable(name: "track", scope: !452, file: !1, line: 140, type: !128)
!461 = !DILocation(line: 140, column: 23, scope: !452)
!462 = !DILocation(line: 142, column: 3, scope: !452)
!463 = !DILocation(line: 142, column: 9, scope: !452)
!464 = !DILocation(line: 142, column: 15, scope: !452)
!465 = !DILocation(line: 145, column: 11, scope: !452)
!466 = !DILocation(line: 145, column: 21, scope: !452)
!467 = !DILocation(line: 145, column: 28, scope: !452)
!468 = !DILocation(line: 145, column: 9, scope: !452)
!469 = !DILocation(line: 146, column: 3, scope: !452)
!470 = !DILocation(line: 146, column: 10, scope: !452)
!471 = !DILocation(line: 147, column: 8, scope: !472)
!472 = distinct !DILexicalBlock(scope: !473, file: !1, line: 147, column: 8)
!473 = distinct !DILexicalBlock(scope: !452, file: !1, line: 146, column: 17)
!474 = !DILocation(line: 147, column: 15, scope: !472)
!475 = !DILocation(line: 147, column: 20, scope: !472)
!476 = !DILocation(line: 147, column: 40, scope: !472)
!477 = !DILocation(line: 148, column: 10, scope: !472)
!478 = !DILocation(line: 148, column: 16, scope: !472)
!479 = !DILocation(line: 148, column: 21, scope: !472)
!480 = !DILocation(line: 148, column: 52, scope: !472)
!481 = !DILocation(line: 148, column: 55, scope: !472)
!482 = !DILocation(line: 148, column: 64, scope: !472)
!483 = !DILocation(line: 148, column: 70, scope: !472)
!484 = !DILocation(line: 148, column: 61, scope: !472)
!485 = !DILocation(line: 147, column: 8, scope: !473)
!486 = !DILocation(line: 150, column: 19, scope: !487)
!487 = distinct !DILexicalBlock(scope: !472, file: !1, line: 149, column: 4)
!488 = !DILocation(line: 150, column: 25, scope: !487)
!489 = !DILocation(line: 150, column: 32, scope: !487)
!490 = !DILocation(line: 150, column: 43, scope: !487)
!491 = !DILocation(line: 150, column: 12, scope: !487)
!492 = !DILocation(line: 150, column: 10, scope: !487)
!493 = !DILocation(line: 151, column: 19, scope: !487)
!494 = !DILocation(line: 151, column: 25, scope: !487)
!495 = !DILocation(line: 151, column: 32, scope: !487)
!496 = !DILocation(line: 151, column: 40, scope: !487)
!497 = !DILocation(line: 151, column: 47, scope: !487)
!498 = !DILocation(line: 151, column: 57, scope: !487)
!499 = !DILocation(line: 151, column: 62, scope: !487)
!500 = !DILocation(line: 151, column: 12, scope: !487)
!501 = !DILocation(line: 151, column: 10, scope: !487)
!502 = !DILocation(line: 152, column: 4, scope: !487)
!503 = !DILocation(line: 154, column: 12, scope: !473)
!504 = !DILocation(line: 154, column: 19, scope: !473)
!505 = !DILocation(line: 154, column: 10, scope: !473)
!506 = distinct !{!506, !469, !507}
!507 = !DILocation(line: 155, column: 3, scope: !452)
!508 = !DILocation(line: 160, column: 15, scope: !509)
!509 = distinct !DILexicalBlock(scope: !452, file: !1, line: 160, column: 3)
!510 = !DILocation(line: 160, column: 13, scope: !509)
!511 = !DILocation(line: 160, column: 8, scope: !509)
!512 = !DILocation(line: 160, column: 21, scope: !513)
!513 = distinct !DILexicalBlock(scope: !509, file: !1, line: 160, column: 3)
!514 = !DILocation(line: 160, column: 29, scope: !513)
!515 = !DILocation(line: 160, column: 26, scope: !513)
!516 = !DILocation(line: 160, column: 3, scope: !509)
!517 = !DILocalVariable(name: "median", scope: !518, file: !1, line: 161, type: !85)
!518 = distinct !DILexicalBlock(scope: !513, file: !1, line: 160, column: 43)
!519 = !DILocation(line: 161, column: 10, scope: !518)
!520 = !DILocalVariable(name: "translation", scope: !518, file: !1, line: 162, type: !85)
!521 = !DILocation(line: 162, column: 10, scope: !518)
!522 = !DILocalVariable(name: "angle", scope: !518, file: !1, line: 162, type: !29)
!523 = !DILocation(line: 162, column: 26, scope: !518)
!524 = !DILocalVariable(name: "tmp_scale", scope: !518, file: !1, line: 162, type: !29)
!525 = !DILocation(line: 162, column: 33, scope: !518)
!526 = !DILocalVariable(name: "i", scope: !518, file: !1, line: 163, type: !46)
!527 = !DILocation(line: 163, column: 8, scope: !518)
!528 = !DILocalVariable(name: "mat", scope: !518, file: !1, line: 164, type: !116)
!529 = !DILocation(line: 164, column: 10, scope: !518)
!530 = !DILocalVariable(name: "points", scope: !518, file: !1, line: 165, type: !154)
!531 = !DILocation(line: 165, column: 10, scope: !518)
!532 = !DILocation(line: 165, column: 25, scope: !518)
!533 = !DILocation(line: 165, column: 26, scope: !518)
!534 = !DILocation(line: 165, column: 40, scope: !518)
!535 = !DILocation(line: 165, column: 47, scope: !518)
!536 = !DILocation(line: 165, column: 56, scope: !518)
!537 = !DILocation(line: 165, column: 57, scope: !518)
!538 = !DILocation(line: 165, column: 64, scope: !518)
!539 = !DILocation(line: 165, column: 73, scope: !518)
!540 = !DILocation(line: 165, column: 74, scope: !518)
!541 = !DILocalVariable(name: "si", scope: !518, file: !1, line: 166, type: !29)
!542 = !DILocation(line: 166, column: 10, scope: !518)
!543 = !DILocalVariable(name: "co", scope: !518, file: !1, line: 166, type: !29)
!544 = !DILocation(line: 166, column: 14, scope: !518)
!545 = !DILocation(line: 168, column: 35, scope: !518)
!546 = !DILocation(line: 168, column: 45, scope: !518)
!547 = !DILocation(line: 168, column: 51, scope: !518)
!548 = !DILocation(line: 168, column: 4, scope: !518)
!549 = !DILocation(line: 170, column: 33, scope: !518)
!550 = !DILocation(line: 170, column: 43, scope: !518)
!551 = !DILocation(line: 170, column: 49, scope: !518)
!552 = !DILocation(line: 170, column: 56, scope: !518)
!553 = !DILocation(line: 170, column: 64, scope: !518)
!554 = !DILocation(line: 170, column: 77, scope: !518)
!555 = !DILocation(line: 170, column: 85, scope: !518)
!556 = !DILocation(line: 170, column: 4, scope: !518)
!557 = !DILocation(line: 173, column: 44, scope: !518)
!558 = !DILocation(line: 173, column: 51, scope: !518)
!559 = !DILocation(line: 173, column: 59, scope: !518)
!560 = !DILocation(line: 173, column: 67, scope: !518)
!561 = !DILocation(line: 173, column: 86, scope: !518)
!562 = !DILocation(line: 173, column: 93, scope: !518)
!563 = !DILocation(line: 173, column: 4, scope: !518)
!564 = !DILocation(line: 175, column: 14, scope: !518)
!565 = !DILocation(line: 175, column: 9, scope: !518)
!566 = !DILocation(line: 175, column: 7, scope: !518)
!567 = !DILocation(line: 176, column: 14, scope: !518)
!568 = !DILocation(line: 176, column: 9, scope: !518)
!569 = !DILocation(line: 176, column: 7, scope: !518)
!570 = !DILocation(line: 178, column: 11, scope: !571)
!571 = distinct !DILexicalBlock(scope: !518, file: !1, line: 178, column: 4)
!572 = !DILocation(line: 178, column: 9, scope: !571)
!573 = !DILocation(line: 178, column: 16, scope: !574)
!574 = distinct !DILexicalBlock(scope: !571, file: !1, line: 178, column: 4)
!575 = !DILocation(line: 178, column: 18, scope: !574)
!576 = !DILocation(line: 178, column: 4, scope: !571)
!577 = !DILocalVariable(name: "j", scope: !578, file: !1, line: 179, type: !46)
!578 = distinct !DILexicalBlock(scope: !574, file: !1, line: 178, column: 28)
!579 = !DILocation(line: 179, column: 9, scope: !578)
!580 = !DILocalVariable(name: "a", scope: !578, file: !1, line: 180, type: !161)
!581 = !DILocation(line: 180, column: 11, scope: !578)
!582 = !DILocalVariable(name: "b", scope: !578, file: !1, line: 180, type: !161)
!583 = !DILocation(line: 180, column: 38, scope: !578)
!584 = !DILocation(line: 182, column: 16, scope: !578)
!585 = !DILocation(line: 182, column: 26, scope: !578)
!586 = !DILocation(line: 182, column: 19, scope: !578)
!587 = !DILocation(line: 182, column: 5, scope: !578)
!588 = !DILocation(line: 183, column: 16, scope: !578)
!589 = !DILocation(line: 183, column: 27, scope: !578)
!590 = !DILocation(line: 183, column: 29, scope: !578)
!591 = !DILocation(line: 183, column: 34, scope: !578)
!592 = !DILocation(line: 183, column: 19, scope: !578)
!593 = !DILocation(line: 183, column: 5, scope: !578)
!594 = !DILocation(line: 185, column: 15, scope: !578)
!595 = !DILocation(line: 185, column: 20, scope: !578)
!596 = !DILocation(line: 185, column: 5, scope: !578)
!597 = !DILocation(line: 186, column: 15, scope: !578)
!598 = !DILocation(line: 186, column: 20, scope: !578)
!599 = !DILocation(line: 186, column: 5, scope: !578)
!600 = !DILocation(line: 188, column: 12, scope: !601)
!601 = distinct !DILexicalBlock(scope: !578, file: !1, line: 188, column: 5)
!602 = !DILocation(line: 188, column: 10, scope: !601)
!603 = !DILocation(line: 188, column: 17, scope: !604)
!604 = distinct !DILexicalBlock(scope: !601, file: !1, line: 188, column: 5)
!605 = !DILocation(line: 188, column: 19, scope: !604)
!606 = !DILocation(line: 188, column: 5, scope: !601)
!607 = !DILocalVariable(name: "point", scope: !608, file: !1, line: 189, type: !161)
!608 = distinct !DILexicalBlock(scope: !604, file: !1, line: 188, column: 29)
!609 = !DILocation(line: 189, column: 12, scope: !608)
!610 = !DILocation(line: 189, column: 23, scope: !608)
!611 = !DILocation(line: 189, column: 31, scope: !608)
!612 = !DILocation(line: 189, column: 24, scope: !608)
!613 = !DILocation(line: 189, column: 45, scope: !608)
!614 = !DILocation(line: 189, column: 38, scope: !608)
!615 = !DILocalVariable(name: "v1", scope: !608, file: !1, line: 190, type: !161)
!616 = !DILocation(line: 190, column: 12, scope: !608)
!617 = !DILocalVariable(name: "v2", scope: !608, file: !1, line: 190, type: !161)
!618 = !DILocation(line: 190, column: 19, scope: !608)
!619 = !DILocation(line: 192, column: 18, scope: !608)
!620 = !DILocation(line: 192, column: 22, scope: !608)
!621 = !DILocation(line: 192, column: 25, scope: !608)
!622 = !DILocation(line: 192, column: 6, scope: !608)
!623 = !DILocation(line: 193, column: 18, scope: !608)
!624 = !DILocation(line: 193, column: 22, scope: !608)
!625 = !DILocation(line: 193, column: 29, scope: !608)
!626 = !DILocation(line: 193, column: 6, scope: !608)
!627 = !DILocation(line: 195, column: 21, scope: !628)
!628 = distinct !DILexicalBlock(scope: !608, file: !1, line: 195, column: 10)
!629 = !DILocation(line: 195, column: 25, scope: !628)
!630 = !DILocation(line: 195, column: 10, scope: !628)
!631 = !DILocation(line: 195, column: 29, scope: !628)
!632 = !DILocation(line: 195, column: 10, scope: !608)
!633 = !DILocalVariable(name: "rotDx", scope: !634, file: !1, line: 196, type: !635)
!634 = distinct !DILexicalBlock(scope: !628, file: !1, line: 195, column: 38)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 256, elements: !155)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!637 = !DILocation(line: 196, column: 19, scope: !634)
!638 = !DILocalVariable(name: "rotDy", scope: !634, file: !1, line: 197, type: !635)
!639 = !DILocation(line: 197, column: 19, scope: !634)
!640 = !DILocalVariable(name: "dx", scope: !634, file: !1, line: 199, type: !29)
!641 = !DILocation(line: 199, column: 13, scope: !634)
!642 = !DILocation(line: 199, column: 18, scope: !634)
!643 = !DILocation(line: 199, column: 41, scope: !634)
!644 = !DILocation(line: 199, column: 35, scope: !634)
!645 = !DILocation(line: 199, column: 33, scope: !634)
!646 = !DILocation(line: 199, column: 49, scope: !634)
!647 = !DILocation(line: 199, column: 72, scope: !634)
!648 = !DILocation(line: 199, column: 66, scope: !634)
!649 = !DILocation(line: 199, column: 64, scope: !634)
!650 = !DILocation(line: 199, column: 47, scope: !634)
!651 = !DILocalVariable(name: "dy", scope: !634, file: !1, line: 200, type: !29)
!652 = !DILocation(line: 200, column: 13, scope: !634)
!653 = !DILocation(line: 200, column: 18, scope: !634)
!654 = !DILocation(line: 200, column: 41, scope: !634)
!655 = !DILocation(line: 200, column: 35, scope: !634)
!656 = !DILocation(line: 200, column: 33, scope: !634)
!657 = !DILocation(line: 200, column: 49, scope: !634)
!658 = !DILocation(line: 200, column: 72, scope: !634)
!659 = !DILocation(line: 200, column: 66, scope: !634)
!660 = !DILocation(line: 200, column: 64, scope: !634)
!661 = !DILocation(line: 200, column: 47, scope: !634)
!662 = !DILocalVariable(name: "w", scope: !634, file: !1, line: 202, type: !29)
!663 = !DILocation(line: 202, column: 13, scope: !634)
!664 = !DILocalVariable(name: "h", scope: !634, file: !1, line: 202, type: !29)
!665 = !DILocation(line: 202, column: 16, scope: !634)
!666 = !DILocalVariable(name: "E", scope: !634, file: !1, line: 202, type: !29)
!667 = !DILocation(line: 202, column: 19, scope: !634)
!668 = !DILocalVariable(name: "F", scope: !634, file: !1, line: 202, type: !29)
!669 = !DILocation(line: 202, column: 22, scope: !634)
!670 = !DILocalVariable(name: "G", scope: !634, file: !1, line: 202, type: !29)
!671 = !DILocation(line: 202, column: 25, scope: !634)
!672 = !DILocalVariable(name: "H", scope: !634, file: !1, line: 202, type: !29)
!673 = !DILocation(line: 202, column: 28, scope: !634)
!674 = !DILocalVariable(name: "I", scope: !634, file: !1, line: 202, type: !29)
!675 = !DILocation(line: 202, column: 31, scope: !634)
!676 = !DILocalVariable(name: "J", scope: !634, file: !1, line: 202, type: !29)
!677 = !DILocation(line: 202, column: 34, scope: !634)
!678 = !DILocalVariable(name: "K", scope: !634, file: !1, line: 202, type: !29)
!679 = !DILocation(line: 202, column: 37, scope: !634)
!680 = !DILocalVariable(name: "S", scope: !634, file: !1, line: 202, type: !29)
!681 = !DILocation(line: 202, column: 40, scope: !634)
!682 = !DILocation(line: 204, column: 11, scope: !683)
!683 = distinct !DILexicalBlock(scope: !634, file: !1, line: 204, column: 11)
!684 = !DILocation(line: 204, column: 13, scope: !683)
!685 = !DILocation(line: 204, column: 11, scope: !634)
!686 = !DILocation(line: 205, column: 19, scope: !687)
!687 = distinct !DILexicalBlock(scope: !683, file: !1, line: 204, column: 18)
!688 = !DILocation(line: 205, column: 12, scope: !687)
!689 = !DILocation(line: 205, column: 26, scope: !687)
!690 = !DILocation(line: 205, column: 10, scope: !687)
!691 = !DILocation(line: 206, column: 19, scope: !687)
!692 = !DILocation(line: 206, column: 12, scope: !687)
!693 = !DILocation(line: 206, column: 25, scope: !687)
!694 = !DILocation(line: 206, column: 10, scope: !687)
!695 = !DILocation(line: 207, column: 7, scope: !687)
!696 = !DILocation(line: 209, column: 19, scope: !697)
!697 = distinct !DILexicalBlock(scope: !683, file: !1, line: 208, column: 12)
!698 = !DILocation(line: 209, column: 12, scope: !697)
!699 = !DILocation(line: 209, column: 25, scope: !697)
!700 = !DILocation(line: 209, column: 10, scope: !697)
!701 = !DILocation(line: 210, column: 19, scope: !697)
!702 = !DILocation(line: 210, column: 12, scope: !697)
!703 = !DILocation(line: 210, column: 26, scope: !697)
!704 = !DILocation(line: 210, column: 10, scope: !697)
!705 = !DILocation(line: 213, column: 12, scope: !634)
!706 = !DILocation(line: 213, column: 11, scope: !634)
!707 = !DILocation(line: 213, column: 16, scope: !634)
!708 = !DILocation(line: 213, column: 14, scope: !634)
!709 = !DILocation(line: 213, column: 21, scope: !634)
!710 = !DILocation(line: 213, column: 25, scope: !634)
!711 = !DILocation(line: 213, column: 23, scope: !634)
!712 = !DILocation(line: 213, column: 19, scope: !634)
!713 = !DILocation(line: 213, column: 9, scope: !634)
!714 = !DILocation(line: 214, column: 12, scope: !634)
!715 = !DILocation(line: 214, column: 11, scope: !634)
!716 = !DILocation(line: 214, column: 16, scope: !634)
!717 = !DILocation(line: 214, column: 14, scope: !634)
!718 = !DILocation(line: 214, column: 21, scope: !634)
!719 = !DILocation(line: 214, column: 25, scope: !634)
!720 = !DILocation(line: 214, column: 23, scope: !634)
!721 = !DILocation(line: 214, column: 19, scope: !634)
!722 = !DILocation(line: 214, column: 9, scope: !634)
!723 = !DILocation(line: 216, column: 12, scope: !724)
!724 = distinct !DILexicalBlock(scope: !634, file: !1, line: 216, column: 11)
!725 = !DILocation(line: 216, column: 14, scope: !724)
!726 = !DILocation(line: 216, column: 23, scope: !724)
!727 = !DILocation(line: 216, column: 25, scope: !724)
!728 = !DILocation(line: 216, column: 19, scope: !724)
!729 = !DILocation(line: 216, column: 11, scope: !634)
!730 = !DILocation(line: 217, column: 13, scope: !731)
!731 = distinct !DILexicalBlock(scope: !724, file: !1, line: 216, column: 31)
!732 = !DILocation(line: 217, column: 12, scope: !731)
!733 = !DILocation(line: 217, column: 17, scope: !731)
!734 = !DILocation(line: 217, column: 15, scope: !731)
!735 = !DILocation(line: 217, column: 22, scope: !731)
!736 = !DILocation(line: 217, column: 26, scope: !731)
!737 = !DILocation(line: 217, column: 24, scope: !731)
!738 = !DILocation(line: 217, column: 20, scope: !731)
!739 = !DILocation(line: 217, column: 10, scope: !731)
!740 = !DILocation(line: 218, column: 12, scope: !731)
!741 = !DILocation(line: 218, column: 16, scope: !731)
!742 = !DILocation(line: 218, column: 14, scope: !731)
!743 = !DILocation(line: 218, column: 21, scope: !731)
!744 = !DILocation(line: 218, column: 25, scope: !731)
!745 = !DILocation(line: 218, column: 23, scope: !731)
!746 = !DILocation(line: 218, column: 19, scope: !731)
!747 = !DILocation(line: 218, column: 10, scope: !731)
!748 = !DILocation(line: 219, column: 7, scope: !731)
!749 = !DILocation(line: 221, column: 12, scope: !750)
!750 = distinct !DILexicalBlock(scope: !724, file: !1, line: 220, column: 12)
!751 = !DILocation(line: 221, column: 16, scope: !750)
!752 = !DILocation(line: 221, column: 14, scope: !750)
!753 = !DILocation(line: 221, column: 21, scope: !750)
!754 = !DILocation(line: 221, column: 25, scope: !750)
!755 = !DILocation(line: 221, column: 23, scope: !750)
!756 = !DILocation(line: 221, column: 19, scope: !750)
!757 = !DILocation(line: 221, column: 10, scope: !750)
!758 = !DILocation(line: 222, column: 13, scope: !750)
!759 = !DILocation(line: 222, column: 12, scope: !750)
!760 = !DILocation(line: 222, column: 17, scope: !750)
!761 = !DILocation(line: 222, column: 15, scope: !750)
!762 = !DILocation(line: 222, column: 22, scope: !750)
!763 = !DILocation(line: 222, column: 26, scope: !750)
!764 = !DILocation(line: 222, column: 24, scope: !750)
!765 = !DILocation(line: 222, column: 20, scope: !750)
!766 = !DILocation(line: 222, column: 10, scope: !750)
!767 = !DILocation(line: 225, column: 11, scope: !634)
!768 = !DILocation(line: 225, column: 15, scope: !634)
!769 = !DILocation(line: 225, column: 13, scope: !634)
!770 = !DILocation(line: 225, column: 9, scope: !634)
!771 = !DILocation(line: 226, column: 11, scope: !634)
!772 = !DILocation(line: 226, column: 15, scope: !634)
!773 = !DILocation(line: 226, column: 13, scope: !634)
!774 = !DILocation(line: 226, column: 9, scope: !634)
!775 = !DILocation(line: 227, column: 11, scope: !634)
!776 = !DILocation(line: 227, column: 15, scope: !634)
!777 = !DILocation(line: 227, column: 13, scope: !634)
!778 = !DILocation(line: 227, column: 19, scope: !634)
!779 = !DILocation(line: 227, column: 23, scope: !634)
!780 = !DILocation(line: 227, column: 21, scope: !634)
!781 = !DILocation(line: 227, column: 17, scope: !634)
!782 = !DILocation(line: 227, column: 9, scope: !634)
!783 = !DILocation(line: 229, column: 13, scope: !634)
!784 = !DILocation(line: 229, column: 12, scope: !634)
!785 = !DILocation(line: 229, column: 17, scope: !634)
!786 = !DILocation(line: 229, column: 15, scope: !634)
!787 = !DILocation(line: 229, column: 21, scope: !634)
!788 = !DILocation(line: 229, column: 25, scope: !634)
!789 = !DILocation(line: 229, column: 23, scope: !634)
!790 = !DILocation(line: 229, column: 19, scope: !634)
!791 = !DILocation(line: 229, column: 31, scope: !634)
!792 = !DILocation(line: 229, column: 36, scope: !634)
!793 = !DILocation(line: 229, column: 34, scope: !634)
!794 = !DILocation(line: 229, column: 40, scope: !634)
!795 = !DILocation(line: 229, column: 45, scope: !634)
!796 = !DILocation(line: 229, column: 43, scope: !634)
!797 = !DILocation(line: 229, column: 38, scope: !634)
!798 = !DILocation(line: 229, column: 49, scope: !634)
!799 = !DILocation(line: 229, column: 47, scope: !634)
!800 = !DILocation(line: 229, column: 28, scope: !634)
!801 = !DILocation(line: 229, column: 9, scope: !634)
!802 = !DILocation(line: 231, column: 22, scope: !634)
!803 = !DILocation(line: 231, column: 29, scope: !634)
!804 = !DILocation(line: 231, column: 15, scope: !634)
!805 = !DILocation(line: 231, column: 13, scope: !634)
!806 = !DILocation(line: 232, column: 6, scope: !634)
!807 = !DILocation(line: 233, column: 5, scope: !608)
!808 = !DILocation(line: 188, column: 25, scope: !604)
!809 = !DILocation(line: 188, column: 5, scope: !604)
!810 = distinct !{!810, !606, !811}
!811 = !DILocation(line: 233, column: 5, scope: !601)
!812 = !DILocation(line: 234, column: 4, scope: !578)
!813 = !DILocation(line: 178, column: 24, scope: !574)
!814 = !DILocation(line: 178, column: 4, scope: !574)
!815 = distinct !{!815, !576, !816}
!816 = !DILocation(line: 234, column: 4, scope: !571)
!817 = !DILocation(line: 235, column: 3, scope: !518)
!818 = !DILocation(line: 160, column: 39, scope: !513)
!819 = !DILocation(line: 160, column: 3, scope: !513)
!820 = distinct !{!820, !516, !821}
!821 = !DILocation(line: 235, column: 3, scope: !509)
!822 = !DILocation(line: 237, column: 17, scope: !452)
!823 = !DILocation(line: 237, column: 3, scope: !452)
!824 = !DILocation(line: 237, column: 9, scope: !452)
!825 = !DILocation(line: 237, column: 15, scope: !452)
!826 = !DILocation(line: 239, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !452, file: !1, line: 239, column: 7)
!828 = !DILocation(line: 239, column: 13, scope: !827)
!829 = !DILocation(line: 239, column: 22, scope: !827)
!830 = !DILocation(line: 239, column: 7, scope: !452)
!831 = !DILocation(line: 240, column: 25, scope: !827)
!832 = !DILocation(line: 240, column: 31, scope: !827)
!833 = !DILocation(line: 240, column: 38, scope: !827)
!834 = !DILocation(line: 240, column: 44, scope: !827)
!835 = !DILocation(line: 240, column: 18, scope: !827)
!836 = !DILocation(line: 240, column: 4, scope: !827)
!837 = !DILocation(line: 240, column: 10, scope: !827)
!838 = !DILocation(line: 240, column: 16, scope: !827)
!839 = !DILocation(line: 241, column: 2, scope: !452)
!840 = !DILocation(line: 243, column: 3, scope: !841)
!841 = distinct !DILexicalBlock(scope: !447, file: !1, line: 242, column: 7)
!842 = !DILocation(line: 243, column: 9, scope: !841)
!843 = !DILocation(line: 243, column: 15, scope: !841)
!844 = !DILocation(line: 246, column: 2, scope: !419)
!845 = !DILocation(line: 246, column: 8, scope: !419)
!846 = !DILocation(line: 246, column: 11, scope: !419)
!847 = !DILocation(line: 248, column: 9, scope: !419)
!848 = !DILocation(line: 248, column: 15, scope: !419)
!849 = !DILocation(line: 248, column: 2, scope: !419)
!850 = !DILocation(line: 249, column: 1, scope: !419)
!851 = distinct !DISubprogram(name: "stabilization_calculate_data", scope: !1, file: !1, line: 84, type: !852, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !239)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !37, !46, !46, !46, !854, !854, !238, !238, !238}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!855 = !DILocalVariable(name: "tracking", arg: 1, scope: !851, file: !1, line: 84, type: !37)
!856 = !DILocation(line: 84, column: 57, scope: !851)
!857 = !DILocalVariable(name: "framenr", arg: 2, scope: !851, file: !1, line: 84, type: !46)
!858 = !DILocation(line: 84, column: 71, scope: !851)
!859 = !DILocalVariable(name: "width", arg: 3, scope: !851, file: !1, line: 84, type: !46)
!860 = !DILocation(line: 84, column: 84, scope: !851)
!861 = !DILocalVariable(name: "height", arg: 4, scope: !851, file: !1, line: 84, type: !46)
!862 = !DILocation(line: 84, column: 95, scope: !851)
!863 = !DILocalVariable(name: "firstmedian", arg: 5, scope: !851, file: !1, line: 85, type: !854)
!864 = !DILocation(line: 85, column: 54, scope: !851)
!865 = !DILocalVariable(name: "median", arg: 6, scope: !851, file: !1, line: 85, type: !854)
!866 = !DILocation(line: 85, column: 82, scope: !851)
!867 = !DILocalVariable(name: "translation", arg: 7, scope: !851, file: !1, line: 86, type: !238)
!868 = !DILocation(line: 86, column: 48, scope: !851)
!869 = !DILocalVariable(name: "scale", arg: 8, scope: !851, file: !1, line: 86, type: !238)
!870 = !DILocation(line: 86, column: 71, scope: !851)
!871 = !DILocalVariable(name: "angle", arg: 9, scope: !851, file: !1, line: 86, type: !238)
!872 = !DILocation(line: 86, column: 85, scope: !851)
!873 = !DILocalVariable(name: "stab", scope: !851, file: !1, line: 88, type: !259)
!874 = !DILocation(line: 88, column: 30, scope: !851)
!875 = !DILocation(line: 88, column: 38, scope: !851)
!876 = !DILocation(line: 88, column: 48, scope: !851)
!877 = !DILocation(line: 90, column: 12, scope: !851)
!878 = !DILocation(line: 90, column: 18, scope: !851)
!879 = !DILocation(line: 90, column: 24, scope: !851)
!880 = !DILocation(line: 90, column: 34, scope: !851)
!881 = !DILocation(line: 90, column: 40, scope: !851)
!882 = !DILocation(line: 90, column: 32, scope: !851)
!883 = !DILocation(line: 90, column: 49, scope: !851)
!884 = !DILocation(line: 90, column: 3, scope: !851)
!885 = !DILocation(line: 90, column: 9, scope: !851)
!886 = !DILocation(line: 91, column: 3, scope: !851)
!887 = !DILocation(line: 91, column: 9, scope: !851)
!888 = !DILocation(line: 93, column: 20, scope: !851)
!889 = !DILocation(line: 93, column: 37, scope: !851)
!890 = !DILocation(line: 93, column: 35, scope: !851)
!891 = !DILocation(line: 93, column: 50, scope: !851)
!892 = !DILocation(line: 93, column: 48, scope: !851)
!893 = !DILocation(line: 93, column: 60, scope: !851)
!894 = !DILocation(line: 93, column: 59, scope: !851)
!895 = !DILocation(line: 93, column: 56, scope: !851)
!896 = !DILocation(line: 93, column: 2, scope: !851)
!897 = !DILocation(line: 93, column: 17, scope: !851)
!898 = !DILocation(line: 94, column: 20, scope: !851)
!899 = !DILocation(line: 94, column: 37, scope: !851)
!900 = !DILocation(line: 94, column: 35, scope: !851)
!901 = !DILocation(line: 94, column: 50, scope: !851)
!902 = !DILocation(line: 94, column: 48, scope: !851)
!903 = !DILocation(line: 94, column: 61, scope: !851)
!904 = !DILocation(line: 94, column: 60, scope: !851)
!905 = !DILocation(line: 94, column: 57, scope: !851)
!906 = !DILocation(line: 94, column: 2, scope: !851)
!907 = !DILocation(line: 94, column: 17, scope: !851)
!908 = !DILocation(line: 96, column: 12, scope: !851)
!909 = !DILocation(line: 96, column: 25, scope: !851)
!910 = !DILocation(line: 96, column: 31, scope: !851)
!911 = !DILocation(line: 96, column: 2, scope: !851)
!912 = !DILocation(line: 98, column: 7, scope: !913)
!913 = distinct !DILexicalBlock(scope: !851, file: !1, line: 98, column: 6)
!914 = !DILocation(line: 98, column: 13, scope: !913)
!915 = !DILocation(line: 98, column: 18, scope: !913)
!916 = !DILocation(line: 98, column: 49, scope: !913)
!917 = !DILocation(line: 98, column: 52, scope: !913)
!918 = !DILocation(line: 98, column: 58, scope: !913)
!919 = !DILocation(line: 98, column: 68, scope: !913)
!920 = !DILocation(line: 98, column: 71, scope: !913)
!921 = !DILocation(line: 98, column: 77, scope: !913)
!922 = !DILocation(line: 98, column: 6, scope: !851)
!923 = !DILocalVariable(name: "marker", scope: !924, file: !1, line: 99, type: !148)
!924 = distinct !DILexicalBlock(scope: !913, file: !1, line: 98, column: 85)
!925 = !DILocation(line: 99, column: 24, scope: !924)
!926 = !DILocalVariable(name: "a", scope: !924, file: !1, line: 100, type: !85)
!927 = !DILocation(line: 100, column: 9, scope: !924)
!928 = !DILocalVariable(name: "b", scope: !924, file: !1, line: 100, type: !85)
!929 = !DILocation(line: 100, column: 15, scope: !924)
!930 = !DILocalVariable(name: "x0", scope: !924, file: !1, line: 101, type: !29)
!931 = !DILocation(line: 101, column: 9, scope: !924)
!932 = !DILocation(line: 101, column: 21, scope: !924)
!933 = !DILocation(line: 101, column: 14, scope: !924)
!934 = !DILocation(line: 101, column: 27, scope: !924)
!935 = !DILocalVariable(name: "y0", scope: !924, file: !1, line: 101, type: !29)
!936 = !DILocation(line: 101, column: 35, scope: !924)
!937 = !DILocation(line: 101, column: 47, scope: !924)
!938 = !DILocation(line: 101, column: 40, scope: !924)
!939 = !DILocation(line: 101, column: 54, scope: !924)
!940 = !DILocalVariable(name: "x", scope: !924, file: !1, line: 102, type: !29)
!941 = !DILocation(line: 102, column: 9, scope: !924)
!942 = !DILocation(line: 102, column: 13, scope: !924)
!943 = !DILocation(line: 102, column: 25, scope: !924)
!944 = !DILocation(line: 102, column: 23, scope: !924)
!945 = !DILocalVariable(name: "y", scope: !924, file: !1, line: 102, type: !29)
!946 = !DILocation(line: 102, column: 32, scope: !924)
!947 = !DILocation(line: 102, column: 36, scope: !924)
!948 = !DILocation(line: 102, column: 48, scope: !924)
!949 = !DILocation(line: 102, column: 46, scope: !924)
!950 = !DILocation(line: 104, column: 36, scope: !924)
!951 = !DILocation(line: 104, column: 42, scope: !924)
!952 = !DILocation(line: 104, column: 12, scope: !924)
!953 = !DILocation(line: 104, column: 10, scope: !924)
!954 = !DILocation(line: 105, column: 15, scope: !924)
!955 = !DILocation(line: 105, column: 18, scope: !924)
!956 = !DILocation(line: 105, column: 26, scope: !924)
!957 = !DILocation(line: 105, column: 31, scope: !924)
!958 = !DILocation(line: 105, column: 3, scope: !924)
!959 = !DILocation(line: 106, column: 11, scope: !924)
!960 = !DILocation(line: 106, column: 3, scope: !924)
!961 = !DILocation(line: 106, column: 8, scope: !924)
!962 = !DILocation(line: 107, column: 11, scope: !924)
!963 = !DILocation(line: 107, column: 3, scope: !924)
!964 = !DILocation(line: 107, column: 8, scope: !924)
!965 = !DILocation(line: 109, column: 36, scope: !924)
!966 = !DILocation(line: 109, column: 42, scope: !924)
!967 = !DILocation(line: 109, column: 53, scope: !924)
!968 = !DILocation(line: 109, column: 12, scope: !924)
!969 = !DILocation(line: 109, column: 10, scope: !924)
!970 = !DILocation(line: 110, column: 15, scope: !924)
!971 = !DILocation(line: 110, column: 18, scope: !924)
!972 = !DILocation(line: 110, column: 26, scope: !924)
!973 = !DILocation(line: 110, column: 31, scope: !924)
!974 = !DILocation(line: 110, column: 3, scope: !924)
!975 = !DILocation(line: 111, column: 11, scope: !924)
!976 = !DILocation(line: 111, column: 3, scope: !924)
!977 = !DILocation(line: 111, column: 8, scope: !924)
!978 = !DILocation(line: 112, column: 11, scope: !924)
!979 = !DILocation(line: 112, column: 3, scope: !924)
!980 = !DILocation(line: 112, column: 8, scope: !924)
!981 = !DILocation(line: 114, column: 20, scope: !924)
!982 = !DILocation(line: 114, column: 27, scope: !924)
!983 = !DILocation(line: 114, column: 25, scope: !924)
!984 = !DILocation(line: 114, column: 34, scope: !924)
!985 = !DILocation(line: 114, column: 41, scope: !924)
!986 = !DILocation(line: 114, column: 39, scope: !924)
!987 = !DILocation(line: 114, column: 32, scope: !924)
!988 = !DILocation(line: 114, column: 47, scope: !924)
!989 = !DILocation(line: 114, column: 54, scope: !924)
!990 = !DILocation(line: 114, column: 52, scope: !924)
!991 = !DILocation(line: 114, column: 61, scope: !924)
!992 = !DILocation(line: 114, column: 68, scope: !924)
!993 = !DILocation(line: 114, column: 66, scope: !924)
!994 = !DILocation(line: 114, column: 59, scope: !924)
!995 = !DILocation(line: 114, column: 13, scope: !924)
!996 = !DILocation(line: 114, column: 12, scope: !924)
!997 = !DILocation(line: 114, column: 4, scope: !924)
!998 = !DILocation(line: 114, column: 10, scope: !924)
!999 = !DILocation(line: 115, column: 13, scope: !924)
!1000 = !DILocation(line: 115, column: 19, scope: !924)
!1001 = !DILocation(line: 115, column: 4, scope: !924)
!1002 = !DILocation(line: 115, column: 10, scope: !924)
!1003 = !DILocation(line: 118, column: 22, scope: !924)
!1004 = !DILocation(line: 118, column: 28, scope: !924)
!1005 = !DILocation(line: 118, column: 32, scope: !924)
!1006 = !DILocation(line: 118, column: 30, scope: !924)
!1007 = !DILocation(line: 118, column: 44, scope: !924)
!1008 = !DILocation(line: 118, column: 43, scope: !924)
!1009 = !DILocation(line: 118, column: 38, scope: !924)
!1010 = !DILocation(line: 118, column: 36, scope: !924)
!1011 = !DILocation(line: 118, column: 25, scope: !924)
!1012 = !DILocation(line: 118, column: 54, scope: !924)
!1013 = !DILocation(line: 118, column: 58, scope: !924)
!1014 = !DILocation(line: 118, column: 56, scope: !924)
!1015 = !DILocation(line: 118, column: 70, scope: !924)
!1016 = !DILocation(line: 118, column: 69, scope: !924)
!1017 = !DILocation(line: 118, column: 64, scope: !924)
!1018 = !DILocation(line: 118, column: 62, scope: !924)
!1019 = !DILocation(line: 118, column: 51, scope: !924)
!1020 = !DILocation(line: 118, column: 79, scope: !924)
!1021 = !DILocation(line: 118, column: 77, scope: !924)
!1022 = !DILocation(line: 118, column: 86, scope: !924)
!1023 = !DILocation(line: 118, column: 85, scope: !924)
!1024 = !DILocation(line: 118, column: 82, scope: !924)
!1025 = !DILocation(line: 118, column: 3, scope: !924)
!1026 = !DILocation(line: 118, column: 18, scope: !924)
!1027 = !DILocation(line: 119, column: 22, scope: !924)
!1028 = !DILocation(line: 119, column: 28, scope: !924)
!1029 = !DILocation(line: 119, column: 32, scope: !924)
!1030 = !DILocation(line: 119, column: 30, scope: !924)
!1031 = !DILocation(line: 119, column: 44, scope: !924)
!1032 = !DILocation(line: 119, column: 43, scope: !924)
!1033 = !DILocation(line: 119, column: 38, scope: !924)
!1034 = !DILocation(line: 119, column: 36, scope: !924)
!1035 = !DILocation(line: 119, column: 25, scope: !924)
!1036 = !DILocation(line: 119, column: 54, scope: !924)
!1037 = !DILocation(line: 119, column: 58, scope: !924)
!1038 = !DILocation(line: 119, column: 56, scope: !924)
!1039 = !DILocation(line: 119, column: 70, scope: !924)
!1040 = !DILocation(line: 119, column: 69, scope: !924)
!1041 = !DILocation(line: 119, column: 64, scope: !924)
!1042 = !DILocation(line: 119, column: 62, scope: !924)
!1043 = !DILocation(line: 119, column: 51, scope: !924)
!1044 = !DILocation(line: 119, column: 79, scope: !924)
!1045 = !DILocation(line: 119, column: 77, scope: !924)
!1046 = !DILocation(line: 119, column: 86, scope: !924)
!1047 = !DILocation(line: 119, column: 85, scope: !924)
!1048 = !DILocation(line: 119, column: 82, scope: !924)
!1049 = !DILocation(line: 119, column: 3, scope: !924)
!1050 = !DILocation(line: 119, column: 18, scope: !924)
!1051 = !DILocation(line: 120, column: 2, scope: !924)
!1052 = !DILocation(line: 121, column: 1, scope: !851)
!1053 = distinct !DISubprogram(name: "BKE_tracking_stabilize_frame", scope: !1, file: !1, line: 309, type: !1054, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !239)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1056, !37, !46, !1135, !238, !238, !238}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !1058, line: 70, size: 19840, elements: !1059)
!1058 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1070, !1071, !1074, !1075, !1076, !1077, !1078, !1080, !1082, !1083, !1084, !1088, !1089, !1090, !1091, !1092, !1095, !1096, !1097, !1101, !1102, !1105, !1106, !1108, !1109, !1110, !1113, !1114, !1115, !1118, !1119, !1128}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1057, file: !1058, line: 71, baseType: !1056, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1057, file: !1058, line: 71, baseType: !1056, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1057, file: !1058, line: 74, baseType: !46, size: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1057, file: !1058, line: 74, baseType: !46, size: 32, offset: 160)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1057, file: !1058, line: 79, baseType: !358, size: 8, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1057, file: !1058, line: 80, baseType: !46, size: 32, offset: 224)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1057, file: !1058, line: 83, baseType: !46, size: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !1057, file: !1058, line: 84, baseType: !46, size: 32, offset: 288)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1057, file: !1058, line: 87, baseType: !1069, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !1057, file: !1058, line: 88, baseType: !238, size: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !1057, file: !1058, line: 93, baseType: !1072, size: 128, offset: 448)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 128, elements: !86)
!1073 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !1057, file: !1058, line: 96, baseType: !46, size: 32, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !1057, file: !1058, line: 96, baseType: !46, size: 32, offset: 608)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !1057, file: !1058, line: 97, baseType: !46, size: 32, offset: 640)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !1057, file: !1058, line: 97, baseType: !46, size: 32, offset: 672)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !1057, file: !1058, line: 98, baseType: !1079, size: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !1057, file: !1058, line: 101, baseType: !1081, size: 64, offset: 768)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !1057, file: !1058, line: 102, baseType: !238, size: 64, offset: 832)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1057, file: !1058, line: 105, baseType: !29, size: 32, offset: 896)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !1057, file: !1058, line: 108, baseType: !1085, size: 1280, offset: 960)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 1280, elements: !1086)
!1086 = !{!1087}
!1087 = !DISubrange(count: 20)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !1057, file: !1058, line: 109, baseType: !46, size: 32, offset: 2240)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !1057, file: !1058, line: 109, baseType: !46, size: 32, offset: 2272)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1057, file: !1058, line: 112, baseType: !46, size: 32, offset: 2304)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !1057, file: !1058, line: 113, baseType: !46, size: 32, offset: 2336)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1057, file: !1058, line: 114, baseType: !1093, size: 64, offset: 2368)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !1058, line: 50, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1057, file: !1058, line: 115, baseType: !76, size: 64, offset: 2432)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !1057, file: !1058, line: 118, baseType: !46, size: 32, offset: 2496)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1057, file: !1058, line: 119, baseType: !1098, size: 8192, offset: 2528)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8192, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !1057, file: !1058, line: 120, baseType: !1098, size: 8192, offset: 10720)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !1057, file: !1058, line: 123, baseType: !1103, size: 64, offset: 18944)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !1058, line: 123, flags: DIFlagFwdDecl)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !1057, file: !1058, line: 124, baseType: !46, size: 32, offset: 19008)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !1057, file: !1058, line: 127, baseType: !1107, size: 64, offset: 19072)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !1057, file: !1058, line: 128, baseType: !5, size: 32, offset: 19136)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !1057, file: !1058, line: 129, baseType: !5, size: 32, offset: 19168)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !1057, file: !1058, line: 132, baseType: !1111, size: 64, offset: 19200)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !1058, line: 132, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !1057, file: !1058, line: 133, baseType: !1111, size: 64, offset: 19264)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !1057, file: !1058, line: 134, baseType: !1069, size: 64, offset: 19328)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !1057, file: !1058, line: 135, baseType: !1116, size: 64, offset: 19392)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !1058, line: 135, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !1057, file: !1058, line: 136, baseType: !46, size: 32, offset: 19456)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !1057, file: !1058, line: 137, baseType: !1120, size: 128, offset: 19488)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1121, line: 89, baseType: !1122)
!1121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1121, line: 86, size: 128, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1122, file: !1121, line: 87, baseType: !46, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1122, file: !1121, line: 87, baseType: !46, size: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1122, file: !1121, line: 88, baseType: !46, size: 32, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1122, file: !1121, line: 88, baseType: !46, size: 32, offset: 96)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !1057, file: !1058, line: 140, baseType: !1129, size: 192, offset: 19648)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !1058, line: 55, size: 192, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !1129, file: !1058, line: 56, baseType: !5, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !1129, file: !1058, line: 57, baseType: !5, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !1058, line: 58, baseType: !1107, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !1058, line: 59, baseType: !5, size: 32, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !1058, line: 141, baseType: !1057)
!1137 = !DILocalVariable(name: "tracking", arg: 1, scope: !1053, file: !1, line: 309, type: !37)
!1138 = !DILocation(line: 309, column: 52, scope: !1053)
!1139 = !DILocalVariable(name: "framenr", arg: 2, scope: !1053, file: !1, line: 309, type: !46)
!1140 = !DILocation(line: 309, column: 66, scope: !1053)
!1141 = !DILocalVariable(name: "ibuf", arg: 3, scope: !1053, file: !1, line: 309, type: !1135)
!1142 = !DILocation(line: 309, column: 82, scope: !1053)
!1143 = !DILocalVariable(name: "translation", arg: 4, scope: !1053, file: !1, line: 310, type: !238)
!1144 = !DILocation(line: 310, column: 43, scope: !1053)
!1145 = !DILocalVariable(name: "scale", arg: 5, scope: !1053, file: !1, line: 310, type: !238)
!1146 = !DILocation(line: 310, column: 66, scope: !1053)
!1147 = !DILocalVariable(name: "angle", arg: 6, scope: !1053, file: !1, line: 310, type: !238)
!1148 = !DILocation(line: 310, column: 80, scope: !1053)
!1149 = !DILocalVariable(name: "tloc", scope: !1053, file: !1, line: 312, type: !85)
!1150 = !DILocation(line: 312, column: 8, scope: !1053)
!1151 = !DILocalVariable(name: "tscale", scope: !1053, file: !1, line: 312, type: !29)
!1152 = !DILocation(line: 312, column: 17, scope: !1053)
!1153 = !DILocalVariable(name: "tangle", scope: !1053, file: !1, line: 312, type: !29)
!1154 = !DILocation(line: 312, column: 25, scope: !1053)
!1155 = !DILocalVariable(name: "stab", scope: !1053, file: !1, line: 313, type: !259)
!1156 = !DILocation(line: 313, column: 30, scope: !1053)
!1157 = !DILocation(line: 313, column: 38, scope: !1053)
!1158 = !DILocation(line: 313, column: 48, scope: !1053)
!1159 = !DILocalVariable(name: "tmpibuf", scope: !1053, file: !1, line: 314, type: !1135)
!1160 = !DILocation(line: 314, column: 9, scope: !1053)
!1161 = !DILocalVariable(name: "width", scope: !1053, file: !1, line: 315, type: !46)
!1162 = !DILocation(line: 315, column: 6, scope: !1053)
!1163 = !DILocation(line: 315, column: 14, scope: !1053)
!1164 = !DILocation(line: 315, column: 20, scope: !1053)
!1165 = !DILocalVariable(name: "height", scope: !1053, file: !1, line: 315, type: !46)
!1166 = !DILocation(line: 315, column: 23, scope: !1053)
!1167 = !DILocation(line: 315, column: 32, scope: !1053)
!1168 = !DILocation(line: 315, column: 38, scope: !1053)
!1169 = !DILocalVariable(name: "aspect", scope: !1053, file: !1, line: 316, type: !29)
!1170 = !DILocation(line: 316, column: 8, scope: !1053)
!1171 = !DILocation(line: 316, column: 17, scope: !1053)
!1172 = !DILocation(line: 316, column: 27, scope: !1053)
!1173 = !DILocation(line: 316, column: 34, scope: !1053)
!1174 = !DILocalVariable(name: "mat", scope: !1053, file: !1, line: 317, type: !116)
!1175 = !DILocation(line: 317, column: 8, scope: !1053)
!1176 = !DILocalVariable(name: "j", scope: !1053, file: !1, line: 318, type: !46)
!1177 = !DILocation(line: 318, column: 6, scope: !1053)
!1178 = !DILocalVariable(name: "filter", scope: !1053, file: !1, line: 318, type: !46)
!1179 = !DILocation(line: 318, column: 9, scope: !1053)
!1180 = !DILocation(line: 318, column: 18, scope: !1053)
!1181 = !DILocation(line: 318, column: 28, scope: !1053)
!1182 = !DILocation(line: 318, column: 42, scope: !1053)
!1183 = !DILocalVariable(name: "interpolation", scope: !1053, file: !1, line: 319, type: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !1056, !1056, !29, !29, !46, !46}
!1187 = !DILocation(line: 319, column: 9, scope: !1053)
!1188 = !DILocalVariable(name: "ibuf_flags", scope: !1053, file: !1, line: 320, type: !46)
!1189 = !DILocation(line: 320, column: 6, scope: !1053)
!1190 = !DILocation(line: 322, column: 6, scope: !1191)
