; ModuleID = 'blender/source/blender/editors/curve/curve_ops.c'
source_filename = "blender/source/blender/editors/curve/curve_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!256 = !DIEnumerator(name: "TFM_DEPRECATED", value: 25)
!257 = !DIEnumerator(name: "TFM_BWEIGHT", value: 26)
!258 = !DIEnumerator(name: "TFM_ALIGN", value: 27)
!259 = !DIEnumerator(name: "TFM_EDGE_SLIDE", value: 28)
!260 = !DIEnumerator(name: "TFM_VERT_SLIDE", value: 29)
!261 = !DIEnumerator(name: "TFM_SEQ_SLIDE", value: 30)
!262 = !{i32 7, !"Dwarf Version", i32 4}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{i32 1, !"wchar_size", i32 4}
!265 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!266 = distinct !DISubprogram(name: "ED_operatortypes_curve", scope: !1, file: !1, line: 57, type: !267, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{null}
!269 = !{}
!270 = !DILocation(line: 59, column: 2, scope: !266)
!271 = !DILocation(line: 60, column: 2, scope: !266)
!272 = !DILocation(line: 61, column: 2, scope: !266)
!273 = !DILocation(line: 63, column: 2, scope: !266)
!274 = !DILocation(line: 64, column: 2, scope: !266)
!275 = !DILocation(line: 65, column: 2, scope: !266)
!276 = !DILocation(line: 66, column: 2, scope: !266)
!277 = !DILocation(line: 68, column: 2, scope: !266)
!278 = !DILocation(line: 70, column: 2, scope: !266)
!279 = !DILocation(line: 71, column: 2, scope: !266)
!280 = !DILocation(line: 72, column: 2, scope: !266)
!281 = !DILocation(line: 73, column: 2, scope: !266)
!282 = !DILocation(line: 74, column: 2, scope: !266)
!283 = !DILocation(line: 76, column: 2, scope: !266)
!284 = !DILocation(line: 77, column: 2, scope: !266)
!285 = !DILocation(line: 78, column: 2, scope: !266)
!286 = !DILocation(line: 80, column: 2, scope: !266)
!287 = !DILocation(line: 81, column: 2, scope: !266)
!288 = !DILocation(line: 83, column: 2, scope: !266)
!289 = !DILocation(line: 84, column: 2, scope: !266)
!290 = !DILocation(line: 86, column: 2, scope: !266)
!291 = !DILocation(line: 87, column: 2, scope: !266)
!292 = !DILocation(line: 89, column: 2, scope: !266)
!293 = !DILocation(line: 90, column: 2, scope: !266)
!294 = !DILocation(line: 92, column: 2, scope: !266)
!295 = !DILocation(line: 93, column: 2, scope: !266)
!296 = !DILocation(line: 94, column: 2, scope: !266)
!297 = !DILocation(line: 95, column: 2, scope: !266)
!298 = !DILocation(line: 97, column: 2, scope: !266)
!299 = !DILocation(line: 98, column: 2, scope: !266)
!300 = !DILocation(line: 99, column: 2, scope: !266)
!301 = !DILocation(line: 100, column: 2, scope: !266)
!302 = !DILocation(line: 101, column: 2, scope: !266)
!303 = !DILocation(line: 102, column: 2, scope: !266)
!304 = !DILocation(line: 103, column: 2, scope: !266)
!305 = !DILocation(line: 104, column: 2, scope: !266)
!306 = !DILocation(line: 106, column: 2, scope: !266)
!307 = !DILocation(line: 107, column: 2, scope: !266)
!308 = !DILocation(line: 108, column: 2, scope: !266)
!309 = !DILocation(line: 109, column: 2, scope: !266)
!310 = !DILocation(line: 110, column: 2, scope: !266)
!311 = !DILocation(line: 112, column: 2, scope: !266)
!312 = !DILocation(line: 113, column: 2, scope: !266)
!313 = !DILocation(line: 114, column: 2, scope: !266)
!314 = !DILocation(line: 115, column: 2, scope: !266)
!315 = !DILocation(line: 116, column: 2, scope: !266)
!316 = !DILocation(line: 117, column: 2, scope: !266)
!317 = !DILocation(line: 119, column: 2, scope: !266)
!318 = !DILocation(line: 120, column: 2, scope: !266)
!319 = !DILocation(line: 121, column: 2, scope: !266)
!320 = !DILocation(line: 122, column: 2, scope: !266)
!321 = !DILocation(line: 124, column: 2, scope: !266)
!322 = !DILocation(line: 125, column: 2, scope: !266)
!323 = !DILocation(line: 126, column: 2, scope: !266)
!324 = !DILocation(line: 127, column: 2, scope: !266)
!325 = !DILocation(line: 128, column: 2, scope: !266)
!326 = !DILocation(line: 129, column: 2, scope: !266)
!327 = !DILocation(line: 130, column: 2, scope: !266)
!328 = !DILocation(line: 131, column: 2, scope: !266)
!329 = !DILocation(line: 132, column: 2, scope: !266)
!330 = !DILocation(line: 133, column: 2, scope: !266)
!331 = !DILocation(line: 134, column: 2, scope: !266)
!332 = !DILocation(line: 135, column: 2, scope: !266)
!333 = !DILocation(line: 137, column: 2, scope: !266)
!334 = !DILocation(line: 138, column: 2, scope: !266)
!335 = !DILocation(line: 139, column: 2, scope: !266)
!336 = !DILocation(line: 140, column: 2, scope: !266)
!337 = !DILocation(line: 141, column: 2, scope: !266)
!338 = !DILocation(line: 142, column: 2, scope: !266)
!339 = !DILocation(line: 143, column: 2, scope: !266)
!340 = !DILocation(line: 145, column: 2, scope: !266)
!341 = !DILocation(line: 146, column: 1, scope: !266)
!342 = distinct !DISubprogram(name: "ED_operatormacros_curve", scope: !1, file: !1, line: 148, type: !267, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !269)
!343 = !DILocalVariable(name: "ot", scope: !342, file: !1, line: 150, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !346, line: 568, baseType: !347)
!346 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !346, line: 508, size: 1536, elements: !348)
!348 = !{!349, !353, !354, !355, !356, !1803, !1807, !1813, !1817, !1818, !1822, !1823, !1824, !1825, !1829, !1830, !1845, !1846, !1850, !1876}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !346, line: 509, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !347, file: !346, line: 510, baseType: !350, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !347, file: !346, line: 511, baseType: !350, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !347, file: !346, line: 512, baseType: !350, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !347, file: !346, line: 518, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!228, !360, !363}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !362, line: 44, flags: DIFlagFwdDecl)
!362 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !365, line: 328, size: 1344, elements: !366)
!365 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!366 = !{!367, !368, !369, !373, !405, !407, !408, !409, !421, !1796, !1797, !1798, !1801, !1802}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !365, line: 329, baseType: !363, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !364, file: !365, line: 329, baseType: !363, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !364, file: !365, line: 332, baseType: !370, size: 512, offset: 128)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 512, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !364, file: !365, line: 333, baseType: !374, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !376, line: 75, baseType: !377)
!376 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !376, line: 62, size: 1024, elements: !378)
!378 = !{!379, !381, !382, !383, !384, !386, !387, !388, !403, !404}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !376, line: 63, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !377, file: !376, line: 63, baseType: !380, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !376, line: 64, baseType: !352, size: 8, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !377, file: !376, line: 64, baseType: !352, size: 8, offset: 136)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !377, file: !376, line: 65, baseType: !385, size: 16, offset: 144)
!385 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !376, line: 66, baseType: !370, size: 512, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !377, file: !376, line: 67, baseType: !228, size: 32, offset: 672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !377, file: !376, line: 69, baseType: !389, size: 256, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !376, line: 60, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !376, line: 48, size: 256, elements: !391)
!391 = !{!392, !394, !401, !402}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !390, file: !376, line: 49, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !390, file: !376, line: 58, baseType: !395, size: 128, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !396, line: 71, baseType: !397)
!396 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !396, line: 69, size: 128, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !397, file: !396, line: 70, baseType: !393, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !397, file: !396, line: 70, baseType: !393, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !390, file: !376, line: 59, baseType: !228, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !390, file: !376, line: 59, baseType: !228, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !377, file: !376, line: 70, baseType: !228, size: 32, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !377, file: !376, line: 74, baseType: !228, size: 32, offset: 992)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !365, line: 336, baseType: !406, size: 64, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !364, file: !365, line: 337, baseType: !393, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !364, file: !365, line: 338, baseType: !393, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !364, file: !365, line: 340, baseType: !410, size: 64, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !362, line: 55, size: 192, elements: !412)
!412 = !{!413, !417, !420}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !411, file: !362, line: 58, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !362, line: 56, size: 64, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !414, file: !362, line: 57, baseType: !393, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !362, line: 60, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !362, line: 41, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !362, line: 61, baseType: !393, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !364, file: !365, line: 341, baseType: !422, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !365, line: 106, size: 320, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !423, file: !365, line: 107, baseType: !395, size: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !423, file: !365, line: 108, baseType: !228, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !423, file: !365, line: 109, baseType: !228, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !423, file: !365, line: 110, baseType: !228, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !423, file: !365, line: 110, baseType: !228, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !423, file: !365, line: 111, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !346, line: 490, size: 768, elements: !433)
!433 = !{!434, !435, !436, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !432, file: !346, line: 491, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !432, file: !346, line: 491, baseType: !431, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !432, file: !346, line: 493, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !365, line: 169, size: 2048, elements: !439)
!439 = !{!440, !441, !442, !443, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1762, !1765, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !365, line: 170, baseType: !437, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !365, line: 170, baseType: !437, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !438, file: !365, line: 172, baseType: !393, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !438, file: !365, line: 174, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !446, line: 49, size: 1984, elements: !447)
!446 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!447 = !{!448, !484, !485, !486, !487, !488, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !445, file: !446, line: 50, baseType: !449, size: 960)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !376, line: 130, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !376, line: 117, size: 960, elements: !451)
!451 = !{!452, !453, !454, !456, !475, !479, !480, !481, !482, !483}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !376, line: 118, baseType: !393, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !376, line: 118, baseType: !393, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !450, file: !376, line: 119, baseType: !455, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !450, file: !376, line: 120, baseType: !457, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !376, line: 136, size: 17600, elements: !459)
!459 = !{!460, !461, !463, !466, !470, !471, !472}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !458, file: !376, line: 137, baseType: !449, size: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !458, file: !376, line: 138, baseType: !462, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !458, file: !376, line: 139, baseType: !464, size: 64, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !376, line: 43, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !376, line: 140, baseType: !467, size: 8192, offset: 1088)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 8192, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !458, file: !376, line: 141, baseType: !467, size: 8192, offset: 9280)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !458, file: !376, line: 148, baseType: !457, size: 64, offset: 17472)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !458, file: !376, line: 150, baseType: !473, size: 64, offset: 17536)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !376, line: 45, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !376, line: 121, baseType: !476, size: 528, offset: 256)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 528, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 66)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !376, line: 126, baseType: !385, size: 16, offset: 784)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !450, file: !376, line: 127, baseType: !228, size: 32, offset: 800)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !450, file: !376, line: 128, baseType: !228, size: 32, offset: 832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !450, file: !376, line: 128, baseType: !228, size: 32, offset: 864)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !450, file: !376, line: 129, baseType: !374, size: 64, offset: 896)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !445, file: !446, line: 52, baseType: !395, size: 128, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !445, file: !446, line: 53, baseType: !395, size: 128, offset: 1088)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !445, file: !446, line: 54, baseType: !395, size: 128, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !445, file: !446, line: 55, baseType: !395, size: 128, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !445, file: !446, line: 57, baseType: !489, size: 64, offset: 1472)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !491, line: 1216, size: 39680, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !498, !501, !504, !505, !506, !518, !519, !524, !525, !526, !527, !528, !529, !530, !531, !532, !536, !613, !1050, !1265, !1268, !1557, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1579, !1580, !1581, !1582, !1583, !1591, !1658, !1665, !1666, !1673, !1674, !1680, !1681, !1682, !1683, !1684}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !491, line: 1217, baseType: !449, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !490, file: !491, line: 1218, baseType: !495, size: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !497, line: 48, flags: DIFlagFwdDecl)
!497 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !490, file: !491, line: 1220, baseType: !499, size: 64, offset: 1024)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !497, line: 43, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !490, file: !491, line: 1221, baseType: !502, size: 64, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !491, line: 52, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !490, file: !491, line: 1223, baseType: !489, size: 64, offset: 1152)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !490, file: !491, line: 1225, baseType: !395, size: 128, offset: 1216)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !490, file: !491, line: 1226, baseType: !507, size: 64, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !491, line: 69, size: 320, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !491, line: 70, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !508, file: !491, line: 70, baseType: !507, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !508, file: !491, line: 71, baseType: !5, size: 32, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !508, file: !491, line: 71, baseType: !5, size: 32, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !508, file: !491, line: 72, baseType: !228, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !508, file: !491, line: 73, baseType: !385, size: 16, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !508, file: !491, line: 73, baseType: !385, size: 16, offset: 240)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !508, file: !491, line: 74, baseType: !499, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !490, file: !491, line: 1227, baseType: !499, size: 64, offset: 1408)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !490, file: !491, line: 1229, baseType: !520, size: 96, offset: 1472)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 96, elements: !522)
!521 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!522 = !{!523}
!523 = !DISubrange(count: 3)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !490, file: !491, line: 1230, baseType: !520, size: 96, offset: 1568)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !490, file: !491, line: 1231, baseType: !520, size: 96, offset: 1664)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !490, file: !491, line: 1231, baseType: !520, size: 96, offset: 1760)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !490, file: !491, line: 1233, baseType: !5, size: 32, offset: 1856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !490, file: !491, line: 1234, baseType: !228, size: 32, offset: 1888)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !490, file: !491, line: 1235, baseType: !5, size: 32, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 1237, baseType: !385, size: 16, offset: 1952)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !490, file: !491, line: 1239, baseType: !352, size: 8, offset: 1968)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !491, line: 1240, baseType: !533, size: 8, offset: 1976)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 8, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 1)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !490, file: !491, line: 1242, baseType: !537, size: 64, offset: 1984)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !539, line: 328, size: 3456, elements: !540)
!539 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!540 = !{!541, !542, !543, !546, !547, !548, !551, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !578, !579, !580, !583, !588, !589, !592, !596, !601, !605, !609, !610, !611, !612}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !538, file: !539, line: 329, baseType: !449, size: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !538, file: !539, line: 330, baseType: !495, size: 64, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !538, file: !539, line: 332, baseType: !544, size: 64, offset: 1024)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !539, line: 332, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !538, file: !539, line: 333, baseType: !370, size: 512, offset: 1088)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !538, file: !539, line: 335, baseType: !418, size: 64, offset: 1600)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !538, file: !539, line: 337, baseType: !549, size: 64, offset: 1664)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !491, line: 61, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !538, file: !539, line: 338, baseType: !552, size: 64, offset: 1728)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 64, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 2)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !538, file: !539, line: 340, baseType: !395, size: 128, offset: 1792)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !538, file: !539, line: 340, baseType: !395, size: 128, offset: 1920)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !538, file: !539, line: 342, baseType: !228, size: 32, offset: 2048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !538, file: !539, line: 342, baseType: !228, size: 32, offset: 2080)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !538, file: !539, line: 343, baseType: !228, size: 32, offset: 2112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !539, line: 345, baseType: !228, size: 32, offset: 2144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !538, file: !539, line: 346, baseType: !228, size: 32, offset: 2176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !538, file: !539, line: 347, baseType: !385, size: 16, offset: 2208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !538, file: !539, line: 348, baseType: !385, size: 16, offset: 2224)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !538, file: !539, line: 349, baseType: !228, size: 32, offset: 2240)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !538, file: !539, line: 351, baseType: !228, size: 32, offset: 2272)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !538, file: !539, line: 353, baseType: !385, size: 16, offset: 2304)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !538, file: !539, line: 354, baseType: !385, size: 16, offset: 2320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !538, file: !539, line: 355, baseType: !228, size: 32, offset: 2336)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !538, file: !539, line: 357, baseType: !570, size: 128, offset: 2368)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !571, line: 95, baseType: !572)
!571 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !571, line: 92, size: 128, elements: !573)
!573 = !{!574, !575, !576, !577}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !572, file: !571, line: 93, baseType: !521, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !572, file: !571, line: 93, baseType: !521, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !572, file: !571, line: 94, baseType: !521, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !572, file: !571, line: 94, baseType: !521, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !538, file: !539, line: 363, baseType: !395, size: 128, offset: 2496)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !538, file: !539, line: 363, baseType: !395, size: 128, offset: 2624)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !538, file: !539, line: 368, baseType: !581, size: 64, offset: 2752)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !539, line: 48, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !538, file: !539, line: 372, baseType: !584, size: 32, offset: 2816)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !539, line: 274, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !539, line: 271, size: 32, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !585, file: !539, line: 273, baseType: !5, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !538, file: !539, line: 373, baseType: !228, size: 32, offset: 2848)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !538, file: !539, line: 382, baseType: !590, size: 64, offset: 2880)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !539, line: 46, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !538, file: !539, line: 385, baseType: !593, size: 64, offset: 2944)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !393, !521}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !538, file: !539, line: 386, baseType: !597, size: 64, offset: 3008)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !393, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !538, file: !539, line: 387, baseType: !602, size: 64, offset: 3072)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!228, !393}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !538, file: !539, line: 388, baseType: !606, size: 64, offset: 3136)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !393}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !538, file: !539, line: 389, baseType: !393, size: 64, offset: 3200)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !538, file: !539, line: 389, baseType: !393, size: 64, offset: 3264)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !538, file: !539, line: 389, baseType: !393, size: 64, offset: 3328)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !538, file: !539, line: 389, baseType: !393, size: 64, offset: 3392)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !490, file: !491, line: 1244, baseType: !614, size: 64, offset: 2048)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !616, line: 200, size: 17024, elements: !617)
!616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !{!618, !620, !621, !622, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !615, file: !616, line: 201, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !615, file: !616, line: 202, baseType: !395, size: 128, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !615, file: !616, line: 203, baseType: !395, size: 128, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !615, file: !616, line: 206, baseType: !623, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !616, line: 190, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !616, line: 126, size: 2816, elements: !626)
!626 = !{!627, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !726, !729, !730, !731, !1015, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1042}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !625, file: !616, line: 127, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !625, file: !616, line: 127, baseType: !628, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !625, file: !616, line: 128, baseType: !393, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !625, file: !616, line: 129, baseType: !393, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !616, line: 130, baseType: !370, size: 512, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !616, line: 132, baseType: !228, size: 32, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !625, file: !616, line: 132, baseType: !228, size: 32, offset: 800)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !625, file: !616, line: 133, baseType: !228, size: 32, offset: 832)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !625, file: !616, line: 134, baseType: !228, size: 32, offset: 864)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !625, file: !616, line: 134, baseType: !228, size: 32, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !625, file: !616, line: 134, baseType: !228, size: 32, offset: 928)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !625, file: !616, line: 135, baseType: !228, size: 32, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !625, file: !616, line: 135, baseType: !228, size: 32, offset: 992)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !625, file: !616, line: 136, baseType: !228, size: 32, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !625, file: !616, line: 136, baseType: !228, size: 32, offset: 1056)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !625, file: !616, line: 137, baseType: !228, size: 32, offset: 1088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !625, file: !616, line: 137, baseType: !228, size: 32, offset: 1120)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !625, file: !616, line: 138, baseType: !521, size: 32, offset: 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !625, file: !616, line: 139, baseType: !521, size: 32, offset: 1184)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !625, file: !616, line: 139, baseType: !521, size: 32, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !625, file: !616, line: 141, baseType: !385, size: 16, offset: 1248)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !625, file: !616, line: 142, baseType: !385, size: 16, offset: 1264)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !625, file: !616, line: 143, baseType: !228, size: 32, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !625, file: !616, line: 144, baseType: !228, size: 32, offset: 1312)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !625, file: !616, line: 146, baseType: !653, size: 64, offset: 1344)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !616, line: 114, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !616, line: 99, size: 7232, elements: !656)
!656 = !{!657, !659, !660, !661, !662, !663, !664, !675, !679, !694, !703, !710, !720}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !616, line: 100, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !655, file: !616, line: 100, baseType: !658, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !655, file: !616, line: 101, baseType: !228, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !655, file: !616, line: 101, baseType: !228, size: 32, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !655, file: !616, line: 102, baseType: !228, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !655, file: !616, line: 102, baseType: !228, size: 32, offset: 224)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !655, file: !616, line: 103, baseType: !665, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !616, line: 59, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !616, line: 56, size: 2112, elements: !668)
!668 = !{!669, !673, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !616, line: 57, baseType: !670, size: 2048)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 2048, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !667, file: !616, line: 58, baseType: !228, size: 32, offset: 2048)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !667, file: !616, line: 58, baseType: !228, size: 32, offset: 2080)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !655, file: !616, line: 106, baseType: !676, size: 6144, offset: 320)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 6144, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !655, file: !616, line: 107, baseType: !680, size: 64, offset: 6464)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !616, line: 97, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !616, line: 83, size: 8320, elements: !683)
!683 = !{!684, !685, !686, !690, !691, !692, !693}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !682, file: !616, line: 84, baseType: !676, size: 6144)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !682, file: !616, line: 87, baseType: !670, size: 2048, offset: 6144)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !682, file: !616, line: 88, baseType: !687, size: 64, offset: 8192)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !689, line: 41, flags: DIFlagFwdDecl)
!689 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !682, file: !616, line: 90, baseType: !385, size: 16, offset: 8256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !682, file: !616, line: 92, baseType: !385, size: 16, offset: 8272)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !682, file: !616, line: 93, baseType: !385, size: 16, offset: 8288)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !682, file: !616, line: 95, baseType: !385, size: 16, offset: 8304)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !655, file: !616, line: 108, baseType: !695, size: 64, offset: 6528)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !616, line: 66, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !616, line: 61, size: 128, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !697, file: !616, line: 62, baseType: !228, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !697, file: !616, line: 63, baseType: !228, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !697, file: !616, line: 64, baseType: !228, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !697, file: !616, line: 65, baseType: !228, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !655, file: !616, line: 109, baseType: !704, size: 64, offset: 6592)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !616, line: 71, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !616, line: 68, size: 64, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !706, file: !616, line: 69, baseType: !228, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !706, file: !616, line: 70, baseType: !228, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !655, file: !616, line: 110, baseType: !711, size: 64, offset: 6656)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !616, line: 81, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !616, line: 73, size: 352, elements: !714)
!714 = !{!715, !716, !717, !718, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !713, file: !616, line: 74, baseType: !520, size: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !713, file: !616, line: 75, baseType: !520, size: 96, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !713, file: !616, line: 76, baseType: !520, size: 96, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !713, file: !616, line: 77, baseType: !228, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !713, file: !616, line: 78, baseType: !228, size: 32, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !655, file: !616, line: 113, baseType: !721, size: 512, offset: 6720)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !722, line: 182, baseType: !723)
!722 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !722, line: 180, size: 512, elements: !724)
!724 = !{!725}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !722, line: 181, baseType: !370, size: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !625, file: !616, line: 148, baseType: !727, size: 64, offset: 1408)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !497, line: 44, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !625, file: !616, line: 151, baseType: !489, size: 64, offset: 1472)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !625, file: !616, line: 152, baseType: !499, size: 64, offset: 1536)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !625, file: !616, line: 153, baseType: !732, size: 64, offset: 1600)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !734, line: 64, size: 19136, elements: !735)
!734 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!735 = !{!736, !737, !738, !739, !740, !741, !743, !744, !745, !746, !749, !750, !1001, !1002, !1010, !1011, !1012, !1013, !1014}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !733, file: !734, line: 65, baseType: !449, size: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !733, file: !734, line: 66, baseType: !495, size: 64, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !733, file: !734, line: 68, baseType: !467, size: 8192, offset: 1024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !733, file: !734, line: 70, baseType: !228, size: 32, offset: 9216)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !733, file: !734, line: 71, baseType: !228, size: 32, offset: 9248)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !733, file: !734, line: 72, baseType: !742, size: 64, offset: 9280)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 64, elements: !553)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !733, file: !734, line: 74, baseType: !521, size: 32, offset: 9344)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !733, file: !734, line: 74, baseType: !521, size: 32, offset: 9376)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !733, file: !734, line: 76, baseType: !687, size: 64, offset: 9408)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !733, file: !734, line: 77, baseType: !747, size: 64, offset: 9472)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !734, line: 77, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !733, file: !734, line: 78, baseType: !549, size: 64, offset: 9536)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !733, file: !734, line: 80, baseType: !751, size: 2624, offset: 9600)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !752, line: 340, size: 2624, elements: !753)
!752 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!753 = !{!754, !782, !800, !801, !802, !820, !878, !879, !981, !982, !983, !984, !990}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !751, file: !752, line: 341, baseType: !755, size: 576)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !752, line: 251, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !752, line: 207, size: 576, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !756, file: !752, line: 208, baseType: !228, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !756, file: !752, line: 211, baseType: !385, size: 16, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !756, file: !752, line: 212, baseType: !385, size: 16, offset: 48)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !756, file: !752, line: 213, baseType: !521, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !756, file: !752, line: 214, baseType: !385, size: 16, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !756, file: !752, line: 215, baseType: !385, size: 16, offset: 112)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !756, file: !752, line: 216, baseType: !385, size: 16, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !756, file: !752, line: 217, baseType: !385, size: 16, offset: 144)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !756, file: !752, line: 218, baseType: !385, size: 16, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !756, file: !752, line: 219, baseType: !385, size: 16, offset: 176)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !756, file: !752, line: 220, baseType: !521, size: 32, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !756, file: !752, line: 222, baseType: !385, size: 16, offset: 224)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !756, file: !752, line: 225, baseType: !385, size: 16, offset: 240)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !756, file: !752, line: 228, baseType: !228, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !756, file: !752, line: 229, baseType: !228, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !756, file: !752, line: 233, baseType: !228, size: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !756, file: !752, line: 236, baseType: !385, size: 16, offset: 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !756, file: !752, line: 236, baseType: !385, size: 16, offset: 368)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !756, file: !752, line: 241, baseType: !521, size: 32, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !756, file: !752, line: 244, baseType: !228, size: 32, offset: 416)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !756, file: !752, line: 244, baseType: !228, size: 32, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !756, file: !752, line: 245, baseType: !521, size: 32, offset: 480)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !756, file: !752, line: 248, baseType: !521, size: 32, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !756, file: !752, line: 250, baseType: !228, size: 32, offset: 544)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !751, file: !752, line: 342, baseType: !783, size: 448, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !752, line: 79, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !752, line: 61, size: 448, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !784, file: !752, line: 62, baseType: !393, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !784, file: !752, line: 64, baseType: !385, size: 16, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !784, file: !752, line: 65, baseType: !385, size: 16, offset: 80)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !784, file: !752, line: 67, baseType: !521, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !784, file: !752, line: 68, baseType: !521, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !784, file: !752, line: 69, baseType: !521, size: 32, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !784, file: !752, line: 70, baseType: !385, size: 16, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !784, file: !752, line: 71, baseType: !385, size: 16, offset: 208)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !784, file: !752, line: 72, baseType: !552, size: 64, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !784, file: !752, line: 75, baseType: !521, size: 32, offset: 288)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !784, file: !752, line: 75, baseType: !521, size: 32, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !784, file: !752, line: 75, baseType: !521, size: 32, offset: 352)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !784, file: !752, line: 78, baseType: !521, size: 32, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !784, file: !752, line: 78, baseType: !521, size: 32, offset: 416)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !751, file: !752, line: 343, baseType: !395, size: 128, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !751, file: !752, line: 344, baseType: !395, size: 128, offset: 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !751, file: !752, line: 345, baseType: !803, size: 192, offset: 1280)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !752, line: 278, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !752, line: 270, size: 192, elements: !805)
!805 = !{!806, !807, !808, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !804, file: !752, line: 271, baseType: !228, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !804, file: !752, line: 273, baseType: !521, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !804, file: !752, line: 275, baseType: !228, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !804, file: !752, line: 276, baseType: !228, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !804, file: !752, line: 277, baseType: !811, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !752, line: 55, size: 576, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !812, file: !752, line: 56, baseType: !228, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !812, file: !752, line: 57, baseType: !521, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !812, file: !752, line: 58, baseType: !817, size: 512, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 512, elements: !818)
!818 = !{!819, !819}
!819 = !DISubrange(count: 4)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !751, file: !752, line: 346, baseType: !821, size: 384, offset: 1472)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !752, line: 268, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !752, line: 253, size: 384, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !872, !873, !874, !875, !876, !877}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !822, file: !752, line: 254, baseType: !228, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !822, file: !752, line: 255, baseType: !228, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !822, file: !752, line: 255, baseType: !228, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !822, file: !752, line: 258, baseType: !521, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !822, file: !752, line: 259, baseType: !829, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !752, line: 164, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !752, line: 108, size: 1664, elements: !832)
!832 = !{!833, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !831, file: !752, line: 109, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !831, file: !752, line: 109, baseType: !834, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !831, file: !752, line: 111, baseType: !370, size: 512, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !831, file: !752, line: 119, baseType: !552, size: 64, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !831, file: !752, line: 119, baseType: !552, size: 64, offset: 704)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !831, file: !752, line: 125, baseType: !552, size: 64, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !831, file: !752, line: 125, baseType: !552, size: 64, offset: 832)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !831, file: !752, line: 127, baseType: !552, size: 64, offset: 896)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !831, file: !752, line: 130, baseType: !228, size: 32, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !831, file: !752, line: 131, baseType: !228, size: 32, offset: 992)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !831, file: !752, line: 132, baseType: !845, size: 64, offset: 1024)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !752, line: 106, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !752, line: 81, size: 512, elements: !848)
!848 = !{!849, !850, !853, !854, !855, !856}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !847, file: !752, line: 82, baseType: !552, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !847, file: !752, line: 97, baseType: !851, size: 256, offset: 64)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 256, elements: !852)
!852 = !{!819, !554}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !847, file: !752, line: 102, baseType: !552, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !847, file: !752, line: 102, baseType: !552, size: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !847, file: !752, line: 104, baseType: !228, size: 32, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !847, file: !752, line: 105, baseType: !228, size: 32, offset: 480)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !831, file: !752, line: 135, baseType: !520, size: 96, offset: 1088)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !831, file: !752, line: 136, baseType: !521, size: 32, offset: 1184)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !831, file: !752, line: 139, baseType: !228, size: 32, offset: 1216)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !831, file: !752, line: 139, baseType: !228, size: 32, offset: 1248)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !831, file: !752, line: 139, baseType: !228, size: 32, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !831, file: !752, line: 140, baseType: !520, size: 96, offset: 1312)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !831, file: !752, line: 143, baseType: !385, size: 16, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !831, file: !752, line: 144, baseType: !385, size: 16, offset: 1424)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !831, file: !752, line: 145, baseType: !385, size: 16, offset: 1440)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !831, file: !752, line: 148, baseType: !385, size: 16, offset: 1456)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !831, file: !752, line: 149, baseType: !228, size: 32, offset: 1472)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !831, file: !752, line: 150, baseType: !521, size: 32, offset: 1504)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !831, file: !752, line: 152, baseType: !549, size: 64, offset: 1536)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !831, file: !752, line: 163, baseType: !521, size: 32, offset: 1600)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !831, file: !752, line: 163, baseType: !521, size: 32, offset: 1632)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !822, file: !752, line: 261, baseType: !521, size: 32, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !822, file: !752, line: 261, baseType: !521, size: 32, offset: 224)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !822, file: !752, line: 261, baseType: !521, size: 32, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !822, file: !752, line: 263, baseType: !228, size: 32, offset: 288)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !822, file: !752, line: 266, baseType: !228, size: 32, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !822, file: !752, line: 267, baseType: !521, size: 32, offset: 352)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !751, file: !752, line: 347, baseType: !829, size: 64, offset: 1856)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !751, file: !752, line: 348, baseType: !880, size: 64, offset: 1920)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !752, line: 205, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !752, line: 186, size: 1024, elements: !883)
!883 = !{!884, !886, !887, !888, !890, !891, !892, !900, !901, !902, !979, !980}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !752, line: 187, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !882, file: !752, line: 187, baseType: !885, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !752, line: 189, baseType: !370, size: 512, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !882, file: !752, line: 191, baseType: !889, size: 64, offset: 640)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !882, file: !752, line: 193, baseType: !228, size: 32, offset: 704)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !882, file: !752, line: 193, baseType: !228, size: 32, offset: 736)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !882, file: !752, line: 195, baseType: !893, size: 64, offset: 768)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !752, line: 184, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !752, line: 166, size: 320, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !895, file: !752, line: 180, baseType: !851, size: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !895, file: !752, line: 182, baseType: !228, size: 32, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !895, file: !752, line: 183, baseType: !228, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !882, file: !752, line: 196, baseType: !228, size: 32, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !882, file: !752, line: 198, baseType: !228, size: 32, offset: 864)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !882, file: !752, line: 200, baseType: !903, size: 64, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !689, line: 77, size: 15424, elements: !905)
!905 = !{!906, !907, !908, !911, !914, !915, !918, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !938, !939, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !965, !966, !967, !968, !969, !973}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !904, file: !689, line: 78, baseType: !449, size: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !904, file: !689, line: 80, baseType: !467, size: 8192, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !904, file: !689, line: 82, baseType: !909, size: 64, offset: 9152)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !689, line: 43, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !904, file: !689, line: 83, baseType: !912, size: 64, offset: 9216)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !376, line: 46, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !904, file: !689, line: 86, baseType: !687, size: 64, offset: 9280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !904, file: !689, line: 87, baseType: !916, size: 64, offset: 9344)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !689, line: 44, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !904, file: !689, line: 89, baseType: !919, size: 512, offset: 9408)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 512, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 8)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !904, file: !689, line: 90, baseType: !385, size: 16, offset: 9920)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !904, file: !689, line: 90, baseType: !385, size: 16, offset: 9936)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !904, file: !689, line: 92, baseType: !385, size: 16, offset: 9952)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !904, file: !689, line: 92, baseType: !385, size: 16, offset: 9968)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !904, file: !689, line: 93, baseType: !385, size: 16, offset: 9984)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !904, file: !689, line: 93, baseType: !385, size: 16, offset: 10000)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !904, file: !689, line: 94, baseType: !228, size: 32, offset: 10016)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !904, file: !689, line: 97, baseType: !385, size: 16, offset: 10048)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !904, file: !689, line: 97, baseType: !385, size: 16, offset: 10064)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !904, file: !689, line: 98, baseType: !385, size: 16, offset: 10080)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !904, file: !689, line: 98, baseType: !385, size: 16, offset: 10096)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !904, file: !689, line: 99, baseType: !385, size: 16, offset: 10112)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !904, file: !689, line: 99, baseType: !385, size: 16, offset: 10128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !904, file: !689, line: 100, baseType: !5, size: 32, offset: 10144)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !904, file: !689, line: 101, baseType: !937, size: 64, offset: 10176)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !904, file: !689, line: 103, baseType: !473, size: 64, offset: 10240)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !904, file: !689, line: 104, baseType: !940, size: 64, offset: 10304)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !376, line: 159, size: 448, elements: !942)
!942 = !{!943, !945, !946, !948, !949, !951}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !941, file: !376, line: 161, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !553)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !941, file: !376, line: 162, baseType: !944, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !941, file: !376, line: 163, baseType: !947, size: 32, offset: 128)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 32, elements: !553)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !941, file: !376, line: 164, baseType: !947, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !941, file: !376, line: 165, baseType: !950, size: 128, offset: 192)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 128, elements: !553)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !941, file: !376, line: 166, baseType: !952, size: 128, offset: 320)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 128, elements: !553)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !904, file: !689, line: 107, baseType: !521, size: 32, offset: 10368)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !904, file: !689, line: 108, baseType: !228, size: 32, offset: 10400)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !904, file: !689, line: 109, baseType: !385, size: 16, offset: 10432)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !904, file: !689, line: 110, baseType: !385, size: 16, offset: 10448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !904, file: !689, line: 113, baseType: !228, size: 32, offset: 10464)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !904, file: !689, line: 113, baseType: !228, size: 32, offset: 10496)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !904, file: !689, line: 114, baseType: !352, size: 8, offset: 10528)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !904, file: !689, line: 114, baseType: !352, size: 8, offset: 10536)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !904, file: !689, line: 115, baseType: !385, size: 16, offset: 10544)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !904, file: !689, line: 116, baseType: !963, size: 128, offset: 10560)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 128, elements: !964)
!964 = !{!819}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !904, file: !689, line: 119, baseType: !521, size: 32, offset: 10688)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !904, file: !689, line: 119, baseType: !521, size: 32, offset: 10720)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !904, file: !689, line: 122, baseType: !721, size: 512, offset: 10752)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !904, file: !689, line: 123, baseType: !352, size: 8, offset: 11264)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !904, file: !689, line: 125, baseType: !970, size: 56, offset: 11272)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 56, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 7)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !904, file: !689, line: 126, baseType: !974, size: 4096, offset: 11328)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 4096, elements: !920)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !689, line: 69, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !689, line: 67, size: 512, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !976, file: !689, line: 68, baseType: !370, size: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !882, file: !752, line: 201, baseType: !521, size: 32, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !882, file: !752, line: 204, baseType: !228, size: 32, offset: 992)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !751, file: !752, line: 350, baseType: !395, size: 128, offset: 1984)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !751, file: !752, line: 351, baseType: !228, size: 32, offset: 2112)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !751, file: !752, line: 351, baseType: !228, size: 32, offset: 2144)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !751, file: !752, line: 353, baseType: !985, size: 64, offset: 2176)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !752, line: 297, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !752, line: 295, size: 2048, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !987, file: !752, line: 296, baseType: !670, size: 2048)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !751, file: !752, line: 355, baseType: !991, size: 384, offset: 2240)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !752, line: 338, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !752, line: 322, size: 384, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !992, file: !752, line: 323, baseType: !228, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !992, file: !752, line: 325, baseType: !385, size: 16, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !992, file: !752, line: 326, baseType: !385, size: 16, offset: 48)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !992, file: !752, line: 331, baseType: !395, size: 128, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !992, file: !752, line: 334, baseType: !395, size: 128, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !992, file: !752, line: 335, baseType: !228, size: 32, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !992, file: !752, line: 337, baseType: !228, size: 32, offset: 352)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !733, file: !734, line: 81, baseType: !393, size: 64, offset: 12224)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !733, file: !734, line: 85, baseType: !1003, size: 6208, offset: 12288)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !734, line: 55, size: 6208, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1003, file: !734, line: 56, baseType: !676, size: 6144)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1003, file: !734, line: 58, baseType: !385, size: 16, offset: 6144)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1003, file: !734, line: 59, baseType: !385, size: 16, offset: 6160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1003, file: !734, line: 60, baseType: !385, size: 16, offset: 6176)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1003, file: !734, line: 61, baseType: !385, size: 16, offset: 6192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !733, file: !734, line: 86, baseType: !228, size: 32, offset: 18496)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !733, file: !734, line: 88, baseType: !228, size: 32, offset: 18528)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !733, file: !734, line: 90, baseType: !228, size: 32, offset: 18560)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !733, file: !734, line: 94, baseType: !228, size: 32, offset: 18592)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !733, file: !734, line: 100, baseType: !721, size: 512, offset: 18624)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !625, file: !616, line: 154, baseType: !1016, size: 64, offset: 1664)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !616, line: 154, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !625, file: !616, line: 156, baseType: !687, size: 64, offset: 1728)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !625, file: !616, line: 158, baseType: !521, size: 32, offset: 1792)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !625, file: !616, line: 159, baseType: !521, size: 32, offset: 1824)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !625, file: !616, line: 162, baseType: !628, size: 64, offset: 1856)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !625, file: !616, line: 162, baseType: !628, size: 64, offset: 1920)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !625, file: !616, line: 162, baseType: !628, size: 64, offset: 1984)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !625, file: !616, line: 164, baseType: !395, size: 128, offset: 2048)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !625, file: !616, line: 166, baseType: !1026, size: 64, offset: 2176)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !616, line: 51, flags: DIFlagFwdDecl)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !625, file: !616, line: 167, baseType: !393, size: 64, offset: 2240)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !625, file: !616, line: 168, baseType: !521, size: 32, offset: 2304)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !625, file: !616, line: 170, baseType: !521, size: 32, offset: 2336)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !625, file: !616, line: 170, baseType: !521, size: 32, offset: 2368)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !625, file: !616, line: 171, baseType: !521, size: 32, offset: 2400)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !625, file: !616, line: 173, baseType: !393, size: 64, offset: 2432)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !625, file: !616, line: 175, baseType: !228, size: 32, offset: 2496)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !625, file: !616, line: 176, baseType: !228, size: 32, offset: 2528)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !625, file: !616, line: 179, baseType: !228, size: 32, offset: 2560)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !625, file: !616, line: 180, baseType: !521, size: 32, offset: 2592)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !625, file: !616, line: 183, baseType: !228, size: 32, offset: 2624)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !625, file: !616, line: 185, baseType: !352, size: 8, offset: 2656)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !625, file: !616, line: 186, baseType: !1041, size: 24, offset: 2664)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 24, elements: !522)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !625, file: !616, line: 189, baseType: !395, size: 128, offset: 2688)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !615, file: !616, line: 207, baseType: !467, size: 8192, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !615, file: !616, line: 208, baseType: !467, size: 8192, offset: 8576)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !615, file: !616, line: 210, baseType: !228, size: 32, offset: 16768)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !615, file: !616, line: 210, baseType: !228, size: 32, offset: 16800)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !615, file: !616, line: 211, baseType: !228, size: 32, offset: 16832)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !615, file: !616, line: 211, baseType: !228, size: 32, offset: 16864)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !615, file: !616, line: 212, baseType: !570, size: 128, offset: 16896)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !490, file: !491, line: 1246, baseType: !1051, size: 64, offset: 2112)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !491, line: 1067, size: 5184, elements: !1053)
!1053 = !{!1054, !1084, !1085, !1100, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1122, !1138, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1248}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1052, file: !491, line: 1068, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !491, line: 934, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !491, line: 925, size: 576, elements: !1058)
!1058 = !{!1059, !1076, !1077, !1078, !1079, !1080, !1083}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1057, file: !491, line: 926, baseType: !1060, size: 320)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !491, line: 830, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !491, line: 813, size: 320, elements: !1062)
!1062 = !{!1063, !1066, !1069, !1070, !1073, !1074, !1075}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1061, file: !491, line: 814, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !491, line: 51, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1061, file: !491, line: 815, baseType: !1067, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !491, line: 815, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1061, file: !491, line: 818, baseType: !393, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1061, file: !491, line: 819, baseType: !1071, size: 32, offset: 192)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 32, elements: !964)
!1072 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1061, file: !491, line: 822, baseType: !228, size: 32, offset: 224)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1061, file: !491, line: 826, baseType: !228, size: 32, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1061, file: !491, line: 829, baseType: !228, size: 32, offset: 288)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1057, file: !491, line: 928, baseType: !385, size: 16, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1057, file: !491, line: 928, baseType: !385, size: 16, offset: 336)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1057, file: !491, line: 929, baseType: !228, size: 32, offset: 352)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1057, file: !491, line: 930, baseType: !937, size: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1057, file: !491, line: 931, baseType: !1081, size: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !491, line: 931, flags: DIFlagFwdDecl)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1057, file: !491, line: 933, baseType: !393, size: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1052, file: !491, line: 1069, baseType: !1055, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1052, file: !491, line: 1070, baseType: !1086, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !491, line: 916, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !491, line: 891, size: 704, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1094, !1095, !1096, !1097, !1098, !1099}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1088, file: !491, line: 892, baseType: !1060, size: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !491, line: 896, baseType: !228, size: 32, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1088, file: !491, line: 900, baseType: !1093, size: 96, offset: 352)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 96, elements: !522)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1088, file: !491, line: 903, baseType: !521, size: 32, offset: 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1088, file: !491, line: 906, baseType: !228, size: 32, offset: 480)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1088, file: !491, line: 909, baseType: !521, size: 32, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1088, file: !491, line: 912, baseType: !521, size: 32, offset: 544)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1088, file: !491, line: 914, baseType: !499, size: 64, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1088, file: !491, line: 915, baseType: !393, size: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1052, file: !491, line: 1071, baseType: !1101, size: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !491, line: 920, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !491, line: 918, size: 320, elements: !1104)
!1104 = !{!1105}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1103, file: !491, line: 919, baseType: !1060, size: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1052, file: !491, line: 1075, baseType: !521, size: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1052, file: !491, line: 1077, baseType: !521, size: 32, offset: 288)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1052, file: !491, line: 1078, baseType: !521, size: 32, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1052, file: !491, line: 1079, baseType: !385, size: 16, offset: 352)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1052, file: !491, line: 1082, baseType: !385, size: 16, offset: 368)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1052, file: !491, line: 1085, baseType: !352, size: 8, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1052, file: !491, line: 1086, baseType: !352, size: 8, offset: 392)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1052, file: !491, line: 1087, baseType: !352, size: 8, offset: 400)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1052, file: !491, line: 1088, baseType: !352, size: 8, offset: 408)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1052, file: !491, line: 1090, baseType: !521, size: 32, offset: 416)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1052, file: !491, line: 1093, baseType: !385, size: 16, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1052, file: !491, line: 1096, baseType: !352, size: 8, offset: 464)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1052, file: !491, line: 1098, baseType: !1119, size: 40, offset: 472)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 40, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 5)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1052, file: !491, line: 1101, baseType: !1123, size: 832, offset: 512)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !491, line: 836, size: 832, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1123, file: !491, line: 837, baseType: !1060, size: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1123, file: !491, line: 839, baseType: !385, size: 16, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1123, file: !491, line: 839, baseType: !385, size: 16, offset: 336)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1123, file: !491, line: 842, baseType: !385, size: 16, offset: 352)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1123, file: !491, line: 842, baseType: !385, size: 16, offset: 368)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1123, file: !491, line: 843, baseType: !947, size: 32, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1123, file: !491, line: 845, baseType: !228, size: 32, offset: 416)
