; ModuleID = 'blender/source/blender/makesdna/intern/dna_genfile.c'
source_filename = "blender/source/blender/makesdna/intern/dna_genfile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SDNA = type { i8*, i32, i32, i8**, i32, i32, i8**, i16*, i32, i16**, %struct.GHash*, i32 }
%struct.GHash = type opaque

@MEM_freeN = external dso_local global void (i8*)*, align 8
@MEM_mallocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [5 x i8] c"sdna\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"sdna_data\00", align 1
@.str.2 = private unnamed_addr constant [26 x i8] c"error: file without SDNA\0A\00", align 1
@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str.3 = private unnamed_addr constant [10 x i8] c"compflags\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"blocktype\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"ipowin\00", align 1
@.str.6 = private unnamed_addr constant [12 x i8] c"reconstruct\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"SDNA\00", align 1
@.str.8 = private unnamed_addr constant [5 x i8] c"NAME\00", align 1
@.str.9 = private unnamed_addr constant [10 x i8] c"sdnanames\00", align 1
@.str.10 = private unnamed_addr constant [25 x i8] c"NAME error in SDNA file\0A\00", align 1

!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !31, line: 27, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !33, line: 44, baseType: !22)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !45, line: 27, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !33, line: 45, baseType: !47)
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!52 = distinct !DISubprogram(name: "DNA_elem_array_size", scope: !1, file: !1, line: 175, type: !53, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !57)
!53 = !DISubroutineType(types: !54)
!54 = !{!23, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!57 = !{}
!58 = !DILocalVariable(name: "str", arg: 1, scope: !52, file: !1, line: 175, type: !55)
!59 = !DILocation(line: 175, column: 37, scope: !52)
!60 = !DILocalVariable(name: "a", scope: !52, file: !1, line: 177, type: !23)
!61 = !DILocation(line: 177, column: 6, scope: !52)
!62 = !DILocalVariable(name: "mul", scope: !52, file: !1, line: 177, type: !23)
!63 = !DILocation(line: 177, column: 9, scope: !52)
!64 = !DILocalVariable(name: "cp", scope: !52, file: !1, line: 178, type: !55)
!65 = !DILocation(line: 178, column: 14, scope: !52)
!66 = !DILocation(line: 180, column: 9, scope: !67)
!67 = distinct !DILexicalBlock(scope: !52, file: !1, line: 180, column: 2)
!68 = !DILocation(line: 180, column: 7, scope: !67)
!69 = !DILocation(line: 180, column: 14, scope: !70)
!70 = distinct !DILexicalBlock(scope: !67, file: !1, line: 180, column: 2)
!71 = !DILocation(line: 180, column: 18, scope: !70)
!72 = !DILocation(line: 180, column: 2, scope: !67)
!73 = !DILocation(line: 181, column: 7, scope: !74)
!74 = distinct !DILexicalBlock(scope: !75, file: !1, line: 181, column: 7)
!75 = distinct !DILexicalBlock(scope: !70, file: !1, line: 180, column: 27)
!76 = !DILocation(line: 181, column: 11, scope: !74)
!77 = !DILocation(line: 181, column: 14, scope: !74)
!78 = !DILocation(line: 181, column: 7, scope: !75)
!79 = !DILocation(line: 182, column: 11, scope: !80)
!80 = distinct !DILexicalBlock(scope: !74, file: !1, line: 181, column: 22)
!81 = !DILocation(line: 182, column: 15, scope: !80)
!82 = !DILocation(line: 182, column: 17, scope: !80)
!83 = !DILocation(line: 182, column: 7, scope: !80)
!84 = !DILocation(line: 183, column: 3, scope: !80)
!85 = !DILocation(line: 184, column: 12, scope: !86)
!86 = distinct !DILexicalBlock(scope: !74, file: !1, line: 184, column: 12)
!87 = !DILocation(line: 184, column: 16, scope: !86)
!88 = !DILocation(line: 184, column: 19, scope: !86)
!89 = !DILocation(line: 184, column: 26, scope: !86)
!90 = !DILocation(line: 184, column: 29, scope: !86)
!91 = !DILocation(line: 184, column: 12, scope: !74)
!92 = !DILocation(line: 185, column: 16, scope: !93)
!93 = distinct !DILexicalBlock(scope: !86, file: !1, line: 184, column: 33)
!94 = !DILocation(line: 185, column: 11, scope: !93)
!95 = !DILocation(line: 185, column: 8, scope: !93)
!96 = !DILocation(line: 186, column: 3, scope: !93)
!97 = !DILocation(line: 187, column: 2, scope: !75)
!98 = !DILocation(line: 180, column: 23, scope: !70)
!99 = !DILocation(line: 180, column: 2, scope: !70)
!100 = distinct !{!100, !72, !101}
!101 = !DILocation(line: 187, column: 2, scope: !67)
!102 = !DILocation(line: 189, column: 9, scope: !52)
!103 = !DILocation(line: 189, column: 2, scope: !52)
!104 = distinct !DISubprogram(name: "DNA_sdna_free", scope: !1, file: !1, line: 196, type: !105, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !57)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDNA", file: !109, line: 64, baseType: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sdna_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDNA", file: !109, line: 37, size: 640, elements: !111)
!111 = !{!112, !113, !114, !115, !117, !118, !119, !121, !122, !123, !125, !129}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !110, file: !109, line: 38, baseType: !25, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !110, file: !109, line: 39, baseType: !23, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nr_names", scope: !110, file: !109, line: 41, baseType: !23, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !110, file: !109, line: 42, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pointerlen", scope: !110, file: !109, line: 44, baseType: !23, size: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nr_types", scope: !110, file: !109, line: 46, baseType: !23, size: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !110, file: !109, line: 47, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "typelens", scope: !110, file: !109, line: 48, baseType: !27, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nr_structs", scope: !110, file: !109, line: 50, baseType: !23, size: 32, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "structs", scope: !110, file: !109, line: 51, baseType: !124, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "structs_map", scope: !110, file: !109, line: 57, baseType: !126, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !128, line: 48, flags: DIFlagFwdDecl)
!128 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lastfind", scope: !110, file: !109, line: 63, baseType: !23, size: 32, offset: 576)
!130 = !DILocalVariable(name: "sdna", arg: 1, scope: !104, file: !1, line: 196, type: !107)
!131 = !DILocation(line: 196, column: 26, scope: !104)
!132 = !DILocation(line: 198, column: 2, scope: !104)
!133 = !DILocation(line: 198, column: 12, scope: !104)
!134 = !DILocation(line: 198, column: 18, scope: !104)
!135 = !DILocation(line: 199, column: 2, scope: !104)
!136 = !DILocation(line: 199, column: 20, scope: !104)
!137 = !DILocation(line: 199, column: 26, scope: !104)
!138 = !DILocation(line: 199, column: 12, scope: !104)
!139 = !DILocation(line: 200, column: 2, scope: !104)
!140 = !DILocation(line: 200, column: 12, scope: !104)
!141 = !DILocation(line: 200, column: 18, scope: !104)
!142 = !DILocation(line: 201, column: 2, scope: !104)
!143 = !DILocation(line: 201, column: 12, scope: !104)
!144 = !DILocation(line: 201, column: 18, scope: !104)
!145 = !DILocation(line: 204, column: 17, scope: !104)
!146 = !DILocation(line: 204, column: 23, scope: !104)
!147 = !DILocation(line: 204, column: 2, scope: !104)
!148 = !DILocation(line: 207, column: 2, scope: !104)
!149 = !DILocation(line: 207, column: 12, scope: !104)
!150 = !DILocation(line: 208, column: 1, scope: !104)
!151 = distinct !DISubprogram(name: "DNA_struct_find_nr", scope: !1, file: !1, line: 302, type: !152, scopeLine: 303, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !57)
!152 = !DISubroutineType(types: !153)
!153 = !{!23, !107, !55}
!154 = !DILocalVariable(name: "sdna", arg: 1, scope: !151, file: !1, line: 302, type: !107)
!155 = !DILocation(line: 302, column: 30, scope: !151)
!156 = !DILocalVariable(name: "str", arg: 2, scope: !151, file: !1, line: 302, type: !55)
!157 = !DILocation(line: 302, column: 48, scope: !151)
!158 = !DILocalVariable(name: "sp", scope: !151, file: !1, line: 304, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!161 = !DILocation(line: 304, column: 15, scope: !151)
!162 = !DILocation(line: 306, column: 6, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !1, line: 306, column: 6)
!164 = !DILocation(line: 306, column: 12, scope: !163)
!165 = !DILocation(line: 306, column: 23, scope: !163)
!166 = !DILocation(line: 306, column: 29, scope: !163)
!167 = !DILocation(line: 306, column: 21, scope: !163)
!168 = !DILocation(line: 306, column: 6, scope: !151)
!169 = !DILocation(line: 307, column: 8, scope: !170)
!170 = distinct !DILexicalBlock(scope: !163, file: !1, line: 306, column: 41)
!171 = !DILocation(line: 307, column: 14, scope: !170)
!172 = !DILocation(line: 307, column: 22, scope: !170)
!173 = !DILocation(line: 307, column: 28, scope: !170)
!174 = !DILocation(line: 307, column: 6, scope: !170)
!175 = !DILocation(line: 308, column: 14, scope: !176)
!176 = distinct !DILexicalBlock(scope: !170, file: !1, line: 308, column: 7)
!177 = !DILocation(line: 308, column: 20, scope: !176)
!178 = !DILocation(line: 308, column: 26, scope: !176)
!179 = !DILocation(line: 308, column: 34, scope: !176)
!180 = !DILocation(line: 308, column: 7, scope: !176)
!181 = !DILocation(line: 308, column: 39, scope: !176)
!182 = !DILocation(line: 308, column: 7, scope: !170)
!183 = !DILocation(line: 309, column: 11, scope: !184)
!184 = distinct !DILexicalBlock(scope: !176, file: !1, line: 308, column: 45)
!185 = !DILocation(line: 309, column: 17, scope: !184)
!186 = !DILocation(line: 309, column: 4, scope: !184)
!187 = !DILocation(line: 311, column: 2, scope: !170)
!188 = !DILocation(line: 314, column: 36, scope: !151)
!189 = !DILocation(line: 314, column: 42, scope: !151)
!190 = !DILocation(line: 314, column: 55, scope: !151)
!191 = !DILocation(line: 314, column: 19, scope: !151)
!192 = !DILocation(line: 314, column: 9, scope: !151)
!193 = !DILocation(line: 314, column: 60, scope: !151)
