; ModuleID = 'blender/source/blender/editors/space_node/node_add.c'
source_filename = "blender/source/blender/editors/space_node/node_add.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFileSel_File_Types", file: !67, line: 682, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!69 = !DIEnumerator(name: "BLENDERFILE", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "BLENDERFILE_BACKUP", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "IMAGEFILE", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "MOVIEFILE", value: 32, isUnsigned: true)
!73 = !DIEnumerator(name: "PYSCRIPTFILE", value: 64, isUnsigned: true)
!74 = !DIEnumerator(name: "FTFONTFILE", value: 128, isUnsigned: true)
!75 = !DIEnumerator(name: "SOUNDFILE", value: 256, isUnsigned: true)
!76 = !DIEnumerator(name: "TEXTFILE", value: 512, isUnsigned: true)
!77 = !DIEnumerator(name: "MOVIEFILE_ICON", value: 1024, isUnsigned: true)
!78 = !DIEnumerator(name: "FOLDERFILE", value: 2048, isUnsigned: true)
!79 = !DIEnumerator(name: "BTXFILE", value: 4096, isUnsigned: true)
!80 = !DIEnumerator(name: "COLLADAFILE", value: 8192, isUnsigned: true)
!81 = !DIEnumerator(name: "OPERATORFILE", value: 16384, isUnsigned: true)
!82 = !DIEnumerator(name: "APPLICATIONBUNDLE", value: 32768, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFileSel_Action", file: !67, line: 660, baseType: !5, size: 32, elements: !84)
!84 = !{!85, !86}
!85 = !DIEnumerator(name: "FILE_OPENFILE", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "FILE_SAVE", value: 1, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FileDisplayTypeE", file: !67, line: 626, baseType: !5, size: 32, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "FILE_DEFAULTDISPLAY", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "FILE_SHORTDISPLAY", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "FILE_LONGDISPLAY", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "FILE_IMGDISPLAY", value: 3, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !94, line: 148, baseType: !5, size: 32, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !97}
!96 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 351, baseType: !5, size: 32, elements: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !{!101, !102, !103, !104, !105, !106}
!101 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!104 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!105 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!106 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !99, line: 67, baseType: !5, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117}
!109 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!112 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!113 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!115 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!116 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!117 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!118 = !{!119, !120, !121, !122, !142, !279}
!119 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !124, line: 127, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !124, line: 77, size: 15424, elements: !126)
!126 = !{!127, !197, !198, !201, !204, !207, !210, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !230, !231, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !260, !261, !262, !268, !269, !273}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !124, line: 78, baseType: !128, size: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !129, line: 130, baseType: !130)
!129 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !129, line: 117, size: 960, elements: !131)
!131 = !{!132, !133, !134, !136, !156, !160, !161, !163, !164, !165}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !129, line: 118, baseType: !120, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !130, file: !129, line: 118, baseType: !120, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !130, file: !129, line: 119, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !130, file: !129, line: 120, baseType: !137, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !129, line: 136, size: 17600, elements: !139)
!139 = !{!140, !141, !143, !146, !151, !152, !153}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !129, line: 137, baseType: !128, size: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !138, file: !129, line: 138, baseType: !142, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !138, file: !129, line: 139, baseType: !144, size: 64, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !129, line: 43, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !129, line: 140, baseType: !147, size: 8192, offset: 1088)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 8192, elements: !149)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = !{!150}
!150 = !DISubrange(count: 1024)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !138, file: !129, line: 141, baseType: !147, size: 8192, offset: 9280)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !138, file: !129, line: 148, baseType: !137, size: 64, offset: 17472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !138, file: !129, line: 150, baseType: !154, size: 64, offset: 17536)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !129, line: 45, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !129, line: 121, baseType: !157, size: 528, offset: 256)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 528, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 66)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !129, line: 126, baseType: !119, size: 16, offset: 784)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !130, file: !129, line: 127, baseType: !162, size: 32, offset: 800)
!162 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !130, file: !129, line: 128, baseType: !162, size: 32, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !130, file: !129, line: 128, baseType: !162, size: 32, offset: 864)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !130, file: !129, line: 129, baseType: !166, size: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !129, line: 75, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !129, line: 62, size: 1024, elements: !169)
!169 = !{!170, !172, !173, !174, !175, !176, !180, !181, !195, !196}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !129, line: 63, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !168, file: !129, line: 63, baseType: !171, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !129, line: 64, baseType: !148, size: 8, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !168, file: !129, line: 64, baseType: !148, size: 8, offset: 136)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !168, file: !129, line: 65, baseType: !119, size: 16, offset: 144)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !129, line: 66, baseType: !177, size: 512, offset: 160)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 512, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !168, file: !129, line: 67, baseType: !162, size: 32, offset: 672)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !129, line: 69, baseType: !182, size: 256, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !129, line: 60, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !129, line: 48, size: 256, elements: !184)
!184 = !{!185, !186, !193, !194}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !183, file: !129, line: 49, baseType: !120, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !183, file: !129, line: 58, baseType: !187, size: 128, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !188, line: 71, baseType: !189)
!188 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !188, line: 69, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !189, file: !188, line: 70, baseType: !120, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !189, file: !188, line: 70, baseType: !120, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !183, file: !129, line: 59, baseType: !162, size: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !183, file: !129, line: 59, baseType: !162, size: 32, offset: 224)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !168, file: !129, line: 70, baseType: !162, size: 32, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !168, file: !129, line: 74, baseType: !162, size: 32, offset: 992)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !124, line: 80, baseType: !147, size: 8192, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !125, file: !124, line: 82, baseType: !199, size: 64, offset: 9152)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !124, line: 43, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !125, file: !124, line: 83, baseType: !202, size: 64, offset: 9216)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !129, line: 46, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !125, file: !124, line: 86, baseType: !205, size: 64, offset: 9280)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !124, line: 41, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !125, file: !124, line: 87, baseType: !208, size: 64, offset: 9344)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !124, line: 44, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !125, file: !124, line: 89, baseType: !211, size: 512, offset: 9408)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 512, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !125, file: !124, line: 90, baseType: !119, size: 16, offset: 9920)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !125, file: !124, line: 90, baseType: !119, size: 16, offset: 9936)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !125, file: !124, line: 92, baseType: !119, size: 16, offset: 9952)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !124, line: 92, baseType: !119, size: 16, offset: 9968)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !125, file: !124, line: 93, baseType: !119, size: 16, offset: 9984)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !124, line: 93, baseType: !119, size: 16, offset: 10000)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !125, file: !124, line: 94, baseType: !162, size: 32, offset: 10016)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !125, file: !124, line: 97, baseType: !119, size: 16, offset: 10048)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !125, file: !124, line: 97, baseType: !119, size: 16, offset: 10064)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !125, file: !124, line: 98, baseType: !119, size: 16, offset: 10080)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !125, file: !124, line: 98, baseType: !119, size: 16, offset: 10096)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !125, file: !124, line: 99, baseType: !119, size: 16, offset: 10112)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !125, file: !124, line: 99, baseType: !119, size: 16, offset: 10128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !125, file: !124, line: 100, baseType: !5, size: 32, offset: 10144)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !125, file: !124, line: 101, baseType: !229, size: 64, offset: 10176)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !125, file: !124, line: 103, baseType: !154, size: 64, offset: 10240)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !125, file: !124, line: 104, baseType: !232, size: 64, offset: 10304)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !129, line: 159, size: 448, elements: !234)
!234 = !{!235, !239, !240, !242, !243, !245}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !233, file: !129, line: 161, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 2)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !233, file: !129, line: 162, baseType: !236, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !233, file: !129, line: 163, baseType: !241, size: 32, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !237)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !233, file: !129, line: 164, baseType: !241, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !233, file: !129, line: 165, baseType: !244, size: 128, offset: 192)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 128, elements: !237)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !233, file: !129, line: 166, baseType: !246, size: 128, offset: 320)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !237)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !125, file: !124, line: 107, baseType: !121, size: 32, offset: 10368)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !125, file: !124, line: 108, baseType: !162, size: 32, offset: 10400)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !125, file: !124, line: 109, baseType: !119, size: 16, offset: 10432)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !125, file: !124, line: 110, baseType: !119, size: 16, offset: 10448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !125, file: !124, line: 113, baseType: !162, size: 32, offset: 10464)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !125, file: !124, line: 113, baseType: !162, size: 32, offset: 10496)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !125, file: !124, line: 114, baseType: !148, size: 8, offset: 10528)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !125, file: !124, line: 114, baseType: !148, size: 8, offset: 10536)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !125, file: !124, line: 115, baseType: !119, size: 16, offset: 10544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !125, file: !124, line: 116, baseType: !257, size: 128, offset: 10560)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 4)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !125, file: !124, line: 119, baseType: !121, size: 32, offset: 10688)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !125, file: !124, line: 119, baseType: !121, size: 32, offset: 10720)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !125, file: !124, line: 122, baseType: !263, size: 512, offset: 10752)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !264, line: 182, baseType: !265)
!264 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !264, line: 180, size: 512, elements: !266)
!266 = !{!267}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !264, line: 181, baseType: !177, size: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !125, file: !124, line: 123, baseType: !148, size: 8, offset: 11264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !125, file: !124, line: 125, baseType: !270, size: 56, offset: 11272)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 56, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 7)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !125, file: !124, line: 126, baseType: !274, size: 4096, offset: 11328)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 4096, elements: !212)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !124, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !124, line: 67, size: 512, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !124, line: 68, baseType: !177, size: 512)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!280 = !{i32 7, !"Dwarf Version", i32 4}
!281 = !{i32 2, !"Debug Info Version", i32 3}
!282 = !{i32 1, !"wchar_size", i32 4}
!283 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!284 = distinct !DISubprogram(name: "node_add_node", scope: !1, file: !1, line: 68, type: !285, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2348)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !2345, !376, !162, !121, !121}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !94, line: 218, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !94, line: 167, size: 3712, elements: !290)
!290 = !{!291, !293, !294, !295, !296, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !94, line: 168, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !289, file: !94, line: 168, baseType: !292, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !289, file: !94, line: 168, baseType: !292, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !289, file: !94, line: 170, baseType: !166, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !289, file: !94, line: 172, baseType: !297, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !299, line: 144, size: 6016, elements: !300)
!299 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!300 = !{!301, !302, !303, !304, !305, !306, !307, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !1964, !1965, !1966, !2215, !2219, !2223, !2224, !2228, !2232, !2236, !2237, !2238, !2239, !2243, !2244, !2248, !2252, !2256, !2260, !2264, !2268, !2272, !2273, !2280, !2282, !2291, !2300}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !299, line: 145, baseType: !120, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !298, file: !299, line: 145, baseType: !120, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !298, file: !299, line: 146, baseType: !119, size: 16, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !298, file: !299, line: 148, baseType: !177, size: 512, offset: 144)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 149, baseType: !162, size: 32, offset: 672)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !298, file: !299, line: 151, baseType: !177, size: 512, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !298, file: !299, line: 152, baseType: !308, size: 2048, offset: 1216)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 2048, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !298, file: !299, line: 153, baseType: !162, size: 32, offset: 3264)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !298, file: !299, line: 155, baseType: !121, size: 32, offset: 3296)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !298, file: !299, line: 155, baseType: !121, size: 32, offset: 3328)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !298, file: !299, line: 155, baseType: !121, size: 32, offset: 3360)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !298, file: !299, line: 156, baseType: !121, size: 32, offset: 3392)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !298, file: !299, line: 156, baseType: !121, size: 32, offset: 3424)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !298, file: !299, line: 156, baseType: !121, size: 32, offset: 3456)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !298, file: !299, line: 157, baseType: !119, size: 16, offset: 3488)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !299, line: 157, baseType: !119, size: 16, offset: 3504)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !298, file: !299, line: 157, baseType: !119, size: 16, offset: 3520)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !298, file: !299, line: 160, baseType: !322, size: 64, offset: 3584)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !299, line: 109, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !299, line: 98, size: 1408, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !1963}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !299, line: 99, baseType: !162, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !324, file: !299, line: 99, baseType: !162, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !299, line: 100, baseType: !177, size: 512, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !324, file: !299, line: 101, baseType: !121, size: 32, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !324, file: !299, line: 101, baseType: !121, size: 32, offset: 608)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !324, file: !299, line: 101, baseType: !121, size: 32, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !324, file: !299, line: 101, baseType: !121, size: 32, offset: 672)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !324, file: !299, line: 102, baseType: !121, size: 32, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !324, file: !299, line: 102, baseType: !121, size: 32, offset: 736)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !324, file: !299, line: 103, baseType: !162, size: 32, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !299, line: 104, baseType: !162, size: 32, offset: 800)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !324, file: !299, line: 107, baseType: !338, size: 64, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !94, line: 87, size: 2816, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !94, line: 88, baseType: !338, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !94, line: 88, baseType: !338, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !339, file: !94, line: 88, baseType: !338, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !339, file: !94, line: 90, baseType: !166, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !339, file: !94, line: 92, baseType: !177, size: 512, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !94, line: 94, baseType: !177, size: 512, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !339, file: !94, line: 99, baseType: !120, size: 64, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !94, line: 101, baseType: !119, size: 16, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !94, line: 101, baseType: !119, size: 16, offset: 1360)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !339, file: !94, line: 102, baseType: !119, size: 16, offset: 1376)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !339, file: !94, line: 103, baseType: !119, size: 16, offset: 1392)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !339, file: !94, line: 104, baseType: !353, size: 64, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !299, line: 114, size: 1600, elements: !355)
!355 = !{!356, !357, !378, !383, !387, !391, !1923, !1927, !1928, !1932, !1933, !1934, !1935}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !354, file: !299, line: 115, baseType: !177, size: 512)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !354, file: !299, line: 117, baseType: !358, size: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361, !363, !365, !365, !376}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !4, line: 44, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !299, line: 73, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !4, line: 55, size: 192, elements: !367)
!367 = !{!368, !372, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !366, file: !4, line: 58, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !4, line: 56, size: 64, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !4, line: 57, baseType: !120, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !4, line: 60, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !94, line: 335, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !366, file: !4, line: 61, baseType: !120, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !354, file: !299, line: 118, baseType: !379, size: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !361, !365, !365, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !354, file: !299, line: 120, baseType: !384, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !361, !363, !365}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !354, file: !299, line: 121, baseType: !388, size: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !361, !365, !382}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !354, file: !299, line: 122, baseType: !392, size: 64, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !395, !338, !373}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !94, line: 328, size: 3456, elements: !397)
!397 = !{!398, !399, !403, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1897, !1902, !1903, !1906, !1910, !1914, !1918, !1919, !1920, !1921, !1922}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !94, line: 329, baseType: !128, size: 960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !396, file: !94, line: 330, baseType: !400, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !402, line: 45, flags: DIFlagFwdDecl)
!402 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!403 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !396, file: !94, line: 332, baseType: !404, size: 64, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !299, line: 283, size: 4096, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !416, !420, !1801, !1807, !1813, !1817, !1818, !1819, !1820, !1837, !1838}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !299, line: 284, baseType: !162, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !405, file: !299, line: 285, baseType: !177, size: 512, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !405, file: !299, line: 287, baseType: !177, size: 512, offset: 544)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !405, file: !299, line: 288, baseType: !308, size: 2048, offset: 1056)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !405, file: !299, line: 289, baseType: !162, size: 32, offset: 3104)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !405, file: !299, line: 292, baseType: !413, size: 64, offset: 3136)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !395}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !405, file: !299, line: 293, baseType: !417, size: 64, offset: 3200)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !395, !292}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !405, file: !299, line: 294, baseType: !421, size: 64, offset: 3264)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !424, !120, !1797}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !426, line: 1216, size: 39680, elements: !427)
!426 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = !{!428, !429, !430, !433, !830, !831, !832, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !1204, !1418, !1421, !1668, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1690, !1691, !1692, !1693, !1694, !1702, !1768, !1775, !1776, !1783, !1784, !1790, !1791, !1792, !1793, !1794}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !425, file: !426, line: 1217, baseType: !128, size: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !425, file: !426, line: 1218, baseType: !400, size: 64, offset: 960)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !425, file: !426, line: 1220, baseType: !431, size: 64, offset: 1024)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !402, line: 49, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !425, file: !426, line: 1221, baseType: !434, size: 64, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !436, line: 52, size: 4224, elements: !437)
!436 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !510, !825, !826, !827, !828, !829}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !435, file: !436, line: 53, baseType: !128, size: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !435, file: !436, line: 54, baseType: !400, size: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !435, file: !436, line: 56, baseType: !119, size: 16, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !435, file: !436, line: 56, baseType: !119, size: 16, offset: 1040)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !435, file: !436, line: 57, baseType: !119, size: 16, offset: 1056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !435, file: !436, line: 57, baseType: !119, size: 16, offset: 1072)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !435, file: !436, line: 59, baseType: !121, size: 32, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !435, file: !436, line: 59, baseType: !121, size: 32, offset: 1120)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !435, file: !436, line: 59, baseType: !121, size: 32, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !435, file: !436, line: 60, baseType: !121, size: 32, offset: 1184)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !435, file: !436, line: 60, baseType: !121, size: 32, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !435, file: !436, line: 60, baseType: !121, size: 32, offset: 1248)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !435, file: !436, line: 61, baseType: !121, size: 32, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !435, file: !436, line: 61, baseType: !121, size: 32, offset: 1312)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !435, file: !436, line: 61, baseType: !121, size: 32, offset: 1344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !435, file: !436, line: 68, baseType: !121, size: 32, offset: 1376)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !435, file: !436, line: 68, baseType: !121, size: 32, offset: 1408)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !435, file: !436, line: 68, baseType: !121, size: 32, offset: 1440)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !435, file: !436, line: 69, baseType: !121, size: 32, offset: 1472)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !435, file: !436, line: 69, baseType: !121, size: 32, offset: 1504)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !435, file: !436, line: 74, baseType: !121, size: 32, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !435, file: !436, line: 79, baseType: !121, size: 32, offset: 1568)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !435, file: !436, line: 81, baseType: !119, size: 16, offset: 1600)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !435, file: !436, line: 91, baseType: !119, size: 16, offset: 1616)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !435, file: !436, line: 92, baseType: !119, size: 16, offset: 1632)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !435, file: !436, line: 93, baseType: !119, size: 16, offset: 1648)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !435, file: !436, line: 94, baseType: !119, size: 16, offset: 1664)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !435, file: !436, line: 94, baseType: !119, size: 16, offset: 1680)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !435, file: !436, line: 94, baseType: !119, size: 16, offset: 1696)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !435, file: !436, line: 94, baseType: !119, size: 16, offset: 1712)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !435, file: !436, line: 96, baseType: !121, size: 32, offset: 1728)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !435, file: !436, line: 96, baseType: !121, size: 32, offset: 1760)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !435, file: !436, line: 96, baseType: !121, size: 32, offset: 1792)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !435, file: !436, line: 96, baseType: !121, size: 32, offset: 1824)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !435, file: !436, line: 98, baseType: !121, size: 32, offset: 1856)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !435, file: !436, line: 98, baseType: !121, size: 32, offset: 1888)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !435, file: !436, line: 98, baseType: !121, size: 32, offset: 1920)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !435, file: !436, line: 98, baseType: !121, size: 32, offset: 1952)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !435, file: !436, line: 99, baseType: !121, size: 32, offset: 1984)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !435, file: !436, line: 99, baseType: !121, size: 32, offset: 2016)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !435, file: !436, line: 100, baseType: !121, size: 32, offset: 2048)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !435, file: !436, line: 100, baseType: !121, size: 32, offset: 2080)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !435, file: !436, line: 103, baseType: !119, size: 16, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !435, file: !436, line: 103, baseType: !119, size: 16, offset: 2128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !435, file: !436, line: 103, baseType: !119, size: 16, offset: 2144)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !435, file: !436, line: 103, baseType: !119, size: 16, offset: 2160)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !435, file: !436, line: 106, baseType: !121, size: 32, offset: 2176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !435, file: !436, line: 106, baseType: !121, size: 32, offset: 2208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !435, file: !436, line: 106, baseType: !121, size: 32, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !435, file: !436, line: 106, baseType: !121, size: 32, offset: 2272)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !435, file: !436, line: 107, baseType: !119, size: 16, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !435, file: !436, line: 107, baseType: !119, size: 16, offset: 2320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !435, file: !436, line: 107, baseType: !119, size: 16, offset: 2336)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !435, file: !436, line: 107, baseType: !119, size: 16, offset: 2352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !435, file: !436, line: 108, baseType: !121, size: 32, offset: 2368)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !435, file: !436, line: 108, baseType: !121, size: 32, offset: 2400)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !435, file: !436, line: 109, baseType: !121, size: 32, offset: 2432)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !435, file: !436, line: 109, baseType: !121, size: 32, offset: 2464)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !435, file: !436, line: 110, baseType: !121, size: 32, offset: 2496)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !435, file: !436, line: 110, baseType: !121, size: 32, offset: 2528)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !435, file: !436, line: 110, baseType: !121, size: 32, offset: 2560)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !435, file: !436, line: 111, baseType: !119, size: 16, offset: 2592)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !435, file: !436, line: 111, baseType: !119, size: 16, offset: 2608)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !435, file: !436, line: 112, baseType: !119, size: 16, offset: 2624)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !435, file: !436, line: 112, baseType: !119, size: 16, offset: 2640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !435, file: !436, line: 112, baseType: !119, size: 16, offset: 2656)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !436, line: 115, baseType: !119, size: 16, offset: 2672)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !435, file: !436, line: 118, baseType: !382, size: 64, offset: 2688)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !435, file: !436, line: 118, baseType: !382, size: 64, offset: 2752)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !435, file: !436, line: 121, baseType: !508, size: 64, offset: 2816)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !402, line: 46, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !435, file: !436, line: 122, baseType: !511, size: 1152, offset: 2880)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 1152, elements: !823)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !402, line: 57, size: 2496, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !513, file: !402, line: 59, baseType: !119, size: 16)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !513, file: !402, line: 59, baseType: !119, size: 16, offset: 16)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !513, file: !402, line: 59, baseType: !119, size: 16, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !513, file: !402, line: 59, baseType: !119, size: 16, offset: 48)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !513, file: !402, line: 60, baseType: !431, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !513, file: !402, line: 61, baseType: !521, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !402, line: 202, size: 3328, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !592, !593, !594, !596, !622, !653, !654, !733, !754, !762, !763}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !522, file: !402, line: 203, baseType: !128, size: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !522, file: !402, line: 204, baseType: !400, size: 64, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !522, file: !402, line: 206, baseType: !121, size: 32, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !522, file: !402, line: 206, baseType: !121, size: 32, offset: 1056)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !522, file: !402, line: 207, baseType: !121, size: 32, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !522, file: !402, line: 207, baseType: !121, size: 32, offset: 1120)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !522, file: !402, line: 207, baseType: !121, size: 32, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !522, file: !402, line: 207, baseType: !121, size: 32, offset: 1184)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !522, file: !402, line: 207, baseType: !121, size: 32, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !522, file: !402, line: 207, baseType: !121, size: 32, offset: 1248)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !522, file: !402, line: 208, baseType: !121, size: 32, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !522, file: !402, line: 208, baseType: !121, size: 32, offset: 1312)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !522, file: !402, line: 211, baseType: !121, size: 32, offset: 1344)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !522, file: !402, line: 211, baseType: !121, size: 32, offset: 1376)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !522, file: !402, line: 211, baseType: !121, size: 32, offset: 1408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !522, file: !402, line: 211, baseType: !121, size: 32, offset: 1440)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !522, file: !402, line: 211, baseType: !121, size: 32, offset: 1472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !522, file: !402, line: 214, baseType: !121, size: 32, offset: 1504)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !522, file: !402, line: 214, baseType: !121, size: 32, offset: 1536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !522, file: !402, line: 217, baseType: !121, size: 32, offset: 1568)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !522, file: !402, line: 218, baseType: !121, size: 32, offset: 1600)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !522, file: !402, line: 219, baseType: !121, size: 32, offset: 1632)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !522, file: !402, line: 220, baseType: !121, size: 32, offset: 1664)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !522, file: !402, line: 221, baseType: !121, size: 32, offset: 1696)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !522, file: !402, line: 222, baseType: !119, size: 16, offset: 1728)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !522, file: !402, line: 222, baseType: !119, size: 16, offset: 1744)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !522, file: !402, line: 224, baseType: !119, size: 16, offset: 1760)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !522, file: !402, line: 224, baseType: !119, size: 16, offset: 1776)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !522, file: !402, line: 227, baseType: !119, size: 16, offset: 1792)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !522, file: !402, line: 227, baseType: !119, size: 16, offset: 1808)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !522, file: !402, line: 229, baseType: !119, size: 16, offset: 1824)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !402, line: 229, baseType: !119, size: 16, offset: 1840)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !522, file: !402, line: 230, baseType: !119, size: 16, offset: 1856)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !522, file: !402, line: 230, baseType: !119, size: 16, offset: 1872)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !522, file: !402, line: 232, baseType: !121, size: 32, offset: 1888)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !522, file: !402, line: 232, baseType: !121, size: 32, offset: 1920)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !522, file: !402, line: 232, baseType: !121, size: 32, offset: 1952)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !522, file: !402, line: 232, baseType: !121, size: 32, offset: 1984)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !522, file: !402, line: 233, baseType: !162, size: 32, offset: 2016)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !522, file: !402, line: 234, baseType: !162, size: 32, offset: 2048)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !522, file: !402, line: 235, baseType: !119, size: 16, offset: 2080)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !522, file: !402, line: 235, baseType: !119, size: 16, offset: 2096)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !522, file: !402, line: 236, baseType: !119, size: 16, offset: 2112)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !522, file: !402, line: 239, baseType: !119, size: 16, offset: 2128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !522, file: !402, line: 240, baseType: !162, size: 32, offset: 2144)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !522, file: !402, line: 241, baseType: !162, size: 32, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !522, file: !402, line: 241, baseType: !162, size: 32, offset: 2208)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !522, file: !402, line: 241, baseType: !162, size: 32, offset: 2240)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !522, file: !402, line: 243, baseType: !121, size: 32, offset: 2272)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !522, file: !402, line: 243, baseType: !121, size: 32, offset: 2304)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !522, file: !402, line: 244, baseType: !121, size: 32, offset: 2336)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !522, file: !402, line: 246, baseType: !576, size: 320, offset: 2368)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !124, line: 50, size: 320, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !576, file: !124, line: 51, baseType: !424, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !576, file: !124, line: 53, baseType: !162, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !576, file: !124, line: 54, baseType: !162, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !576, file: !124, line: 55, baseType: !162, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !576, file: !124, line: 55, baseType: !162, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !576, file: !124, line: 56, baseType: !148, size: 8, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !576, file: !124, line: 56, baseType: !148, size: 8, offset: 200)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !576, file: !124, line: 57, baseType: !148, size: 8, offset: 208)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !576, file: !124, line: 57, baseType: !148, size: 8, offset: 216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !576, file: !124, line: 59, baseType: !119, size: 16, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !576, file: !124, line: 59, baseType: !119, size: 16, offset: 240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !576, file: !124, line: 59, baseType: !119, size: 16, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !124, line: 61, baseType: !119, size: 16, offset: 272)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !576, file: !124, line: 63, baseType: !162, size: 32, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !522, file: !402, line: 248, baseType: !395, size: 64, offset: 2688)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !522, file: !402, line: 249, baseType: !508, size: 64, offset: 2752)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !522, file: !402, line: 250, baseType: !595, size: 64, offset: 2816)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !522, file: !402, line: 251, baseType: !597, size: 64, offset: 2880)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !402, line: 113, size: 6208, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !609}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !598, file: !402, line: 114, baseType: !119, size: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !598, file: !402, line: 114, baseType: !119, size: 16, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !598, file: !402, line: 115, baseType: !148, size: 8, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !598, file: !402, line: 115, baseType: !148, size: 8, offset: 40)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !598, file: !402, line: 116, baseType: !148, size: 8, offset: 48)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !598, file: !402, line: 117, baseType: !606, size: 8, offset: 56)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 8, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 1)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !598, file: !402, line: 119, baseType: !610, size: 6144, offset: 64)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 6144, elements: !620)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !402, line: 109, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !402, line: 106, size: 192, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !612, file: !402, line: 107, baseType: !121, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !612, file: !402, line: 107, baseType: !121, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !612, file: !402, line: 107, baseType: !121, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !612, file: !402, line: 107, baseType: !121, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !612, file: !402, line: 107, baseType: !121, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !612, file: !402, line: 108, baseType: !162, size: 32, offset: 160)
!620 = !{!621}
!621 = !DISubrange(count: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !522, file: !402, line: 252, baseType: !623, size: 64, offset: 2944)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !402, line: 122, size: 1600, elements: !625)
!625 = !{!626, !627, !628, !634, !637, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !624, file: !402, line: 123, baseType: !431, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !624, file: !402, line: 124, baseType: !595, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !624, file: !402, line: 125, baseType: !629, size: 384, offset: 128)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 384, elements: !632)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !264, line: 136, flags: DIFlagFwdDecl)
!632 = !{!633}
!633 = !DISubrange(count: 6)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !624, file: !402, line: 126, baseType: !635, size: 512, offset: 512)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 512, elements: !636)
!636 = !{!259, !259}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !624, file: !402, line: 127, baseType: !638, size: 288, offset: 1024)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 288, elements: !639)
!639 = !{!640, !640}
!640 = !DISubrange(count: 3)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !624, file: !402, line: 128, baseType: !119, size: 16, offset: 1312)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !624, file: !402, line: 128, baseType: !119, size: 16, offset: 1328)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !624, file: !402, line: 129, baseType: !121, size: 32, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !624, file: !402, line: 129, baseType: !121, size: 32, offset: 1376)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !624, file: !402, line: 130, baseType: !121, size: 32, offset: 1408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !624, file: !402, line: 131, baseType: !5, size: 32, offset: 1440)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !624, file: !402, line: 132, baseType: !119, size: 16, offset: 1472)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !624, file: !402, line: 132, baseType: !119, size: 16, offset: 1488)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !624, file: !402, line: 133, baseType: !162, size: 32, offset: 1504)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !624, file: !402, line: 133, baseType: !162, size: 32, offset: 1536)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !624, file: !402, line: 134, baseType: !119, size: 16, offset: 1568)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !624, file: !402, line: 134, baseType: !119, size: 16, offset: 1584)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !522, file: !402, line: 253, baseType: !232, size: 64, offset: 3008)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !522, file: !402, line: 254, baseType: !655, size: 64, offset: 3072)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !402, line: 137, size: 832, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !679, !680, !681, !682, !683, !684}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !402, line: 138, baseType: !119, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !656, file: !402, line: 140, baseType: !119, size: 16, offset: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !656, file: !402, line: 141, baseType: !121, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !656, file: !402, line: 142, baseType: !121, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !656, file: !402, line: 143, baseType: !119, size: 16, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !656, file: !402, line: 144, baseType: !119, size: 16, offset: 112)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !656, file: !402, line: 145, baseType: !162, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !656, file: !402, line: 147, baseType: !162, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !656, file: !402, line: 149, baseType: !431, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !656, file: !402, line: 150, baseType: !162, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !656, file: !402, line: 151, baseType: !119, size: 16, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !656, file: !402, line: 152, baseType: !119, size: 16, offset: 304)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !656, file: !402, line: 154, baseType: !120, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !656, file: !402, line: 155, baseType: !382, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !656, file: !402, line: 157, baseType: !121, size: 32, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !656, file: !402, line: 158, baseType: !119, size: 16, offset: 480)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !656, file: !402, line: 159, baseType: !119, size: 16, offset: 496)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !656, file: !402, line: 160, baseType: !119, size: 16, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !656, file: !402, line: 161, baseType: !677, size: 48, offset: 528)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 48, elements: !678)
!678 = !{!640}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !656, file: !402, line: 162, baseType: !121, size: 32, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !656, file: !402, line: 164, baseType: !121, size: 32, offset: 608)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !656, file: !402, line: 164, baseType: !121, size: 32, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !656, file: !402, line: 164, baseType: !121, size: 32, offset: 672)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !656, file: !402, line: 165, baseType: !597, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !656, file: !402, line: 167, baseType: !685, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !264, line: 72, size: 3072, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !701, !702, !728, !730, !731, !732}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !686, file: !264, line: 73, baseType: !162, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !686, file: !264, line: 73, baseType: !162, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !686, file: !264, line: 74, baseType: !162, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !686, file: !264, line: 75, baseType: !162, size: 32, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !686, file: !264, line: 77, baseType: !693, size: 128, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !694, line: 95, baseType: !695)
!694 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !694, line: 92, size: 128, elements: !696)
!696 = !{!697, !698, !699, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !695, file: !694, line: 93, baseType: !121, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !695, file: !694, line: 93, baseType: !121, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !695, file: !694, line: 94, baseType: !121, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !695, file: !694, line: 94, baseType: !121, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !686, file: !264, line: 77, baseType: !693, size: 128, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !686, file: !264, line: 79, baseType: !703, size: 2304, offset: 384)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 2304, elements: !258)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !264, line: 67, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !264, line: 55, size: 576, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !714, !715, !724, !725, !726, !727}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !705, file: !264, line: 56, baseType: !119, size: 16)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !705, file: !264, line: 56, baseType: !119, size: 16, offset: 16)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !705, file: !264, line: 58, baseType: !121, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !705, file: !264, line: 59, baseType: !121, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !705, file: !264, line: 59, baseType: !121, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !705, file: !264, line: 60, baseType: !713, size: 64, offset: 128)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !237)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !705, file: !264, line: 60, baseType: !713, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !705, file: !264, line: 61, baseType: !716, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !264, line: 47, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !264, line: 44, size: 96, elements: !719)
!719 = !{!720, !721, !722, !723}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !718, file: !264, line: 45, baseType: !121, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !718, file: !264, line: 45, baseType: !121, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !718, file: !264, line: 46, baseType: !119, size: 16, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !718, file: !264, line: 46, baseType: !119, size: 16, offset: 80)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !705, file: !264, line: 62, baseType: !716, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !705, file: !264, line: 64, baseType: !716, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !705, file: !264, line: 65, baseType: !713, size: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !705, file: !264, line: 66, baseType: !713, size: 64, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !686, file: !264, line: 80, baseType: !729, size: 96, offset: 2688)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 96, elements: !678)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !686, file: !264, line: 80, baseType: !729, size: 96, offset: 2784)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !686, file: !264, line: 81, baseType: !729, size: 96, offset: 2880)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !686, file: !264, line: 83, baseType: !729, size: 96, offset: 2976)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !522, file: !402, line: 255, baseType: !734, size: 64, offset: 3136)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !402, line: 170, size: 8704, elements: !736)
!736 = !{!737, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !735, file: !402, line: 171, baseType: !738, size: 96)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 96, elements: !678)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !735, file: !402, line: 172, baseType: !162, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !735, file: !402, line: 173, baseType: !119, size: 16, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !735, file: !402, line: 174, baseType: !119, size: 16, offset: 144)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !735, file: !402, line: 175, baseType: !119, size: 16, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !735, file: !402, line: 176, baseType: !119, size: 16, offset: 176)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !735, file: !402, line: 177, baseType: !119, size: 16, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !735, file: !402, line: 178, baseType: !119, size: 16, offset: 208)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !735, file: !402, line: 179, baseType: !162, size: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !735, file: !402, line: 181, baseType: !431, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !735, file: !402, line: 182, baseType: !121, size: 32, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !735, file: !402, line: 183, baseType: !162, size: 32, offset: 352)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !735, file: !402, line: 184, baseType: !147, size: 8192, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !735, file: !402, line: 187, baseType: !382, size: 64, offset: 8576)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !735, file: !402, line: 188, baseType: !162, size: 32, offset: 8640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !735, file: !402, line: 189, baseType: !162, size: 32, offset: 8672)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !522, file: !402, line: 256, baseType: !755, size: 64, offset: 3200)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !402, line: 193, size: 640, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !756, file: !402, line: 194, baseType: !431, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !756, file: !402, line: 195, baseType: !177, size: 512, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !756, file: !402, line: 197, baseType: !162, size: 32, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !756, file: !402, line: 198, baseType: !162, size: 32, offset: 608)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !522, file: !402, line: 258, baseType: !148, size: 8, offset: 3264)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !522, file: !402, line: 259, baseType: !270, size: 56, offset: 3272)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !513, file: !402, line: 62, baseType: !177, size: 512, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !513, file: !402, line: 64, baseType: !148, size: 8, offset: 704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !513, file: !402, line: 64, baseType: !148, size: 8, offset: 712)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !513, file: !402, line: 64, baseType: !148, size: 8, offset: 720)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !513, file: !402, line: 64, baseType: !148, size: 8, offset: 728)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !513, file: !402, line: 65, baseType: !729, size: 96, offset: 736)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !513, file: !402, line: 65, baseType: !729, size: 96, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !513, file: !402, line: 65, baseType: !121, size: 32, offset: 928)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !513, file: !402, line: 67, baseType: !119, size: 16, offset: 960)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !513, file: !402, line: 67, baseType: !119, size: 16, offset: 976)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !513, file: !402, line: 67, baseType: !119, size: 16, offset: 992)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !513, file: !402, line: 67, baseType: !119, size: 16, offset: 1008)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !513, file: !402, line: 68, baseType: !119, size: 16, offset: 1024)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !513, file: !402, line: 68, baseType: !119, size: 16, offset: 1040)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !513, file: !402, line: 69, baseType: !148, size: 8, offset: 1056)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !513, file: !402, line: 69, baseType: !270, size: 56, offset: 1064)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !513, file: !402, line: 70, baseType: !121, size: 32, offset: 1120)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !513, file: !402, line: 70, baseType: !121, size: 32, offset: 1152)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !513, file: !402, line: 70, baseType: !121, size: 32, offset: 1184)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !513, file: !402, line: 70, baseType: !121, size: 32, offset: 1216)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !513, file: !402, line: 71, baseType: !121, size: 32, offset: 1248)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !513, file: !402, line: 71, baseType: !121, size: 32, offset: 1280)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !513, file: !402, line: 74, baseType: !121, size: 32, offset: 1312)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !513, file: !402, line: 74, baseType: !121, size: 32, offset: 1344)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !513, file: !402, line: 77, baseType: !121, size: 32, offset: 1376)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !513, file: !402, line: 77, baseType: !121, size: 32, offset: 1408)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !513, file: !402, line: 77, baseType: !121, size: 32, offset: 1440)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !513, file: !402, line: 78, baseType: !121, size: 32, offset: 1472)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !513, file: !402, line: 78, baseType: !121, size: 32, offset: 1504)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !513, file: !402, line: 78, baseType: !121, size: 32, offset: 1536)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !513, file: !402, line: 79, baseType: !121, size: 32, offset: 1568)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !513, file: !402, line: 79, baseType: !121, size: 32, offset: 1600)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !513, file: !402, line: 79, baseType: !121, size: 32, offset: 1632)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !513, file: !402, line: 79, baseType: !121, size: 32, offset: 1664)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !513, file: !402, line: 80, baseType: !121, size: 32, offset: 1696)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !513, file: !402, line: 80, baseType: !121, size: 32, offset: 1728)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !513, file: !402, line: 80, baseType: !121, size: 32, offset: 1760)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !513, file: !402, line: 81, baseType: !121, size: 32, offset: 1792)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !513, file: !402, line: 81, baseType: !121, size: 32, offset: 1824)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !513, file: !402, line: 81, baseType: !121, size: 32, offset: 1856)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !513, file: !402, line: 82, baseType: !121, size: 32, offset: 1888)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !513, file: !402, line: 82, baseType: !121, size: 32, offset: 1920)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !513, file: !402, line: 82, baseType: !121, size: 32, offset: 1952)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !513, file: !402, line: 85, baseType: !121, size: 32, offset: 1984)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !513, file: !402, line: 85, baseType: !121, size: 32, offset: 2016)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !513, file: !402, line: 85, baseType: !121, size: 32, offset: 2048)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !513, file: !402, line: 85, baseType: !121, size: 32, offset: 2080)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !513, file: !402, line: 86, baseType: !121, size: 32, offset: 2112)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !513, file: !402, line: 86, baseType: !121, size: 32, offset: 2144)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !513, file: !402, line: 86, baseType: !121, size: 32, offset: 2176)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !513, file: !402, line: 86, baseType: !121, size: 32, offset: 2208)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !513, file: !402, line: 87, baseType: !121, size: 32, offset: 2240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !513, file: !402, line: 87, baseType: !121, size: 32, offset: 2272)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !513, file: !402, line: 87, baseType: !121, size: 32, offset: 2304)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !513, file: !402, line: 87, baseType: !121, size: 32, offset: 2336)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !513, file: !402, line: 90, baseType: !121, size: 32, offset: 2368)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !513, file: !402, line: 93, baseType: !121, size: 32, offset: 2400)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !513, file: !402, line: 93, baseType: !121, size: 32, offset: 2432)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !513, file: !402, line: 93, baseType: !121, size: 32, offset: 2464)
!823 = !{!824}
!824 = !DISubrange(count: 18)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !435, file: !436, line: 123, baseType: !119, size: 16, offset: 4032)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !435, file: !436, line: 123, baseType: !119, size: 16, offset: 4048)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !435, file: !436, line: 123, baseType: !241, size: 32, offset: 4064)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !435, file: !436, line: 126, baseType: !232, size: 64, offset: 4096)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !435, file: !436, line: 129, baseType: !395, size: 64, offset: 4160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !425, file: !426, line: 1223, baseType: !424, size: 64, offset: 1152)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !425, file: !426, line: 1225, baseType: !187, size: 128, offset: 1216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !425, file: !426, line: 1226, baseType: !833, size: 64, offset: 1344)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !426, line: 69, size: 320, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !426, line: 70, baseType: !833, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !834, file: !426, line: 70, baseType: !833, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !834, file: !426, line: 71, baseType: !5, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !834, file: !426, line: 71, baseType: !5, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !834, file: !426, line: 72, baseType: !162, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !834, file: !426, line: 73, baseType: !119, size: 16, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !834, file: !426, line: 73, baseType: !119, size: 16, offset: 240)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !834, file: !426, line: 74, baseType: !431, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !425, file: !426, line: 1227, baseType: !431, size: 64, offset: 1408)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !425, file: !426, line: 1229, baseType: !729, size: 96, offset: 1472)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !425, file: !426, line: 1230, baseType: !729, size: 96, offset: 1568)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !425, file: !426, line: 1231, baseType: !729, size: 96, offset: 1664)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !425, file: !426, line: 1231, baseType: !729, size: 96, offset: 1760)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !425, file: !426, line: 1233, baseType: !5, size: 32, offset: 1856)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !425, file: !426, line: 1234, baseType: !162, size: 32, offset: 1888)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !425, file: !426, line: 1235, baseType: !5, size: 32, offset: 1920)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !425, file: !426, line: 1237, baseType: !119, size: 16, offset: 1952)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !425, file: !426, line: 1239, baseType: !148, size: 8, offset: 1968)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !425, file: !426, line: 1240, baseType: !606, size: 8, offset: 1976)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !425, file: !426, line: 1242, baseType: !395, size: 64, offset: 1984)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !425, file: !426, line: 1244, baseType: !857, size: 64, offset: 2048)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !859, line: 200, size: 17024, elements: !860)
!859 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!860 = !{!861, !863, !864, !865, !1197, !1198, !1199, !1200, !1201, !1202, !1203}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !858, file: !859, line: 201, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !858, file: !859, line: 202, baseType: !187, size: 128, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !858, file: !859, line: 203, baseType: !187, size: 128, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !858, file: !859, line: 206, baseType: !866, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !859, line: 190, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !859, line: 126, size: 2816, elements: !869)
!869 = !{!870, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !958, !959, !960, !961, !1168, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1196}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !859, line: 127, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !868, file: !859, line: 127, baseType: !871, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !868, file: !859, line: 128, baseType: !120, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !868, file: !859, line: 129, baseType: !120, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !868, file: !859, line: 130, baseType: !177, size: 512, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !868, file: !859, line: 132, baseType: !162, size: 32, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !868, file: !859, line: 132, baseType: !162, size: 32, offset: 800)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !868, file: !859, line: 133, baseType: !162, size: 32, offset: 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !868, file: !859, line: 134, baseType: !162, size: 32, offset: 864)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !868, file: !859, line: 134, baseType: !162, size: 32, offset: 896)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !868, file: !859, line: 134, baseType: !162, size: 32, offset: 928)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !868, file: !859, line: 135, baseType: !162, size: 32, offset: 960)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !868, file: !859, line: 135, baseType: !162, size: 32, offset: 992)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !868, file: !859, line: 136, baseType: !162, size: 32, offset: 1024)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !868, file: !859, line: 136, baseType: !162, size: 32, offset: 1056)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !868, file: !859, line: 137, baseType: !162, size: 32, offset: 1088)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !868, file: !859, line: 137, baseType: !162, size: 32, offset: 1120)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !868, file: !859, line: 138, baseType: !121, size: 32, offset: 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !868, file: !859, line: 139, baseType: !121, size: 32, offset: 1184)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !868, file: !859, line: 139, baseType: !121, size: 32, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !868, file: !859, line: 141, baseType: !119, size: 16, offset: 1248)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !868, file: !859, line: 142, baseType: !119, size: 16, offset: 1264)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !868, file: !859, line: 143, baseType: !162, size: 32, offset: 1280)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !868, file: !859, line: 144, baseType: !162, size: 32, offset: 1312)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !868, file: !859, line: 146, baseType: !896, size: 64, offset: 1344)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !859, line: 114, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !859, line: 99, size: 7232, elements: !899)
!899 = !{!900, !902, !903, !904, !905, !906, !907, !915, !919, !931, !940, !947, !957}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !898, file: !859, line: 100, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
