; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_structure.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_structure.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [43 x i8] c"BMESH_ASSERT failed: %s, %s(), %d at '%s'\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_structure.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !14, !56, !72, !73}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !6, line: 123, baseType: !7)
!6 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !6, line: 110, size: 640, elements: !8)
!8 = !{!9, !21, !27, !41, !42, !65, !71}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !7, file: !6, line: 111, baseType: !10, size: 128)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !6, line: 82, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !6, line: 64, size: 128, elements: !12)
!12 = !{!13, !15, !17, !19, !20}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, line: 65, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !11, file: !6, line: 66, baseType: !16, size: 32, offset: 64)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !11, file: !6, line: 73, baseType: !18, size: 8, offset: 96)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !11, file: !6, line: 74, baseType: !18, size: 8, offset: 104)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !11, file: !6, line: 80, baseType: !18, size: 8, offset: 112)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !7, file: !6, line: 112, baseType: !22, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !6, line: 180, size: 16, elements: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !23, file: !6, line: 181, baseType: !26, size: 16)
!26 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !7, file: !6, line: 114, baseType: !28, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !6, line: 90, size: 448, elements: !30)
!30 = !{!31, !32, !33, !38, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !29, file: !6, line: 91, baseType: !10, size: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !29, file: !6, line: 92, baseType: !22, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !29, file: !6, line: 94, baseType: !34, size: 96, offset: 192)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 96, elements: !36)
!35 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!36 = !{!37}
!37 = !DISubrange(count: 3)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !29, file: !6, line: 95, baseType: !34, size: 96, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !29, file: !6, line: 102, baseType: !40, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !7, file: !6, line: 114, baseType: !28, size: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !7, file: !6, line: 118, baseType: !43, size: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !6, line: 125, size: 576, elements: !45)
!45 = !{!46, !47, !48, !49, !61, !62, !63, !64}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !44, file: !6, line: 126, baseType: !10, size: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !44, file: !6, line: 129, baseType: !28, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !44, file: !6, line: 130, baseType: !40, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !44, file: !6, line: 131, baseType: !50, size: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !6, line: 164, size: 448, elements: !52)
!52 = !{!53, !54, !55, !58, !59, !60}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !51, file: !6, line: 165, baseType: !10, size: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !51, file: !6, line: 166, baseType: !22, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !51, file: !6, line: 172, baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !6, line: 140, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !51, file: !6, line: 174, baseType: !16, size: 32, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !51, file: !6, line: 175, baseType: !34, size: 96, offset: 288)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !51, file: !6, line: 176, baseType: !26, size: 16, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !44, file: !6, line: 135, baseType: !43, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !44, file: !6, line: 135, baseType: !43, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !6, line: 139, baseType: !43, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !44, file: !6, line: 139, baseType: !43, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !7, file: !6, line: 122, baseType: !66, size: 128, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !6, line: 108, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !6, line: 106, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !6, line: 107, baseType: !40, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !67, file: !6, line: 107, baseType: !40, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !7, file: !6, line: 122, baseType: !66, size: 128, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !6, line: 103, baseType: !29)
!75 = !{i32 7, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 1, !"wchar_size", i32 4}
!78 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!79 = distinct !DISubprogram(name: "bmesh_edge_swapverts", scope: !1, file: !1, line: 43, type: !80, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !4, !73, !73}
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DILocalVariable(name: "e", arg: 1, scope: !79, file: !1, line: 43, type: !4)
!84 = !DILocation(line: 43, column: 35, scope: !79)
!85 = !DILocalVariable(name: "v_orig", arg: 2, scope: !79, file: !1, line: 43, type: !73)
!86 = !DILocation(line: 43, column: 46, scope: !79)
!87 = !DILocalVariable(name: "v_new", arg: 3, scope: !79, file: !1, line: 43, type: !73)
!88 = !DILocation(line: 43, column: 62, scope: !79)
!89 = !DILocation(line: 45, column: 6, scope: !90)
!90 = distinct !DILexicalBlock(scope: !79, file: !1, line: 45, column: 6)
!91 = !DILocation(line: 45, column: 9, scope: !90)
!92 = !DILocation(line: 45, column: 15, scope: !90)
!93 = !DILocation(line: 45, column: 12, scope: !90)
!94 = !DILocation(line: 45, column: 6, scope: !79)
!95 = !DILocation(line: 46, column: 11, scope: !96)
!96 = distinct !DILexicalBlock(scope: !90, file: !1, line: 45, column: 23)
!97 = !DILocation(line: 46, column: 3, scope: !96)
!98 = !DILocation(line: 46, column: 6, scope: !96)
!99 = !DILocation(line: 46, column: 9, scope: !96)
!100 = !DILocation(line: 47, column: 26, scope: !96)
!101 = !DILocation(line: 47, column: 29, scope: !96)
!102 = !DILocation(line: 47, column: 42, scope: !96)
!103 = !DILocation(line: 47, column: 47, scope: !96)
!104 = !DILocation(line: 47, column: 3, scope: !96)
!105 = !DILocation(line: 47, column: 6, scope: !96)
!106 = !DILocation(line: 47, column: 19, scope: !96)
!107 = !DILocation(line: 47, column: 24, scope: !96)
!108 = !DILocation(line: 48, column: 3, scope: !96)
!109 = !DILocation(line: 50, column: 11, scope: !110)
!110 = distinct !DILexicalBlock(scope: !90, file: !1, line: 50, column: 11)
!111 = !DILocation(line: 50, column: 14, scope: !110)
!112 = !DILocation(line: 50, column: 20, scope: !110)
!113 = !DILocation(line: 50, column: 17, scope: !110)
!114 = !DILocation(line: 50, column: 11, scope: !90)
!115 = !DILocation(line: 51, column: 11, scope: !116)
!116 = distinct !DILexicalBlock(scope: !110, file: !1, line: 50, column: 28)
!117 = !DILocation(line: 51, column: 3, scope: !116)
!118 = !DILocation(line: 51, column: 6, scope: !116)
!119 = !DILocation(line: 51, column: 9, scope: !116)
!120 = !DILocation(line: 52, column: 26, scope: !116)
!121 = !DILocation(line: 52, column: 29, scope: !116)
!122 = !DILocation(line: 52, column: 42, scope: !116)
!123 = !DILocation(line: 52, column: 47, scope: !116)
!124 = !DILocation(line: 52, column: 3, scope: !116)
!125 = !DILocation(line: 52, column: 6, scope: !116)
!126 = !DILocation(line: 52, column: 19, scope: !116)
!127 = !DILocation(line: 52, column: 24, scope: !116)
!128 = !DILocation(line: 53, column: 3, scope: !116)
!129 = !DILocation(line: 55, column: 2, scope: !79)
!130 = !DILocation(line: 56, column: 1, scope: !79)
!131 = distinct !DISubprogram(name: "bmesh_disk_edge_append", scope: !1, file: !1, line: 134, type: !132, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !4, !73}
