; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_meta_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_meta_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !57, line: 67, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!65 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!66 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!67 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyFlag", file: !6, line: 151, baseType: !7, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!70 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!72 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!74 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!75 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!76 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!79 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!80 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!81 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!82 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!83 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!84 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!85 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!86 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!87 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!88 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!89 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!90 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!91 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!92 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!93 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!94 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!95 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!96 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!97 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!98 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!99 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!100 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!101 = !{!102, !1574, !48, !401, !1599, !1601, !136, !1624, !179, !446, !1625, !1626, !1627}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !105, line: 157, size: 1344, elements: !106)
!105 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !{!107, !109, !110, !111, !115, !116, !117, !118, !119, !120, !122, !124, !500, !501, !505, !506, !1558, !1559, !1564, !1569, !1570, !1572, !1573}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !105, line: 158, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !105, line: 158, baseType: !108, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !104, file: !105, line: 161, baseType: !48, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !104, file: !105, line: 164, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !105, line: 166, baseType: !48, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !105, line: 169, baseType: !112, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !104, file: !105, line: 171, baseType: !112, size: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !104, file: !105, line: 173, baseType: !48, size: 32, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !104, file: !105, line: 175, baseType: !112, size: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !105, line: 178, baseType: !121, size: 32, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !104, file: !105, line: 180, baseType: !123, size: 32, offset: 608)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !104, file: !105, line: 182, baseType: !125, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !105, line: 73, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!48, !129, !446}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !131)
!131 = !{!132, !137, !499}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !6, line: 58, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !130, file: !6, line: 56, size: 64, elements: !134)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !6, line: 57, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !6, line: 60, baseType: !138, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !105, line: 339, size: 1600, elements: !140)
!140 = !{!141, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !174, !180, !481, !486, !492, !498}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !139, file: !105, line: 341, baseType: !142, size: 320)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !105, line: 135, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !105, line: 130, size: 320, elements: !144)
!144 = !{!145, !146, !147, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !105, line: 131, baseType: !136, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !105, line: 131, baseType: !136, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !143, file: !105, line: 133, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !105, line: 46, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !143, file: !105, line: 134, baseType: !151, size: 128, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !152, line: 71, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !152, line: 69, size: 128, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !153, file: !152, line: 70, baseType: !136, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !153, file: !152, line: 70, baseType: !136, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !139, file: !105, line: 344, baseType: !112, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !139, file: !105, line: 348, baseType: !136, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !139, file: !105, line: 349, baseType: !136, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !139, file: !105, line: 352, baseType: !48, size: 32, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !105, line: 355, baseType: !112, size: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !139, file: !105, line: 357, baseType: !112, size: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !139, file: !105, line: 359, baseType: !112, size: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !139, file: !105, line: 361, baseType: !48, size: 32, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !139, file: !105, line: 364, baseType: !102, size: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !139, file: !105, line: 367, baseType: !102, size: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !139, file: !105, line: 370, baseType: !138, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !139, file: !105, line: 376, baseType: !138, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !139, file: !105, line: 379, baseType: !170, size: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !105, line: 70, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!138, !129}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !139, file: !105, line: 382, baseType: !175, size: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !105, line: 71, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !129}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !139, file: !105, line: 385, baseType: !181, size: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!138, !185, !317, !136, !112, !442, !447, !477}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !187, line: 53, size: 15232, elements: !188)
!187 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !{!189, !190, !191, !195, !197, !198, !199, !200, !206, !210, !211, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !308, !314}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !187, line: 54, baseType: !185, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !187, line: 54, baseType: !185, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !187, line: 55, baseType: !192, size: 8192, offset: 128)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 8192, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 1024)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !186, file: !187, line: 56, baseType: !196, size: 16, offset: 8320)
!196 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !186, file: !187, line: 56, baseType: !196, size: 16, offset: 8336)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !186, file: !187, line: 57, baseType: !196, size: 16, offset: 8352)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !186, file: !187, line: 57, baseType: !196, size: 16, offset: 8368)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !186, file: !187, line: 58, baseType: !201, size: 64, offset: 8384)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !202, line: 27, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !204, line: 45, baseType: !205)
!204 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!205 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !186, file: !187, line: 59, baseType: !207, size: 128, offset: 8448)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 16)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !186, file: !187, line: 60, baseType: !196, size: 16, offset: 8576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !186, file: !187, line: 62, baseType: !212, size: 64, offset: 8640)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !214, line: 136, size: 17600, elements: !215)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = !{!216, !259, !261, !264, !265, !266, !267}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !213, file: !214, line: 137, baseType: !217, size: 960)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !214, line: 130, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !214, line: 117, size: 960, elements: !219)
!219 = !{!220, !221, !222, !224, !225, !229, !230, !231, !232, !233}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !214, line: 118, baseType: !136, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !218, file: !214, line: 118, baseType: !136, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !218, file: !214, line: 119, baseType: !223, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !218, file: !214, line: 120, baseType: !212, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !214, line: 121, baseType: !226, size: 528, offset: 256)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 528, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 66)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !218, file: !214, line: 126, baseType: !196, size: 16, offset: 784)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !218, file: !214, line: 127, baseType: !48, size: 32, offset: 800)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !218, file: !214, line: 128, baseType: !48, size: 32, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !218, file: !214, line: 128, baseType: !48, size: 32, offset: 864)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !218, file: !214, line: 129, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !214, line: 75, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !214, line: 62, size: 1024, elements: !237)
!237 = !{!238, !240, !241, !242, !243, !244, !248, !249, !257, !258}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !214, line: 63, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !214, line: 63, baseType: !239, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !214, line: 64, baseType: !114, size: 8, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !236, file: !214, line: 64, baseType: !114, size: 8, offset: 136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !214, line: 65, baseType: !196, size: 16, offset: 144)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !214, line: 66, baseType: !245, size: 512, offset: 160)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 512, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !236, file: !214, line: 67, baseType: !48, size: 32, offset: 672)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !214, line: 69, baseType: !250, size: 256, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !214, line: 60, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !214, line: 48, size: 256, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !251, file: !214, line: 49, baseType: !136, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !251, file: !214, line: 58, baseType: !151, size: 128, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !251, file: !214, line: 59, baseType: !48, size: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !251, file: !214, line: 59, baseType: !48, size: 32, offset: 224)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !214, line: 70, baseType: !48, size: 32, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !236, file: !214, line: 74, baseType: !48, size: 32, offset: 992)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !213, file: !214, line: 138, baseType: !260, size: 64, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !213, file: !214, line: 139, baseType: !262, size: 64, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !214, line: 43, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !214, line: 140, baseType: !192, size: 8192, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !213, file: !214, line: 141, baseType: !192, size: 8192, offset: 9280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !213, file: !214, line: 148, baseType: !212, size: 64, offset: 17472)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !213, file: !214, line: 150, baseType: !268, size: 64, offset: 17536)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !214, line: 45, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !186, file: !187, line: 63, baseType: !151, size: 128, offset: 8704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !186, file: !187, line: 64, baseType: !151, size: 128, offset: 8832)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !186, file: !187, line: 65, baseType: !151, size: 128, offset: 8960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !186, file: !187, line: 66, baseType: !151, size: 128, offset: 9088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !186, file: !187, line: 67, baseType: !151, size: 128, offset: 9216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !186, file: !187, line: 68, baseType: !151, size: 128, offset: 9344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !186, file: !187, line: 69, baseType: !151, size: 128, offset: 9472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !186, file: !187, line: 70, baseType: !151, size: 128, offset: 9600)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !186, file: !187, line: 71, baseType: !151, size: 128, offset: 9728)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !186, file: !187, line: 72, baseType: !151, size: 128, offset: 9856)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !186, file: !187, line: 73, baseType: !151, size: 128, offset: 9984)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !186, file: !187, line: 74, baseType: !151, size: 128, offset: 10112)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !186, file: !187, line: 75, baseType: !151, size: 128, offset: 10240)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !186, file: !187, line: 76, baseType: !151, size: 128, offset: 10368)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !186, file: !187, line: 77, baseType: !151, size: 128, offset: 10496)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !186, file: !187, line: 78, baseType: !151, size: 128, offset: 10624)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !186, file: !187, line: 79, baseType: !151, size: 128, offset: 10752)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !186, file: !187, line: 80, baseType: !151, size: 128, offset: 10880)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !186, file: !187, line: 81, baseType: !151, size: 128, offset: 11008)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !186, file: !187, line: 82, baseType: !151, size: 128, offset: 11136)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !186, file: !187, line: 83, baseType: !151, size: 128, offset: 11264)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !186, file: !187, line: 84, baseType: !151, size: 128, offset: 11392)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !186, file: !187, line: 85, baseType: !151, size: 128, offset: 11520)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !186, file: !187, line: 86, baseType: !151, size: 128, offset: 11648)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !186, file: !187, line: 87, baseType: !151, size: 128, offset: 11776)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !186, file: !187, line: 88, baseType: !151, size: 128, offset: 11904)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !186, file: !187, line: 89, baseType: !151, size: 128, offset: 12032)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !186, file: !187, line: 90, baseType: !151, size: 128, offset: 12160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !186, file: !187, line: 91, baseType: !151, size: 128, offset: 12288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !186, file: !187, line: 92, baseType: !151, size: 128, offset: 12416)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !186, file: !187, line: 93, baseType: !151, size: 128, offset: 12544)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !186, file: !187, line: 94, baseType: !151, size: 128, offset: 12672)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !186, file: !187, line: 95, baseType: !151, size: 128, offset: 12800)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !186, file: !187, line: 96, baseType: !151, size: 128, offset: 12928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !186, file: !187, line: 98, baseType: !305, size: 2048, offset: 13056)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 2048, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !186, file: !187, line: 101, baseType: !309, size: 64, offset: 15104)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !311, line: 58, size: 32, elements: !312)
!311 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !310, file: !311, line: 59, baseType: !48, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !186, file: !187, line: 103, baseType: !315, size: 64, offset: 15168)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !187, line: 51, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !57, line: 106, size: 320, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !318, file: !57, line: 107, baseType: !151, size: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !318, file: !57, line: 108, baseType: !48, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !318, file: !57, line: 109, baseType: !48, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !57, line: 110, baseType: !48, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !318, file: !57, line: 110, baseType: !48, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !318, file: !57, line: 111, baseType: !326, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !328, line: 490, size: 768, elements: !329)
!328 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!329 = !{!330, !331, !332, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !328, line: 491, baseType: !326, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !327, file: !328, line: 491, baseType: !326, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !327, file: !328, line: 493, baseType: !333, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !57, line: 169, size: 2048, elements: !335)
!335 = !{!336, !337, !338, !339, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !408, !411, !425, !426, !427, !428, !429, !430, !431, !432}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !57, line: 170, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !57, line: 170, baseType: !333, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !334, file: !57, line: 172, baseType: !136, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !334, file: !57, line: 174, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !342, line: 41, flags: DIFlagFwdDecl)
!342 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !334, file: !57, line: 175, baseType: !340, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !334, file: !57, line: 176, baseType: !245, size: 512, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !334, file: !57, line: 178, baseType: !196, size: 16, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !334, file: !57, line: 178, baseType: !196, size: 16, offset: 848)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !334, file: !57, line: 178, baseType: !196, size: 16, offset: 864)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !334, file: !57, line: 178, baseType: !196, size: 16, offset: 880)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !334, file: !57, line: 179, baseType: !196, size: 16, offset: 896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !334, file: !57, line: 180, baseType: !196, size: 16, offset: 912)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !334, file: !57, line: 181, baseType: !196, size: 16, offset: 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !334, file: !57, line: 182, baseType: !196, size: 16, offset: 944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !334, file: !57, line: 183, baseType: !196, size: 16, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !334, file: !57, line: 184, baseType: !196, size: 16, offset: 976)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !334, file: !57, line: 185, baseType: !196, size: 16, offset: 992)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !334, file: !57, line: 186, baseType: !196, size: 16, offset: 1008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !334, file: !57, line: 188, baseType: !48, size: 32, offset: 1024)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !334, file: !57, line: 190, baseType: !196, size: 16, offset: 1056)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !334, file: !57, line: 191, baseType: !196, size: 16, offset: 1072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !334, file: !57, line: 194, baseType: !361, size: 64, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !328, line: 421, size: 960, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !374, !378, !379, !380, !381, !382, !383, !384, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !404, !405, !406, !407}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !328, line: 422, baseType: !361, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !362, file: !328, line: 422, baseType: !361, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !328, line: 424, baseType: !196, size: 16, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !362, file: !328, line: 425, baseType: !196, size: 16, offset: 144)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !362, file: !328, line: 426, baseType: !48, size: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !362, file: !328, line: 426, baseType: !48, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !362, file: !328, line: 427, baseType: !371, size: 64, offset: 224)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 2)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !362, file: !328, line: 428, baseType: !375, size: 48, offset: 288)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 48, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 6)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !362, file: !328, line: 431, baseType: !114, size: 8, offset: 336)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !362, file: !328, line: 432, baseType: !114, size: 8, offset: 344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !362, file: !328, line: 435, baseType: !196, size: 16, offset: 352)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !362, file: !328, line: 436, baseType: !196, size: 16, offset: 368)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !362, file: !328, line: 437, baseType: !48, size: 32, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !362, file: !328, line: 437, baseType: !48, size: 32, offset: 416)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !362, file: !328, line: 438, baseType: !385, size: 64, offset: 448)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !362, file: !328, line: 439, baseType: !48, size: 32, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !362, file: !328, line: 439, baseType: !48, size: 32, offset: 544)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !362, file: !328, line: 442, baseType: !196, size: 16, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !362, file: !328, line: 442, baseType: !196, size: 16, offset: 592)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !362, file: !328, line: 442, baseType: !196, size: 16, offset: 608)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !362, file: !328, line: 442, baseType: !196, size: 16, offset: 624)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !362, file: !328, line: 443, baseType: !196, size: 16, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !362, file: !328, line: 446, baseType: !196, size: 16, offset: 656)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !362, file: !328, line: 449, baseType: !112, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !362, file: !328, line: 452, baseType: !396, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !328, line: 463, size: 128, elements: !398)
!398 = !{!399, !400, !402, !403}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !397, file: !328, line: 464, baseType: !48, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !397, file: !328, line: 465, baseType: !401, size: 32, offset: 32)
!401 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !397, file: !328, line: 466, baseType: !401, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !397, file: !328, line: 467, baseType: !401, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !362, file: !328, line: 455, baseType: !196, size: 16, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !362, file: !328, line: 456, baseType: !196, size: 16, offset: 848)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !362, file: !328, line: 457, baseType: !48, size: 32, offset: 864)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !362, file: !328, line: 458, baseType: !136, size: 64, offset: 896)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !334, file: !57, line: 196, baseType: !409, size: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !57, line: 55, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !334, file: !57, line: 198, baseType: !412, size: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !328, line: 398, size: 448, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !413, file: !328, line: 399, baseType: !412, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !413, file: !328, line: 399, baseType: !412, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !413, file: !328, line: 400, baseType: !48, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !413, file: !328, line: 401, baseType: !48, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !328, line: 402, baseType: !48, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !413, file: !328, line: 403, baseType: !48, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !413, file: !328, line: 404, baseType: !48, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !413, file: !328, line: 405, baseType: !48, size: 32, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !413, file: !328, line: 407, baseType: !136, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !413, file: !328, line: 414, baseType: !136, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !334, file: !57, line: 200, baseType: !48, size: 32, offset: 1280)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !334, file: !57, line: 200, baseType: !48, size: 32, offset: 1312)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !334, file: !57, line: 201, baseType: !136, size: 64, offset: 1344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !334, file: !57, line: 203, baseType: !151, size: 128, offset: 1408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !334, file: !57, line: 204, baseType: !151, size: 128, offset: 1536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !334, file: !57, line: 205, baseType: !151, size: 128, offset: 1664)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !334, file: !57, line: 207, baseType: !151, size: 128, offset: 1792)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !334, file: !57, line: 208, baseType: !151, size: 128, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !327, file: !328, line: 495, baseType: !385, size: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !327, file: !328, line: 496, baseType: !48, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !327, file: !328, line: 497, baseType: !136, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !327, file: !328, line: 499, baseType: !385, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !327, file: !328, line: 500, baseType: !385, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !327, file: !328, line: 502, baseType: !385, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !327, file: !328, line: 503, baseType: !385, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !327, file: !328, line: 504, baseType: !385, size: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !327, file: !328, line: 505, baseType: !48, size: 32, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!48, !129, !136, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!48, !451, !129, !453, !467}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !105, line: 137, size: 640, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !476}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !454, file: !105, line: 139, baseType: !142, size: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !454, file: !105, line: 142, baseType: !112, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !454, file: !105, line: 144, baseType: !48, size: 32, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !454, file: !105, line: 147, baseType: !112, size: 64, offset: 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !454, file: !105, line: 150, baseType: !461, size: 64, offset: 512)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !451, !317, !465, !467}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !130)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !470)
!470 = !{!471, !472, !473, !474, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !469, file: !6, line: 339, baseType: !136, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !469, file: !6, line: 342, baseType: !453, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !469, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !469, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !469, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !454, file: !105, line: 154, baseType: !102, size: 64, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !136}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !139, file: !105, line: 386, baseType: !482, size: 64, offset: 1280)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !185, !138}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !139, file: !105, line: 387, baseType: !487, size: 64, offset: 1344)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!491, !465}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !139, file: !105, line: 390, baseType: !493, size: 64, offset: 1408)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !105, line: 69, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!239, !129, !497}
!497 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !139, file: !105, line: 393, baseType: !151, size: 128, offset: 1472)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !6, line: 61, baseType: !136, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !104, file: !105, line: 184, baseType: !7, size: 32, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !104, file: !105, line: 186, baseType: !502, size: 96, offset: 736)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 3)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !104, file: !105, line: 187, baseType: !7, size: 32, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !104, file: !105, line: 190, baseType: !507, size: 64, offset: 896)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !105, line: 64, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !185, !511, !129}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !513, line: 1216, size: 39680, elements: !514)
!513 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!514 = !{!515, !516, !519, !800, !803, !804, !805, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !831, !834, !837, !1132, !1135, !1431, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1453, !1454, !1455, !1456, !1457, !1465, !1532, !1539, !1540, !1547, !1550, !1551, !1552, !1553, !1554, !1555}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !512, file: !513, line: 1217, baseType: !217, size: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !512, file: !513, line: 1218, baseType: !517, size: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !513, line: 58, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !512, file: !513, line: 1220, baseType: !520, size: 64, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !522, line: 115, size: 11392, elements: !523)
!522 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!523 = !{!524, !525, !526, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !544, !554, !568, !569, !609, !610, !613, !614, !630, !631, !632, !633, !634, !635, !636, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !655, !656, !657, !658, !659, !660, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !720, !721, !722, !723, !724, !725, !726, !727, !728, !731, !734, !738, !739, !740, !741, !742, !745, !748, !751, !752, !753, !754, !755, !756, !757, !758, !760, !763, !766, !768, !788, !789}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !521, file: !522, line: 116, baseType: !217, size: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !521, file: !522, line: 117, baseType: !517, size: 64, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !521, file: !522, line: 119, baseType: !527, size: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !522, line: 57, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !521, file: !522, line: 121, baseType: !196, size: 16, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !521, file: !522, line: 121, baseType: !196, size: 16, offset: 1104)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !521, file: !522, line: 122, baseType: !48, size: 32, offset: 1120)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !521, file: !522, line: 122, baseType: !48, size: 32, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !521, file: !522, line: 122, baseType: !48, size: 32, offset: 1184)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !521, file: !522, line: 123, baseType: !245, size: 512, offset: 1216)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !521, file: !522, line: 124, baseType: !520, size: 64, offset: 1728)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !521, file: !522, line: 124, baseType: !520, size: 64, offset: 1792)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !521, file: !522, line: 127, baseType: !520, size: 64, offset: 1856)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !521, file: !522, line: 127, baseType: !520, size: 64, offset: 1920)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !521, file: !522, line: 127, baseType: !520, size: 64, offset: 1984)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !521, file: !522, line: 128, baseType: !541, size: 64, offset: 2048)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !543, line: 41, flags: DIFlagFwdDecl)
!543 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !521, file: !522, line: 130, baseType: !545, size: 64, offset: 2112)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !522, line: 97, size: 832, elements: !547)
!547 = !{!548, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !546, file: !522, line: 98, baseType: !549, size: 768)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 768, elements: !550)
!550 = !{!551, !504}
!551 = !DISubrange(count: 8)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !522, line: 99, baseType: !48, size: 32, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !546, file: !522, line: 99, baseType: !48, size: 32, offset: 800)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !521, file: !522, line: 131, baseType: !555, size: 64, offset: 2176)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !557, line: 486, size: 1600, elements: !558)
!557 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !556, file: !557, line: 487, baseType: !217, size: 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !556, file: !557, line: 489, baseType: !151, size: 128, offset: 960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !556, file: !557, line: 490, baseType: !151, size: 128, offset: 1088)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !556, file: !557, line: 491, baseType: !151, size: 128, offset: 1216)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !556, file: !557, line: 492, baseType: !151, size: 128, offset: 1344)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !556, file: !557, line: 494, baseType: !48, size: 32, offset: 1472)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !556, file: !557, line: 495, baseType: !48, size: 32, offset: 1504)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !556, file: !557, line: 497, baseType: !48, size: 32, offset: 1536)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !556, file: !557, line: 498, baseType: !48, size: 32, offset: 1568)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !521, file: !522, line: 132, baseType: !555, size: 64, offset: 2240)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !521, file: !522, line: 133, baseType: !570, size: 64, offset: 2304)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !557, line: 334, size: 1728, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !582, !583, !584, !585, !586, !587, !588, !608}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !571, file: !557, line: 335, baseType: !151, size: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !571, file: !557, line: 336, baseType: !148, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !557, line: 338, baseType: !196, size: 16, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !571, file: !557, line: 338, baseType: !196, size: 16, offset: 208)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !571, file: !557, line: 339, baseType: !7, size: 32, offset: 224)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !571, file: !557, line: 340, baseType: !48, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !571, file: !557, line: 342, baseType: !401, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !571, file: !557, line: 343, baseType: !581, size: 96, offset: 320)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 96, elements: !503)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !571, file: !557, line: 344, baseType: !581, size: 96, offset: 416)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !571, file: !557, line: 347, baseType: !151, size: 128, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !571, file: !557, line: 349, baseType: !48, size: 32, offset: 640)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !571, file: !557, line: 350, baseType: !48, size: 32, offset: 672)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !571, file: !557, line: 351, baseType: !136, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !571, file: !557, line: 352, baseType: !136, size: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !571, file: !557, line: 354, baseType: !589, size: 384, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !557, line: 116, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !557, line: 94, size: 384, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !590, file: !557, line: 96, baseType: !48, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !590, file: !557, line: 96, baseType: !48, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !590, file: !557, line: 97, baseType: !48, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !590, file: !557, line: 97, baseType: !48, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !590, file: !557, line: 99, baseType: !196, size: 16, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !590, file: !557, line: 100, baseType: !196, size: 16, offset: 144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !590, file: !557, line: 102, baseType: !196, size: 16, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !590, file: !557, line: 105, baseType: !196, size: 16, offset: 176)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !590, file: !557, line: 108, baseType: !196, size: 16, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !590, file: !557, line: 109, baseType: !196, size: 16, offset: 208)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !590, file: !557, line: 111, baseType: !196, size: 16, offset: 224)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !590, file: !557, line: 112, baseType: !196, size: 16, offset: 240)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !590, file: !557, line: 114, baseType: !48, size: 32, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !590, file: !557, line: 114, baseType: !48, size: 32, offset: 288)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !590, file: !557, line: 115, baseType: !48, size: 32, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !590, file: !557, line: 115, baseType: !48, size: 32, offset: 352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !571, file: !557, line: 355, baseType: !245, size: 512, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !521, file: !522, line: 134, baseType: !136, size: 64, offset: 2368)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !521, file: !522, line: 136, baseType: !611, size: 64, offset: 2432)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !513, line: 61, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !521, file: !522, line: 138, baseType: !589, size: 384, offset: 2496)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !521, file: !522, line: 139, baseType: !615, size: 64, offset: 2880)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !557, line: 80, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !557, line: 72, size: 192, elements: !618)
!618 = !{!619, !626, !627, !628, !629}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !617, file: !557, line: 73, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !557, line: 59, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !557, line: 56, size: 128, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !622, file: !557, line: 57, baseType: !581, size: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !622, file: !557, line: 58, baseType: !48, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !617, file: !557, line: 74, baseType: !48, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !617, file: !557, line: 76, baseType: !48, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !617, file: !557, line: 77, baseType: !48, size: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !617, file: !557, line: 79, baseType: !48, size: 32, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !521, file: !522, line: 141, baseType: !151, size: 128, offset: 2944)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !521, file: !522, line: 142, baseType: !151, size: 128, offset: 3072)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !521, file: !522, line: 143, baseType: !151, size: 128, offset: 3200)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !521, file: !522, line: 144, baseType: !151, size: 128, offset: 3328)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !521, file: !522, line: 146, baseType: !48, size: 32, offset: 3456)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !521, file: !522, line: 147, baseType: !48, size: 32, offset: 3488)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !521, file: !522, line: 150, baseType: !637, size: 64, offset: 3520)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !513, line: 179, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !521, file: !522, line: 151, baseType: !179, size: 64, offset: 3584)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !521, file: !522, line: 152, baseType: !48, size: 32, offset: 3648)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !521, file: !522, line: 153, baseType: !48, size: 32, offset: 3680)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !521, file: !522, line: 156, baseType: !581, size: 96, offset: 3712)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !521, file: !522, line: 156, baseType: !581, size: 96, offset: 3808)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !521, file: !522, line: 156, baseType: !581, size: 96, offset: 3904)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !521, file: !522, line: 157, baseType: !581, size: 96, offset: 4000)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !521, file: !522, line: 158, baseType: !581, size: 96, offset: 4096)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !521, file: !522, line: 159, baseType: !581, size: 96, offset: 4192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !521, file: !522, line: 160, baseType: !581, size: 96, offset: 4288)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !521, file: !522, line: 160, baseType: !581, size: 96, offset: 4384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !521, file: !522, line: 161, baseType: !652, size: 128, offset: 4480)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 128, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 4)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !521, file: !522, line: 161, baseType: !652, size: 128, offset: 4608)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !521, file: !522, line: 162, baseType: !581, size: 96, offset: 4736)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !521, file: !522, line: 162, baseType: !581, size: 96, offset: 4832)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !521, file: !522, line: 163, baseType: !401, size: 32, offset: 4928)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !521, file: !522, line: 163, baseType: !401, size: 32, offset: 4960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !521, file: !522, line: 164, baseType: !661, size: 512, offset: 4992)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 512, elements: !662)
!662 = !{!654, !654}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !521, file: !522, line: 165, baseType: !661, size: 512, offset: 5504)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !521, file: !522, line: 166, baseType: !661, size: 512, offset: 6016)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !521, file: !522, line: 167, baseType: !661, size: 512, offset: 6528)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !521, file: !522, line: 176, baseType: !661, size: 512, offset: 7040)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !521, file: !522, line: 178, baseType: !7, size: 32, offset: 7552)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !522, line: 180, baseType: !196, size: 16, offset: 7584)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !521, file: !522, line: 181, baseType: !196, size: 16, offset: 7600)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !521, file: !522, line: 183, baseType: !196, size: 16, offset: 7616)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !521, file: !522, line: 183, baseType: !196, size: 16, offset: 7632)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !521, file: !522, line: 184, baseType: !196, size: 16, offset: 7648)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !521, file: !522, line: 184, baseType: !196, size: 16, offset: 7664)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !521, file: !522, line: 185, baseType: !196, size: 16, offset: 7680)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !521, file: !522, line: 186, baseType: !196, size: 16, offset: 7696)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !521, file: !522, line: 187, baseType: !196, size: 16, offset: 7712)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !521, file: !522, line: 188, baseType: !114, size: 8, offset: 7728)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !521, file: !522, line: 189, baseType: !114, size: 8, offset: 7736)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !521, file: !522, line: 192, baseType: !48, size: 32, offset: 7744)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !521, file: !522, line: 192, baseType: !48, size: 32, offset: 7776)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !521, file: !522, line: 192, baseType: !48, size: 32, offset: 7808)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !521, file: !522, line: 192, baseType: !48, size: 32, offset: 7840)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !521, file: !522, line: 194, baseType: !48, size: 32, offset: 7872)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !521, file: !522, line: 202, baseType: !401, size: 32, offset: 7904)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !521, file: !522, line: 202, baseType: !401, size: 32, offset: 7936)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !521, file: !522, line: 202, baseType: !401, size: 32, offset: 7968)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !521, file: !522, line: 211, baseType: !401, size: 32, offset: 8000)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !521, file: !522, line: 212, baseType: !401, size: 32, offset: 8032)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !521, file: !522, line: 213, baseType: !401, size: 32, offset: 8064)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !521, file: !522, line: 214, baseType: !401, size: 32, offset: 8096)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !521, file: !522, line: 215, baseType: !401, size: 32, offset: 8128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !521, file: !522, line: 216, baseType: !401, size: 32, offset: 8160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !521, file: !522, line: 219, baseType: !401, size: 32, offset: 8192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !521, file: !522, line: 220, baseType: !401, size: 32, offset: 8224)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !521, file: !522, line: 221, baseType: !401, size: 32, offset: 8256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !521, file: !522, line: 224, baseType: !697, size: 16, offset: 8288)
!697 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !521, file: !522, line: 224, baseType: !697, size: 16, offset: 8304)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !521, file: !522, line: 226, baseType: !196, size: 16, offset: 8320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !521, file: !522, line: 228, baseType: !114, size: 8, offset: 8336)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !521, file: !522, line: 229, baseType: !114, size: 8, offset: 8344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !521, file: !522, line: 231, baseType: !196, size: 16, offset: 8352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !521, file: !522, line: 232, baseType: !114, size: 8, offset: 8368)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !521, file: !522, line: 233, baseType: !114, size: 8, offset: 8376)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !521, file: !522, line: 234, baseType: !401, size: 32, offset: 8384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !521, file: !522, line: 235, baseType: !401, size: 32, offset: 8416)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !521, file: !522, line: 237, baseType: !151, size: 128, offset: 8448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !521, file: !522, line: 238, baseType: !151, size: 128, offset: 8576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !521, file: !522, line: 239, baseType: !151, size: 128, offset: 8704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !521, file: !522, line: 240, baseType: !151, size: 128, offset: 8832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !521, file: !522, line: 242, baseType: !401, size: 32, offset: 8960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !521, file: !522, line: 244, baseType: !196, size: 16, offset: 8992)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !521, file: !522, line: 245, baseType: !697, size: 16, offset: 9008)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !521, file: !522, line: 246, baseType: !652, size: 128, offset: 9024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !521, file: !522, line: 248, baseType: !48, size: 32, offset: 9152)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !521, file: !522, line: 249, baseType: !48, size: 32, offset: 9184)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !521, file: !522, line: 251, baseType: !718, size: 64, offset: 9216)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !522, line: 251, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !521, file: !522, line: 253, baseType: !114, size: 8, offset: 9280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !521, file: !522, line: 254, baseType: !114, size: 8, offset: 9288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !521, file: !522, line: 255, baseType: !196, size: 16, offset: 9296)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !521, file: !522, line: 256, baseType: !581, size: 96, offset: 9312)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !521, file: !522, line: 258, baseType: !151, size: 128, offset: 9408)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !521, file: !522, line: 259, baseType: !151, size: 128, offset: 9536)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !521, file: !522, line: 260, baseType: !151, size: 128, offset: 9664)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !521, file: !522, line: 261, baseType: !151, size: 128, offset: 9792)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !521, file: !522, line: 263, baseType: !729, size: 64, offset: 9920)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !522, line: 52, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !521, file: !522, line: 264, baseType: !732, size: 64, offset: 9984)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !522, line: 53, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !521, file: !522, line: 265, baseType: !735, size: 64, offset: 10048)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !737, line: 43, flags: DIFlagFwdDecl)
!737 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!738 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !521, file: !522, line: 267, baseType: !114, size: 8, offset: 10112)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !521, file: !522, line: 268, baseType: !114, size: 8, offset: 10120)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !521, file: !522, line: 269, baseType: !196, size: 16, offset: 10128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !521, file: !522, line: 270, baseType: !401, size: 32, offset: 10144)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !521, file: !522, line: 272, baseType: !743, size: 64, offset: 10176)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !522, line: 54, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !521, file: !522, line: 275, baseType: !746, size: 64, offset: 10240)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !522, line: 275, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !521, file: !522, line: 277, baseType: !749, size: 64, offset: 10304)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !543, line: 40, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !521, file: !522, line: 277, baseType: !749, size: 64, offset: 10368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !521, file: !522, line: 278, baseType: !201, size: 64, offset: 10432)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !521, file: !522, line: 279, baseType: !201, size: 64, offset: 10496)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !521, file: !522, line: 280, baseType: !7, size: 32, offset: 10560)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !521, file: !522, line: 281, baseType: !7, size: 32, offset: 10592)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !521, file: !522, line: 283, baseType: !151, size: 128, offset: 10624)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !521, file: !522, line: 284, baseType: !151, size: 128, offset: 10752)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !521, file: !522, line: 285, baseType: !759, size: 64, offset: 10880)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !521, file: !522, line: 287, baseType: !761, size: 64, offset: 10944)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !522, line: 59, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !521, file: !522, line: 288, baseType: !764, size: 64, offset: 11008)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !522, line: 288, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !521, file: !522, line: 290, baseType: !767, size: 64, offset: 11072)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 64, elements: !372)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !521, file: !522, line: 291, baseType: !769, size: 64, offset: 11136)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !771, line: 65, baseType: !772)
!771 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !771, line: 50, size: 320, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !772, file: !771, line: 51, baseType: !511, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !772, file: !771, line: 53, baseType: !48, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !772, file: !771, line: 54, baseType: !48, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !772, file: !771, line: 55, baseType: !48, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !772, file: !771, line: 55, baseType: !48, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !772, file: !771, line: 56, baseType: !114, size: 8, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !772, file: !771, line: 56, baseType: !114, size: 8, offset: 200)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !772, file: !771, line: 57, baseType: !114, size: 8, offset: 208)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !772, file: !771, line: 57, baseType: !114, size: 8, offset: 216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !772, file: !771, line: 59, baseType: !196, size: 16, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !772, file: !771, line: 59, baseType: !196, size: 16, offset: 240)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !772, file: !771, line: 59, baseType: !196, size: 16, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !771, line: 61, baseType: !196, size: 16, offset: 272)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !772, file: !771, line: 63, baseType: !48, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !521, file: !522, line: 293, baseType: !151, size: 128, offset: 11200)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !521, file: !522, line: 294, baseType: !790, size: 64, offset: 11328)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !522, line: 113, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !522, line: 108, size: 256, elements: !793)
!793 = !{!794, !796, !797, !798, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !522, line: 109, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !792, file: !522, line: 109, baseType: !795, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !792, file: !522, line: 110, baseType: !520, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !792, file: !522, line: 111, baseType: !48, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !792, file: !522, line: 112, baseType: !401, size: 32, offset: 224)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !512, file: !513, line: 1221, baseType: !801, size: 64, offset: 1088)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !513, line: 52, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !512, file: !513, line: 1223, baseType: !511, size: 64, offset: 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !512, file: !513, line: 1225, baseType: !151, size: 128, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !512, file: !513, line: 1226, baseType: !806, size: 64, offset: 1344)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !513, line: 69, size: 320, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !807, file: !513, line: 70, baseType: !806, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !807, file: !513, line: 70, baseType: !806, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !807, file: !513, line: 71, baseType: !7, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !807, file: !513, line: 71, baseType: !7, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !513, line: 72, baseType: !48, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !807, file: !513, line: 73, baseType: !196, size: 16, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !807, file: !513, line: 73, baseType: !196, size: 16, offset: 240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !807, file: !513, line: 74, baseType: !520, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !512, file: !513, line: 1227, baseType: !520, size: 64, offset: 1408)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !512, file: !513, line: 1229, baseType: !581, size: 96, offset: 1472)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !512, file: !513, line: 1230, baseType: !581, size: 96, offset: 1568)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !512, file: !513, line: 1231, baseType: !581, size: 96, offset: 1664)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !512, file: !513, line: 1231, baseType: !581, size: 96, offset: 1760)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !512, file: !513, line: 1233, baseType: !7, size: 32, offset: 1856)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !512, file: !513, line: 1234, baseType: !48, size: 32, offset: 1888)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !512, file: !513, line: 1235, baseType: !7, size: 32, offset: 1920)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !513, line: 1237, baseType: !196, size: 16, offset: 1952)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !512, file: !513, line: 1239, baseType: !114, size: 8, offset: 1968)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !512, file: !513, line: 1240, baseType: !828, size: 8, offset: 1976)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 8, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 1)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !512, file: !513, line: 1242, baseType: !832, size: 64, offset: 1984)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !513, line: 57, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !512, file: !513, line: 1244, baseType: !835, size: 64, offset: 2048)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !513, line: 59, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !512, file: !513, line: 1246, baseType: !838, size: 64, offset: 2112)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !513, line: 1067, size: 5184, elements: !840)
!840 = !{!841, !871, !872, !887, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !909, !1004, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1115}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !839, file: !513, line: 1068, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !513, line: 934, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !513, line: 925, size: 576, elements: !845)
!845 = !{!846, !862, !863, !864, !865, !867, !870}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !844, file: !513, line: 926, baseType: !847, size: 320)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !513, line: 830, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !513, line: 813, size: 320, elements: !849)
!849 = !{!850, !853, !856, !857, !859, !860, !861}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !848, file: !513, line: 814, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !513, line: 51, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !848, file: !513, line: 815, baseType: !854, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !513, line: 815, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !848, file: !513, line: 818, baseType: !136, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !848, file: !513, line: 819, baseType: !858, size: 32, offset: 192)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 32, elements: !653)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !848, file: !513, line: 822, baseType: !48, size: 32, offset: 224)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !848, file: !513, line: 826, baseType: !48, size: 32, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !848, file: !513, line: 829, baseType: !48, size: 32, offset: 288)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !844, file: !513, line: 928, baseType: !196, size: 16, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !844, file: !513, line: 928, baseType: !196, size: 16, offset: 336)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !844, file: !513, line: 929, baseType: !48, size: 32, offset: 352)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !844, file: !513, line: 930, baseType: !866, size: 64, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !844, file: !513, line: 931, baseType: !868, size: 64, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !513, line: 931, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !844, file: !513, line: 933, baseType: !136, size: 64, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !839, file: !513, line: 1069, baseType: !842, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !839, file: !513, line: 1070, baseType: !873, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !513, line: 916, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !513, line: 891, size: 704, elements: !876)
!876 = !{!877, !878, !879, !881, !882, !883, !884, !885, !886}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !875, file: !513, line: 892, baseType: !847, size: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !875, file: !513, line: 896, baseType: !48, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !875, file: !513, line: 900, baseType: !880, size: 96, offset: 352)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !503)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !875, file: !513, line: 903, baseType: !401, size: 32, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !875, file: !513, line: 906, baseType: !48, size: 32, offset: 480)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !875, file: !513, line: 909, baseType: !401, size: 32, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !875, file: !513, line: 912, baseType: !401, size: 32, offset: 544)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !875, file: !513, line: 914, baseType: !520, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !875, file: !513, line: 915, baseType: !136, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !839, file: !513, line: 1071, baseType: !888, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !513, line: 920, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !513, line: 918, size: 320, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !890, file: !513, line: 919, baseType: !847, size: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !839, file: !513, line: 1075, baseType: !401, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !839, file: !513, line: 1077, baseType: !401, size: 32, offset: 288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !839, file: !513, line: 1078, baseType: !401, size: 32, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !839, file: !513, line: 1079, baseType: !196, size: 16, offset: 352)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !839, file: !513, line: 1082, baseType: !196, size: 16, offset: 368)
