; ModuleID = 'blender/source/blender/blenkernel/intern/fluidsim.c'
source_filename = "blender/source/blender/blenkernel/intern/fluidsim.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/fluidsim.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10, !15, !19, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !4, line: 128, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !4, line: 164, baseType: !5, size: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!13 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!14 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !4, line: 159, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !4, line: 134, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !4, line: 152, baseType: !5, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!35 = distinct !DISubprogram(name: "initElbeemMesh", scope: !1, file: !1, line: 68, type: !36, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2138)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !119, !1324, !2136, !1324, !2137, !79, !79}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !40, line: 1216, size: 39680, elements: !41)
!40 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = !{!42, !114, !118, !1513, !1516, !1517, !1518, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1545, !1757, !1760, !2010, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2032, !2033, !2034, !2035, !2036, !2044, !2110, !2117, !2118, !2125, !2128, !2129, !2130, !2131, !2132, !2133}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !39, file: !40, line: 1217, baseType: !43, size: 960)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !44, line: 130, baseType: !45)
!44 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !44, line: 117, size: 960, elements: !46)
!46 = !{!47, !49, !50, !52, !72, !76, !78, !80, !81, !82}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !45, file: !44, line: 118, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !45, file: !44, line: 118, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !45, file: !44, line: 119, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !45, file: !44, line: 120, baseType: !53, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !44, line: 136, size: 17600, elements: !55)
!55 = !{!56, !57, !59, !62, !67, !68, !69}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !54, file: !44, line: 137, baseType: !43, size: 960)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !54, file: !44, line: 138, baseType: !58, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !54, file: !44, line: 139, baseType: !60, size: 64, offset: 1024)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !44, line: 43, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !44, line: 140, baseType: !63, size: 8192, offset: 1088)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8192, elements: !65)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !{!66}
!66 = !DISubrange(count: 1024)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !54, file: !44, line: 141, baseType: !63, size: 8192, offset: 9280)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !54, file: !44, line: 148, baseType: !53, size: 64, offset: 17472)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !54, file: !44, line: 150, baseType: !70, size: 64, offset: 17536)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !44, line: 45, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !44, line: 121, baseType: !73, size: 528, offset: 256)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 528, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 66)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !45, file: !44, line: 126, baseType: !77, size: 16, offset: 784)
!77 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !45, file: !44, line: 127, baseType: !79, size: 32, offset: 800)
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !45, file: !44, line: 128, baseType: !79, size: 32, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !45, file: !44, line: 128, baseType: !79, size: 32, offset: 864)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !45, file: !44, line: 129, baseType: !83, size: 64, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !44, line: 75, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !44, line: 62, size: 1024, elements: !86)
!86 = !{!87, !89, !90, !91, !92, !93, !97, !98, !112, !113}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !44, line: 63, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !44, line: 63, baseType: !88, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !44, line: 64, baseType: !64, size: 8, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !85, file: !44, line: 64, baseType: !64, size: 8, offset: 136)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !85, file: !44, line: 65, baseType: !77, size: 16, offset: 144)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !44, line: 66, baseType: !94, size: 512, offset: 160)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !85, file: !44, line: 67, baseType: !79, size: 32, offset: 672)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !44, line: 69, baseType: !99, size: 256, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !44, line: 60, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !44, line: 48, size: 256, elements: !101)
!101 = !{!102, !103, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !100, file: !44, line: 49, baseType: !48, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !100, file: !44, line: 58, baseType: !104, size: 128, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !105, line: 71, baseType: !106)
!105 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !105, line: 69, size: 128, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !106, file: !105, line: 70, baseType: !48, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !106, file: !105, line: 70, baseType: !48, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !100, file: !44, line: 59, baseType: !79, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !100, file: !44, line: 59, baseType: !79, size: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, file: !44, line: 70, baseType: !79, size: 32, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !85, file: !44, line: 74, baseType: !79, size: 32, offset: 992)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !39, file: !40, line: 1218, baseType: !115, size: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !117, line: 39, flags: DIFlagFwdDecl)
!117 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !39, file: !40, line: 1220, baseType: !119, size: 64, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !121, line: 115, size: 11392, elements: !122)
!121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = !{!123, !124, !125, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !142, !154, !168, !169, !212, !213, !216, !217, !233, !234, !235, !236, !237, !238, !239, !243, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !259, !260, !261, !262, !263, !264, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !356, !357, !358, !359, !360, !361, !362, !363, !364, !735, !850, !851, !852, !853, !854, !855, !1157, !1160, !1477, !1478, !1484, !1485, !1486, !1487, !1488, !1489, !1491, !1494, !1497, !1498, !1501, !1502}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !120, file: !121, line: 116, baseType: !43, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !120, file: !121, line: 117, baseType: !115, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !120, file: !121, line: 119, baseType: !126, size: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !121, line: 57, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !121, line: 121, baseType: !77, size: 16, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !120, file: !121, line: 121, baseType: !77, size: 16, offset: 1104)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !120, file: !121, line: 122, baseType: !79, size: 32, offset: 1120)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !120, file: !121, line: 122, baseType: !79, size: 32, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !120, file: !121, line: 122, baseType: !79, size: 32, offset: 1184)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !120, file: !121, line: 123, baseType: !94, size: 512, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !120, file: !121, line: 124, baseType: !119, size: 64, offset: 1728)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !120, file: !121, line: 124, baseType: !119, size: 64, offset: 1792)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !120, file: !121, line: 127, baseType: !119, size: 64, offset: 1856)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !120, file: !121, line: 127, baseType: !119, size: 64, offset: 1920)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !120, file: !121, line: 127, baseType: !119, size: 64, offset: 1984)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !120, file: !121, line: 128, baseType: !140, size: 64, offset: 2048)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !117, line: 41, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !120, file: !121, line: 130, baseType: !143, size: 64, offset: 2112)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !121, line: 97, size: 832, elements: !145)
!145 = !{!146, !152, !153}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !144, file: !121, line: 98, baseType: !147, size: 768)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 768, elements: !149)
!148 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!149 = !{!150, !151}
!150 = !DISubrange(count: 8)
!151 = !DISubrange(count: 3)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !144, file: !121, line: 99, baseType: !79, size: 32, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !144, file: !121, line: 99, baseType: !79, size: 32, offset: 800)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !120, file: !121, line: 131, baseType: !155, size: 64, offset: 2176)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !157, line: 486, size: 1600, elements: !158)
!157 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !157, line: 487, baseType: !43, size: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !156, file: !157, line: 489, baseType: !104, size: 128, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !156, file: !157, line: 490, baseType: !104, size: 128, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !156, file: !157, line: 491, baseType: !104, size: 128, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !156, file: !157, line: 492, baseType: !104, size: 128, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !156, file: !157, line: 494, baseType: !79, size: 32, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !156, file: !157, line: 495, baseType: !79, size: 32, offset: 1504)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !156, file: !157, line: 497, baseType: !79, size: 32, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !156, file: !157, line: 498, baseType: !79, size: 32, offset: 1568)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !120, file: !121, line: 132, baseType: !155, size: 64, offset: 2240)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !120, file: !121, line: 133, baseType: !170, size: 64, offset: 2304)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !157, line: 334, size: 1728, elements: !172)
!172 = !{!173, !174, !177, !178, !179, !180, !181, !182, !185, !186, !187, !188, !189, !190, !191, !211}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !171, file: !157, line: 335, baseType: !104, size: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !171, file: !157, line: 336, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !157, line: 47, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !157, line: 338, baseType: !77, size: 16, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !171, file: !157, line: 338, baseType: !77, size: 16, offset: 208)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !171, file: !157, line: 339, baseType: !5, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !171, file: !157, line: 340, baseType: !79, size: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !171, file: !157, line: 342, baseType: !148, size: 32, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !171, file: !157, line: 343, baseType: !183, size: 96, offset: 320)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 96, elements: !184)
!184 = !{!151}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !171, file: !157, line: 344, baseType: !183, size: 96, offset: 416)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !171, file: !157, line: 347, baseType: !104, size: 128, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !171, file: !157, line: 349, baseType: !79, size: 32, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !171, file: !157, line: 350, baseType: !79, size: 32, offset: 672)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !171, file: !157, line: 351, baseType: !48, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !171, file: !157, line: 352, baseType: !48, size: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !171, file: !157, line: 354, baseType: !192, size: 384, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !157, line: 116, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !157, line: 94, size: 384, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !193, file: !157, line: 96, baseType: !79, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !193, file: !157, line: 96, baseType: !79, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !193, file: !157, line: 97, baseType: !79, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !193, file: !157, line: 97, baseType: !79, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !193, file: !157, line: 99, baseType: !77, size: 16, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !193, file: !157, line: 100, baseType: !77, size: 16, offset: 144)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !193, file: !157, line: 102, baseType: !77, size: 16, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !193, file: !157, line: 105, baseType: !77, size: 16, offset: 176)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !193, file: !157, line: 108, baseType: !77, size: 16, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !193, file: !157, line: 109, baseType: !77, size: 16, offset: 208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !193, file: !157, line: 111, baseType: !77, size: 16, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !193, file: !157, line: 112, baseType: !77, size: 16, offset: 240)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !193, file: !157, line: 114, baseType: !79, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !193, file: !157, line: 114, baseType: !79, size: 32, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !193, file: !157, line: 115, baseType: !79, size: 32, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !193, file: !157, line: 115, baseType: !79, size: 32, offset: 352)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !171, file: !157, line: 355, baseType: !94, size: 512, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !121, line: 134, baseType: !48, size: 64, offset: 2368)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !120, file: !121, line: 136, baseType: !214, size: 64, offset: 2432)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !121, line: 58, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !120, file: !121, line: 138, baseType: !192, size: 384, offset: 2496)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !120, file: !121, line: 139, baseType: !218, size: 64, offset: 2880)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !157, line: 80, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !157, line: 72, size: 192, elements: !221)
!221 = !{!222, !229, !230, !231, !232}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !220, file: !157, line: 73, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !157, line: 59, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !157, line: 56, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !225, file: !157, line: 57, baseType: !183, size: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !157, line: 58, baseType: !79, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !220, file: !157, line: 74, baseType: !79, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !220, file: !157, line: 76, baseType: !79, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !220, file: !157, line: 77, baseType: !79, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !220, file: !157, line: 79, baseType: !79, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !120, file: !121, line: 141, baseType: !104, size: 128, offset: 2944)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !120, file: !121, line: 142, baseType: !104, size: 128, offset: 3072)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !120, file: !121, line: 143, baseType: !104, size: 128, offset: 3200)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !120, file: !121, line: 144, baseType: !104, size: 128, offset: 3328)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !120, file: !121, line: 146, baseType: !79, size: 32, offset: 3456)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !120, file: !121, line: 147, baseType: !79, size: 32, offset: 3488)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !120, file: !121, line: 150, baseType: !240, size: 64, offset: 3520)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !117, line: 53, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !120, file: !121, line: 151, baseType: !244, size: 64, offset: 3584)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !120, file: !121, line: 152, baseType: !79, size: 32, offset: 3648)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !120, file: !121, line: 153, baseType: !79, size: 32, offset: 3680)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !120, file: !121, line: 156, baseType: !183, size: 96, offset: 3712)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !120, file: !121, line: 156, baseType: !183, size: 96, offset: 3808)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !120, file: !121, line: 156, baseType: !183, size: 96, offset: 3904)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !120, file: !121, line: 157, baseType: !183, size: 96, offset: 4000)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !120, file: !121, line: 158, baseType: !183, size: 96, offset: 4096)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !120, file: !121, line: 159, baseType: !183, size: 96, offset: 4192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !120, file: !121, line: 160, baseType: !183, size: 96, offset: 4288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !120, file: !121, line: 160, baseType: !183, size: 96, offset: 4384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !120, file: !121, line: 161, baseType: !256, size: 128, offset: 4480)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 128, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !120, file: !121, line: 161, baseType: !256, size: 128, offset: 4608)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !120, file: !121, line: 162, baseType: !183, size: 96, offset: 4736)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !120, file: !121, line: 162, baseType: !183, size: 96, offset: 4832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !120, file: !121, line: 163, baseType: !148, size: 32, offset: 4928)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !120, file: !121, line: 163, baseType: !148, size: 32, offset: 4960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !120, file: !121, line: 164, baseType: !265, size: 512, offset: 4992)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 512, elements: !266)
!266 = !{!258, !258}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !120, file: !121, line: 165, baseType: !265, size: 512, offset: 5504)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !120, file: !121, line: 166, baseType: !265, size: 512, offset: 6016)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !120, file: !121, line: 167, baseType: !265, size: 512, offset: 6528)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !120, file: !121, line: 176, baseType: !265, size: 512, offset: 7040)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !120, file: !121, line: 178, baseType: !5, size: 32, offset: 7552)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !120, file: !121, line: 180, baseType: !77, size: 16, offset: 7584)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !120, file: !121, line: 181, baseType: !77, size: 16, offset: 7600)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !120, file: !121, line: 183, baseType: !77, size: 16, offset: 7616)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !120, file: !121, line: 183, baseType: !77, size: 16, offset: 7632)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !120, file: !121, line: 184, baseType: !77, size: 16, offset: 7648)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !120, file: !121, line: 184, baseType: !77, size: 16, offset: 7664)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !120, file: !121, line: 185, baseType: !77, size: 16, offset: 7680)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !120, file: !121, line: 186, baseType: !77, size: 16, offset: 7696)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !120, file: !121, line: 187, baseType: !77, size: 16, offset: 7712)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !120, file: !121, line: 188, baseType: !64, size: 8, offset: 7728)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !120, file: !121, line: 189, baseType: !64, size: 8, offset: 7736)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !120, file: !121, line: 192, baseType: !79, size: 32, offset: 7744)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !120, file: !121, line: 192, baseType: !79, size: 32, offset: 7776)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !120, file: !121, line: 192, baseType: !79, size: 32, offset: 7808)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !120, file: !121, line: 192, baseType: !79, size: 32, offset: 7840)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !120, file: !121, line: 194, baseType: !79, size: 32, offset: 7872)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !120, file: !121, line: 202, baseType: !148, size: 32, offset: 7904)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !120, file: !121, line: 202, baseType: !148, size: 32, offset: 7936)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !120, file: !121, line: 202, baseType: !148, size: 32, offset: 7968)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !120, file: !121, line: 211, baseType: !148, size: 32, offset: 8000)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !120, file: !121, line: 212, baseType: !148, size: 32, offset: 8032)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !120, file: !121, line: 213, baseType: !148, size: 32, offset: 8064)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !120, file: !121, line: 214, baseType: !148, size: 32, offset: 8096)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !120, file: !121, line: 215, baseType: !148, size: 32, offset: 8128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !120, file: !121, line: 216, baseType: !148, size: 32, offset: 8160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !120, file: !121, line: 219, baseType: !148, size: 32, offset: 8192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !120, file: !121, line: 220, baseType: !148, size: 32, offset: 8224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !120, file: !121, line: 221, baseType: !148, size: 32, offset: 8256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !120, file: !121, line: 224, baseType: !301, size: 16, offset: 8288)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !120, file: !121, line: 224, baseType: !301, size: 16, offset: 8304)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !120, file: !121, line: 226, baseType: !77, size: 16, offset: 8320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !120, file: !121, line: 228, baseType: !64, size: 8, offset: 8336)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !120, file: !121, line: 229, baseType: !64, size: 8, offset: 8344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !120, file: !121, line: 231, baseType: !77, size: 16, offset: 8352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !120, file: !121, line: 232, baseType: !64, size: 8, offset: 8368)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !120, file: !121, line: 233, baseType: !64, size: 8, offset: 8376)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !120, file: !121, line: 234, baseType: !148, size: 32, offset: 8384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !120, file: !121, line: 235, baseType: !148, size: 32, offset: 8416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !120, file: !121, line: 237, baseType: !104, size: 128, offset: 8448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !120, file: !121, line: 238, baseType: !104, size: 128, offset: 8576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !120, file: !121, line: 239, baseType: !104, size: 128, offset: 8704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !120, file: !121, line: 240, baseType: !104, size: 128, offset: 8832)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !120, file: !121, line: 242, baseType: !148, size: 32, offset: 8960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !120, file: !121, line: 244, baseType: !77, size: 16, offset: 8992)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !120, file: !121, line: 245, baseType: !301, size: 16, offset: 9008)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !120, file: !121, line: 246, baseType: !256, size: 128, offset: 9024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !120, file: !121, line: 248, baseType: !79, size: 32, offset: 9152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !120, file: !121, line: 249, baseType: !79, size: 32, offset: 9184)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !120, file: !121, line: 251, baseType: !322, size: 64, offset: 9216)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !324, line: 215, size: 960, elements: !325)
!324 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !324, line: 216, baseType: !79, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !323, file: !324, line: 217, baseType: !148, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !323, file: !324, line: 218, baseType: !148, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !323, file: !324, line: 219, baseType: !148, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !323, file: !324, line: 221, baseType: !79, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !323, file: !324, line: 222, baseType: !79, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !323, file: !324, line: 223, baseType: !79, size: 32, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !323, file: !324, line: 224, baseType: !79, size: 32, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !323, file: !324, line: 226, baseType: !148, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !323, file: !324, line: 227, baseType: !148, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !323, file: !324, line: 228, baseType: !148, size: 32, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !323, file: !324, line: 229, baseType: !148, size: 32, offset: 352)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !323, file: !324, line: 231, baseType: !148, size: 32, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !323, file: !324, line: 232, baseType: !148, size: 32, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !323, file: !324, line: 233, baseType: !148, size: 32, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !323, file: !324, line: 234, baseType: !148, size: 32, offset: 480)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !323, file: !324, line: 236, baseType: !148, size: 32, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !323, file: !324, line: 237, baseType: !148, size: 32, offset: 544)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !323, file: !324, line: 238, baseType: !148, size: 32, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !323, file: !324, line: 239, baseType: !148, size: 32, offset: 608)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !323, file: !324, line: 241, baseType: !148, size: 32, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !323, file: !324, line: 242, baseType: !148, size: 32, offset: 672)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !323, file: !324, line: 243, baseType: !148, size: 32, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !323, file: !324, line: 244, baseType: !148, size: 32, offset: 736)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !323, file: !324, line: 246, baseType: !148, size: 32, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !323, file: !324, line: 247, baseType: !148, size: 32, offset: 800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !323, file: !324, line: 248, baseType: !79, size: 32, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !323, file: !324, line: 249, baseType: !79, size: 32, offset: 864)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !323, file: !324, line: 250, baseType: !148, size: 32, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !323, file: !324, line: 251, baseType: !148, size: 32, offset: 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !120, file: !121, line: 253, baseType: !64, size: 8, offset: 9280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !120, file: !121, line: 254, baseType: !64, size: 8, offset: 9288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !120, file: !121, line: 255, baseType: !77, size: 16, offset: 9296)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !120, file: !121, line: 256, baseType: !183, size: 96, offset: 9312)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !120, file: !121, line: 258, baseType: !104, size: 128, offset: 9408)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !120, file: !121, line: 259, baseType: !104, size: 128, offset: 9536)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !120, file: !121, line: 260, baseType: !104, size: 128, offset: 9664)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !120, file: !121, line: 261, baseType: !104, size: 128, offset: 9792)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !120, file: !121, line: 263, baseType: !365, size: 64, offset: 9920)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !324, line: 61, size: 1280, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !729, !732, !733, !734}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !324, line: 62, baseType: !79, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !366, file: !324, line: 63, baseType: !77, size: 16, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !366, file: !324, line: 64, baseType: !77, size: 16, offset: 48)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !366, file: !324, line: 65, baseType: !77, size: 16, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !366, file: !324, line: 66, baseType: !77, size: 16, offset: 80)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !366, file: !324, line: 67, baseType: !77, size: 16, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !366, file: !324, line: 68, baseType: !77, size: 16, offset: 112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !366, file: !324, line: 68, baseType: !77, size: 16, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !366, file: !324, line: 69, baseType: !77, size: 16, offset: 144)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !366, file: !324, line: 72, baseType: !148, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !366, file: !324, line: 73, baseType: !148, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !366, file: !324, line: 74, baseType: !148, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !366, file: !324, line: 77, baseType: !148, size: 32, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !366, file: !324, line: 80, baseType: !148, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !366, file: !324, line: 81, baseType: !148, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !366, file: !324, line: 82, baseType: !148, size: 32, offset: 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !366, file: !324, line: 83, baseType: !148, size: 32, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !366, file: !324, line: 84, baseType: !148, size: 32, offset: 416)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !366, file: !324, line: 85, baseType: !148, size: 32, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !366, file: !324, line: 88, baseType: !148, size: 32, offset: 480)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !366, file: !324, line: 89, baseType: !148, size: 32, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !366, file: !324, line: 90, baseType: !148, size: 32, offset: 544)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !366, file: !324, line: 91, baseType: !148, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !366, file: !324, line: 92, baseType: !148, size: 32, offset: 608)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !366, file: !324, line: 93, baseType: !148, size: 32, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !366, file: !324, line: 95, baseType: !148, size: 32, offset: 672)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !366, file: !324, line: 98, baseType: !148, size: 32, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !366, file: !324, line: 99, baseType: !148, size: 32, offset: 736)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !366, file: !324, line: 100, baseType: !148, size: 32, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !366, file: !324, line: 103, baseType: !148, size: 32, offset: 800)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !366, file: !324, line: 103, baseType: !148, size: 32, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !366, file: !324, line: 104, baseType: !148, size: 32, offset: 864)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !366, file: !324, line: 104, baseType: !148, size: 32, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !366, file: !324, line: 104, baseType: !148, size: 32, offset: 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !366, file: !324, line: 104, baseType: !148, size: 32, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !366, file: !324, line: 107, baseType: !148, size: 32, offset: 992)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !366, file: !324, line: 108, baseType: !405, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !407, line: 202, size: 3328, elements: !408)
!407 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !478, !481, !482, !565, !591, !619, !620, !698, !719, !727, !728}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !406, file: !407, line: 203, baseType: !43, size: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !406, file: !407, line: 204, baseType: !115, size: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !406, file: !407, line: 206, baseType: !148, size: 32, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !406, file: !407, line: 206, baseType: !148, size: 32, offset: 1056)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !406, file: !407, line: 207, baseType: !148, size: 32, offset: 1088)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !406, file: !407, line: 207, baseType: !148, size: 32, offset: 1120)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !406, file: !407, line: 207, baseType: !148, size: 32, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !406, file: !407, line: 207, baseType: !148, size: 32, offset: 1184)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !406, file: !407, line: 207, baseType: !148, size: 32, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !406, file: !407, line: 207, baseType: !148, size: 32, offset: 1248)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !406, file: !407, line: 208, baseType: !148, size: 32, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !406, file: !407, line: 208, baseType: !148, size: 32, offset: 1312)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !406, file: !407, line: 211, baseType: !148, size: 32, offset: 1344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !406, file: !407, line: 211, baseType: !148, size: 32, offset: 1376)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !406, file: !407, line: 211, baseType: !148, size: 32, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !406, file: !407, line: 211, baseType: !148, size: 32, offset: 1440)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !406, file: !407, line: 211, baseType: !148, size: 32, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !406, file: !407, line: 214, baseType: !148, size: 32, offset: 1504)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !406, file: !407, line: 214, baseType: !148, size: 32, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !406, file: !407, line: 217, baseType: !148, size: 32, offset: 1568)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !406, file: !407, line: 218, baseType: !148, size: 32, offset: 1600)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !406, file: !407, line: 219, baseType: !148, size: 32, offset: 1632)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !406, file: !407, line: 220, baseType: !148, size: 32, offset: 1664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !406, file: !407, line: 221, baseType: !148, size: 32, offset: 1696)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !406, file: !407, line: 222, baseType: !77, size: 16, offset: 1728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !406, file: !407, line: 222, baseType: !77, size: 16, offset: 1744)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !406, file: !407, line: 224, baseType: !77, size: 16, offset: 1760)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !406, file: !407, line: 224, baseType: !77, size: 16, offset: 1776)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !406, file: !407, line: 227, baseType: !77, size: 16, offset: 1792)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !406, file: !407, line: 227, baseType: !77, size: 16, offset: 1808)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !406, file: !407, line: 229, baseType: !77, size: 16, offset: 1824)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !407, line: 229, baseType: !77, size: 16, offset: 1840)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !406, file: !407, line: 230, baseType: !77, size: 16, offset: 1856)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !406, file: !407, line: 230, baseType: !77, size: 16, offset: 1872)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !406, file: !407, line: 232, baseType: !148, size: 32, offset: 1888)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !406, file: !407, line: 232, baseType: !148, size: 32, offset: 1920)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !406, file: !407, line: 232, baseType: !148, size: 32, offset: 1952)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !406, file: !407, line: 232, baseType: !148, size: 32, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !406, file: !407, line: 233, baseType: !79, size: 32, offset: 2016)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !406, file: !407, line: 234, baseType: !79, size: 32, offset: 2048)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !406, file: !407, line: 235, baseType: !77, size: 16, offset: 2080)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !406, file: !407, line: 235, baseType: !77, size: 16, offset: 2096)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !406, file: !407, line: 236, baseType: !77, size: 16, offset: 2112)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !406, file: !407, line: 239, baseType: !77, size: 16, offset: 2128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !406, file: !407, line: 240, baseType: !79, size: 32, offset: 2144)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !406, file: !407, line: 241, baseType: !79, size: 32, offset: 2176)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !406, file: !407, line: 241, baseType: !79, size: 32, offset: 2208)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !406, file: !407, line: 241, baseType: !79, size: 32, offset: 2240)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !406, file: !407, line: 243, baseType: !148, size: 32, offset: 2272)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !406, file: !407, line: 243, baseType: !148, size: 32, offset: 2304)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !406, file: !407, line: 244, baseType: !148, size: 32, offset: 2336)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !406, file: !407, line: 246, baseType: !461, size: 320, offset: 2368)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !462, line: 50, size: 320, elements: !463)
!462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !461, file: !462, line: 51, baseType: !38, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !461, file: !462, line: 53, baseType: !79, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !461, file: !462, line: 54, baseType: !79, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !461, file: !462, line: 55, baseType: !79, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !461, file: !462, line: 55, baseType: !79, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !461, file: !462, line: 56, baseType: !64, size: 8, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !461, file: !462, line: 56, baseType: !64, size: 8, offset: 200)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !461, file: !462, line: 57, baseType: !64, size: 8, offset: 208)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !461, file: !462, line: 57, baseType: !64, size: 8, offset: 216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !461, file: !462, line: 59, baseType: !77, size: 16, offset: 224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !461, file: !462, line: 59, baseType: !77, size: 16, offset: 240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !461, file: !462, line: 59, baseType: !77, size: 16, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !462, line: 61, baseType: !77, size: 16, offset: 272)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !461, file: !462, line: 63, baseType: !79, size: 32, offset: 288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !406, file: !407, line: 248, baseType: !479, size: 64, offset: 2688)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !407, line: 248, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !406, file: !407, line: 249, baseType: !140, size: 64, offset: 2752)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !406, file: !407, line: 250, baseType: !483, size: 64, offset: 2816)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !462, line: 77, size: 15424, elements: !485)
!485 = !{!486, !487, !488, !491, !494, !497, !500, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !519, !520, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !554, !555, !559}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !484, file: !462, line: 78, baseType: !43, size: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !462, line: 80, baseType: !63, size: 8192, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !484, file: !462, line: 82, baseType: !489, size: 64, offset: 9152)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !462, line: 43, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !484, file: !462, line: 83, baseType: !492, size: 64, offset: 9216)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !44, line: 46, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !484, file: !462, line: 86, baseType: !495, size: 64, offset: 9280)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !462, line: 41, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !484, file: !462, line: 87, baseType: !498, size: 64, offset: 9344)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !462, line: 44, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !484, file: !462, line: 89, baseType: !501, size: 512, offset: 9408)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 512, elements: !502)
!502 = !{!150}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !484, file: !462, line: 90, baseType: !77, size: 16, offset: 9920)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !484, file: !462, line: 90, baseType: !77, size: 16, offset: 9936)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !484, file: !462, line: 92, baseType: !77, size: 16, offset: 9952)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !484, file: !462, line: 92, baseType: !77, size: 16, offset: 9968)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !484, file: !462, line: 93, baseType: !77, size: 16, offset: 9984)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !462, line: 93, baseType: !77, size: 16, offset: 10000)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !484, file: !462, line: 94, baseType: !79, size: 32, offset: 10016)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !484, file: !462, line: 97, baseType: !77, size: 16, offset: 10048)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !484, file: !462, line: 97, baseType: !77, size: 16, offset: 10064)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !484, file: !462, line: 98, baseType: !77, size: 16, offset: 10080)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !484, file: !462, line: 98, baseType: !77, size: 16, offset: 10096)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !484, file: !462, line: 99, baseType: !77, size: 16, offset: 10112)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !484, file: !462, line: 99, baseType: !77, size: 16, offset: 10128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !484, file: !462, line: 100, baseType: !5, size: 32, offset: 10144)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !484, file: !462, line: 101, baseType: !518, size: 64, offset: 10176)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !484, file: !462, line: 103, baseType: !70, size: 64, offset: 10240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !484, file: !462, line: 104, baseType: !521, size: 64, offset: 10304)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !44, line: 159, size: 448, elements: !523)
!523 = !{!524, !528, !529, !531, !532, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !522, file: !44, line: 161, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 2)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !522, file: !44, line: 162, baseType: !525, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !522, file: !44, line: 163, baseType: !530, size: 32, offset: 128)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32, elements: !526)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !522, file: !44, line: 164, baseType: !530, size: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !522, file: !44, line: 165, baseType: !533, size: 128, offset: 192)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 128, elements: !526)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !522, file: !44, line: 166, baseType: !535, size: 128, offset: 320)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 128, elements: !526)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !484, file: !462, line: 107, baseType: !148, size: 32, offset: 10368)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !484, file: !462, line: 108, baseType: !79, size: 32, offset: 10400)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !484, file: !462, line: 109, baseType: !77, size: 16, offset: 10432)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !484, file: !462, line: 110, baseType: !77, size: 16, offset: 10448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !484, file: !462, line: 113, baseType: !79, size: 32, offset: 10464)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !484, file: !462, line: 113, baseType: !79, size: 32, offset: 10496)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !484, file: !462, line: 114, baseType: !64, size: 8, offset: 10528)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !484, file: !462, line: 114, baseType: !64, size: 8, offset: 10536)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !484, file: !462, line: 115, baseType: !77, size: 16, offset: 10544)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !484, file: !462, line: 116, baseType: !256, size: 128, offset: 10560)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !484, file: !462, line: 119, baseType: !148, size: 32, offset: 10688)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !484, file: !462, line: 119, baseType: !148, size: 32, offset: 10720)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !484, file: !462, line: 122, baseType: !549, size: 512, offset: 10752)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !550, line: 182, baseType: !551)
!550 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !550, line: 180, size: 512, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !551, file: !550, line: 181, baseType: !94, size: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !484, file: !462, line: 123, baseType: !64, size: 8, offset: 11264)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !484, file: !462, line: 125, baseType: !556, size: 56, offset: 11272)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 56, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 7)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !484, file: !462, line: 126, baseType: !560, size: 4096, offset: 11328)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 4096, elements: !502)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !462, line: 69, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !462, line: 67, size: 512, elements: !563)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !462, line: 68, baseType: !94, size: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !406, file: !407, line: 251, baseType: !566, size: 64, offset: 2880)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !407, line: 113, size: 6208, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !578}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !567, file: !407, line: 114, baseType: !77, size: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !567, file: !407, line: 114, baseType: !77, size: 16, offset: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !567, file: !407, line: 115, baseType: !64, size: 8, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !567, file: !407, line: 115, baseType: !64, size: 8, offset: 40)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !567, file: !407, line: 116, baseType: !64, size: 8, offset: 48)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !567, file: !407, line: 117, baseType: !575, size: 8, offset: 56)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 1)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !567, file: !407, line: 119, baseType: !579, size: 6144, offset: 64)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 6144, elements: !589)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !407, line: 109, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !407, line: 106, size: 192, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !581, file: !407, line: 107, baseType: !148, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !581, file: !407, line: 107, baseType: !148, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !581, file: !407, line: 107, baseType: !148, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !581, file: !407, line: 107, baseType: !148, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !581, file: !407, line: 107, baseType: !148, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !581, file: !407, line: 108, baseType: !79, size: 32, offset: 160)
!589 = !{!590}
!590 = !DISubrange(count: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !406, file: !407, line: 252, baseType: !592, size: 64, offset: 2944)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !407, line: 122, size: 1600, elements: !594)
!594 = !{!595, !596, !597, !603, !604, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !593, file: !407, line: 123, baseType: !119, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !593, file: !407, line: 124, baseType: !483, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !593, file: !407, line: 125, baseType: !598, size: 384, offset: 128)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 384, elements: !601)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !550, line: 136, flags: DIFlagFwdDecl)
!601 = !{!602}
!602 = !DISubrange(count: 6)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !593, file: !407, line: 126, baseType: !265, size: 512, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !593, file: !407, line: 127, baseType: !605, size: 288, offset: 1024)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 288, elements: !606)
!606 = !{!151, !151}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !593, file: !407, line: 128, baseType: !77, size: 16, offset: 1312)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !593, file: !407, line: 128, baseType: !77, size: 16, offset: 1328)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !593, file: !407, line: 129, baseType: !148, size: 32, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !593, file: !407, line: 129, baseType: !148, size: 32, offset: 1376)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !593, file: !407, line: 130, baseType: !148, size: 32, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !593, file: !407, line: 131, baseType: !5, size: 32, offset: 1440)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !593, file: !407, line: 132, baseType: !77, size: 16, offset: 1472)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !593, file: !407, line: 132, baseType: !77, size: 16, offset: 1488)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !593, file: !407, line: 133, baseType: !79, size: 32, offset: 1504)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !593, file: !407, line: 133, baseType: !79, size: 32, offset: 1536)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !593, file: !407, line: 134, baseType: !77, size: 16, offset: 1568)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !593, file: !407, line: 134, baseType: !77, size: 16, offset: 1584)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !406, file: !407, line: 253, baseType: !521, size: 64, offset: 3008)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !406, file: !407, line: 254, baseType: !621, size: 64, offset: 3072)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !407, line: 137, size: 832, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !645, !646, !647, !648, !649, !650}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !622, file: !407, line: 138, baseType: !77, size: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !622, file: !407, line: 140, baseType: !77, size: 16, offset: 16)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !622, file: !407, line: 141, baseType: !148, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !622, file: !407, line: 142, baseType: !148, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !622, file: !407, line: 143, baseType: !77, size: 16, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !622, file: !407, line: 144, baseType: !77, size: 16, offset: 112)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !622, file: !407, line: 145, baseType: !79, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !622, file: !407, line: 147, baseType: !79, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !622, file: !407, line: 149, baseType: !119, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !622, file: !407, line: 150, baseType: !79, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !622, file: !407, line: 151, baseType: !77, size: 16, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !622, file: !407, line: 152, baseType: !77, size: 16, offset: 304)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !622, file: !407, line: 154, baseType: !48, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !622, file: !407, line: 155, baseType: !638, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !622, file: !407, line: 157, baseType: !148, size: 32, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !622, file: !407, line: 158, baseType: !77, size: 16, offset: 480)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !622, file: !407, line: 159, baseType: !77, size: 16, offset: 496)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !622, file: !407, line: 160, baseType: !77, size: 16, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !622, file: !407, line: 161, baseType: !644, size: 48, offset: 528)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 48, elements: !184)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !622, file: !407, line: 162, baseType: !148, size: 32, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !622, file: !407, line: 164, baseType: !148, size: 32, offset: 608)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !622, file: !407, line: 164, baseType: !148, size: 32, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !622, file: !407, line: 164, baseType: !148, size: 32, offset: 672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !622, file: !407, line: 165, baseType: !566, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !622, file: !407, line: 167, baseType: !651, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !550, line: 72, size: 3072, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !667, !668, !694, !695, !696, !697}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !652, file: !550, line: 73, baseType: !79, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !652, file: !550, line: 73, baseType: !79, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !652, file: !550, line: 74, baseType: !79, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !652, file: !550, line: 75, baseType: !79, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !652, file: !550, line: 77, baseType: !659, size: 128, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !660, line: 95, baseType: !661)
!660 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !660, line: 92, size: 128, elements: !662)
!662 = !{!663, !664, !665, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !661, file: !660, line: 93, baseType: !148, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !661, file: !660, line: 93, baseType: !148, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !661, file: !660, line: 94, baseType: !148, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !661, file: !660, line: 94, baseType: !148, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !652, file: !550, line: 77, baseType: !659, size: 128, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !652, file: !550, line: 79, baseType: !669, size: 2304, offset: 384)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 2304, elements: !257)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !550, line: 67, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !550, line: 55, size: 576, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !680, !681, !690, !691, !692, !693}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !671, file: !550, line: 56, baseType: !77, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !550, line: 56, baseType: !77, size: 16, offset: 16)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !671, file: !550, line: 58, baseType: !148, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !671, file: !550, line: 59, baseType: !148, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !671, file: !550, line: 59, baseType: !148, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !671, file: !550, line: 60, baseType: !679, size: 64, offset: 128)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 64, elements: !526)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !671, file: !550, line: 60, baseType: !679, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !671, file: !550, line: 61, baseType: !682, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !550, line: 47, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !550, line: 44, size: 96, elements: !685)
!685 = !{!686, !687, !688, !689}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !684, file: !550, line: 45, baseType: !148, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !684, file: !550, line: 45, baseType: !148, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !684, file: !550, line: 46, baseType: !77, size: 16, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !684, file: !550, line: 46, baseType: !77, size: 16, offset: 80)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !671, file: !550, line: 62, baseType: !682, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !671, file: !550, line: 64, baseType: !682, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !671, file: !550, line: 65, baseType: !679, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !671, file: !550, line: 66, baseType: !679, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !652, file: !550, line: 80, baseType: !183, size: 96, offset: 2688)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !652, file: !550, line: 80, baseType: !183, size: 96, offset: 2784)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !652, file: !550, line: 81, baseType: !183, size: 96, offset: 2880)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !652, file: !550, line: 83, baseType: !183, size: 96, offset: 2976)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !406, file: !407, line: 255, baseType: !699, size: 64, offset: 3136)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !407, line: 170, size: 8704, elements: !701)
!701 = !{!702, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !700, file: !407, line: 171, baseType: !703, size: 96)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 96, elements: !184)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !700, file: !407, line: 172, baseType: !79, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !700, file: !407, line: 173, baseType: !77, size: 16, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !700, file: !407, line: 174, baseType: !77, size: 16, offset: 144)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !700, file: !407, line: 175, baseType: !77, size: 16, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !700, file: !407, line: 176, baseType: !77, size: 16, offset: 176)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !700, file: !407, line: 177, baseType: !77, size: 16, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !700, file: !407, line: 178, baseType: !77, size: 16, offset: 208)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !700, file: !407, line: 179, baseType: !79, size: 32, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !700, file: !407, line: 181, baseType: !119, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !700, file: !407, line: 182, baseType: !148, size: 32, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !700, file: !407, line: 183, baseType: !79, size: 32, offset: 352)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !700, file: !407, line: 184, baseType: !63, size: 8192, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !700, file: !407, line: 187, baseType: !638, size: 64, offset: 8576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !700, file: !407, line: 188, baseType: !79, size: 32, offset: 8640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !700, file: !407, line: 189, baseType: !79, size: 32, offset: 8672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !406, file: !407, line: 256, baseType: !720, size: 64, offset: 3200)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !407, line: 193, size: 640, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !721, file: !407, line: 194, baseType: !119, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !721, file: !407, line: 195, baseType: !94, size: 512, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !721, file: !407, line: 197, baseType: !79, size: 32, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !721, file: !407, line: 198, baseType: !79, size: 32, offset: 608)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !406, file: !407, line: 258, baseType: !64, size: 8, offset: 3264)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !406, file: !407, line: 259, baseType: !556, size: 56, offset: 3272)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "rng", scope: !366, file: !324, line: 111, baseType: !730, size: 64, offset: 1088)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "RNG", file: !324, line: 111, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "f_noise", scope: !366, file: !324, line: 112, baseType: !148, size: 32, offset: 1152)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !366, file: !324, line: 113, baseType: !79, size: 32, offset: 1184)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "f_source", scope: !366, file: !324, line: 115, baseType: !119, size: 64, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !120, file: !121, line: 264, baseType: !736, size: 64, offset: 9984)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !324, line: 268, size: 3776, elements: !738)
!738 = !{!739, !740, !741, !744, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !796, !797, !798, !830, !831, !846, !847, !848, !849}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !737, file: !324, line: 270, baseType: !79, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "totspring", scope: !737, file: !324, line: 270, baseType: !79, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bpoint", scope: !737, file: !324, line: 271, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodyPoint", file: !324, line: 271, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bspring", scope: !737, file: !324, line: 272, baseType: !745, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodySpring", file: !324, line: 272, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !737, file: !324, line: 273, baseType: !64, size: 8, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "msg_lock", scope: !737, file: !324, line: 274, baseType: !64, size: 8, offset: 200)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "msg_value", scope: !737, file: !324, line: 275, baseType: !77, size: 16, offset: 208)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nodemass", scope: !737, file: !324, line: 280, baseType: !148, size: 32, offset: 224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Mass", scope: !737, file: !324, line: 281, baseType: !94, size: 512, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "grav", scope: !737, file: !324, line: 285, baseType: !148, size: 32, offset: 768)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mediafrict", scope: !737, file: !324, line: 286, baseType: !148, size: 32, offset: 800)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rklimit", scope: !737, file: !324, line: 287, baseType: !148, size: 32, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "physics_speed", scope: !737, file: !324, line: 288, baseType: !148, size: 32, offset: 864)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "goalspring", scope: !737, file: !324, line: 291, baseType: !148, size: 32, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "goalfrict", scope: !737, file: !324, line: 292, baseType: !148, size: 32, offset: 928)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mingoal", scope: !737, file: !324, line: 293, baseType: !148, size: 32, offset: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "maxgoal", scope: !737, file: !324, line: 294, baseType: !148, size: 32, offset: 992)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "defgoal", scope: !737, file: !324, line: 295, baseType: !148, size: 32, offset: 1024)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vertgroup", scope: !737, file: !324, line: 296, baseType: !77, size: 16, offset: 1056)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Softgoal", scope: !737, file: !324, line: 297, baseType: !94, size: 512, offset: 1072)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fuzzyness", scope: !737, file: !324, line: 301, baseType: !77, size: 16, offset: 1584)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "inspring", scope: !737, file: !324, line: 304, baseType: !148, size: 32, offset: 1600)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "infrict", scope: !737, file: !324, line: 305, baseType: !148, size: 32, offset: 1632)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Spring_K", scope: !737, file: !324, line: 306, baseType: !94, size: 512, offset: 1664)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !737, file: !324, line: 312, baseType: !79, size: 32, offset: 2176)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !737, file: !324, line: 312, baseType: !79, size: 32, offset: 2208)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !737, file: !324, line: 313, baseType: !79, size: 32, offset: 2240)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !737, file: !324, line: 314, baseType: !77, size: 16, offset: 2272)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "solverflags", scope: !737, file: !324, line: 314, baseType: !77, size: 16, offset: 2288)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !737, file: !324, line: 317, baseType: !773, size: 64, offset: 2304)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBVertex", file: !324, line: 213, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBVertex", file: !324, line: 211, size: 128, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !776, file: !324, line: 212, baseType: !256, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "totpointkey", scope: !737, file: !324, line: 318, baseType: !79, size: 32, offset: 2368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !737, file: !324, line: 318, baseType: !79, size: 32, offset: 2400)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "secondspring", scope: !737, file: !324, line: 320, baseType: !148, size: 32, offset: 2432)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "colball", scope: !737, file: !324, line: 323, baseType: !148, size: 32, offset: 2464)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "balldamp", scope: !737, file: !324, line: 324, baseType: !148, size: 32, offset: 2496)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ballstiff", scope: !737, file: !324, line: 325, baseType: !148, size: 32, offset: 2528)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_mode", scope: !737, file: !324, line: 326, baseType: !77, size: 16, offset: 2560)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "aeroedge", scope: !737, file: !324, line: 327, baseType: !77, size: 16, offset: 2576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "minloops", scope: !737, file: !324, line: 328, baseType: !77, size: 16, offset: 2592)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "maxloops", scope: !737, file: !324, line: 329, baseType: !77, size: 16, offset: 2608)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "choke", scope: !737, file: !324, line: 330, baseType: !77, size: 16, offset: 2624)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "solver_ID", scope: !737, file: !324, line: 331, baseType: !77, size: 16, offset: 2640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "plastic", scope: !737, file: !324, line: 332, baseType: !77, size: 16, offset: 2656)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "springpreload", scope: !737, file: !324, line: 332, baseType: !77, size: 16, offset: 2672)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !737, file: !324, line: 335, baseType: !794, size: 64, offset: 2688)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "SBScratch", file: !324, line: 335, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "shearstiff", scope: !737, file: !324, line: 336, baseType: !148, size: 32, offset: 2752)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "inpush", scope: !737, file: !324, line: 337, baseType: !148, size: 32, offset: 2784)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pointcache", scope: !737, file: !324, line: 339, baseType: !799, size: 64, offset: 2816)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointCache", file: !324, line: 170, size: 10560, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !826}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !324, line: 171, baseType: !799, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !800, file: !324, line: 171, baseType: !799, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !800, file: !324, line: 172, baseType: !79, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !800, file: !324, line: 174, baseType: !79, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "simframe", scope: !800, file: !324, line: 186, baseType: !79, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "startframe", scope: !800, file: !324, line: 187, baseType: !79, size: 32, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "endframe", scope: !800, file: !324, line: 188, baseType: !79, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "editframe", scope: !800, file: !324, line: 189, baseType: !79, size: 32, offset: 288)
