; ModuleID = 'blender/source/blender/blenkernel/intern/material.c'
source_filename = "blender/source/blender/blenkernel/intern/material.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Material = type { %struct.ID, %struct.AnimData*, i16, i16, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, %struct.VolumeSettings, %struct.GameSettings, float, float, float, float, float, float, float, i16, i16, i16, i8, i8, float, float, i16, i16, float, float, float, float, i16, i16, i32, i32, i32, i32, i16, i16, i16, i16, float, float, float, float, float, float, float, float, float, float, [64 x i8], float, float, float, i32, i8, i8, i8, i8, i16, i16, i16, i8, i8, i16, i16, float, float, [4 x float], float, float, i16, i16, %struct.ColorBand*, %struct.ColorBand*, i8, i8, i8, i8, i16, i16, float, float, [18 x %struct.MTex*], %struct.bNodeTree*, %struct.Ipo*, %struct.Group*, %struct.PreviewImage*, float, float, float, float, float, i16, i16, [3 x float], [3 x float], float, float, float, float, float, float, float, i16, i16, i32, i16, i16, [4 x float], i16, i16, i16, i16, i16, [3 x i16], %struct.TexPaintSlot*, %struct.ListBase }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!74 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!76 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 368, baseType: !7, size: 32, elements: !119)
!118 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!120 = !DIEnumerator(name: "TF_DYNAMIC", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "TF_ALPHASORT", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "TF_TEX", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "TF_SHAREDVERT", value: 8, isUnsigned: true)
!124 = !DIEnumerator(name: "TF_LIGHT", value: 16, isUnsigned: true)
!125 = !DIEnumerator(name: "TF_CONVERTED", value: 32, isUnsigned: true)
!126 = !DIEnumerator(name: "TF_SHAREDCOL", value: 64, isUnsigned: true)
!127 = !DIEnumerator(name: "TF_BILLBOARD", value: 256, isUnsigned: true)
!128 = !DIEnumerator(name: "TF_TWOSIDE", value: 512, isUnsigned: true)
!129 = !DIEnumerator(name: "TF_INVISIBLE", value: 1024, isUnsigned: true)
!130 = !DIEnumerator(name: "TF_OBCOL", value: 2048, isUnsigned: true)
!131 = !DIEnumerator(name: "TF_BILLBOARD2", value: 4096, isUnsigned: true)
!132 = !DIEnumerator(name: "TF_SHADOW", value: 8192, isUnsigned: true)
!133 = !DIEnumerator(name: "TF_BMFONT", value: 16384, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 390, baseType: !7, size: 32, elements: !135)
!135 = !{!136, !137, !138, !139, !140}
!136 = !DIEnumerator(name: "TF_SOLID", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "TF_ADD", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "TF_ALPHA", value: 2, isUnsigned: true)
!139 = !DIEnumerator(name: "TF_CLIP", value: 4, isUnsigned: true)
!140 = !DIEnumerator(name: "TF_SUB", value: 3, isUnsigned: true)
!141 = !{!142, !151, !148, !213, !214, !215, !2509, !2611, !176, !2660, !2662, !2664, !2666, !178}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !144, line: 130, baseType: !145)
!144 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !144, line: 117, size: 960, elements: !146)
!146 = !{!147, !149, !150, !152, !171, !175, !177, !179, !180, !181}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !144, line: 118, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !144, line: 118, baseType: !148, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !145, file: !144, line: 119, baseType: !151, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !145, file: !144, line: 120, baseType: !153, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !144, line: 136, size: 17600, elements: !155)
!155 = !{!156, !157, !158, !161, !166, !167, !168}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !144, line: 137, baseType: !143, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !154, file: !144, line: 138, baseType: !142, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !154, file: !144, line: 139, baseType: !159, size: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !144, line: 43, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !144, line: 140, baseType: !162, size: 8192, offset: 1088)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 8192, elements: !164)
!163 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!164 = !{!165}
!165 = !DISubrange(count: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !154, file: !144, line: 141, baseType: !162, size: 8192, offset: 9280)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !154, file: !144, line: 148, baseType: !153, size: 64, offset: 17472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !154, file: !144, line: 150, baseType: !169, size: 64, offset: 17536)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !144, line: 45, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !144, line: 121, baseType: !172, size: 528, offset: 256)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 528, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 66)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !144, line: 126, baseType: !176, size: 16, offset: 784)
!176 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !145, file: !144, line: 127, baseType: !178, size: 32, offset: 800)
!178 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !145, file: !144, line: 128, baseType: !178, size: 32, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !145, file: !144, line: 128, baseType: !178, size: 32, offset: 864)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !145, file: !144, line: 129, baseType: !182, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !144, line: 75, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !144, line: 62, size: 1024, elements: !185)
!185 = !{!186, !188, !189, !190, !191, !192, !196, !197, !211, !212}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !144, line: 63, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !144, line: 63, baseType: !187, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !144, line: 64, baseType: !163, size: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !184, file: !144, line: 64, baseType: !163, size: 8, offset: 136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !144, line: 65, baseType: !176, size: 16, offset: 144)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !144, line: 66, baseType: !193, size: 512, offset: 160)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 512, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !184, file: !144, line: 67, baseType: !178, size: 32, offset: 672)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !144, line: 69, baseType: !198, size: 256, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !144, line: 60, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !144, line: 48, size: 256, elements: !200)
!200 = !{!201, !202, !209, !210}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !199, file: !144, line: 49, baseType: !148, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !199, file: !144, line: 58, baseType: !203, size: 128, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !204, line: 71, baseType: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !204, line: 69, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !205, file: !204, line: 70, baseType: !148, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !205, file: !204, line: 70, baseType: !148, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !199, file: !144, line: 59, baseType: !178, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !199, file: !144, line: 59, baseType: !178, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !184, file: !144, line: 70, baseType: !178, size: 32, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !184, file: !144, line: 74, baseType: !178, size: 32, offset: 992)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !217, line: 133, baseType: !218)
!217 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !217, line: 58, size: 11008, elements: !219)
!219 = !{!220, !221, !291, !302, !306, !310, !2315, !2321, !2330, !2340, !2346, !2352, !2360, !2371, !2384, !2397, !2405, !2414, !2415, !2423, !2425, !2428, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !218, file: !217, line: 59, baseType: !143, size: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !218, file: !217, line: 60, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !63, line: 838, size: 768, elements: !224)
!224 = !{!225, !240, !241, !251, !252, !284, !285, !286, !287, !288, !289, !290}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !223, file: !63, line: 840, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !228, line: 499, baseType: !229)
!228 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !228, line: 486, size: 1600, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !229, file: !228, line: 487, baseType: !143, size: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !229, file: !228, line: 489, baseType: !203, size: 128, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !229, file: !228, line: 490, baseType: !203, size: 128, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !229, file: !228, line: 491, baseType: !203, size: 128, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !229, file: !228, line: 492, baseType: !203, size: 128, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !228, line: 494, baseType: !178, size: 32, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !229, file: !228, line: 495, baseType: !178, size: 32, offset: 1504)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !229, file: !228, line: 497, baseType: !178, size: 32, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !229, file: !228, line: 498, baseType: !178, size: 32, offset: 1568)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !223, file: !63, line: 844, baseType: !226, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !223, file: !63, line: 848, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !63, line: 549, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !63, line: 544, size: 320, elements: !245)
!245 = !{!246, !248, !249, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !63, line: 545, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !63, line: 545, baseType: !247, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !244, file: !63, line: 547, baseType: !226, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !244, file: !63, line: 548, baseType: !203, size: 128, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !223, file: !63, line: 851, baseType: !203, size: 128, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !223, file: !63, line: 853, baseType: !253, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !63, line: 594, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !63, line: 561, size: 1664, elements: !256)
!256 = !{!257, !259, !260, !261, !262, !263, !264, !265, !266, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !63, line: 562, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !255, file: !63, line: 562, baseType: !258, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !255, file: !63, line: 564, baseType: !203, size: 128, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !255, file: !63, line: 565, baseType: !226, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !255, file: !63, line: 566, baseType: !242, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !255, file: !63, line: 568, baseType: !203, size: 128, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !255, file: !63, line: 569, baseType: !203, size: 128, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !63, line: 571, baseType: !193, size: 512, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !255, file: !63, line: 573, baseType: !267, size: 32, offset: 1152)
!267 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !255, file: !63, line: 574, baseType: !267, size: 32, offset: 1184)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !255, file: !63, line: 576, baseType: !267, size: 32, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !255, file: !63, line: 576, baseType: !267, size: 32, offset: 1248)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !255, file: !63, line: 577, baseType: !267, size: 32, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !255, file: !63, line: 577, baseType: !267, size: 32, offset: 1312)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !255, file: !63, line: 579, baseType: !267, size: 32, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !255, file: !63, line: 580, baseType: !267, size: 32, offset: 1376)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !255, file: !63, line: 582, baseType: !267, size: 32, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !255, file: !63, line: 582, baseType: !267, size: 32, offset: 1440)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !255, file: !63, line: 583, baseType: !176, size: 16, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !255, file: !63, line: 585, baseType: !176, size: 16, offset: 1488)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !255, file: !63, line: 586, baseType: !176, size: 16, offset: 1504)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !63, line: 588, baseType: !176, size: 16, offset: 1520)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !255, file: !63, line: 590, baseType: !148, size: 64, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !63, line: 592, baseType: !178, size: 32, offset: 1600)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !255, file: !63, line: 593, baseType: !178, size: 32, offset: 1632)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !223, file: !63, line: 858, baseType: !203, size: 128, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !223, file: !63, line: 859, baseType: !203, size: 128, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !63, line: 862, baseType: !178, size: 32, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !223, file: !63, line: 863, baseType: !178, size: 32, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !223, file: !63, line: 866, baseType: !176, size: 16, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !223, file: !63, line: 867, baseType: !176, size: 16, offset: 720)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !223, file: !63, line: 868, baseType: !267, size: 32, offset: 736)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !218, file: !217, line: 62, baseType: !292, size: 64, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !20, line: 97, size: 832, elements: !294)
!294 = !{!295, !300, !301}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !293, file: !20, line: 98, baseType: !296, size: 768)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 768, elements: !297)
!297 = !{!298, !299}
!298 = !DISubrange(count: 8)
!299 = !DISubrange(count: 3)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !20, line: 99, baseType: !178, size: 32, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !20, line: 99, baseType: !178, size: 32, offset: 800)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !218, file: !217, line: 64, baseType: !303, size: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !305, line: 46, flags: DIFlagFwdDecl)
!305 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !218, file: !217, line: 65, baseType: !307, size: 64, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !309, line: 45, flags: DIFlagFwdDecl)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !218, file: !217, line: 66, baseType: !311, size: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !314, line: 93, size: 7552, elements: !315)
!314 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !366, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !435, !436, !437, !438, !439, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2314}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !313, file: !314, line: 94, baseType: !143, size: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !313, file: !314, line: 95, baseType: !222, size: 64, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !313, file: !314, line: 97, baseType: !176, size: 16, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !314, line: 97, baseType: !176, size: 16, offset: 1040)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !313, file: !314, line: 99, baseType: !267, size: 32, offset: 1056)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !313, file: !314, line: 99, baseType: !267, size: 32, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !313, file: !314, line: 99, baseType: !267, size: 32, offset: 1120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !313, file: !314, line: 100, baseType: !267, size: 32, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !313, file: !314, line: 100, baseType: !267, size: 32, offset: 1184)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !313, file: !314, line: 100, baseType: !267, size: 32, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !313, file: !314, line: 101, baseType: !267, size: 32, offset: 1248)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !313, file: !314, line: 101, baseType: !267, size: 32, offset: 1280)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !313, file: !314, line: 101, baseType: !267, size: 32, offset: 1312)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !313, file: !314, line: 102, baseType: !267, size: 32, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !313, file: !314, line: 102, baseType: !267, size: 32, offset: 1376)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !313, file: !314, line: 102, baseType: !267, size: 32, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !313, file: !314, line: 103, baseType: !267, size: 32, offset: 1440)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !313, file: !314, line: 103, baseType: !267, size: 32, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !313, file: !314, line: 103, baseType: !267, size: 32, offset: 1504)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !313, file: !314, line: 103, baseType: !267, size: 32, offset: 1536)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !313, file: !314, line: 103, baseType: !267, size: 32, offset: 1568)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !313, file: !314, line: 104, baseType: !267, size: 32, offset: 1600)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !313, file: !314, line: 104, baseType: !267, size: 32, offset: 1632)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !313, file: !314, line: 104, baseType: !267, size: 32, offset: 1664)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !313, file: !314, line: 104, baseType: !267, size: 32, offset: 1696)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !313, file: !314, line: 104, baseType: !267, size: 32, offset: 1728)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !313, file: !314, line: 105, baseType: !267, size: 32, offset: 1760)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !313, file: !314, line: 108, baseType: !344, size: 704, offset: 1792)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !314, line: 53, size: 704, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !344, file: !314, line: 54, baseType: !267, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !344, file: !314, line: 55, baseType: !267, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !344, file: !314, line: 56, baseType: !267, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !344, file: !314, line: 57, baseType: !267, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !344, file: !314, line: 59, baseType: !351, size: 96, offset: 128)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 96, elements: !352)
!352 = !{!299}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !344, file: !314, line: 60, baseType: !351, size: 96, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !344, file: !314, line: 61, baseType: !351, size: 96, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !344, file: !314, line: 63, baseType: !267, size: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !344, file: !314, line: 64, baseType: !267, size: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !344, file: !314, line: 65, baseType: !267, size: 32, offset: 480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !344, file: !314, line: 67, baseType: !176, size: 16, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !344, file: !314, line: 68, baseType: !176, size: 16, offset: 528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !344, file: !314, line: 69, baseType: !176, size: 16, offset: 544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !344, file: !314, line: 70, baseType: !176, size: 16, offset: 560)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !344, file: !314, line: 72, baseType: !267, size: 32, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !344, file: !314, line: 73, baseType: !267, size: 32, offset: 608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !344, file: !314, line: 74, baseType: !267, size: 32, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !344, file: !314, line: 75, baseType: !267, size: 32, offset: 672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !313, file: !314, line: 109, baseType: !367, size: 128, offset: 2496)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !314, line: 79, size: 128, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !314, line: 80, baseType: !178, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !367, file: !314, line: 81, baseType: !178, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !367, file: !314, line: 82, baseType: !178, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !367, file: !314, line: 83, baseType: !178, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !313, file: !314, line: 111, baseType: !267, size: 32, offset: 2624)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !313, file: !314, line: 111, baseType: !267, size: 32, offset: 2656)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !313, file: !314, line: 112, baseType: !267, size: 32, offset: 2688)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !313, file: !314, line: 112, baseType: !267, size: 32, offset: 2720)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !313, file: !314, line: 113, baseType: !267, size: 32, offset: 2752)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !313, file: !314, line: 114, baseType: !267, size: 32, offset: 2784)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !313, file: !314, line: 114, baseType: !267, size: 32, offset: 2816)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !313, file: !314, line: 115, baseType: !176, size: 16, offset: 2848)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !313, file: !314, line: 115, baseType: !176, size: 16, offset: 2864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !313, file: !314, line: 116, baseType: !176, size: 16, offset: 2880)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !313, file: !314, line: 117, baseType: !163, size: 8, offset: 2896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !313, file: !314, line: 117, baseType: !163, size: 8, offset: 2904)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !313, file: !314, line: 119, baseType: !267, size: 32, offset: 2912)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !313, file: !314, line: 119, baseType: !267, size: 32, offset: 2944)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !313, file: !314, line: 120, baseType: !176, size: 16, offset: 2976)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !313, file: !314, line: 120, baseType: !176, size: 16, offset: 2992)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !313, file: !314, line: 121, baseType: !267, size: 32, offset: 3008)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !313, file: !314, line: 121, baseType: !267, size: 32, offset: 3040)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !313, file: !314, line: 122, baseType: !267, size: 32, offset: 3072)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !313, file: !314, line: 123, baseType: !267, size: 32, offset: 3104)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !313, file: !314, line: 124, baseType: !176, size: 16, offset: 3136)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !313, file: !314, line: 125, baseType: !176, size: 16, offset: 3152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !313, file: !314, line: 127, baseType: !178, size: 32, offset: 3168)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !313, file: !314, line: 127, baseType: !178, size: 32, offset: 3200)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !313, file: !314, line: 128, baseType: !178, size: 32, offset: 3232)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !313, file: !314, line: 128, baseType: !178, size: 32, offset: 3264)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !313, file: !314, line: 129, baseType: !176, size: 16, offset: 3296)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !313, file: !314, line: 129, baseType: !176, size: 16, offset: 3312)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !313, file: !314, line: 129, baseType: !176, size: 16, offset: 3328)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !313, file: !314, line: 129, baseType: !176, size: 16, offset: 3344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !313, file: !314, line: 130, baseType: !267, size: 32, offset: 3360)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !313, file: !314, line: 130, baseType: !267, size: 32, offset: 3392)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !313, file: !314, line: 130, baseType: !267, size: 32, offset: 3424)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !313, file: !314, line: 130, baseType: !267, size: 32, offset: 3456)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !313, file: !314, line: 131, baseType: !267, size: 32, offset: 3488)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !313, file: !314, line: 131, baseType: !267, size: 32, offset: 3520)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !313, file: !314, line: 131, baseType: !267, size: 32, offset: 3552)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !313, file: !314, line: 131, baseType: !267, size: 32, offset: 3584)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !313, file: !314, line: 132, baseType: !267, size: 32, offset: 3616)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !313, file: !314, line: 132, baseType: !267, size: 32, offset: 3648)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !313, file: !314, line: 133, baseType: !193, size: 512, offset: 3680)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !313, file: !314, line: 135, baseType: !267, size: 32, offset: 4192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !313, file: !314, line: 136, baseType: !267, size: 32, offset: 4224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !313, file: !314, line: 137, baseType: !267, size: 32, offset: 4256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !313, file: !314, line: 138, baseType: !178, size: 32, offset: 4288)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !313, file: !314, line: 141, baseType: !163, size: 8, offset: 4320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !313, file: !314, line: 141, baseType: !163, size: 8, offset: 4328)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !313, file: !314, line: 141, baseType: !163, size: 8, offset: 4336)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !313, file: !314, line: 141, baseType: !163, size: 8, offset: 4344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !313, file: !314, line: 142, baseType: !176, size: 16, offset: 4352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !313, file: !314, line: 142, baseType: !176, size: 16, offset: 4368)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !313, file: !314, line: 142, baseType: !176, size: 16, offset: 4384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !313, file: !314, line: 145, baseType: !163, size: 8, offset: 4400)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !313, file: !314, line: 145, baseType: !163, size: 8, offset: 4408)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !313, file: !314, line: 148, baseType: !176, size: 16, offset: 4416)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !313, file: !314, line: 148, baseType: !176, size: 16, offset: 4432)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !313, file: !314, line: 149, baseType: !267, size: 32, offset: 4448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !313, file: !314, line: 149, baseType: !267, size: 32, offset: 4480)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !313, file: !314, line: 152, baseType: !432, size: 128, offset: 4512)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 4)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !313, file: !314, line: 153, baseType: !267, size: 32, offset: 4640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !313, file: !314, line: 154, baseType: !267, size: 32, offset: 4672)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !313, file: !314, line: 157, baseType: !176, size: 16, offset: 4704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !313, file: !314, line: 157, baseType: !176, size: 16, offset: 4720)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !313, file: !314, line: 160, baseType: !440, size: 64, offset: 4736)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !305, line: 113, size: 6208, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !452}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !441, file: !305, line: 114, baseType: !176, size: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !441, file: !305, line: 114, baseType: !176, size: 16, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !441, file: !305, line: 115, baseType: !163, size: 8, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !441, file: !305, line: 115, baseType: !163, size: 8, offset: 40)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !441, file: !305, line: 116, baseType: !163, size: 8, offset: 48)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !441, file: !305, line: 117, baseType: !449, size: 8, offset: 56)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 8, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 1)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !305, line: 119, baseType: !453, size: 6144, offset: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 6144, elements: !463)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !305, line: 109, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !305, line: 106, size: 192, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !455, file: !305, line: 107, baseType: !267, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !455, file: !305, line: 107, baseType: !267, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !455, file: !305, line: 107, baseType: !267, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !455, file: !305, line: 107, baseType: !267, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !455, file: !305, line: 107, baseType: !267, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !455, file: !305, line: 108, baseType: !178, size: 32, offset: 160)
!463 = !{!464}
!464 = !DISubrange(count: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !313, file: !314, line: 161, baseType: !440, size: 64, offset: 4800)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !313, file: !314, line: 162, baseType: !163, size: 8, offset: 4864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !313, file: !314, line: 162, baseType: !163, size: 8, offset: 4872)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !313, file: !314, line: 163, baseType: !163, size: 8, offset: 4880)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !313, file: !314, line: 163, baseType: !163, size: 8, offset: 4888)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !313, file: !314, line: 164, baseType: !176, size: 16, offset: 4896)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !313, file: !314, line: 164, baseType: !176, size: 16, offset: 4912)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !313, file: !314, line: 165, baseType: !267, size: 32, offset: 4928)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !313, file: !314, line: 165, baseType: !267, size: 32, offset: 4960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !313, file: !314, line: 167, baseType: !475, size: 1152, offset: 4992)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 1152, elements: !2272)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !305, line: 57, size: 2496, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !2069, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !477, file: !305, line: 59, baseType: !176, size: 16)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !477, file: !305, line: 59, baseType: !176, size: 16, offset: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !477, file: !305, line: 59, baseType: !176, size: 16, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !477, file: !305, line: 59, baseType: !176, size: 16, offset: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !477, file: !305, line: 60, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !20, line: 115, size: 11392, elements: !486)
!486 = !{!487, !488, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !507, !508, !549, !550, !553, !554, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !654, !655, !656, !657, !658, !659, !660, !661, !662, !665, !668, !677, !678, !679, !680, !681, !684, !706, !709, !710, !716, !717, !718, !719, !720, !721, !723, !726, !729, !733, !2057, !2058}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !485, file: !20, line: 116, baseType: !143, size: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !485, file: !20, line: 117, baseType: !222, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !485, file: !20, line: 119, baseType: !490, size: 64, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !20, line: 57, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !20, line: 121, baseType: !176, size: 16, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !485, file: !20, line: 121, baseType: !176, size: 16, offset: 1104)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !485, file: !20, line: 122, baseType: !178, size: 32, offset: 1120)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !485, file: !20, line: 122, baseType: !178, size: 32, offset: 1152)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !485, file: !20, line: 122, baseType: !178, size: 32, offset: 1184)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !485, file: !20, line: 123, baseType: !193, size: 512, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !485, file: !20, line: 124, baseType: !484, size: 64, offset: 1728)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !485, file: !20, line: 124, baseType: !484, size: 64, offset: 1792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !485, file: !20, line: 127, baseType: !484, size: 64, offset: 1856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !485, file: !20, line: 127, baseType: !484, size: 64, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !485, file: !20, line: 127, baseType: !484, size: 64, offset: 1984)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !485, file: !20, line: 128, baseType: !303, size: 64, offset: 2048)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !485, file: !20, line: 130, baseType: !292, size: 64, offset: 2112)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !485, file: !20, line: 131, baseType: !506, size: 64, offset: 2176)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !485, file: !20, line: 132, baseType: !506, size: 64, offset: 2240)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !485, file: !20, line: 133, baseType: !509, size: 64, offset: 2304)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !228, line: 334, size: 1728, elements: !511)
!511 = !{!512, !513, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !548}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !510, file: !228, line: 335, baseType: !203, size: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !510, file: !228, line: 336, baseType: !514, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !228, line: 47, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !228, line: 338, baseType: !176, size: 16, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !510, file: !228, line: 338, baseType: !176, size: 16, offset: 208)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !510, file: !228, line: 339, baseType: !7, size: 32, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !510, file: !228, line: 340, baseType: !178, size: 32, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !510, file: !228, line: 342, baseType: !267, size: 32, offset: 288)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !510, file: !228, line: 343, baseType: !351, size: 96, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !510, file: !228, line: 344, baseType: !351, size: 96, offset: 416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !510, file: !228, line: 347, baseType: !203, size: 128, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !510, file: !228, line: 349, baseType: !178, size: 32, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !510, file: !228, line: 350, baseType: !178, size: 32, offset: 672)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !510, file: !228, line: 351, baseType: !148, size: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !510, file: !228, line: 352, baseType: !148, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !510, file: !228, line: 354, baseType: !529, size: 384, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !228, line: 116, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !228, line: 94, size: 384, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !530, file: !228, line: 96, baseType: !178, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !530, file: !228, line: 96, baseType: !178, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !530, file: !228, line: 97, baseType: !178, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !530, file: !228, line: 97, baseType: !178, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !530, file: !228, line: 99, baseType: !176, size: 16, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !530, file: !228, line: 100, baseType: !176, size: 16, offset: 144)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !530, file: !228, line: 102, baseType: !176, size: 16, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !530, file: !228, line: 105, baseType: !176, size: 16, offset: 176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !530, file: !228, line: 108, baseType: !176, size: 16, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !530, file: !228, line: 109, baseType: !176, size: 16, offset: 208)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !530, file: !228, line: 111, baseType: !176, size: 16, offset: 224)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !530, file: !228, line: 112, baseType: !176, size: 16, offset: 240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !530, file: !228, line: 114, baseType: !178, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !530, file: !228, line: 114, baseType: !178, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !530, file: !228, line: 115, baseType: !178, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !530, file: !228, line: 115, baseType: !178, size: 32, offset: 352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !510, file: !228, line: 355, baseType: !193, size: 512, offset: 1216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !20, line: 134, baseType: !148, size: 64, offset: 2368)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !485, file: !20, line: 136, baseType: !551, size: 64, offset: 2432)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !69, line: 61, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !485, file: !20, line: 138, baseType: !529, size: 384, offset: 2496)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !485, file: !20, line: 139, baseType: !555, size: 64, offset: 2880)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !228, line: 80, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !228, line: 72, size: 192, elements: !558)
!558 = !{!559, !566, !567, !568, !569}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !557, file: !228, line: 73, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !228, line: 59, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !228, line: 56, size: 128, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !562, file: !228, line: 57, baseType: !351, size: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !228, line: 58, baseType: !178, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !557, file: !228, line: 74, baseType: !178, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !557, file: !228, line: 76, baseType: !178, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !557, file: !228, line: 77, baseType: !178, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !557, file: !228, line: 79, baseType: !178, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !485, file: !20, line: 141, baseType: !203, size: 128, offset: 2944)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !485, file: !20, line: 142, baseType: !203, size: 128, offset: 3072)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !485, file: !20, line: 143, baseType: !203, size: 128, offset: 3200)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !485, file: !20, line: 144, baseType: !203, size: 128, offset: 3328)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !485, file: !20, line: 146, baseType: !178, size: 32, offset: 3456)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !485, file: !20, line: 147, baseType: !178, size: 32, offset: 3488)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !485, file: !20, line: 150, baseType: !311, size: 64, offset: 3520)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !485, file: !20, line: 151, baseType: !213, size: 64, offset: 3584)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !485, file: !20, line: 152, baseType: !178, size: 32, offset: 3648)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !485, file: !20, line: 153, baseType: !178, size: 32, offset: 3680)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !485, file: !20, line: 156, baseType: !351, size: 96, offset: 3712)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !485, file: !20, line: 156, baseType: !351, size: 96, offset: 3808)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !485, file: !20, line: 156, baseType: !351, size: 96, offset: 3904)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !20, line: 157, baseType: !351, size: 96, offset: 4000)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !485, file: !20, line: 158, baseType: !351, size: 96, offset: 4096)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !485, file: !20, line: 159, baseType: !351, size: 96, offset: 4192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !485, file: !20, line: 160, baseType: !351, size: 96, offset: 4288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !485, file: !20, line: 160, baseType: !351, size: 96, offset: 4384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !485, file: !20, line: 161, baseType: !432, size: 128, offset: 4480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !485, file: !20, line: 161, baseType: !432, size: 128, offset: 4608)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !485, file: !20, line: 162, baseType: !351, size: 96, offset: 4736)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !485, file: !20, line: 162, baseType: !351, size: 96, offset: 4832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !485, file: !20, line: 163, baseType: !267, size: 32, offset: 4928)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !485, file: !20, line: 163, baseType: !267, size: 32, offset: 4960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !485, file: !20, line: 164, baseType: !595, size: 512, offset: 4992)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 512, elements: !596)
!596 = !{!434, !434}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !485, file: !20, line: 165, baseType: !595, size: 512, offset: 5504)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !485, file: !20, line: 166, baseType: !595, size: 512, offset: 6016)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !485, file: !20, line: 167, baseType: !595, size: 512, offset: 6528)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !485, file: !20, line: 176, baseType: !595, size: 512, offset: 7040)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !485, file: !20, line: 178, baseType: !7, size: 32, offset: 7552)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !485, file: !20, line: 180, baseType: !176, size: 16, offset: 7584)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !485, file: !20, line: 181, baseType: !176, size: 16, offset: 7600)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !485, file: !20, line: 183, baseType: !176, size: 16, offset: 7616)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !485, file: !20, line: 183, baseType: !176, size: 16, offset: 7632)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !485, file: !20, line: 184, baseType: !176, size: 16, offset: 7648)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !485, file: !20, line: 184, baseType: !176, size: 16, offset: 7664)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !485, file: !20, line: 185, baseType: !176, size: 16, offset: 7680)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !485, file: !20, line: 186, baseType: !176, size: 16, offset: 7696)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !485, file: !20, line: 187, baseType: !176, size: 16, offset: 7712)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !485, file: !20, line: 188, baseType: !163, size: 8, offset: 7728)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !485, file: !20, line: 189, baseType: !163, size: 8, offset: 7736)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !485, file: !20, line: 192, baseType: !178, size: 32, offset: 7744)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !485, file: !20, line: 192, baseType: !178, size: 32, offset: 7776)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !485, file: !20, line: 192, baseType: !178, size: 32, offset: 7808)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !485, file: !20, line: 192, baseType: !178, size: 32, offset: 7840)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !485, file: !20, line: 194, baseType: !178, size: 32, offset: 7872)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !485, file: !20, line: 202, baseType: !267, size: 32, offset: 7904)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !485, file: !20, line: 202, baseType: !267, size: 32, offset: 7936)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !485, file: !20, line: 202, baseType: !267, size: 32, offset: 7968)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !485, file: !20, line: 211, baseType: !267, size: 32, offset: 8000)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !485, file: !20, line: 212, baseType: !267, size: 32, offset: 8032)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !485, file: !20, line: 213, baseType: !267, size: 32, offset: 8064)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !485, file: !20, line: 214, baseType: !267, size: 32, offset: 8096)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !485, file: !20, line: 215, baseType: !267, size: 32, offset: 8128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !485, file: !20, line: 216, baseType: !267, size: 32, offset: 8160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !485, file: !20, line: 219, baseType: !267, size: 32, offset: 8192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !485, file: !20, line: 220, baseType: !267, size: 32, offset: 8224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !485, file: !20, line: 221, baseType: !267, size: 32, offset: 8256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !485, file: !20, line: 224, baseType: !631, size: 16, offset: 8288)
!631 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !485, file: !20, line: 224, baseType: !631, size: 16, offset: 8304)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !485, file: !20, line: 226, baseType: !176, size: 16, offset: 8320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !485, file: !20, line: 228, baseType: !163, size: 8, offset: 8336)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !485, file: !20, line: 229, baseType: !163, size: 8, offset: 8344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !485, file: !20, line: 231, baseType: !176, size: 16, offset: 8352)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !485, file: !20, line: 232, baseType: !163, size: 8, offset: 8368)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !485, file: !20, line: 233, baseType: !163, size: 8, offset: 8376)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !485, file: !20, line: 234, baseType: !267, size: 32, offset: 8384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !485, file: !20, line: 235, baseType: !267, size: 32, offset: 8416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !485, file: !20, line: 237, baseType: !203, size: 128, offset: 8448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !485, file: !20, line: 238, baseType: !203, size: 128, offset: 8576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !485, file: !20, line: 239, baseType: !203, size: 128, offset: 8704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !485, file: !20, line: 240, baseType: !203, size: 128, offset: 8832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !485, file: !20, line: 242, baseType: !267, size: 32, offset: 8960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !485, file: !20, line: 244, baseType: !176, size: 16, offset: 8992)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !485, file: !20, line: 245, baseType: !631, size: 16, offset: 9008)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !485, file: !20, line: 246, baseType: !432, size: 128, offset: 9024)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !485, file: !20, line: 248, baseType: !178, size: 32, offset: 9152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !485, file: !20, line: 249, baseType: !178, size: 32, offset: 9184)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !485, file: !20, line: 251, baseType: !652, size: 64, offset: 9216)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !20, line: 251, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !485, file: !20, line: 253, baseType: !163, size: 8, offset: 9280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !485, file: !20, line: 254, baseType: !163, size: 8, offset: 9288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !485, file: !20, line: 255, baseType: !176, size: 16, offset: 9296)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !485, file: !20, line: 256, baseType: !351, size: 96, offset: 9312)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !485, file: !20, line: 258, baseType: !203, size: 128, offset: 9408)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !485, file: !20, line: 259, baseType: !203, size: 128, offset: 9536)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !485, file: !20, line: 260, baseType: !203, size: 128, offset: 9664)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !485, file: !20, line: 261, baseType: !203, size: 128, offset: 9792)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !485, file: !20, line: 263, baseType: !663, size: 64, offset: 9920)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !20, line: 52, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !485, file: !20, line: 264, baseType: !666, size: 64, offset: 9984)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !20, line: 53, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !485, file: !20, line: 265, baseType: !669, size: 64, offset: 10048)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !671, line: 51, size: 1216, elements: !672)
!671 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!672 = !{!673, !674, !675, !676}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !670, file: !671, line: 52, baseType: !143, size: 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !670, file: !671, line: 54, baseType: !203, size: 128, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !670, file: !671, line: 59, baseType: !7, size: 32, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !670, file: !671, line: 60, baseType: !351, size: 96, offset: 1120)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !485, file: !20, line: 267, baseType: !163, size: 8, offset: 10112)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !485, file: !20, line: 268, baseType: !163, size: 8, offset: 10120)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !485, file: !20, line: 269, baseType: !176, size: 16, offset: 10128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !485, file: !20, line: 270, baseType: !267, size: 32, offset: 10144)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !485, file: !20, line: 272, baseType: !682, size: 64, offset: 10176)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !20, line: 54, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !485, file: !20, line: 275, baseType: !685, size: 64, offset: 10240)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !687, line: 49, size: 448, elements: !688)
!687 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !686, file: !687, line: 50, baseType: !203, size: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !686, file: !687, line: 51, baseType: !203, size: 128, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !686, file: !687, line: 52, baseType: !203, size: 128, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !686, file: !687, line: 53, baseType: !693, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !309, line: 65, size: 128, elements: !695)
!695 = !{!696, !704, !705}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !694, file: !309, line: 66, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !309, line: 56, size: 320, elements: !699)
!699 = !{!700, !701, !702, !703}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !698, file: !309, line: 57, baseType: !432, size: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !698, file: !309, line: 58, baseType: !432, size: 128, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !698, file: !309, line: 59, baseType: !267, size: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !698, file: !309, line: 59, baseType: !267, size: 32, offset: 288)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !694, file: !309, line: 67, baseType: !178, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !694, file: !309, line: 68, baseType: !267, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !485, file: !20, line: 277, baseType: !707, size: 64, offset: 10304)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !217, line: 40, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !485, file: !20, line: 277, baseType: !707, size: 64, offset: 10368)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !485, file: !20, line: 278, baseType: !711, size: 64, offset: 10432)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !712, line: 27, baseType: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !714, line: 45, baseType: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!715 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !485, file: !20, line: 279, baseType: !711, size: 64, offset: 10496)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !485, file: !20, line: 280, baseType: !7, size: 32, offset: 10560)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !485, file: !20, line: 281, baseType: !7, size: 32, offset: 10592)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !485, file: !20, line: 283, baseType: !203, size: 128, offset: 10624)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !485, file: !20, line: 284, baseType: !203, size: 128, offset: 10752)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !485, file: !20, line: 285, baseType: !722, size: 64, offset: 10880)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !485, file: !20, line: 287, baseType: !724, size: 64, offset: 10944)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !20, line: 59, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !485, file: !20, line: 288, baseType: !727, size: 64, offset: 11008)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !20, line: 288, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !485, file: !20, line: 290, baseType: !730, size: 64, offset: 11072)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 64, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 2)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !485, file: !20, line: 291, baseType: !734, size: 64, offset: 11136)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !736, line: 65, baseType: !737)
!736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !736, line: 50, size: 320, elements: !738)
!738 = !{!739, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !737, file: !736, line: 51, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !69, line: 1216, size: 39680, elements: !742)
!742 = !{!743, !744, !745, !746, !1309, !1310, !1311, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1338, !1625, !1628, !1917, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1939, !1940, !1941, !1942, !1943, !1951, !2018, !2025, !2026, !2033, !2036, !2037, !2038, !2039, !2040, !2041}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !741, file: !69, line: 1217, baseType: !143, size: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !741, file: !69, line: 1218, baseType: !222, size: 64, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !741, file: !69, line: 1220, baseType: !484, size: 64, offset: 1024)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !741, file: !69, line: 1221, baseType: !747, size: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !749, line: 52, size: 4224, elements: !750)
!749 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !820, !821, !822, !823, !824, !825, !827, !843}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !748, file: !749, line: 53, baseType: !143, size: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !748, file: !749, line: 54, baseType: !222, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !748, file: !749, line: 56, baseType: !176, size: 16, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !748, file: !749, line: 56, baseType: !176, size: 16, offset: 1040)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !748, file: !749, line: 57, baseType: !176, size: 16, offset: 1056)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !748, file: !749, line: 57, baseType: !176, size: 16, offset: 1072)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !748, file: !749, line: 59, baseType: !267, size: 32, offset: 1088)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !748, file: !749, line: 59, baseType: !267, size: 32, offset: 1120)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !748, file: !749, line: 59, baseType: !267, size: 32, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !748, file: !749, line: 60, baseType: !267, size: 32, offset: 1184)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !748, file: !749, line: 60, baseType: !267, size: 32, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !748, file: !749, line: 60, baseType: !267, size: 32, offset: 1248)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !748, file: !749, line: 61, baseType: !267, size: 32, offset: 1280)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !748, file: !749, line: 61, baseType: !267, size: 32, offset: 1312)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !748, file: !749, line: 61, baseType: !267, size: 32, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !748, file: !749, line: 68, baseType: !267, size: 32, offset: 1376)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !748, file: !749, line: 68, baseType: !267, size: 32, offset: 1408)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !748, file: !749, line: 68, baseType: !267, size: 32, offset: 1440)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !748, file: !749, line: 69, baseType: !267, size: 32, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !748, file: !749, line: 69, baseType: !267, size: 32, offset: 1504)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !748, file: !749, line: 74, baseType: !267, size: 32, offset: 1536)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !748, file: !749, line: 79, baseType: !267, size: 32, offset: 1568)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !748, file: !749, line: 81, baseType: !176, size: 16, offset: 1600)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !748, file: !749, line: 91, baseType: !176, size: 16, offset: 1616)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !748, file: !749, line: 92, baseType: !176, size: 16, offset: 1632)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !748, file: !749, line: 93, baseType: !176, size: 16, offset: 1648)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !748, file: !749, line: 94, baseType: !176, size: 16, offset: 1664)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !748, file: !749, line: 94, baseType: !176, size: 16, offset: 1680)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !748, file: !749, line: 94, baseType: !176, size: 16, offset: 1696)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !748, file: !749, line: 94, baseType: !176, size: 16, offset: 1712)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !748, file: !749, line: 96, baseType: !267, size: 32, offset: 1728)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !748, file: !749, line: 96, baseType: !267, size: 32, offset: 1760)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !748, file: !749, line: 96, baseType: !267, size: 32, offset: 1792)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !748, file: !749, line: 96, baseType: !267, size: 32, offset: 1824)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !748, file: !749, line: 98, baseType: !267, size: 32, offset: 1856)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !748, file: !749, line: 98, baseType: !267, size: 32, offset: 1888)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !748, file: !749, line: 98, baseType: !267, size: 32, offset: 1920)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !748, file: !749, line: 98, baseType: !267, size: 32, offset: 1952)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !748, file: !749, line: 99, baseType: !267, size: 32, offset: 1984)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !748, file: !749, line: 99, baseType: !267, size: 32, offset: 2016)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !748, file: !749, line: 100, baseType: !267, size: 32, offset: 2048)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !748, file: !749, line: 100, baseType: !267, size: 32, offset: 2080)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !748, file: !749, line: 103, baseType: !176, size: 16, offset: 2112)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !748, file: !749, line: 103, baseType: !176, size: 16, offset: 2128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !748, file: !749, line: 103, baseType: !176, size: 16, offset: 2144)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !748, file: !749, line: 103, baseType: !176, size: 16, offset: 2160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !748, file: !749, line: 106, baseType: !267, size: 32, offset: 2176)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !748, file: !749, line: 106, baseType: !267, size: 32, offset: 2208)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !748, file: !749, line: 106, baseType: !267, size: 32, offset: 2240)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !748, file: !749, line: 106, baseType: !267, size: 32, offset: 2272)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !748, file: !749, line: 107, baseType: !176, size: 16, offset: 2304)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !748, file: !749, line: 107, baseType: !176, size: 16, offset: 2320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !748, file: !749, line: 107, baseType: !176, size: 16, offset: 2336)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !748, file: !749, line: 107, baseType: !176, size: 16, offset: 2352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !748, file: !749, line: 108, baseType: !267, size: 32, offset: 2368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !748, file: !749, line: 108, baseType: !267, size: 32, offset: 2400)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !748, file: !749, line: 109, baseType: !267, size: 32, offset: 2432)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !748, file: !749, line: 109, baseType: !267, size: 32, offset: 2464)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !748, file: !749, line: 110, baseType: !267, size: 32, offset: 2496)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !748, file: !749, line: 110, baseType: !267, size: 32, offset: 2528)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !748, file: !749, line: 110, baseType: !267, size: 32, offset: 2560)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !748, file: !749, line: 111, baseType: !176, size: 16, offset: 2592)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !748, file: !749, line: 111, baseType: !176, size: 16, offset: 2608)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !748, file: !749, line: 112, baseType: !176, size: 16, offset: 2624)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !748, file: !749, line: 112, baseType: !176, size: 16, offset: 2640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !748, file: !749, line: 112, baseType: !176, size: 16, offset: 2656)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !749, line: 115, baseType: !176, size: 16, offset: 2672)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !748, file: !749, line: 118, baseType: !819, size: 64, offset: 2688)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !748, file: !749, line: 118, baseType: !819, size: 64, offset: 2752)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !748, file: !749, line: 121, baseType: !303, size: 64, offset: 2816)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !748, file: !749, line: 122, baseType: !475, size: 1152, offset: 2880)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !748, file: !749, line: 123, baseType: !176, size: 16, offset: 4032)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !748, file: !749, line: 123, baseType: !176, size: 16, offset: 4048)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !748, file: !749, line: 123, baseType: !826, size: 32, offset: 4064)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 32, elements: !731)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !748, file: !749, line: 126, baseType: !828, size: 64, offset: 4096)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !144, line: 159, size: 448, elements: !830)
!830 = !{!831, !833, !834, !835, !836, !839}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !829, file: !144, line: 161, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !731)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !829, file: !144, line: 162, baseType: !832, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !829, file: !144, line: 163, baseType: !826, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !829, file: !144, line: 164, baseType: !826, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !829, file: !144, line: 165, baseType: !837, size: 128, offset: 192)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 128, elements: !731)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !829, file: !144, line: 166, baseType: !840, size: 128, offset: 320)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 128, elements: !731)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !144, line: 46, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !748, file: !749, line: 129, baseType: !844, size: 64, offset: 4160)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !846, line: 328, size: 3456, elements: !847)
!846 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!847 = !{!848, !849, !850, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1287, !1288, !1289, !1292, !1296, !1300, !1304, !1305, !1306, !1307, !1308}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !845, file: !846, line: 329, baseType: !143, size: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !845, file: !846, line: 330, baseType: !222, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !845, file: !846, line: 332, baseType: !851, size: 64, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !853, line: 283, size: 4096, elements: !854)
!853 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!854 = !{!855, !856, !857, !858, !862, !863, !867, !1227, !1235, !1239, !1245, !1249, !1250, !1251, !1252, !1256, !1257}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !853, line: 284, baseType: !178, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !852, file: !853, line: 285, baseType: !193, size: 512, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !852, file: !853, line: 287, baseType: !193, size: 512, offset: 544)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !852, file: !853, line: 288, baseType: !859, size: 2048, offset: 1056)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 2048, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !852, file: !853, line: 289, baseType: !178, size: 32, offset: 3104)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !852, file: !853, line: 292, baseType: !864, size: 64, offset: 3136)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !844}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !852, file: !853, line: 293, baseType: !868, size: 64, offset: 3200)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !844, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !846, line: 167, size: 3712, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1219, !1220, !1221, !1222, !1223, !1224}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !846, line: 168, baseType: !871, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !872, file: !846, line: 168, baseType: !871, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !872, file: !846, line: 168, baseType: !871, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !872, file: !846, line: 170, baseType: !182, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !872, file: !846, line: 172, baseType: !879, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !853, line: 144, size: 6016, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !1058, !1059, !1060, !1074, !1078, !1082, !1083, !1090, !1094, !1098, !1099, !1100, !1101, !1105, !1106, !1110, !1114, !1118, !1122, !1126, !1130, !1134, !1135, !1142, !1144, !1153, !1174}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !880, file: !853, line: 145, baseType: !148, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !853, line: 145, baseType: !148, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !880, file: !853, line: 146, baseType: !176, size: 16, offset: 128)
