; ModuleID = 'blender/source/blender/blenkernel/intern/group.c'
source_filename = "blender/source/blender/blenkernel/intern/group.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/group.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!9 = distinct !DISubprogram(name: "BKE_group_free", scope: !1, file: !1, line: 63, type: !10, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "Group", file: !14, line: 61, baseType: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !14, line: 51, size: 1216, elements: !16)
!16 = !{!17, !88, !89, !91}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !15, file: !14, line: 52, baseType: !18, size: 960)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !19, line: 130, baseType: !20)
!19 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !19, line: 117, size: 960, elements: !21)
!21 = !{!22, !23, !24, !26, !46, !50, !52, !54, !55, !56}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !19, line: 118, baseType: !4, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !20, file: !19, line: 118, baseType: !4, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !20, file: !19, line: 119, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !20, file: !19, line: 120, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !19, line: 136, size: 17600, elements: !29)
!29 = !{!30, !31, !33, !36, !41, !42, !43}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !28, file: !19, line: 137, baseType: !18, size: 960)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !28, file: !19, line: 138, baseType: !32, size: 64, offset: 960)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !28, file: !19, line: 139, baseType: !34, size: 64, offset: 1024)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !19, line: 43, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !19, line: 140, baseType: !37, size: 8192, offset: 1088)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8192, elements: !39)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40}
!40 = !DISubrange(count: 1024)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !28, file: !19, line: 141, baseType: !37, size: 8192, offset: 9280)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !28, file: !19, line: 148, baseType: !27, size: 64, offset: 17472)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !28, file: !19, line: 150, baseType: !44, size: 64, offset: 17536)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !19, line: 45, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !19, line: 121, baseType: !47, size: 528, offset: 256)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 528, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 66)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !20, file: !19, line: 126, baseType: !51, size: 16, offset: 784)
!51 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !20, file: !19, line: 127, baseType: !53, size: 32, offset: 800)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !20, file: !19, line: 128, baseType: !53, size: 32, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !20, file: !19, line: 128, baseType: !53, size: 32, offset: 864)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !20, file: !19, line: 129, baseType: !57, size: 64, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !19, line: 75, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !19, line: 62, size: 1024, elements: !60)
!60 = !{!61, !63, !64, !65, !66, !67, !71, !72, !86, !87}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !19, line: 63, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !19, line: 63, baseType: !62, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !19, line: 64, baseType: !38, size: 8, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !19, line: 64, baseType: !38, size: 8, offset: 136)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !19, line: 65, baseType: !51, size: 16, offset: 144)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !19, line: 66, baseType: !68, size: 512, offset: 160)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !59, file: !19, line: 67, baseType: !53, size: 32, offset: 672)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !19, line: 69, baseType: !73, size: 256, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !19, line: 60, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !19, line: 48, size: 256, elements: !75)
!75 = !{!76, !77, !84, !85}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !74, file: !19, line: 49, baseType: !4, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !74, file: !19, line: 58, baseType: !78, size: 128, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !79, line: 71, baseType: !80)
!79 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !79, line: 69, size: 128, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !80, file: !79, line: 70, baseType: !4, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !80, file: !79, line: 70, baseType: !4, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !74, file: !19, line: 59, baseType: !53, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !74, file: !19, line: 59, baseType: !53, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !59, file: !19, line: 70, baseType: !53, size: 32, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !59, file: !19, line: 74, baseType: !53, size: 32, offset: 992)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !15, file: !14, line: 54, baseType: !78, size: 128, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !15, file: !14, line: 59, baseType: !90, size: 32, offset: 1088)
!90 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !15, file: !14, line: 60, baseType: !92, size: 96, offset: 1120)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 96, elements: !94)
!93 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!94 = !{!95}
!95 = !DISubrange(count: 3)
!96 = !DILocalVariable(name: "group", arg: 1, scope: !9, file: !1, line: 63, type: !12)
!97 = !DILocation(line: 63, column: 28, scope: !9)
!98 = !DILocalVariable(name: "go", scope: !9, file: !1, line: 66, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "GroupObject", file: !14, line: 48, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GroupObject", file: !14, line: 42, size: 320, elements: !102)
!102 = !{!103, !105, !106, !1575, !1576, !1577}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !14, line: 43, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !14, line: 43, baseType: !104, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !101, file: !14, line: 44, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !109, line: 115, size: 11392, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !116, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !133, !143, !157, !158, !199, !200, !203, !204, !220, !221, !222, !223, !224, !225, !226, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1527, !1530, !1531, !1532, !1533, !1534, !1535, !1538, !1541, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1553, !1556, !1559, !1560, !1563, !1564}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 116, baseType: !18, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !108, file: !109, line: 117, baseType: !113, size: 64, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !115, line: 48, flags: DIFlagFwdDecl)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !108, file: !109, line: 119, baseType: !117, size: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !109, line: 57, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !109, line: 121, baseType: !51, size: 16, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !108, file: !109, line: 121, baseType: !51, size: 16, offset: 1104)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !108, file: !109, line: 122, baseType: !53, size: 32, offset: 1120)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !108, file: !109, line: 122, baseType: !53, size: 32, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !108, file: !109, line: 122, baseType: !53, size: 32, offset: 1184)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !108, file: !109, line: 123, baseType: !68, size: 512, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !108, file: !109, line: 124, baseType: !107, size: 64, offset: 1728)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !108, file: !109, line: 124, baseType: !107, size: 64, offset: 1792)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !108, file: !109, line: 127, baseType: !107, size: 64, offset: 1856)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !108, file: !109, line: 127, baseType: !107, size: 64, offset: 1920)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !108, file: !109, line: 127, baseType: !107, size: 64, offset: 1984)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !108, file: !109, line: 128, baseType: !131, size: 64, offset: 2048)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !115, line: 49, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !108, file: !109, line: 130, baseType: !134, size: 64, offset: 2112)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !109, line: 97, size: 832, elements: !136)
!136 = !{!137, !141, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !135, file: !109, line: 98, baseType: !138, size: 768)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 768, elements: !139)
!139 = !{!140, !95}
!140 = !DISubrange(count: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !109, line: 99, baseType: !53, size: 32, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !135, file: !109, line: 99, baseType: !53, size: 32, offset: 800)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !108, file: !109, line: 131, baseType: !144, size: 64, offset: 2176)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !146, line: 486, size: 1600, elements: !147)
!146 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !146, line: 487, baseType: !18, size: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !145, file: !146, line: 489, baseType: !78, size: 128, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !145, file: !146, line: 490, baseType: !78, size: 128, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !145, file: !146, line: 491, baseType: !78, size: 128, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !145, file: !146, line: 492, baseType: !78, size: 128, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !146, line: 494, baseType: !53, size: 32, offset: 1472)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !145, file: !146, line: 495, baseType: !53, size: 32, offset: 1504)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !145, file: !146, line: 497, baseType: !53, size: 32, offset: 1536)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !145, file: !146, line: 498, baseType: !53, size: 32, offset: 1568)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !108, file: !109, line: 132, baseType: !144, size: 64, offset: 2240)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !108, file: !109, line: 133, baseType: !159, size: 64, offset: 2304)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !146, line: 334, size: 1728, elements: !161)
!161 = !{!162, !163, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !198}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !160, file: !146, line: 335, baseType: !78, size: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !160, file: !146, line: 336, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !146, line: 47, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !146, line: 338, baseType: !51, size: 16, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !160, file: !146, line: 338, baseType: !51, size: 16, offset: 208)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !160, file: !146, line: 339, baseType: !90, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !160, file: !146, line: 340, baseType: !53, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !160, file: !146, line: 342, baseType: !93, size: 32, offset: 288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !160, file: !146, line: 343, baseType: !92, size: 96, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !160, file: !146, line: 344, baseType: !92, size: 96, offset: 416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !160, file: !146, line: 347, baseType: !78, size: 128, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !160, file: !146, line: 349, baseType: !53, size: 32, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !160, file: !146, line: 350, baseType: !53, size: 32, offset: 672)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !160, file: !146, line: 351, baseType: !4, size: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !160, file: !146, line: 352, baseType: !4, size: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !160, file: !146, line: 354, baseType: !179, size: 384, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !146, line: 116, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !146, line: 94, size: 384, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !180, file: !146, line: 96, baseType: !53, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !180, file: !146, line: 96, baseType: !53, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !180, file: !146, line: 97, baseType: !53, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !180, file: !146, line: 97, baseType: !53, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !180, file: !146, line: 99, baseType: !51, size: 16, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !180, file: !146, line: 100, baseType: !51, size: 16, offset: 144)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !180, file: !146, line: 102, baseType: !51, size: 16, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !180, file: !146, line: 105, baseType: !51, size: 16, offset: 176)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !180, file: !146, line: 108, baseType: !51, size: 16, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !180, file: !146, line: 109, baseType: !51, size: 16, offset: 208)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !180, file: !146, line: 111, baseType: !51, size: 16, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !180, file: !146, line: 112, baseType: !51, size: 16, offset: 240)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !180, file: !146, line: 114, baseType: !53, size: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !180, file: !146, line: 114, baseType: !53, size: 32, offset: 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !180, file: !146, line: 115, baseType: !53, size: 32, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !180, file: !146, line: 115, baseType: !53, size: 32, offset: 352)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !160, file: !146, line: 355, baseType: !68, size: 512, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !109, line: 134, baseType: !4, size: 64, offset: 2368)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !108, file: !109, line: 136, baseType: !201, size: 64, offset: 2432)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !109, line: 58, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !108, file: !109, line: 138, baseType: !179, size: 384, offset: 2496)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !108, file: !109, line: 139, baseType: !205, size: 64, offset: 2880)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !146, line: 80, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !146, line: 72, size: 192, elements: !208)
!208 = !{!209, !216, !217, !218, !219}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !207, file: !146, line: 73, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !146, line: 59, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !146, line: 56, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !212, file: !146, line: 57, baseType: !92, size: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !212, file: !146, line: 58, baseType: !53, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !207, file: !146, line: 74, baseType: !53, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !207, file: !146, line: 76, baseType: !53, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !207, file: !146, line: 77, baseType: !53, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !207, file: !146, line: 79, baseType: !53, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !108, file: !109, line: 141, baseType: !78, size: 128, offset: 2944)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !108, file: !109, line: 142, baseType: !78, size: 128, offset: 3072)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !108, file: !109, line: 143, baseType: !78, size: 128, offset: 3200)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !108, file: !109, line: 144, baseType: !78, size: 128, offset: 3328)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !108, file: !109, line: 146, baseType: !53, size: 32, offset: 3456)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !108, file: !109, line: 147, baseType: !53, size: 32, offset: 3488)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !108, file: !109, line: 150, baseType: !227, size: 64, offset: 3520)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !115, line: 93, size: 7552, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !279, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !352, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !1398, !1399, !1400, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1440}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !229, file: !115, line: 94, baseType: !18, size: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !229, file: !115, line: 95, baseType: !113, size: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !229, file: !115, line: 97, baseType: !51, size: 16, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !115, line: 97, baseType: !51, size: 16, offset: 1040)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !229, file: !115, line: 99, baseType: !93, size: 32, offset: 1056)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !229, file: !115, line: 99, baseType: !93, size: 32, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !229, file: !115, line: 99, baseType: !93, size: 32, offset: 1120)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !229, file: !115, line: 100, baseType: !93, size: 32, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !229, file: !115, line: 100, baseType: !93, size: 32, offset: 1184)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !229, file: !115, line: 100, baseType: !93, size: 32, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !229, file: !115, line: 101, baseType: !93, size: 32, offset: 1248)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !229, file: !115, line: 101, baseType: !93, size: 32, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !229, file: !115, line: 101, baseType: !93, size: 32, offset: 1312)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !229, file: !115, line: 102, baseType: !93, size: 32, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !229, file: !115, line: 102, baseType: !93, size: 32, offset: 1376)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !229, file: !115, line: 102, baseType: !93, size: 32, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !229, file: !115, line: 103, baseType: !93, size: 32, offset: 1440)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !229, file: !115, line: 103, baseType: !93, size: 32, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !229, file: !115, line: 103, baseType: !93, size: 32, offset: 1504)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !229, file: !115, line: 103, baseType: !93, size: 32, offset: 1536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !229, file: !115, line: 103, baseType: !93, size: 32, offset: 1568)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !229, file: !115, line: 104, baseType: !93, size: 32, offset: 1600)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !229, file: !115, line: 104, baseType: !93, size: 32, offset: 1632)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !229, file: !115, line: 104, baseType: !93, size: 32, offset: 1664)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !229, file: !115, line: 104, baseType: !93, size: 32, offset: 1696)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !229, file: !115, line: 104, baseType: !93, size: 32, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !229, file: !115, line: 105, baseType: !93, size: 32, offset: 1760)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !229, file: !115, line: 108, baseType: !259, size: 704, offset: 1792)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !115, line: 53, size: 704, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !259, file: !115, line: 54, baseType: !93, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !259, file: !115, line: 55, baseType: !93, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !259, file: !115, line: 56, baseType: !93, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !259, file: !115, line: 57, baseType: !93, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !259, file: !115, line: 59, baseType: !92, size: 96, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !259, file: !115, line: 60, baseType: !92, size: 96, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !259, file: !115, line: 61, baseType: !92, size: 96, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !259, file: !115, line: 63, baseType: !93, size: 32, offset: 416)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !259, file: !115, line: 64, baseType: !93, size: 32, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !259, file: !115, line: 65, baseType: !93, size: 32, offset: 480)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !259, file: !115, line: 67, baseType: !51, size: 16, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !259, file: !115, line: 68, baseType: !51, size: 16, offset: 528)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !259, file: !115, line: 69, baseType: !51, size: 16, offset: 544)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !259, file: !115, line: 70, baseType: !51, size: 16, offset: 560)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !259, file: !115, line: 72, baseType: !93, size: 32, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !259, file: !115, line: 73, baseType: !93, size: 32, offset: 608)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !259, file: !115, line: 74, baseType: !93, size: 32, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !259, file: !115, line: 75, baseType: !93, size: 32, offset: 672)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !229, file: !115, line: 109, baseType: !280, size: 128, offset: 2496)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !115, line: 79, size: 128, elements: !281)
!281 = !{!282, !283, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !280, file: !115, line: 80, baseType: !53, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !280, file: !115, line: 81, baseType: !53, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !280, file: !115, line: 82, baseType: !53, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !280, file: !115, line: 83, baseType: !53, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !229, file: !115, line: 111, baseType: !93, size: 32, offset: 2624)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !229, file: !115, line: 111, baseType: !93, size: 32, offset: 2656)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !229, file: !115, line: 112, baseType: !93, size: 32, offset: 2688)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !229, file: !115, line: 112, baseType: !93, size: 32, offset: 2720)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !229, file: !115, line: 113, baseType: !93, size: 32, offset: 2752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !229, file: !115, line: 114, baseType: !93, size: 32, offset: 2784)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !229, file: !115, line: 114, baseType: !93, size: 32, offset: 2816)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !229, file: !115, line: 115, baseType: !51, size: 16, offset: 2848)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !229, file: !115, line: 115, baseType: !51, size: 16, offset: 2864)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !229, file: !115, line: 116, baseType: !51, size: 16, offset: 2880)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !229, file: !115, line: 117, baseType: !38, size: 8, offset: 2896)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !229, file: !115, line: 117, baseType: !38, size: 8, offset: 2904)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !229, file: !115, line: 119, baseType: !93, size: 32, offset: 2912)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !229, file: !115, line: 119, baseType: !93, size: 32, offset: 2944)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !229, file: !115, line: 120, baseType: !51, size: 16, offset: 2976)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !229, file: !115, line: 120, baseType: !51, size: 16, offset: 2992)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !229, file: !115, line: 121, baseType: !93, size: 32, offset: 3008)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !229, file: !115, line: 121, baseType: !93, size: 32, offset: 3040)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !229, file: !115, line: 122, baseType: !93, size: 32, offset: 3072)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !229, file: !115, line: 123, baseType: !93, size: 32, offset: 3104)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !229, file: !115, line: 124, baseType: !51, size: 16, offset: 3136)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !229, file: !115, line: 125, baseType: !51, size: 16, offset: 3152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !229, file: !115, line: 127, baseType: !53, size: 32, offset: 3168)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !229, file: !115, line: 127, baseType: !53, size: 32, offset: 3200)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !229, file: !115, line: 128, baseType: !53, size: 32, offset: 3232)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !229, file: !115, line: 128, baseType: !53, size: 32, offset: 3264)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !229, file: !115, line: 129, baseType: !51, size: 16, offset: 3296)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !229, file: !115, line: 129, baseType: !51, size: 16, offset: 3312)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !229, file: !115, line: 129, baseType: !51, size: 16, offset: 3328)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !229, file: !115, line: 129, baseType: !51, size: 16, offset: 3344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !229, file: !115, line: 130, baseType: !93, size: 32, offset: 3360)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !229, file: !115, line: 130, baseType: !93, size: 32, offset: 3392)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !229, file: !115, line: 130, baseType: !93, size: 32, offset: 3424)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !229, file: !115, line: 130, baseType: !93, size: 32, offset: 3456)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !229, file: !115, line: 131, baseType: !93, size: 32, offset: 3488)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !229, file: !115, line: 131, baseType: !93, size: 32, offset: 3520)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !229, file: !115, line: 131, baseType: !93, size: 32, offset: 3552)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !229, file: !115, line: 131, baseType: !93, size: 32, offset: 3584)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !229, file: !115, line: 132, baseType: !93, size: 32, offset: 3616)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !229, file: !115, line: 132, baseType: !93, size: 32, offset: 3648)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !229, file: !115, line: 133, baseType: !68, size: 512, offset: 3680)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !229, file: !115, line: 135, baseType: !93, size: 32, offset: 4192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !229, file: !115, line: 136, baseType: !93, size: 32, offset: 4224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !229, file: !115, line: 137, baseType: !93, size: 32, offset: 4256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !229, file: !115, line: 138, baseType: !53, size: 32, offset: 4288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !229, file: !115, line: 141, baseType: !38, size: 8, offset: 4320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !229, file: !115, line: 141, baseType: !38, size: 8, offset: 4328)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !229, file: !115, line: 141, baseType: !38, size: 8, offset: 4336)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !229, file: !115, line: 141, baseType: !38, size: 8, offset: 4344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !229, file: !115, line: 142, baseType: !51, size: 16, offset: 4352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !229, file: !115, line: 142, baseType: !51, size: 16, offset: 4368)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !229, file: !115, line: 142, baseType: !51, size: 16, offset: 4384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !229, file: !115, line: 145, baseType: !38, size: 8, offset: 4400)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !229, file: !115, line: 145, baseType: !38, size: 8, offset: 4408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !229, file: !115, line: 148, baseType: !51, size: 16, offset: 4416)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !229, file: !115, line: 148, baseType: !51, size: 16, offset: 4432)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !229, file: !115, line: 149, baseType: !93, size: 32, offset: 4448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !229, file: !115, line: 149, baseType: !93, size: 32, offset: 4480)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !229, file: !115, line: 152, baseType: !345, size: 128, offset: 4512)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 4)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !229, file: !115, line: 153, baseType: !93, size: 32, offset: 4640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !229, file: !115, line: 154, baseType: !93, size: 32, offset: 4672)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !229, file: !115, line: 157, baseType: !51, size: 16, offset: 4704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !229, file: !115, line: 157, baseType: !51, size: 16, offset: 4720)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !229, file: !115, line: 160, baseType: !353, size: 64, offset: 4736)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !355, line: 113, size: 6208, elements: !356)
!355 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !{!357, !358, !359, !360, !361, !362, !366}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !354, file: !355, line: 114, baseType: !51, size: 16)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !354, file: !355, line: 114, baseType: !51, size: 16, offset: 16)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !354, file: !355, line: 115, baseType: !38, size: 8, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !354, file: !355, line: 115, baseType: !38, size: 8, offset: 40)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !354, file: !355, line: 116, baseType: !38, size: 8, offset: 48)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !355, line: 117, baseType: !363, size: 8, offset: 56)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 1)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !355, line: 119, baseType: !367, size: 6144, offset: 64)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 6144, elements: !377)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !355, line: 109, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !355, line: 106, size: 192, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !369, file: !355, line: 107, baseType: !93, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !369, file: !355, line: 107, baseType: !93, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !369, file: !355, line: 107, baseType: !93, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !369, file: !355, line: 107, baseType: !93, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !369, file: !355, line: 107, baseType: !93, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !369, file: !355, line: 108, baseType: !53, size: 32, offset: 160)
!377 = !{!378}
!378 = !DISubrange(count: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !229, file: !115, line: 161, baseType: !353, size: 64, offset: 4800)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !229, file: !115, line: 162, baseType: !38, size: 8, offset: 4864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !229, file: !115, line: 162, baseType: !38, size: 8, offset: 4872)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !229, file: !115, line: 163, baseType: !38, size: 8, offset: 4880)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !229, file: !115, line: 163, baseType: !38, size: 8, offset: 4888)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !229, file: !115, line: 164, baseType: !51, size: 16, offset: 4896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !229, file: !115, line: 164, baseType: !51, size: 16, offset: 4912)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !229, file: !115, line: 165, baseType: !93, size: 32, offset: 4928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !229, file: !115, line: 165, baseType: !93, size: 32, offset: 4960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !229, file: !115, line: 167, baseType: !389, size: 1152, offset: 4992)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 1152, elements: !1396)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !355, line: 57, size: 2496, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !391, file: !355, line: 59, baseType: !51, size: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !391, file: !355, line: 59, baseType: !51, size: 16, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !391, file: !355, line: 59, baseType: !51, size: 16, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !391, file: !355, line: 59, baseType: !51, size: 16, offset: 48)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !391, file: !355, line: 60, baseType: !107, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !391, file: !355, line: 61, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !355, line: 202, size: 3328, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !1244, !1245, !1246, !1247, !1248, !1276, !1277, !1307, !1327, !1335, !1336}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !400, file: !355, line: 203, baseType: !18, size: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !400, file: !355, line: 204, baseType: !113, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !400, file: !355, line: 206, baseType: !93, size: 32, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !400, file: !355, line: 206, baseType: !93, size: 32, offset: 1056)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !400, file: !355, line: 207, baseType: !93, size: 32, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !400, file: !355, line: 207, baseType: !93, size: 32, offset: 1120)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !400, file: !355, line: 207, baseType: !93, size: 32, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !400, file: !355, line: 207, baseType: !93, size: 32, offset: 1184)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !400, file: !355, line: 207, baseType: !93, size: 32, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !400, file: !355, line: 207, baseType: !93, size: 32, offset: 1248)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !400, file: !355, line: 208, baseType: !93, size: 32, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !400, file: !355, line: 208, baseType: !93, size: 32, offset: 1312)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !400, file: !355, line: 211, baseType: !93, size: 32, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !400, file: !355, line: 211, baseType: !93, size: 32, offset: 1376)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !400, file: !355, line: 211, baseType: !93, size: 32, offset: 1408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !400, file: !355, line: 211, baseType: !93, size: 32, offset: 1440)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !400, file: !355, line: 211, baseType: !93, size: 32, offset: 1472)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !400, file: !355, line: 214, baseType: !93, size: 32, offset: 1504)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !400, file: !355, line: 214, baseType: !93, size: 32, offset: 1536)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !400, file: !355, line: 217, baseType: !93, size: 32, offset: 1568)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !400, file: !355, line: 218, baseType: !93, size: 32, offset: 1600)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !400, file: !355, line: 219, baseType: !93, size: 32, offset: 1632)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !400, file: !355, line: 220, baseType: !93, size: 32, offset: 1664)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !400, file: !355, line: 221, baseType: !93, size: 32, offset: 1696)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !400, file: !355, line: 222, baseType: !51, size: 16, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !400, file: !355, line: 222, baseType: !51, size: 16, offset: 1744)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !400, file: !355, line: 224, baseType: !51, size: 16, offset: 1760)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !400, file: !355, line: 224, baseType: !51, size: 16, offset: 1776)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !400, file: !355, line: 227, baseType: !51, size: 16, offset: 1792)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !400, file: !355, line: 227, baseType: !51, size: 16, offset: 1808)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !400, file: !355, line: 229, baseType: !51, size: 16, offset: 1824)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !355, line: 229, baseType: !51, size: 16, offset: 1840)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !355, line: 230, baseType: !51, size: 16, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !400, file: !355, line: 230, baseType: !51, size: 16, offset: 1872)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !400, file: !355, line: 232, baseType: !93, size: 32, offset: 1888)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !400, file: !355, line: 232, baseType: !93, size: 32, offset: 1920)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !400, file: !355, line: 232, baseType: !93, size: 32, offset: 1952)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !400, file: !355, line: 232, baseType: !93, size: 32, offset: 1984)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !400, file: !355, line: 233, baseType: !53, size: 32, offset: 2016)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !400, file: !355, line: 234, baseType: !53, size: 32, offset: 2048)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !400, file: !355, line: 235, baseType: !51, size: 16, offset: 2080)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !400, file: !355, line: 235, baseType: !51, size: 16, offset: 2096)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !400, file: !355, line: 236, baseType: !51, size: 16, offset: 2112)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !400, file: !355, line: 239, baseType: !51, size: 16, offset: 2128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !400, file: !355, line: 240, baseType: !53, size: 32, offset: 2144)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !400, file: !355, line: 241, baseType: !53, size: 32, offset: 2176)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !400, file: !355, line: 241, baseType: !53, size: 32, offset: 2208)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !400, file: !355, line: 241, baseType: !53, size: 32, offset: 2240)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !400, file: !355, line: 243, baseType: !93, size: 32, offset: 2272)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !400, file: !355, line: 243, baseType: !93, size: 32, offset: 2304)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !400, file: !355, line: 244, baseType: !93, size: 32, offset: 2336)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !400, file: !355, line: 246, baseType: !454, size: 320, offset: 2368)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !455, line: 50, size: 320, elements: !456)
!455 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!456 = !{!457, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !454, file: !455, line: 51, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !460, line: 1216, size: 39680, elements: !461)
!460 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!461 = !{!462, !463, !464, !465, !468, !469, !470, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !496, !499, !798, !801, !1099, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1121, !1122, !1123, !1124, !1125, !1133, !1200, !1207, !1208, !1215, !1218, !1224, !1225, !1226, !1227, !1228}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !459, file: !460, line: 1217, baseType: !18, size: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !459, file: !460, line: 1218, baseType: !113, size: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !459, file: !460, line: 1220, baseType: !107, size: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !459, file: !460, line: 1221, baseType: !466, size: 64, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !460, line: 52, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !459, file: !460, line: 1223, baseType: !458, size: 64, offset: 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !459, file: !460, line: 1225, baseType: !78, size: 128, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !459, file: !460, line: 1226, baseType: !471, size: 64, offset: 1344)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !460, line: 69, size: 320, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !460, line: 70, baseType: !471, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !472, file: !460, line: 70, baseType: !471, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !472, file: !460, line: 71, baseType: !90, size: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !472, file: !460, line: 71, baseType: !90, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !472, file: !460, line: 72, baseType: !53, size: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !472, file: !460, line: 73, baseType: !51, size: 16, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !472, file: !460, line: 73, baseType: !51, size: 16, offset: 240)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !472, file: !460, line: 74, baseType: !107, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !459, file: !460, line: 1227, baseType: !107, size: 64, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !459, file: !460, line: 1229, baseType: !92, size: 96, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !459, file: !460, line: 1230, baseType: !92, size: 96, offset: 1568)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !459, file: !460, line: 1231, baseType: !92, size: 96, offset: 1664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !459, file: !460, line: 1231, baseType: !92, size: 96, offset: 1760)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !459, file: !460, line: 1233, baseType: !90, size: 32, offset: 1856)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !459, file: !460, line: 1234, baseType: !53, size: 32, offset: 1888)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !459, file: !460, line: 1235, baseType: !90, size: 32, offset: 1920)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !459, file: !460, line: 1237, baseType: !51, size: 16, offset: 1952)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !459, file: !460, line: 1239, baseType: !38, size: 8, offset: 1968)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !459, file: !460, line: 1240, baseType: !363, size: 8, offset: 1976)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !459, file: !460, line: 1242, baseType: !494, size: 64, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !115, line: 47, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !459, file: !460, line: 1244, baseType: !497, size: 64, offset: 2048)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !460, line: 59, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !459, file: !460, line: 1246, baseType: !500, size: 64, offset: 2112)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !460, line: 1067, size: 5184, elements: !502)
!502 = !{!503, !534, !535, !550, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !572, !669, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !718, !719, !720, !721, !722, !723, !724, !725, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !781}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !501, file: !460, line: 1068, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !460, line: 934, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !460, line: 925, size: 576, elements: !507)
!507 = !{!508, !525, !526, !527, !528, !530, !533}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !506, file: !460, line: 926, baseType: !509, size: 320)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !460, line: 830, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !460, line: 813, size: 320, elements: !511)
!511 = !{!512, !515, !518, !519, !522, !523, !524}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !510, file: !460, line: 814, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !460, line: 51, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !510, file: !460, line: 815, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !460, line: 815, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !510, file: !460, line: 818, baseType: !4, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !510, file: !460, line: 819, baseType: !520, size: 32, offset: 192)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 32, elements: !346)
!521 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !510, file: !460, line: 822, baseType: !53, size: 32, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !510, file: !460, line: 826, baseType: !53, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !510, file: !460, line: 829, baseType: !53, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !506, file: !460, line: 928, baseType: !51, size: 16, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !506, file: !460, line: 928, baseType: !51, size: 16, offset: 336)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !506, file: !460, line: 929, baseType: !53, size: 32, offset: 352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !506, file: !460, line: 930, baseType: !529, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !506, file: !460, line: 931, baseType: !531, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !460, line: 931, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !506, file: !460, line: 933, baseType: !4, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !501, file: !460, line: 1069, baseType: !504, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !501, file: !460, line: 1070, baseType: !536, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !460, line: 916, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !460, line: 891, size: 704, elements: !539)
!539 = !{!540, !541, !542, !544, !545, !546, !547, !548, !549}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !538, file: !460, line: 892, baseType: !509, size: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !538, file: !460, line: 896, baseType: !53, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !538, file: !460, line: 900, baseType: !543, size: 96, offset: 352)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !94)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !538, file: !460, line: 903, baseType: !93, size: 32, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !538, file: !460, line: 906, baseType: !53, size: 32, offset: 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !538, file: !460, line: 909, baseType: !93, size: 32, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !538, file: !460, line: 912, baseType: !93, size: 32, offset: 544)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !538, file: !460, line: 914, baseType: !107, size: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !538, file: !460, line: 915, baseType: !4, size: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !501, file: !460, line: 1071, baseType: !551, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !460, line: 920, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !460, line: 918, size: 320, elements: !554)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !553, file: !460, line: 919, baseType: !509, size: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !501, file: !460, line: 1075, baseType: !93, size: 32, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !501, file: !460, line: 1077, baseType: !93, size: 32, offset: 288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !501, file: !460, line: 1078, baseType: !93, size: 32, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !501, file: !460, line: 1079, baseType: !51, size: 16, offset: 352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !501, file: !460, line: 1082, baseType: !51, size: 16, offset: 368)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !501, file: !460, line: 1085, baseType: !38, size: 8, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !501, file: !460, line: 1086, baseType: !38, size: 8, offset: 392)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !501, file: !460, line: 1087, baseType: !38, size: 8, offset: 400)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !501, file: !460, line: 1088, baseType: !38, size: 8, offset: 408)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !501, file: !460, line: 1090, baseType: !93, size: 32, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !501, file: !460, line: 1093, baseType: !51, size: 16, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !501, file: !460, line: 1096, baseType: !38, size: 8, offset: 464)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !501, file: !460, line: 1098, baseType: !569, size: 40, offset: 472)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 40, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 5)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !501, file: !460, line: 1101, baseType: !573, size: 832, offset: 512)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !460, line: 836, size: 832, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !584, !585, !586, !665, !666, !667, !668}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !573, file: !460, line: 837, baseType: !509, size: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !573, file: !460, line: 839, baseType: !51, size: 16, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !573, file: !460, line: 839, baseType: !51, size: 16, offset: 336)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !573, file: !460, line: 842, baseType: !51, size: 16, offset: 352)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !573, file: !460, line: 842, baseType: !51, size: 16, offset: 368)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !573, file: !460, line: 843, baseType: !581, size: 32, offset: 384)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 32, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 2)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !573, file: !460, line: 845, baseType: !53, size: 32, offset: 416)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !573, file: !460, line: 847, baseType: !4, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !573, file: !460, line: 848, baseType: !587, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !455, line: 77, size: 15424, elements: !589)
!589 = !{!590, !591, !592, !595, !598, !601, !604, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !654, !655, !659}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !588, file: !455, line: 78, baseType: !18, size: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !588, file: !455, line: 80, baseType: !37, size: 8192, offset: 960)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !588, file: !455, line: 82, baseType: !593, size: 64, offset: 9152)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !455, line: 43, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !588, file: !455, line: 83, baseType: !596, size: 64, offset: 9216)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !19, line: 46, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !588, file: !455, line: 86, baseType: !599, size: 64, offset: 9280)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !455, line: 41, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !588, file: !455, line: 87, baseType: !602, size: 64, offset: 9344)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !455, line: 44, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !588, file: !455, line: 89, baseType: !605, size: 512, offset: 9408)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 512, elements: !606)
!606 = !{!140}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !588, file: !455, line: 90, baseType: !51, size: 16, offset: 9920)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !588, file: !455, line: 90, baseType: !51, size: 16, offset: 9936)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !588, file: !455, line: 92, baseType: !51, size: 16, offset: 9952)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !588, file: !455, line: 92, baseType: !51, size: 16, offset: 9968)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !588, file: !455, line: 93, baseType: !51, size: 16, offset: 9984)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !455, line: 93, baseType: !51, size: 16, offset: 10000)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !588, file: !455, line: 94, baseType: !53, size: 32, offset: 10016)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !588, file: !455, line: 97, baseType: !51, size: 16, offset: 10048)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !588, file: !455, line: 97, baseType: !51, size: 16, offset: 10064)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !588, file: !455, line: 98, baseType: !51, size: 16, offset: 10080)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !588, file: !455, line: 98, baseType: !51, size: 16, offset: 10096)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !588, file: !455, line: 99, baseType: !51, size: 16, offset: 10112)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !588, file: !455, line: 99, baseType: !51, size: 16, offset: 10128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !588, file: !455, line: 100, baseType: !90, size: 32, offset: 10144)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !588, file: !455, line: 101, baseType: !529, size: 64, offset: 10176)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !588, file: !455, line: 103, baseType: !44, size: 64, offset: 10240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !588, file: !455, line: 104, baseType: !624, size: 64, offset: 10304)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !19, line: 159, size: 448, elements: !626)
!626 = !{!627, !629, !630, !631, !632, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !625, file: !19, line: 161, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !582)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !625, file: !19, line: 162, baseType: !628, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !625, file: !19, line: 163, baseType: !581, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !625, file: !19, line: 164, baseType: !581, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !625, file: !19, line: 165, baseType: !633, size: 128, offset: 192)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 128, elements: !582)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !625, file: !19, line: 166, baseType: !635, size: 128, offset: 320)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 128, elements: !582)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !588, file: !455, line: 107, baseType: !93, size: 32, offset: 10368)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !588, file: !455, line: 108, baseType: !53, size: 32, offset: 10400)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !588, file: !455, line: 109, baseType: !51, size: 16, offset: 10432)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !588, file: !455, line: 110, baseType: !51, size: 16, offset: 10448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !588, file: !455, line: 113, baseType: !53, size: 32, offset: 10464)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !588, file: !455, line: 113, baseType: !53, size: 32, offset: 10496)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !588, file: !455, line: 114, baseType: !38, size: 8, offset: 10528)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !588, file: !455, line: 114, baseType: !38, size: 8, offset: 10536)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !588, file: !455, line: 115, baseType: !51, size: 16, offset: 10544)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !588, file: !455, line: 116, baseType: !345, size: 128, offset: 10560)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !588, file: !455, line: 119, baseType: !93, size: 32, offset: 10688)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !588, file: !455, line: 119, baseType: !93, size: 32, offset: 10720)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !588, file: !455, line: 122, baseType: !649, size: 512, offset: 10752)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !650, line: 182, baseType: !651)
!650 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !650, line: 180, size: 512, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !650, line: 181, baseType: !68, size: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !588, file: !455, line: 123, baseType: !38, size: 8, offset: 11264)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !588, file: !455, line: 125, baseType: !656, size: 56, offset: 11272)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 56, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 7)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !588, file: !455, line: 126, baseType: !660, size: 4096, offset: 11328)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 4096, elements: !606)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !455, line: 69, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !455, line: 67, size: 512, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !455, line: 68, baseType: !68, size: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !573, file: !460, line: 849, baseType: !587, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !573, file: !460, line: 850, baseType: !587, size: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !573, file: !460, line: 851, baseType: !92, size: 96, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !573, file: !460, line: 852, baseType: !93, size: 32, offset: 800)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !501, file: !460, line: 1104, baseType: !670, size: 1344, offset: 1344)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !460, line: 867, size: 1344, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !670, file: !460, line: 868, baseType: !51, size: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !670, file: !460, line: 869, baseType: !51, size: 16, offset: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !670, file: !460, line: 870, baseType: !51, size: 16, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !670, file: !460, line: 871, baseType: !51, size: 16, offset: 48)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !670, file: !460, line: 873, baseType: !677, size: 896, offset: 64)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 896, elements: !657)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !460, line: 864, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !460, line: 859, size: 128, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !679, file: !460, line: 860, baseType: !51, size: 16)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !679, file: !460, line: 861, baseType: !51, size: 16, offset: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !679, file: !460, line: 861, baseType: !51, size: 16, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !679, file: !460, line: 861, baseType: !51, size: 16, offset: 48)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !460, line: 862, baseType: !53, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !679, file: !460, line: 863, baseType: !93, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !670, file: !460, line: 874, baseType: !4, size: 64, offset: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !670, file: !460, line: 876, baseType: !93, size: 32, offset: 1024)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !670, file: !460, line: 876, baseType: !93, size: 32, offset: 1056)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !670, file: !460, line: 878, baseType: !53, size: 32, offset: 1088)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !670, file: !460, line: 879, baseType: !53, size: 32, offset: 1120)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !670, file: !460, line: 881, baseType: !53, size: 32, offset: 1152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !670, file: !460, line: 881, baseType: !53, size: 32, offset: 1184)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !670, file: !460, line: 883, baseType: !458, size: 64, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !670, file: !460, line: 884, baseType: !107, size: 64, offset: 1280)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !501, file: !460, line: 1107, baseType: !93, size: 32, offset: 2688)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !501, file: !460, line: 1110, baseType: !93, size: 32, offset: 2720)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !501, file: !460, line: 1113, baseType: !51, size: 16, offset: 2752)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !501, file: !460, line: 1113, baseType: !51, size: 16, offset: 2768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !501, file: !460, line: 1116, baseType: !38, size: 8, offset: 2784)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !501, file: !460, line: 1117, baseType: !363, size: 8, offset: 2792)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !501, file: !460, line: 1120, baseType: !51, size: 16, offset: 2800)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !501, file: !460, line: 1121, baseType: !93, size: 32, offset: 2816)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !501, file: !460, line: 1122, baseType: !93, size: 32, offset: 2848)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !501, file: !460, line: 1123, baseType: !93, size: 32, offset: 2880)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !501, file: !460, line: 1124, baseType: !93, size: 32, offset: 2912)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !501, file: !460, line: 1125, baseType: !93, size: 32, offset: 2944)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !501, file: !460, line: 1126, baseType: !93, size: 32, offset: 2976)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !501, file: !460, line: 1127, baseType: !93, size: 32, offset: 3008)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !501, file: !460, line: 1128, baseType: !93, size: 32, offset: 3040)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !501, file: !460, line: 1129, baseType: !93, size: 32, offset: 3072)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !501, file: !460, line: 1130, baseType: !93, size: 32, offset: 3104)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !501, file: !460, line: 1131, baseType: !51, size: 16, offset: 3136)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !501, file: !460, line: 1132, baseType: !38, size: 8, offset: 3152)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !501, file: !460, line: 1133, baseType: !38, size: 8, offset: 3160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !501, file: !460, line: 1134, baseType: !717, size: 24, offset: 3168)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 24, elements: !94)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !501, file: !460, line: 1135, baseType: !38, size: 8, offset: 3192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !501, file: !460, line: 1138, baseType: !107, size: 64, offset: 3200)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !501, file: !460, line: 1139, baseType: !38, size: 8, offset: 3264)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !501, file: !460, line: 1140, baseType: !38, size: 8, offset: 3272)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !501, file: !460, line: 1141, baseType: !38, size: 8, offset: 3280)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !501, file: !460, line: 1142, baseType: !38, size: 8, offset: 3288)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !501, file: !460, line: 1143, baseType: !38, size: 8, offset: 3296)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !501, file: !460, line: 1144, baseType: !726, size: 64, offset: 3304)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !606)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !501, file: !460, line: 1145, baseType: !726, size: 64, offset: 3368)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !501, file: !460, line: 1148, baseType: !38, size: 8, offset: 3432)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !501, file: !460, line: 1149, baseType: !38, size: 8, offset: 3440)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !501, file: !460, line: 1152, baseType: !38, size: 8, offset: 3448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !501, file: !460, line: 1152, baseType: !38, size: 8, offset: 3456)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !501, file: !460, line: 1153, baseType: !38, size: 8, offset: 3464)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !501, file: !460, line: 1154, baseType: !51, size: 16, offset: 3472)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !501, file: !460, line: 1154, baseType: !51, size: 16, offset: 3488)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !501, file: !460, line: 1155, baseType: !51, size: 16, offset: 3504)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !501, file: !460, line: 1155, baseType: !51, size: 16, offset: 3520)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !501, file: !460, line: 1156, baseType: !38, size: 8, offset: 3536)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !501, file: !460, line: 1157, baseType: !38, size: 8, offset: 3544)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !501, file: !460, line: 1159, baseType: !38, size: 8, offset: 3552)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !501, file: !460, line: 1160, baseType: !38, size: 8, offset: 3560)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !501, file: !460, line: 1161, baseType: !38, size: 8, offset: 3568)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !501, file: !460, line: 1162, baseType: !38, size: 8, offset: 3576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !501, file: !460, line: 1165, baseType: !53, size: 32, offset: 3584)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !501, file: !460, line: 1166, baseType: !53, size: 32, offset: 3616)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !501, file: !460, line: 1167, baseType: !53, size: 32, offset: 3648)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !501, file: !460, line: 1168, baseType: !53, size: 32, offset: 3680)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !501, file: !460, line: 1171, baseType: !51, size: 16, offset: 3712)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !501, file: !460, line: 1171, baseType: !51, size: 16, offset: 3728)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !501, file: !460, line: 1172, baseType: !53, size: 32, offset: 3744)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !501, file: !460, line: 1173, baseType: !93, size: 32, offset: 3776)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !501, file: !460, line: 1174, baseType: !93, size: 32, offset: 3808)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !501, file: !460, line: 1177, baseType: !753, size: 1024, offset: 3840)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !460, line: 963, size: 1024, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !779, !780}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !753, file: !460, line: 965, baseType: !53, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !753, file: !460, line: 968, baseType: !93, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !753, file: !460, line: 971, baseType: !93, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !753, file: !460, line: 974, baseType: !93, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !753, file: !460, line: 977, baseType: !92, size: 96, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !753, file: !460, line: 979, baseType: !92, size: 96, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !753, file: !460, line: 982, baseType: !53, size: 32, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !753, file: !460, line: 987, baseType: !763, size: 64, offset: 352)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 64, elements: !582)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !753, file: !460, line: 989, baseType: !93, size: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !753, file: !460, line: 994, baseType: !53, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !753, file: !460, line: 995, baseType: !53, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !753, file: !460, line: 997, baseType: !38, size: 8, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !753, file: !460, line: 998, baseType: !656, size: 56, offset: 520)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !753, file: !460, line: 1000, baseType: !93, size: 32, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !753, file: !460, line: 1003, baseType: !763, size: 64, offset: 608)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !753, file: !460, line: 1006, baseType: !53, size: 32, offset: 672)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !753, file: !460, line: 1009, baseType: !93, size: 32, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !753, file: !460, line: 1012, baseType: !763, size: 64, offset: 736)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !753, file: !460, line: 1015, baseType: !763, size: 64, offset: 800)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !753, file: !460, line: 1018, baseType: !53, size: 32, offset: 864)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !753, file: !460, line: 1019, baseType: !777, size: 64, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !460, line: 63, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !753, file: !460, line: 1023, baseType: !93, size: 32, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !753, file: !460, line: 1024, baseType: !53, size: 32, offset: 992)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !501, file: !460, line: 1179, baseType: !782, size: 320, offset: 4864)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !460, line: 1043, size: 320, elements: !783)
!783 = !{!784, !785, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !460, line: 1044, baseType: !38, size: 8)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !782, file: !460, line: 1045, baseType: !786, size: 16, offset: 8)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 16, elements: !582)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !782, file: !460, line: 1048, baseType: !38, size: 8, offset: 24)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !782, file: !460, line: 1049, baseType: !93, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !782, file: !460, line: 1049, baseType: !93, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !782, file: !460, line: 1052, baseType: !93, size: 32, offset: 96)
