; ModuleID = 'blender/source/blender/editors/space_clip/clip_buttons.c'
source_filename = "blender/source/blender/editors/space_clip/clip_buttons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!880 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!881 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!882 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!883 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!884 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!885 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!886 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!887 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!888 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!889 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!890 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!891 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!892 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!893 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!894 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!895 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!896 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!897 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!898 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!899 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!900 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!901 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!902 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!903 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!904 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!905 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!906 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!907 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!908 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!909 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!910 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !912, line: 371, baseType: !5, size: 32, elements: !913)
!912 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIEnumerator(name: "MARKER_DISABLED", value: 1, isUnsigned: true)
!915 = !DIEnumerator(name: "MARKER_TRACKED", value: 2, isUnsigned: true)
!916 = !DIEnumerator(name: "MARKER_GRAPH_SEL_X", value: 4, isUnsigned: true)
!917 = !DIEnumerator(name: "MARKER_GRAPH_SEL_Y", value: 8, isUnsigned: true)
!918 = !DIEnumerator(name: "MARKER_GRAPH_SEL", value: 12, isUnsigned: true)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !912, line: 380, baseType: !5, size: 32, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!921 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!922 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!923 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!924 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!925 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!926 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!927 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!928 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!929 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!930 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!931 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 133, baseType: !5, size: 32, elements: !934)
!933 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!934 = !{!935, !936}
!935 = !DIEnumerator(name: "MCLIP_SRC_SEQUENCE", value: 1, isUnsigned: true)
!936 = !DIEnumerator(name: "MCLIP_SRC_MOVIE", value: 2, isUnsigned: true)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceClip_View", file: !938, line: 1147, baseType: !5, size: 32, elements: !939)
!938 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!939 = !{!940, !941, !942}
!940 = !DIEnumerator(name: "SC_VIEW_CLIP", value: 0, isUnsigned: true)
!941 = !DIEnumerator(name: "SC_VIEW_GRAPH", value: 1, isUnsigned: true)
!942 = !DIEnumerator(name: "SC_VIEW_DOPESHEET", value: 2, isUnsigned: true)
!943 = !{!944, !945, !950, !1104, !1420}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClipScopes", file: !933, line: 118, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !933, line: 103, size: 1088, elements: !948)
!948 = !{!949, !951, !952, !954, !955, !956, !972, !1056, !1057, !1058, !1059, !1060, !1061, !1101, !1103}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !947, file: !933, line: 104, baseType: !950, size: 16)
!950 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !947, file: !933, line: 105, baseType: !950, size: 16, offset: 16)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !947, file: !933, line: 106, baseType: !953, size: 32, offset: 32)
!953 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !947, file: !933, line: 107, baseType: !953, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !947, file: !933, line: 107, baseType: !953, size: 32, offset: 96)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !947, file: !933, line: 108, baseType: !957, size: 512, offset: 128)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !912, line: 81, size: 512, elements: !958)
!958 = !{!959, !964, !968, !969, !970, !971}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !957, file: !912, line: 82, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 64, elements: !962)
!961 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!962 = !{!963}
!963 = !DISubrange(count: 2)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !957, file: !912, line: 97, baseType: !965, size: 256, offset: 64)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 256, elements: !966)
!966 = !{!967, !963}
!967 = !DISubrange(count: 4)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !957, file: !912, line: 102, baseType: !960, size: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !957, file: !912, line: 102, baseType: !960, size: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !957, file: !912, line: 104, baseType: !953, size: 32, offset: 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !957, file: !912, line: 105, baseType: !953, size: 32, offset: 480)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !947, file: !933, line: 109, baseType: !973, size: 64, offset: 640)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !975, line: 70, size: 19840, elements: !976)
!975 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!976 = !{!977, !978, !979, !980, !981, !983, !984, !985, !986, !988, !990, !993, !994, !995, !996, !997, !999, !1001, !1002, !1003, !1007, !1008, !1009, !1010, !1011, !1014, !1015, !1016, !1021, !1022, !1025, !1026, !1028, !1029, !1030, !1034, !1035, !1036, !1039, !1040, !1049}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !974, file: !975, line: 71, baseType: !973, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !974, file: !975, line: 71, baseType: !973, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !974, file: !975, line: 74, baseType: !953, size: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !974, file: !975, line: 74, baseType: !953, size: 32, offset: 160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !974, file: !975, line: 79, baseType: !982, size: 8, offset: 192)
!982 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !974, file: !975, line: 80, baseType: !953, size: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !974, file: !975, line: 83, baseType: !953, size: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !974, file: !975, line: 84, baseType: !953, size: 32, offset: 288)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !974, file: !975, line: 87, baseType: !987, size: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !974, file: !975, line: 88, baseType: !989, size: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !974, file: !975, line: 93, baseType: !991, size: 128, offset: 448)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 128, elements: !962)
!992 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !974, file: !975, line: 96, baseType: !953, size: 32, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !974, file: !975, line: 96, baseType: !953, size: 32, offset: 608)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !974, file: !975, line: 97, baseType: !953, size: 32, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !974, file: !975, line: 97, baseType: !953, size: 32, offset: 672)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !974, file: !975, line: 98, baseType: !998, size: 64, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !974, file: !975, line: 101, baseType: !1000, size: 64, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !974, file: !975, line: 102, baseType: !989, size: 64, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !974, file: !975, line: 105, baseType: !961, size: 32, offset: 896)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !974, file: !975, line: 108, baseType: !1004, size: 1280, offset: 960)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 1280, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 20)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !974, file: !975, line: 109, baseType: !953, size: 32, offset: 2240)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !974, file: !975, line: 109, baseType: !953, size: 32, offset: 2272)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !974, file: !975, line: 112, baseType: !953, size: 32, offset: 2304)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !974, file: !975, line: 113, baseType: !953, size: 32, offset: 2336)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !974, file: !975, line: 114, baseType: !1012, size: 64, offset: 2368)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !975, line: 50, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !974, file: !975, line: 115, baseType: !944, size: 64, offset: 2432)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !974, file: !975, line: 118, baseType: !953, size: 32, offset: 2496)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !974, file: !975, line: 119, baseType: !1017, size: 8192, offset: 2528)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 8192, elements: !1019)
!1018 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1019 = !{!1020}
!1020 = !DISubrange(count: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !974, file: !975, line: 120, baseType: !1017, size: 8192, offset: 10720)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !974, file: !975, line: 123, baseType: !1023, size: 64, offset: 18944)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !975, line: 123, flags: DIFlagFwdDecl)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !974, file: !975, line: 124, baseType: !953, size: 32, offset: 19008)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !974, file: !975, line: 127, baseType: !1027, size: 64, offset: 19072)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !974, file: !975, line: 128, baseType: !5, size: 32, offset: 19136)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !974, file: !975, line: 129, baseType: !5, size: 32, offset: 19168)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !974, file: !975, line: 132, baseType: !1031, size: 64, offset: 19200)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !1033, line: 63, flags: DIFlagFwdDecl)
!1033 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !974, file: !975, line: 133, baseType: !1031, size: 64, offset: 19264)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !974, file: !975, line: 134, baseType: !987, size: 64, offset: 19328)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !974, file: !975, line: 135, baseType: !1037, size: 64, offset: 19392)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !975, line: 135, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !974, file: !975, line: 136, baseType: !953, size: 32, offset: 19456)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !974, file: !975, line: 137, baseType: !1041, size: 128, offset: 19488)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1042, line: 89, baseType: !1043)
!1042 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1042, line: 86, size: 128, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1043, file: !1042, line: 87, baseType: !953, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1043, file: !1042, line: 87, baseType: !953, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1043, file: !1042, line: 88, baseType: !953, size: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1043, file: !1042, line: 88, baseType: !953, size: 32, offset: 96)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !974, file: !975, line: 140, baseType: !1050, size: 192, offset: 19648)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !975, line: 55, size: 192, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !1050, file: !975, line: 56, baseType: !5, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !1050, file: !975, line: 57, baseType: !5, size: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1050, file: !975, line: 58, baseType: !1027, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1050, file: !975, line: 59, baseType: !5, size: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !947, file: !933, line: 110, baseType: !973, size: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !947, file: !933, line: 111, baseType: !960, size: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !947, file: !933, line: 112, baseType: !950, size: 16, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !947, file: !933, line: 113, baseType: !950, size: 16, offset: 848)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !947, file: !933, line: 114, baseType: !953, size: 32, offset: 864)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !947, file: !933, line: 115, baseType: !1062, size: 64, offset: 896)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !912, line: 108, size: 1664, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1081, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1099, !1100}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !912, line: 109, baseType: !1062, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1063, file: !912, line: 109, baseType: !1062, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1063, file: !912, line: 111, baseType: !1068, size: 512, offset: 128)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 512, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1063, file: !912, line: 119, baseType: !960, size: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1063, file: !912, line: 119, baseType: !960, size: 64, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1063, file: !912, line: 125, baseType: !960, size: 64, offset: 768)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1063, file: !912, line: 125, baseType: !960, size: 64, offset: 832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1063, file: !912, line: 127, baseType: !960, size: 64, offset: 896)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1063, file: !912, line: 130, baseType: !953, size: 32, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1063, file: !912, line: 131, baseType: !953, size: 32, offset: 992)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1063, file: !912, line: 132, baseType: !1079, size: 64, offset: 1024)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !912, line: 106, baseType: !957)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1063, file: !912, line: 135, baseType: !1082, size: 96, offset: 1088)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 96, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 3)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1063, file: !912, line: 136, baseType: !961, size: 32, offset: 1184)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1063, file: !912, line: 139, baseType: !953, size: 32, offset: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1063, file: !912, line: 139, baseType: !953, size: 32, offset: 1248)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1063, file: !912, line: 139, baseType: !953, size: 32, offset: 1280)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1063, file: !912, line: 140, baseType: !1082, size: 96, offset: 1312)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1063, file: !912, line: 143, baseType: !950, size: 16, offset: 1408)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1063, file: !912, line: 144, baseType: !950, size: 16, offset: 1424)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1063, file: !912, line: 145, baseType: !950, size: 16, offset: 1440)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1063, file: !912, line: 148, baseType: !950, size: 16, offset: 1456)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1063, file: !912, line: 149, baseType: !953, size: 32, offset: 1472)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1063, file: !912, line: 150, baseType: !961, size: 32, offset: 1504)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1063, file: !912, line: 152, baseType: !1097, size: 64, offset: 1536)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1033, line: 61, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1063, file: !912, line: 163, baseType: !961, size: 32, offset: 1600)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1063, file: !912, line: 163, baseType: !961, size: 32, offset: 1632)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !947, file: !933, line: 116, baseType: !1102, size: 64, offset: 960)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !947, file: !933, line: 117, baseType: !960, size: 64, offset: 1024)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !933, line: 101, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !933, line: 64, size: 19136, elements: !1107)
!1107 = !{!1108, !1170, !1173, !1174, !1175, !1176, !1178, !1179, !1180, !1184, !1187, !1188, !1403, !1404, !1415, !1416, !1417, !1418, !1419}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1106, file: !933, line: 65, baseType: !1109, size: 960)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1110, line: 130, baseType: !1111)
!1110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1110, line: 117, size: 960, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1117, !1133, !1137, !1138, !1139, !1140, !1141}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1111, file: !1110, line: 118, baseType: !944, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1111, file: !1110, line: 118, baseType: !944, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1111, file: !1110, line: 119, baseType: !1116, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1111, file: !1110, line: 120, baseType: !1118, size: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1110, line: 136, size: 17600, elements: !1120)
!1120 = !{!1121, !1122, !1124, !1127, !1128, !1129, !1130}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1119, file: !1110, line: 137, baseType: !1109, size: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1119, file: !1110, line: 138, baseType: !1123, size: 64, offset: 960)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1119, file: !1110, line: 139, baseType: !1125, size: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1110, line: 43, flags: DIFlagFwdDecl)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1119, file: !1110, line: 140, baseType: !1017, size: 8192, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1119, file: !1110, line: 141, baseType: !1017, size: 8192, offset: 9280)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1119, file: !1110, line: 148, baseType: !1118, size: 64, offset: 17472)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1119, file: !1110, line: 150, baseType: !1131, size: 64, offset: 17536)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1110, line: 45, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1111, file: !1110, line: 121, baseType: !1134, size: 528, offset: 256)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 528, elements: !1135)
!1135 = !{!1136}
!1136 = !DISubrange(count: 66)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1111, file: !1110, line: 126, baseType: !950, size: 16, offset: 784)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1111, file: !1110, line: 127, baseType: !953, size: 32, offset: 800)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1111, file: !1110, line: 128, baseType: !953, size: 32, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1111, file: !1110, line: 128, baseType: !953, size: 32, offset: 864)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1111, file: !1110, line: 129, baseType: !1142, size: 64, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1110, line: 75, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1110, line: 62, size: 1024, elements: !1145)
!1145 = !{!1146, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1168, !1169}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1144, file: !1110, line: 63, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1144, file: !1110, line: 63, baseType: !1147, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1144, file: !1110, line: 64, baseType: !1018, size: 8, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1144, file: !1110, line: 64, baseType: !1018, size: 8, offset: 136)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1144, file: !1110, line: 65, baseType: !950, size: 16, offset: 144)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1144, file: !1110, line: 66, baseType: !1068, size: 512, offset: 160)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1144, file: !1110, line: 67, baseType: !953, size: 32, offset: 672)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !1110, line: 69, baseType: !1155, size: 256, offset: 704)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1110, line: 60, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1110, line: 48, size: 256, elements: !1157)
!1157 = !{!1158, !1159, !1166, !1167}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1156, file: !1110, line: 49, baseType: !944, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1156, file: !1110, line: 58, baseType: !1160, size: 128, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1161, line: 71, baseType: !1162)
!1161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1161, line: 69, size: 128, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1162, file: !1161, line: 70, baseType: !944, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1162, file: !1161, line: 70, baseType: !944, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1156, file: !1110, line: 59, baseType: !953, size: 32, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1156, file: !1110, line: 59, baseType: !953, size: 32, offset: 224)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1144, file: !1110, line: 70, baseType: !953, size: 32, offset: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1144, file: !1110, line: 74, baseType: !953, size: 32, offset: 992)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1106, file: !933, line: 66, baseType: !1171, size: 64, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1033, line: 58, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1106, file: !933, line: 68, baseType: !1017, size: 8192, offset: 1024)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1106, file: !933, line: 70, baseType: !953, size: 32, offset: 9216)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1106, file: !933, line: 71, baseType: !953, size: 32, offset: 9248)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1106, file: !933, line: 72, baseType: !1177, size: 64, offset: 9280)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 64, elements: !962)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1106, file: !933, line: 74, baseType: !961, size: 32, offset: 9344)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1106, file: !933, line: 74, baseType: !961, size: 32, offset: 9376)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1106, file: !933, line: 76, baseType: !1181, size: 64, offset: 9408)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1183, line: 41, flags: DIFlagFwdDecl)
!1183 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1106, file: !933, line: 77, baseType: !1185, size: 64, offset: 9472)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !933, line: 77, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1106, file: !933, line: 78, baseType: !1097, size: 64, offset: 9536)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1106, file: !933, line: 80, baseType: !1189, size: 2624, offset: 9600)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !912, line: 340, size: 2624, elements: !1190)
!1190 = !{!1191, !1219, !1237, !1238, !1239, !1256, !1273, !1274, !1380, !1381, !1382, !1383, !1392}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1189, file: !912, line: 341, baseType: !1192, size: 576)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !912, line: 251, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !912, line: 207, size: 576, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1193, file: !912, line: 208, baseType: !953, size: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1193, file: !912, line: 211, baseType: !950, size: 16, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1193, file: !912, line: 212, baseType: !950, size: 16, offset: 48)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1193, file: !912, line: 213, baseType: !961, size: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1193, file: !912, line: 214, baseType: !950, size: 16, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1193, file: !912, line: 215, baseType: !950, size: 16, offset: 112)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1193, file: !912, line: 216, baseType: !950, size: 16, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1193, file: !912, line: 217, baseType: !950, size: 16, offset: 144)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1193, file: !912, line: 218, baseType: !950, size: 16, offset: 160)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1193, file: !912, line: 219, baseType: !950, size: 16, offset: 176)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1193, file: !912, line: 220, baseType: !961, size: 32, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1193, file: !912, line: 222, baseType: !950, size: 16, offset: 224)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1193, file: !912, line: 225, baseType: !950, size: 16, offset: 240)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1193, file: !912, line: 228, baseType: !953, size: 32, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1193, file: !912, line: 229, baseType: !953, size: 32, offset: 288)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1193, file: !912, line: 233, baseType: !953, size: 32, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1193, file: !912, line: 236, baseType: !950, size: 16, offset: 352)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1193, file: !912, line: 236, baseType: !950, size: 16, offset: 368)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1193, file: !912, line: 241, baseType: !961, size: 32, offset: 384)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1193, file: !912, line: 244, baseType: !953, size: 32, offset: 416)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1193, file: !912, line: 244, baseType: !953, size: 32, offset: 448)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1193, file: !912, line: 245, baseType: !961, size: 32, offset: 480)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1193, file: !912, line: 248, baseType: !961, size: 32, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1193, file: !912, line: 250, baseType: !953, size: 32, offset: 544)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1189, file: !912, line: 342, baseType: !1220, size: 448, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !912, line: 79, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !912, line: 61, size: 448, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1221, file: !912, line: 62, baseType: !944, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1221, file: !912, line: 64, baseType: !950, size: 16, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1221, file: !912, line: 65, baseType: !950, size: 16, offset: 80)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1221, file: !912, line: 67, baseType: !961, size: 32, offset: 96)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1221, file: !912, line: 68, baseType: !961, size: 32, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1221, file: !912, line: 69, baseType: !961, size: 32, offset: 160)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1221, file: !912, line: 70, baseType: !950, size: 16, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1221, file: !912, line: 71, baseType: !950, size: 16, offset: 208)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1221, file: !912, line: 72, baseType: !960, size: 64, offset: 224)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1221, file: !912, line: 75, baseType: !961, size: 32, offset: 288)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1221, file: !912, line: 75, baseType: !961, size: 32, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1221, file: !912, line: 75, baseType: !961, size: 32, offset: 352)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1221, file: !912, line: 78, baseType: !961, size: 32, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1221, file: !912, line: 78, baseType: !961, size: 32, offset: 416)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1189, file: !912, line: 343, baseType: !1160, size: 128, offset: 1024)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1189, file: !912, line: 344, baseType: !1160, size: 128, offset: 1152)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1189, file: !912, line: 345, baseType: !1240, size: 192, offset: 1280)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !912, line: 278, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !912, line: 270, size: 192, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1241, file: !912, line: 271, baseType: !953, size: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1241, file: !912, line: 273, baseType: !961, size: 32, offset: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1241, file: !912, line: 275, baseType: !953, size: 32, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1241, file: !912, line: 276, baseType: !953, size: 32, offset: 96)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1241, file: !912, line: 277, baseType: !1248, size: 64, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !912, line: 55, size: 576, elements: !1250)
!1250 = !{!1251, !1252, !1253}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1249, file: !912, line: 56, baseType: !953, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1249, file: !912, line: 57, baseType: !961, size: 32, offset: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1249, file: !912, line: 58, baseType: !1254, size: 512, offset: 64)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 512, elements: !1255)
!1255 = !{!967, !967}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1189, file: !912, line: 346, baseType: !1257, size: 384, offset: 1472)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !912, line: 268, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !912, line: 253, size: 384, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264, !1267, !1268, !1269, !1270, !1271, !1272}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1258, file: !912, line: 254, baseType: !953, size: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1258, file: !912, line: 255, baseType: !953, size: 32, offset: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1258, file: !912, line: 255, baseType: !953, size: 32, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1258, file: !912, line: 258, baseType: !961, size: 32, offset: 96)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1258, file: !912, line: 259, baseType: !1265, size: 64, offset: 128)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !912, line: 164, baseType: !1063)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1258, file: !912, line: 261, baseType: !961, size: 32, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1258, file: !912, line: 261, baseType: !961, size: 32, offset: 224)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1258, file: !912, line: 261, baseType: !961, size: 32, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1258, file: !912, line: 263, baseType: !953, size: 32, offset: 288)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1258, file: !912, line: 266, baseType: !953, size: 32, offset: 320)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1258, file: !912, line: 267, baseType: !961, size: 32, offset: 352)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1189, file: !912, line: 347, baseType: !1265, size: 64, offset: 1856)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1189, file: !912, line: 348, baseType: !1275, size: 64, offset: 1920)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !912, line: 205, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !912, line: 186, size: 1024, elements: !1278)
!1278 = !{!1279, !1281, !1282, !1283, !1285, !1286, !1287, !1295, !1296, !1297, !1378, !1379}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1277, file: !912, line: 187, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1277, file: !912, line: 187, baseType: !1280, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1277, file: !912, line: 189, baseType: !1068, size: 512, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1277, file: !912, line: 191, baseType: !1284, size: 64, offset: 640)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1277, file: !912, line: 193, baseType: !953, size: 32, offset: 704)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1277, file: !912, line: 193, baseType: !953, size: 32, offset: 736)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1277, file: !912, line: 195, baseType: !1288, size: 64, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !912, line: 184, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !912, line: 166, size: 320, elements: !1291)
!1291 = !{!1292, !1293, !1294}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1290, file: !912, line: 180, baseType: !965, size: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1290, file: !912, line: 182, baseType: !953, size: 32, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1290, file: !912, line: 183, baseType: !953, size: 32, offset: 288)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1277, file: !912, line: 196, baseType: !953, size: 32, offset: 832)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1277, file: !912, line: 198, baseType: !953, size: 32, offset: 864)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1277, file: !912, line: 200, baseType: !1298, size: 64, offset: 896)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1183, line: 77, size: 15424, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1306, !1309, !1310, !1313, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1359, !1360, !1361, !1367, !1368, !1372}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1299, file: !1183, line: 78, baseType: !1109, size: 960)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1299, file: !1183, line: 80, baseType: !1017, size: 8192, offset: 960)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1299, file: !1183, line: 82, baseType: !1304, size: 64, offset: 9152)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1183, line: 43, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1299, file: !1183, line: 83, baseType: !1307, size: 64, offset: 9216)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1110, line: 46, flags: DIFlagFwdDecl)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1299, file: !1183, line: 86, baseType: !1181, size: 64, offset: 9280)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1299, file: !1183, line: 87, baseType: !1311, size: 64, offset: 9344)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1183, line: 44, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1299, file: !1183, line: 89, baseType: !1314, size: 512, offset: 9408)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1311, size: 512, elements: !1315)
!1315 = !{!1316}
!1316 = !DISubrange(count: 8)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1299, file: !1183, line: 90, baseType: !950, size: 16, offset: 9920)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1299, file: !1183, line: 90, baseType: !950, size: 16, offset: 9936)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1299, file: !1183, line: 92, baseType: !950, size: 16, offset: 9952)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1299, file: !1183, line: 92, baseType: !950, size: 16, offset: 9968)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1299, file: !1183, line: 93, baseType: !950, size: 16, offset: 9984)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1299, file: !1183, line: 93, baseType: !950, size: 16, offset: 10000)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1299, file: !1183, line: 94, baseType: !953, size: 32, offset: 10016)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1299, file: !1183, line: 97, baseType: !950, size: 16, offset: 10048)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1299, file: !1183, line: 97, baseType: !950, size: 16, offset: 10064)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1299, file: !1183, line: 98, baseType: !950, size: 16, offset: 10080)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1299, file: !1183, line: 98, baseType: !950, size: 16, offset: 10096)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1299, file: !1183, line: 99, baseType: !950, size: 16, offset: 10112)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1299, file: !1183, line: 99, baseType: !950, size: 16, offset: 10128)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1299, file: !1183, line: 100, baseType: !5, size: 32, offset: 10144)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1299, file: !1183, line: 101, baseType: !987, size: 64, offset: 10176)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1299, file: !1183, line: 103, baseType: !1131, size: 64, offset: 10240)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1299, file: !1183, line: 104, baseType: !1334, size: 64, offset: 10304)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1110, line: 159, size: 448, elements: !1336)
!1336 = !{!1337, !1339, !1340, !1342, !1343, !1345}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1335, file: !1110, line: 161, baseType: !1338, size: 64)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !962)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1335, file: !1110, line: 162, baseType: !1338, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1335, file: !1110, line: 163, baseType: !1341, size: 32, offset: 128)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 32, elements: !962)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1335, file: !1110, line: 164, baseType: !1341, size: 32, offset: 160)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1335, file: !1110, line: 165, baseType: !1344, size: 128, offset: 192)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 128, elements: !962)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1335, file: !1110, line: 166, baseType: !1346, size: 128, offset: 320)
!1346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1307, size: 128, elements: !962)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1299, file: !1183, line: 107, baseType: !961, size: 32, offset: 10368)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1299, file: !1183, line: 108, baseType: !953, size: 32, offset: 10400)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1299, file: !1183, line: 109, baseType: !950, size: 16, offset: 10432)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1299, file: !1183, line: 110, baseType: !950, size: 16, offset: 10448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1299, file: !1183, line: 113, baseType: !953, size: 32, offset: 10464)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1299, file: !1183, line: 113, baseType: !953, size: 32, offset: 10496)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1299, file: !1183, line: 114, baseType: !1018, size: 8, offset: 10528)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1299, file: !1183, line: 114, baseType: !1018, size: 8, offset: 10536)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1299, file: !1183, line: 115, baseType: !950, size: 16, offset: 10544)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1299, file: !1183, line: 116, baseType: !1357, size: 128, offset: 10560)
!1357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 128, elements: !1358)
!1358 = !{!967}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1299, file: !1183, line: 119, baseType: !961, size: 32, offset: 10688)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1299, file: !1183, line: 119, baseType: !961, size: 32, offset: 10720)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1299, file: !1183, line: 122, baseType: !1362, size: 512, offset: 10752)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1363, line: 182, baseType: !1364)
!1363 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1363, line: 180, size: 512, elements: !1365)
!1365 = !{!1366}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1364, file: !1363, line: 181, baseType: !1068, size: 512)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1299, file: !1183, line: 123, baseType: !1018, size: 8, offset: 11264)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1299, file: !1183, line: 125, baseType: !1369, size: 56, offset: 11272)
!1369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 56, elements: !1370)
!1370 = !{!1371}
!1371 = !DISubrange(count: 7)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1299, file: !1183, line: 126, baseType: !1373, size: 4096, offset: 11328)
!1373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1374, size: 4096, elements: !1315)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1183, line: 69, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1183, line: 67, size: 512, elements: !1376)
!1376 = !{!1377}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1375, file: !1183, line: 68, baseType: !1068, size: 512)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1277, file: !912, line: 201, baseType: !961, size: 32, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1277, file: !912, line: 204, baseType: !953, size: 32, offset: 992)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1189, file: !912, line: 350, baseType: !1160, size: 128, offset: 1984)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1189, file: !912, line: 351, baseType: !953, size: 32, offset: 2112)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1189, file: !912, line: 351, baseType: !953, size: 32, offset: 2144)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1189, file: !912, line: 353, baseType: !1384, size: 64, offset: 2176)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !912, line: 297, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !912, line: 295, size: 2048, elements: !1387)
!1387 = !{!1388}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1386, file: !912, line: 296, baseType: !1389, size: 2048)
!1389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 2048, elements: !1390)
!1390 = !{!1391}
!1391 = !DISubrange(count: 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1189, file: !912, line: 355, baseType: !1393, size: 384, offset: 2240)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !912, line: 338, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !912, line: 322, size: 384, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399, !1400, !1401, !1402}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1394, file: !912, line: 323, baseType: !953, size: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1394, file: !912, line: 325, baseType: !950, size: 16, offset: 32)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1394, file: !912, line: 326, baseType: !950, size: 16, offset: 48)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1394, file: !912, line: 331, baseType: !1160, size: 128, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1394, file: !912, line: 334, baseType: !1160, size: 128, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1394, file: !912, line: 335, baseType: !953, size: 32, offset: 320)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1394, file: !912, line: 337, baseType: !953, size: 32, offset: 352)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1106, file: !933, line: 81, baseType: !944, size: 64, offset: 12224)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1106, file: !933, line: 85, baseType: !1405, size: 6208, offset: 12288)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !933, line: 55, size: 6208, elements: !1406)
!1406 = !{!1407, !1411, !1412, !1413, !1414}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1405, file: !933, line: 56, baseType: !1408, size: 6144)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 6144, elements: !1409)
!1409 = !{!1410}
!1410 = !DISubrange(count: 768)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1405, file: !933, line: 58, baseType: !950, size: 16, offset: 6144)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1405, file: !933, line: 59, baseType: !950, size: 16, offset: 6160)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1405, file: !933, line: 60, baseType: !950, size: 16, offset: 6176)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1405, file: !933, line: 61, baseType: !950, size: 16, offset: 6192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1106, file: !933, line: 86, baseType: !953, size: 32, offset: 18496)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1106, file: !933, line: 88, baseType: !953, size: 32, offset: 18528)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1106, file: !933, line: 90, baseType: !953, size: 32, offset: 18560)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1106, file: !933, line: 94, baseType: !953, size: 32, offset: 18592)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1106, file: !933, line: 100, baseType: !1362, size: 512, offset: 18624)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "MarkerUpdateCb", file: !1, line: 216, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 202, size: 704, elements: !1423)
!1423 = !{!1424, !1425, !1426, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !1422, file: !1, line: 203, baseType: !953, size: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1422, file: !1, line: 205, baseType: !1104, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !1422, file: !1, line: 206, baseType: !1427, size: 64, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClipUser", file: !933, line: 53, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !933, line: 50, size: 64, elements: !1430)
!1430 = !{!1431, !1432, !1433}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1429, file: !933, line: 51, baseType: !953, size: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !1429, file: !933, line: 52, baseType: !950, size: 16, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !1429, file: !933, line: 52, baseType: !950, size: 16, offset: 48)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1422, file: !1, line: 207, baseType: !1265, size: 64, offset: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !1422, file: !1, line: 208, baseType: !1079, size: 64, offset: 256)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1422, file: !1, line: 210, baseType: !953, size: 32, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "marker_pos", scope: !1422, file: !1, line: 211, baseType: !960, size: 64, offset: 352)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "marker_pat", scope: !1422, file: !1, line: 212, baseType: !960, size: 64, offset: 416)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "track_offset", scope: !1422, file: !1, line: 213, baseType: !960, size: 64, offset: 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "marker_search_pos", scope: !1422, file: !1, line: 214, baseType: !960, size: 64, offset: 544)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "marker_search", scope: !1422, file: !1, line: 214, baseType: !960, size: 64, offset: 608)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "marker_flag", scope: !1422, file: !1, line: 215, baseType: !953, size: 32, offset: 672)
!1443 = !{i32 7, !"Dwarf Version", i32 4}
!1444 = !{i32 2, !"Debug Info Version", i32 3}
!1445 = !{i32 1, !"wchar_size", i32 4}
!1446 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1447 = distinct !DISubprogram(name: "ED_clip_buttons_register", scope: !1, file: !1, line: 79, type: !1448, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2743)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{null, !1450}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegionType", file: !1452, line: 165, baseType: !1453)
!1452 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1452, line: 116, size: 1472, elements: !1454)
!1454 = !{!1455, !1457, !1458, !1459, !2586, !2587, !2594, !2717, !2721, !2725, !2726, !2727, !2731, !2732, !2733, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1453, file: !1452, line: 117, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1453, file: !1452, line: 117, baseType: !1456, size: 64, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !1453, file: !1452, line: 119, baseType: !953, size: 32, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1453, file: !1452, line: 122, baseType: !1460, size: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{null, !1463, !2520}
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !1465, line: 128, size: 2816, elements: !1466)
!1465 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1466 = !{!1467, !1468, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2499, !2500, !2501, !2502, !2503, !2514, !2515, !2516, !2517, !2518, !2519}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1464, file: !1465, line: 129, baseType: !1109, size: 960)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1464, file: !1465, line: 131, baseType: !1469, size: 64, offset: 960)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1465, line: 169, size: 2048, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2458, !2461, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1470, file: !1465, line: 170, baseType: !1469, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1470, file: !1465, line: 170, baseType: !1469, size: 64, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1470, file: !1465, line: 172, baseType: !944, size: 64, offset: 128)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1470, file: !1465, line: 174, baseType: !1476, size: 64, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1478, line: 49, size: 1984, elements: !1479)
!1478 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1479 = !{!1480, !1481, !1482, !1483, !1484, !1485, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2398}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1477, file: !1478, line: 50, baseType: !1109, size: 960)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1477, file: !1478, line: 52, baseType: !1160, size: 128, offset: 960)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1477, file: !1478, line: 53, baseType: !1160, size: 128, offset: 1088)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1477, file: !1478, line: 54, baseType: !1160, size: 128, offset: 1216)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1477, file: !1478, line: 55, baseType: !1160, size: 128, offset: 1344)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1477, file: !1478, line: 57, baseType: !1486, size: 64, offset: 1472)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1033, line: 1216, size: 39680, elements: !1488)
!1488 = !{!1489, !1490, !1491, !1494, !1497, !1498, !1499, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1525, !1598, !1739, !1951, !1954, !2236, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2258, !2259, !2260, !2261, !2262, !2270, !2337, !2344, !2345, !2352, !2353, !2359, !2360, !2361, !2362, !2363}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1487, file: !1033, line: 1217, baseType: !1109, size: 960)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1487, file: !1033, line: 1218, baseType: !1171, size: 64, offset: 960)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1487, file: !1033, line: 1220, baseType: !1492, size: 64, offset: 1024)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1033, line: 50, flags: DIFlagFwdDecl)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1487, file: !1033, line: 1221, baseType: !1495, size: 64, offset: 1088)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64)
!1496 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1033, line: 52, flags: DIFlagFwdDecl)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1487, file: !1033, line: 1223, baseType: !1486, size: 64, offset: 1152)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1487, file: !1033, line: 1225, baseType: !1160, size: 128, offset: 1216)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1487, file: !1033, line: 1226, baseType: !1500, size: 64, offset: 1344)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1033, line: 69, size: 320, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1501, file: !1033, line: 70, baseType: !1500, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1501, file: !1033, line: 70, baseType: !1500, size: 64, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1501, file: !1033, line: 71, baseType: !5, size: 32, offset: 128)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1501, file: !1033, line: 71, baseType: !5, size: 32, offset: 160)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1501, file: !1033, line: 72, baseType: !953, size: 32, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1501, file: !1033, line: 73, baseType: !950, size: 16, offset: 224)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1501, file: !1033, line: 73, baseType: !950, size: 16, offset: 240)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1501, file: !1033, line: 74, baseType: !1492, size: 64, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1487, file: !1033, line: 1227, baseType: !1492, size: 64, offset: 1408)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1487, file: !1033, line: 1229, baseType: !1082, size: 96, offset: 1472)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1487, file: !1033, line: 1230, baseType: !1082, size: 96, offset: 1568)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1487, file: !1033, line: 1231, baseType: !1082, size: 96, offset: 1664)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1487, file: !1033, line: 1231, baseType: !1082, size: 96, offset: 1760)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1487, file: !1033, line: 1233, baseType: !5, size: 32, offset: 1856)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1487, file: !1033, line: 1234, baseType: !953, size: 32, offset: 1888)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1487, file: !1033, line: 1235, baseType: !5, size: 32, offset: 1920)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1487, file: !1033, line: 1237, baseType: !950, size: 16, offset: 1952)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1487, file: !1033, line: 1239, baseType: !1018, size: 8, offset: 1968)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1487, file: !1033, line: 1240, baseType: !1522, size: 8, offset: 1976)
!1522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 8, elements: !1523)
!1523 = !{!1524}
!1524 = !DISubrange(count: 1)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1487, file: !1033, line: 1242, baseType: !1526, size: 64, offset: 1984)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1528, line: 328, size: 3456, elements: !1529)
!1528 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1529 = !{!1530, !1531, !1532, !1535, !1536, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1563, !1564, !1565, !1568, !1573, !1574, !1577, !1581, !1586, !1590, !1594, !1595, !1596, !1597}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1527, file: !1528, line: 329, baseType: !1109, size: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1527, file: !1528, line: 330, baseType: !1171, size: 64, offset: 960)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1527, file: !1528, line: 332, baseType: !1533, size: 64, offset: 1024)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1534 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1528, line: 332, flags: DIFlagFwdDecl)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1527, file: !1528, line: 333, baseType: !1068, size: 512, offset: 1088)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1527, file: !1528, line: 335, baseType: !1537, size: 64, offset: 1600)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64)
!1538 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1528, line: 335, flags: DIFlagFwdDecl)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1527, file: !1528, line: 337, baseType: !1097, size: 64, offset: 1664)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1527, file: !1528, line: 338, baseType: !960, size: 64, offset: 1728)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1527, file: !1528, line: 340, baseType: !1160, size: 128, offset: 1792)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1527, file: !1528, line: 340, baseType: !1160, size: 128, offset: 1920)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1527, file: !1528, line: 342, baseType: !953, size: 32, offset: 2048)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1527, file: !1528, line: 342, baseType: !953, size: 32, offset: 2080)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1527, file: !1528, line: 343, baseType: !953, size: 32, offset: 2112)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1527, file: !1528, line: 345, baseType: !953, size: 32, offset: 2144)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1527, file: !1528, line: 346, baseType: !953, size: 32, offset: 2176)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1527, file: !1528, line: 347, baseType: !950, size: 16, offset: 2208)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1527, file: !1528, line: 348, baseType: !950, size: 16, offset: 2224)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1527, file: !1528, line: 349, baseType: !953, size: 32, offset: 2240)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1527, file: !1528, line: 351, baseType: !953, size: 32, offset: 2272)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1527, file: !1528, line: 353, baseType: !950, size: 16, offset: 2304)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1527, file: !1528, line: 354, baseType: !950, size: 16, offset: 2320)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1527, file: !1528, line: 355, baseType: !953, size: 32, offset: 2336)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1527, file: !1528, line: 357, baseType: !1556, size: 128, offset: 2368)
!1556 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1042, line: 95, baseType: !1557)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1042, line: 92, size: 128, elements: !1558)
!1558 = !{!1559, !1560, !1561, !1562}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1557, file: !1042, line: 93, baseType: !961, size: 32)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1557, file: !1042, line: 93, baseType: !961, size: 32, offset: 32)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1557, file: !1042, line: 94, baseType: !961, size: 32, offset: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1557, file: !1042, line: 94, baseType: !961, size: 32, offset: 96)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1527, file: !1528, line: 363, baseType: !1160, size: 128, offset: 2496)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1527, file: !1528, line: 363, baseType: !1160, size: 128, offset: 2624)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1527, file: !1528, line: 368, baseType: !1566, size: 64, offset: 2752)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1567 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1528, line: 48, flags: DIFlagFwdDecl)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1527, file: !1528, line: 372, baseType: !1569, size: 32, offset: 2816)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1528, line: 274, baseType: !1570)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1528, line: 271, size: 32, elements: !1571)
!1571 = !{!1572}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1570, file: !1528, line: 273, baseType: !5, size: 32)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1527, file: !1528, line: 373, baseType: !953, size: 32, offset: 2848)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1527, file: !1528, line: 382, baseType: !1575, size: 64, offset: 2880)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64)
!1576 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1528, line: 46, flags: DIFlagFwdDecl)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1527, file: !1528, line: 385, baseType: !1578, size: 64, offset: 2944)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{null, !944, !961}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1527, file: !1528, line: 386, baseType: !1582, size: 64, offset: 3008)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{null, !944, !1585}
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1527, file: !1528, line: 387, baseType: !1587, size: 64, offset: 3072)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{!953, !944}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1527, file: !1528, line: 388, baseType: !1591, size: 64, offset: 3136)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{null, !944}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1527, file: !1528, line: 389, baseType: !944, size: 64, offset: 3200)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1527, file: !1528, line: 389, baseType: !944, size: 64, offset: 3264)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1527, file: !1528, line: 389, baseType: !944, size: 64, offset: 3328)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1527, file: !1528, line: 389, baseType: !944, size: 64, offset: 3392)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1487, file: !1033, line: 1244, baseType: !1599, size: 64, offset: 2048)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1601, line: 200, size: 17024, elements: !1602)
!1601 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1602 = !{!1603, !1605, !1606, !1607, !1732, !1733, !1734, !1735, !1736, !1737, !1738}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1600, file: !1601, line: 201, baseType: !1604, size: 64)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1600, file: !1601, line: 202, baseType: !1160, size: 128, offset: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1600, file: !1601, line: 203, baseType: !1160, size: 128, offset: 192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1600, file: !1601, line: 206, baseType: !1608, size: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1601, line: 190, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1601, line: 126, size: 2816, elements: !1611)
!1611 = !{!1612, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1697, !1700, !1701, !1702, !1704, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1731}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1610, file: !1601, line: 127, baseType: !1613, size: 64)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1610, file: !1601, line: 127, baseType: !1613, size: 64, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1610, file: !1601, line: 128, baseType: !944, size: 64, offset: 128)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1610, file: !1601, line: 129, baseType: !944, size: 64, offset: 192)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1610, file: !1601, line: 130, baseType: !1068, size: 512, offset: 256)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1610, file: !1601, line: 132, baseType: !953, size: 32, offset: 768)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1610, file: !1601, line: 132, baseType: !953, size: 32, offset: 800)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1610, file: !1601, line: 133, baseType: !953, size: 32, offset: 832)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1610, file: !1601, line: 134, baseType: !953, size: 32, offset: 864)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1610, file: !1601, line: 134, baseType: !953, size: 32, offset: 896)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1610, file: !1601, line: 134, baseType: !953, size: 32, offset: 928)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1610, file: !1601, line: 135, baseType: !953, size: 32, offset: 960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1610, file: !1601, line: 135, baseType: !953, size: 32, offset: 992)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1610, file: !1601, line: 136, baseType: !953, size: 32, offset: 1024)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1610, file: !1601, line: 136, baseType: !953, size: 32, offset: 1056)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1610, file: !1601, line: 137, baseType: !953, size: 32, offset: 1088)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1610, file: !1601, line: 137, baseType: !953, size: 32, offset: 1120)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1610, file: !1601, line: 138, baseType: !961, size: 32, offset: 1152)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1610, file: !1601, line: 139, baseType: !961, size: 32, offset: 1184)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1610, file: !1601, line: 139, baseType: !961, size: 32, offset: 1216)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1610, file: !1601, line: 141, baseType: !950, size: 16, offset: 1248)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1610, file: !1601, line: 142, baseType: !950, size: 16, offset: 1264)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1610, file: !1601, line: 143, baseType: !953, size: 32, offset: 1280)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1610, file: !1601, line: 144, baseType: !953, size: 32, offset: 1312)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1610, file: !1601, line: 146, baseType: !1638, size: 64, offset: 1344)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64)
!1639 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1601, line: 114, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1601, line: 99, size: 7232, elements: !1641)
!1641 = !{!1642, !1644, !1645, !1646, !1647, !1648, !1649, !1657, !1658, !1670, !1679, !1686, !1696}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1640, file: !1601, line: 100, baseType: !1643, size: 64)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1640, file: !1601, line: 100, baseType: !1643, size: 64, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1640, file: !1601, line: 101, baseType: !953, size: 32, offset: 128)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1640, file: !1601, line: 101, baseType: !953, size: 32, offset: 160)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1640, file: !1601, line: 102, baseType: !953, size: 32, offset: 192)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1640, file: !1601, line: 102, baseType: !953, size: 32, offset: 224)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1640, file: !1601, line: 103, baseType: !1650, size: 64, offset: 256)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1601, line: 59, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1601, line: 56, size: 2112, elements: !1653)
!1653 = !{!1654, !1655, !1656}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1652, file: !1601, line: 57, baseType: !1389, size: 2048)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1652, file: !1601, line: 58, baseType: !953, size: 32, offset: 2048)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1652, file: !1601, line: 58, baseType: !953, size: 32, offset: 2080)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1640, file: !1601, line: 106, baseType: !1408, size: 6144, offset: 320)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1640, file: !1601, line: 107, baseType: !1659, size: 64, offset: 6464)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64)
!1660 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1601, line: 97, baseType: !1661)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1601, line: 83, size: 8320, elements: !1662)
!1662 = !{!1663, !1664, !1665, !1666, !1667, !1668, !1669}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1661, file: !1601, line: 84, baseType: !1408, size: 6144)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1661, file: !1601, line: 87, baseType: !1389, size: 2048, offset: 6144)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1661, file: !1601, line: 88, baseType: !1181, size: 64, offset: 8192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1661, file: !1601, line: 90, baseType: !950, size: 16, offset: 8256)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1661, file: !1601, line: 92, baseType: !950, size: 16, offset: 8272)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1661, file: !1601, line: 93, baseType: !950, size: 16, offset: 8288)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1661, file: !1601, line: 95, baseType: !950, size: 16, offset: 8304)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1640, file: !1601, line: 108, baseType: !1671, size: 64, offset: 6528)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1601, line: 66, baseType: !1673)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1601, line: 61, size: 128, elements: !1674)
!1674 = !{!1675, !1676, !1677, !1678}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1673, file: !1601, line: 62, baseType: !953, size: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1673, file: !1601, line: 63, baseType: !953, size: 32, offset: 32)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1673, file: !1601, line: 64, baseType: !953, size: 32, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1673, file: !1601, line: 65, baseType: !953, size: 32, offset: 96)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1640, file: !1601, line: 109, baseType: !1680, size: 64, offset: 6592)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1601, line: 71, baseType: !1682)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1601, line: 68, size: 64, elements: !1683)
!1683 = !{!1684, !1685}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1682, file: !1601, line: 69, baseType: !953, size: 32)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1682, file: !1601, line: 70, baseType: !953, size: 32, offset: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1640, file: !1601, line: 110, baseType: !1687, size: 64, offset: 6656)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1601, line: 81, baseType: !1689)
!1689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1601, line: 73, size: 352, elements: !1690)
!1690 = !{!1691, !1692, !1693, !1694, !1695}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1689, file: !1601, line: 74, baseType: !1082, size: 96)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1689, file: !1601, line: 75, baseType: !1082, size: 96, offset: 96)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1689, file: !1601, line: 76, baseType: !1082, size: 96, offset: 192)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1689, file: !1601, line: 77, baseType: !953, size: 32, offset: 288)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1689, file: !1601, line: 78, baseType: !953, size: 32, offset: 320)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1640, file: !1601, line: 113, baseType: !1362, size: 512, offset: 6720)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1610, file: !1601, line: 148, baseType: !1698, size: 64, offset: 1408)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64)
!1699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1601, line: 49, flags: DIFlagFwdDecl)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1610, file: !1601, line: 151, baseType: !1486, size: 64, offset: 1472)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1610, file: !1601, line: 152, baseType: !1492, size: 64, offset: 1536)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1610, file: !1601, line: 153, baseType: !1703, size: 64, offset: 1600)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1610, file: !1601, line: 154, baseType: !1705, size: 64, offset: 1664)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1601, line: 154, flags: DIFlagFwdDecl)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1610, file: !1601, line: 156, baseType: !1181, size: 64, offset: 1728)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1610, file: !1601, line: 158, baseType: !961, size: 32, offset: 1792)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1610, file: !1601, line: 159, baseType: !961, size: 32, offset: 1824)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1610, file: !1601, line: 162, baseType: !1613, size: 64, offset: 1856)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1610, file: !1601, line: 162, baseType: !1613, size: 64, offset: 1920)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1610, file: !1601, line: 162, baseType: !1613, size: 64, offset: 1984)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1610, file: !1601, line: 164, baseType: !1160, size: 128, offset: 2048)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1610, file: !1601, line: 166, baseType: !1715, size: 64, offset: 2176)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1601, line: 51, flags: DIFlagFwdDecl)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1610, file: !1601, line: 167, baseType: !944, size: 64, offset: 2240)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1610, file: !1601, line: 168, baseType: !961, size: 32, offset: 2304)
