; ModuleID = 'blender/source/blender/editors/space_logic/logic_ops.c'
source_filename = "blender/source/blender/editors/space_logic/logic_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !62, globals: !134, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/editors/space_logic/logic_ops.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !15, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 351, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyFlag", file: !16, line: 151, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!18 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!47 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!48 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 605, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!52 = !DIEnumerator(name: "OB_SHOWSENS", value: 64, isUnsigned: true)
!53 = !DIEnumerator(name: "OB_SHOWACT", value: 128, isUnsigned: true)
!54 = !DIEnumerator(name: "OB_ADDSENS", value: 256, isUnsigned: true)
!55 = !DIEnumerator(name: "OB_ADDCONT", value: 512, isUnsigned: true)
!56 = !DIEnumerator(name: "OB_ADDACT", value: 1024, isUnsigned: true)
!57 = !DIEnumerator(name: "OB_SHOWCONT", value: 2048, isUnsigned: true)
!58 = !DIEnumerator(name: "OB_ALLSTATE", value: 4096, isUnsigned: true)
!59 = !DIEnumerator(name: "OB_INITSTBIT", value: 8192, isUnsigned: true)
!60 = !DIEnumerator(name: "OB_DEBUGSTATE", value: 16384, isUnsigned: true)
!61 = !DIEnumerator(name: "OB_SHOWSTATE", value: 32768, isUnsigned: true)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !66, line: 130, baseType: !67)
!66 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !66, line: 117, size: 960, elements: !68)
!68 = !{!69, !70, !71, !73, !92, !96, !98, !100, !101, !102}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !66, line: 118, baseType: !63, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !67, file: !66, line: 118, baseType: !63, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !67, file: !66, line: 119, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !67, file: !66, line: 120, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !66, line: 136, size: 17600, elements: !76)
!76 = !{!77, !78, !79, !82, !87, !88, !89}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !75, file: !66, line: 137, baseType: !65, size: 960)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !75, file: !66, line: 138, baseType: !64, size: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !75, file: !66, line: 139, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !66, line: 43, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !66, line: 140, baseType: !83, size: 8192, offset: 1088)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !75, file: !66, line: 141, baseType: !83, size: 8192, offset: 9280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !75, file: !66, line: 148, baseType: !74, size: 64, offset: 17472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !75, file: !66, line: 150, baseType: !90, size: 64, offset: 17536)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !66, line: 45, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !66, line: 121, baseType: !93, size: 528, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 66)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !67, file: !66, line: 126, baseType: !97, size: 16, offset: 784)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !67, file: !66, line: 127, baseType: !99, size: 32, offset: 800)
!99 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !67, file: !66, line: 128, baseType: !99, size: 32, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !67, file: !66, line: 128, baseType: !99, size: 32, offset: 864)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !67, file: !66, line: 129, baseType: !103, size: 64, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !66, line: 75, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !66, line: 62, size: 1024, elements: !106)
!106 = !{!107, !109, !110, !111, !112, !113, !117, !118, !132, !133}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !66, line: 63, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !105, file: !66, line: 63, baseType: !108, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !66, line: 64, baseType: !84, size: 8, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !105, file: !66, line: 64, baseType: !84, size: 8, offset: 136)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !66, line: 65, baseType: !97, size: 16, offset: 144)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !66, line: 66, baseType: !114, size: 512, offset: 160)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !105, file: !66, line: 67, baseType: !99, size: 32, offset: 672)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !66, line: 69, baseType: !119, size: 256, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !66, line: 60, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !66, line: 48, size: 256, elements: !121)
!121 = !{!122, !123, !130, !131}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !120, file: !66, line: 49, baseType: !63, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !120, file: !66, line: 58, baseType: !124, size: 128, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !125, line: 71, baseType: !126)
!125 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !125, line: 69, size: 128, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !126, file: !125, line: 70, baseType: !63, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !126, file: !125, line: 70, baseType: !63, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !120, file: !66, line: 59, baseType: !99, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !120, file: !66, line: 59, baseType: !99, size: 32, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !105, file: !66, line: 70, baseType: !99, size: 32, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !105, file: !66, line: 74, baseType: !99, size: 32, offset: 992)
!134 = !{!0}
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 960, elements: !146)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !16, line: 308, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !16, line: 302, size: 320, elements: !138)
!138 = !{!139, !140, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !137, file: !16, line: 303, baseType: !99, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !137, file: !16, line: 304, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !137, file: !16, line: 305, baseType: !99, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !16, line: 306, baseType: !141, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !137, file: !16, line: 307, baseType: !141, size: 64, offset: 256)
!146 = !{!147}
!147 = !DISubrange(count: 3)
!148 = !{i32 7, !"Dwarf Version", i32 4}
!149 = !{i32 2, !"Debug Info Version", i32 3}
!150 = !{i32 1, !"wchar_size", i32 4}
!151 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!152 = distinct !DISubprogram(name: "ED_operatortypes_logic", scope: !3, file: !3, line: 737, type: !153, scopeLine: 738, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !155)
!153 = !DISubroutineType(types: !154)
!154 = !{null}
!155 = !{}
!156 = !DILocation(line: 739, column: 2, scope: !152)
!157 = !DILocation(line: 740, column: 2, scope: !152)
!158 = !DILocation(line: 741, column: 2, scope: !152)
!159 = !DILocation(line: 742, column: 2, scope: !152)
!160 = !DILocation(line: 743, column: 2, scope: !152)
!161 = !DILocation(line: 744, column: 2, scope: !152)
!162 = !DILocation(line: 745, column: 2, scope: !152)
!163 = !DILocation(line: 746, column: 2, scope: !152)
!164 = !DILocation(line: 747, column: 2, scope: !152)
!165 = !DILocation(line: 748, column: 2, scope: !152)
!166 = !DILocation(line: 749, column: 1, scope: !152)
!167 = distinct !DISubprogram(name: "LOGIC_OT_sensor_remove", scope: !3, file: !3, line: 256, type: !168, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !155)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !172, line: 568, baseType: !173)
!172 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !172, line: 508, size: 1536, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !1818, !1822, !1828, !1832, !1833, !1837, !1838, !1839, !1840, !1844, !1845, !1860, !1861, !1865, !1891}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !172, line: 509, baseType: !141, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !173, file: !172, line: 510, baseType: !141, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !173, file: !172, line: 511, baseType: !141, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !173, file: !172, line: 512, baseType: !141, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !173, file: !172, line: 518, baseType: !180, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!99, !183, !185}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !16, line: 44, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !6, line: 328, size: 1344, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !194, !195, !196, !208, !1811, !1812, !1813, !1816, !1817}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !6, line: 329, baseType: !185, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !6, line: 329, baseType: !185, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !186, file: !6, line: 332, baseType: !114, size: 512, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !186, file: !6, line: 333, baseType: !103, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !6, line: 336, baseType: !193, size: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !186, file: !6, line: 337, baseType: !63, size: 64, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !186, file: !6, line: 338, baseType: !63, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !186, file: !6, line: 340, baseType: !197, size: 64, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !16, line: 55, size: 192, elements: !199)
!199 = !{!200, !204, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !16, line: 58, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !16, line: 56, size: 64, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !16, line: 57, baseType: !63, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !16, line: 60, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !16, line: 41, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !16, line: 61, baseType: !63, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !186, file: !6, line: 341, baseType: !209, size: 64, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !6, line: 106, size: 320, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !210, file: !6, line: 107, baseType: !124, size: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !210, file: !6, line: 108, baseType: !99, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !210, file: !6, line: 109, baseType: !99, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !6, line: 110, baseType: !99, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !210, file: !6, line: 110, baseType: !99, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !210, file: !6, line: 111, baseType: !218, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !172, line: 490, size: 768, elements: !220)
!220 = !{!221, !222, !223, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !172, line: 491, baseType: !218, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !219, file: !172, line: 491, baseType: !218, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !219, file: !172, line: 493, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !6, line: 169, size: 2048, elements: !226)
!226 = !{!227, !228, !229, !230, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1777, !1780, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !6, line: 170, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !6, line: 170, baseType: !224, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !225, file: !6, line: 172, baseType: !63, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !225, file: !6, line: 174, baseType: !231, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !233, line: 49, size: 1984, elements: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !{!235, !236, !237, !238, !239, !240, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !232, file: !233, line: 50, baseType: !65, size: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !232, file: !233, line: 52, baseType: !124, size: 128, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !232, file: !233, line: 53, baseType: !124, size: 128, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !232, file: !233, line: 54, baseType: !124, size: 128, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !232, file: !233, line: 55, baseType: !124, size: 128, offset: 1344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !232, file: !233, line: 57, baseType: !241, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !243, line: 1216, size: 39680, elements: !244)
!243 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!244 = !{!245, !246, !250, !539, !542, !543, !544, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !570, !641, !1070, !1285, !1288, !1577, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1599, !1600, !1601, !1602, !1603, !1611, !1678, !1685, !1686, !1693, !1694, !1695, !1696, !1697, !1698, !1699}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !242, file: !243, line: 1217, baseType: !65, size: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !242, file: !243, line: 1218, baseType: !247, size: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !249, line: 45, flags: DIFlagFwdDecl)
!249 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!250 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !242, file: !243, line: 1220, baseType: !251, size: 64, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !50, line: 115, size: 11392, elements: !253)
!253 = !{!254, !255, !256, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !273, !284, !298, !299, !341, !342, !345, !346, !362, !363, !364, !365, !366, !367, !368, !372, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !388, !389, !390, !391, !392, !393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !453, !454, !455, !456, !457, !458, !459, !460, !461, !464, !467, !470, !471, !472, !473, !474, !477, !480, !483, !484, !490, !491, !492, !493, !494, !495, !497, !500, !503, !507, !527, !528}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !252, file: !50, line: 116, baseType: !65, size: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !252, file: !50, line: 117, baseType: !247, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !252, file: !50, line: 119, baseType: !257, size: 64, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !50, line: 57, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !252, file: !50, line: 121, baseType: !97, size: 16, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !252, file: !50, line: 121, baseType: !97, size: 16, offset: 1104)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !252, file: !50, line: 122, baseType: !99, size: 32, offset: 1120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !252, file: !50, line: 122, baseType: !99, size: 32, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !252, file: !50, line: 122, baseType: !99, size: 32, offset: 1184)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !252, file: !50, line: 123, baseType: !114, size: 512, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !252, file: !50, line: 124, baseType: !251, size: 64, offset: 1728)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !252, file: !50, line: 124, baseType: !251, size: 64, offset: 1792)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !252, file: !50, line: 127, baseType: !251, size: 64, offset: 1856)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !252, file: !50, line: 127, baseType: !251, size: 64, offset: 1920)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !252, file: !50, line: 127, baseType: !251, size: 64, offset: 1984)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !252, file: !50, line: 128, baseType: !271, size: 64, offset: 2048)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !249, line: 46, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !252, file: !50, line: 130, baseType: !274, size: 64, offset: 2112)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !50, line: 97, size: 832, elements: !276)
!276 = !{!277, !282, !283}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !275, file: !50, line: 98, baseType: !278, size: 768)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 768, elements: !280)
!279 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!280 = !{!281, !147}
!281 = !DISubrange(count: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !50, line: 99, baseType: !99, size: 32, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !275, file: !50, line: 99, baseType: !99, size: 32, offset: 800)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !252, file: !50, line: 131, baseType: !285, size: 64, offset: 2176)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !287, line: 486, size: 1600, elements: !288)
!287 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !286, file: !287, line: 487, baseType: !65, size: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !286, file: !287, line: 489, baseType: !124, size: 128, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !286, file: !287, line: 490, baseType: !124, size: 128, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !286, file: !287, line: 491, baseType: !124, size: 128, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !286, file: !287, line: 492, baseType: !124, size: 128, offset: 1344)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !287, line: 494, baseType: !99, size: 32, offset: 1472)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !286, file: !287, line: 495, baseType: !99, size: 32, offset: 1504)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !286, file: !287, line: 497, baseType: !99, size: 32, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !286, file: !287, line: 498, baseType: !99, size: 32, offset: 1568)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !252, file: !50, line: 132, baseType: !285, size: 64, offset: 2240)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !252, file: !50, line: 133, baseType: !300, size: 64, offset: 2304)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !287, line: 334, size: 1728, elements: !302)
!302 = !{!303, !304, !307, !308, !309, !310, !311, !312, !314, !315, !316, !317, !318, !319, !320, !340}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !301, file: !287, line: 335, baseType: !124, size: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !301, file: !287, line: 336, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !287, line: 47, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !301, file: !287, line: 338, baseType: !97, size: 16, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !301, file: !287, line: 338, baseType: !97, size: 16, offset: 208)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !301, file: !287, line: 339, baseType: !7, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !301, file: !287, line: 340, baseType: !99, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !301, file: !287, line: 342, baseType: !279, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !301, file: !287, line: 343, baseType: !313, size: 96, offset: 320)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 96, elements: !146)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !301, file: !287, line: 344, baseType: !313, size: 96, offset: 416)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !301, file: !287, line: 347, baseType: !124, size: 128, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !301, file: !287, line: 349, baseType: !99, size: 32, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !301, file: !287, line: 350, baseType: !99, size: 32, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !301, file: !287, line: 351, baseType: !63, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !301, file: !287, line: 352, baseType: !63, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !301, file: !287, line: 354, baseType: !321, size: 384, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !287, line: 116, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !287, line: 94, size: 384, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !322, file: !287, line: 96, baseType: !99, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !322, file: !287, line: 96, baseType: !99, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !322, file: !287, line: 97, baseType: !99, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !322, file: !287, line: 97, baseType: !99, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !322, file: !287, line: 99, baseType: !97, size: 16, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !322, file: !287, line: 100, baseType: !97, size: 16, offset: 144)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !322, file: !287, line: 102, baseType: !97, size: 16, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !322, file: !287, line: 105, baseType: !97, size: 16, offset: 176)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !322, file: !287, line: 108, baseType: !97, size: 16, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !322, file: !287, line: 109, baseType: !97, size: 16, offset: 208)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !322, file: !287, line: 111, baseType: !97, size: 16, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !322, file: !287, line: 112, baseType: !97, size: 16, offset: 240)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !322, file: !287, line: 114, baseType: !99, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !322, file: !287, line: 114, baseType: !99, size: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !322, file: !287, line: 115, baseType: !99, size: 32, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !322, file: !287, line: 115, baseType: !99, size: 32, offset: 352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !301, file: !287, line: 355, baseType: !114, size: 512, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !252, file: !50, line: 134, baseType: !63, size: 64, offset: 2368)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !252, file: !50, line: 136, baseType: !343, size: 64, offset: 2432)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !50, line: 58, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !252, file: !50, line: 138, baseType: !321, size: 384, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !252, file: !50, line: 139, baseType: !347, size: 64, offset: 2880)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !287, line: 80, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !287, line: 72, size: 192, elements: !350)
!350 = !{!351, !358, !359, !360, !361}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !349, file: !287, line: 73, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !287, line: 59, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !287, line: 56, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !354, file: !287, line: 57, baseType: !313, size: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !287, line: 58, baseType: !99, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !349, file: !287, line: 74, baseType: !99, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !349, file: !287, line: 76, baseType: !99, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !349, file: !287, line: 77, baseType: !99, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !287, line: 79, baseType: !99, size: 32, offset: 160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !252, file: !50, line: 141, baseType: !124, size: 128, offset: 2944)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !252, file: !50, line: 142, baseType: !124, size: 128, offset: 3072)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !252, file: !50, line: 143, baseType: !124, size: 128, offset: 3200)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !252, file: !50, line: 144, baseType: !124, size: 128, offset: 3328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !252, file: !50, line: 146, baseType: !99, size: 32, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !252, file: !50, line: 147, baseType: !99, size: 32, offset: 3488)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !252, file: !50, line: 150, baseType: !369, size: 64, offset: 3520)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !50, line: 50, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !252, file: !50, line: 151, baseType: !373, size: 64, offset: 3584)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !252, file: !50, line: 152, baseType: !99, size: 32, offset: 3648)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !252, file: !50, line: 153, baseType: !99, size: 32, offset: 3680)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !252, file: !50, line: 156, baseType: !313, size: 96, offset: 3712)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !252, file: !50, line: 156, baseType: !313, size: 96, offset: 3808)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !252, file: !50, line: 156, baseType: !313, size: 96, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !252, file: !50, line: 157, baseType: !313, size: 96, offset: 4000)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !252, file: !50, line: 158, baseType: !313, size: 96, offset: 4096)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !252, file: !50, line: 159, baseType: !313, size: 96, offset: 4192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !252, file: !50, line: 160, baseType: !313, size: 96, offset: 4288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !252, file: !50, line: 160, baseType: !313, size: 96, offset: 4384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !252, file: !50, line: 161, baseType: !385, size: 128, offset: 4480)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 4)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !252, file: !50, line: 161, baseType: !385, size: 128, offset: 4608)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !252, file: !50, line: 162, baseType: !313, size: 96, offset: 4736)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !252, file: !50, line: 162, baseType: !313, size: 96, offset: 4832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !252, file: !50, line: 163, baseType: !279, size: 32, offset: 4928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !252, file: !50, line: 163, baseType: !279, size: 32, offset: 4960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !252, file: !50, line: 164, baseType: !394, size: 512, offset: 4992)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 512, elements: !395)
!395 = !{!387, !387}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !252, file: !50, line: 165, baseType: !394, size: 512, offset: 5504)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !252, file: !50, line: 166, baseType: !394, size: 512, offset: 6016)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !252, file: !50, line: 167, baseType: !394, size: 512, offset: 6528)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !252, file: !50, line: 176, baseType: !394, size: 512, offset: 7040)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !252, file: !50, line: 178, baseType: !7, size: 32, offset: 7552)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !50, line: 180, baseType: !97, size: 16, offset: 7584)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !252, file: !50, line: 181, baseType: !97, size: 16, offset: 7600)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !252, file: !50, line: 183, baseType: !97, size: 16, offset: 7616)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !252, file: !50, line: 183, baseType: !97, size: 16, offset: 7632)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !252, file: !50, line: 184, baseType: !97, size: 16, offset: 7648)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !252, file: !50, line: 184, baseType: !97, size: 16, offset: 7664)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !252, file: !50, line: 185, baseType: !97, size: 16, offset: 7680)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !252, file: !50, line: 186, baseType: !97, size: 16, offset: 7696)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !252, file: !50, line: 187, baseType: !97, size: 16, offset: 7712)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !252, file: !50, line: 188, baseType: !84, size: 8, offset: 7728)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !252, file: !50, line: 189, baseType: !84, size: 8, offset: 7736)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !252, file: !50, line: 192, baseType: !99, size: 32, offset: 7744)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !252, file: !50, line: 192, baseType: !99, size: 32, offset: 7776)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !252, file: !50, line: 192, baseType: !99, size: 32, offset: 7808)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !252, file: !50, line: 192, baseType: !99, size: 32, offset: 7840)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !252, file: !50, line: 194, baseType: !99, size: 32, offset: 7872)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !252, file: !50, line: 202, baseType: !279, size: 32, offset: 7904)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !252, file: !50, line: 202, baseType: !279, size: 32, offset: 7936)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !252, file: !50, line: 202, baseType: !279, size: 32, offset: 7968)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !252, file: !50, line: 211, baseType: !279, size: 32, offset: 8000)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !252, file: !50, line: 212, baseType: !279, size: 32, offset: 8032)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !252, file: !50, line: 213, baseType: !279, size: 32, offset: 8064)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !252, file: !50, line: 214, baseType: !279, size: 32, offset: 8096)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !252, file: !50, line: 215, baseType: !279, size: 32, offset: 8128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !252, file: !50, line: 216, baseType: !279, size: 32, offset: 8160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !252, file: !50, line: 219, baseType: !279, size: 32, offset: 8192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !252, file: !50, line: 220, baseType: !279, size: 32, offset: 8224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !252, file: !50, line: 221, baseType: !279, size: 32, offset: 8256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !252, file: !50, line: 224, baseType: !430, size: 16, offset: 8288)
!430 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !252, file: !50, line: 224, baseType: !430, size: 16, offset: 8304)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !252, file: !50, line: 226, baseType: !97, size: 16, offset: 8320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !252, file: !50, line: 228, baseType: !84, size: 8, offset: 8336)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !252, file: !50, line: 229, baseType: !84, size: 8, offset: 8344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !252, file: !50, line: 231, baseType: !97, size: 16, offset: 8352)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !252, file: !50, line: 232, baseType: !84, size: 8, offset: 8368)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !252, file: !50, line: 233, baseType: !84, size: 8, offset: 8376)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !252, file: !50, line: 234, baseType: !279, size: 32, offset: 8384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !252, file: !50, line: 235, baseType: !279, size: 32, offset: 8416)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !252, file: !50, line: 237, baseType: !124, size: 128, offset: 8448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !252, file: !50, line: 238, baseType: !124, size: 128, offset: 8576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !252, file: !50, line: 239, baseType: !124, size: 128, offset: 8704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !252, file: !50, line: 240, baseType: !124, size: 128, offset: 8832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !252, file: !50, line: 242, baseType: !279, size: 32, offset: 8960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !252, file: !50, line: 244, baseType: !97, size: 16, offset: 8992)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !252, file: !50, line: 245, baseType: !430, size: 16, offset: 9008)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !252, file: !50, line: 246, baseType: !385, size: 128, offset: 9024)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !252, file: !50, line: 248, baseType: !99, size: 32, offset: 9152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !252, file: !50, line: 249, baseType: !99, size: 32, offset: 9184)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !252, file: !50, line: 251, baseType: !451, size: 64, offset: 9216)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !50, line: 251, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !252, file: !50, line: 253, baseType: !84, size: 8, offset: 9280)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !252, file: !50, line: 254, baseType: !84, size: 8, offset: 9288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !252, file: !50, line: 255, baseType: !97, size: 16, offset: 9296)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !252, file: !50, line: 256, baseType: !313, size: 96, offset: 9312)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !252, file: !50, line: 258, baseType: !124, size: 128, offset: 9408)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !252, file: !50, line: 259, baseType: !124, size: 128, offset: 9536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !252, file: !50, line: 260, baseType: !124, size: 128, offset: 9664)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !252, file: !50, line: 261, baseType: !124, size: 128, offset: 9792)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !252, file: !50, line: 263, baseType: !462, size: 64, offset: 9920)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !50, line: 52, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !252, file: !50, line: 264, baseType: !465, size: 64, offset: 9984)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !50, line: 53, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !252, file: !50, line: 265, baseType: !468, size: 64, offset: 10048)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !287, line: 46, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !252, file: !50, line: 267, baseType: !84, size: 8, offset: 10112)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !252, file: !50, line: 268, baseType: !84, size: 8, offset: 10120)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !252, file: !50, line: 269, baseType: !97, size: 16, offset: 10128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !252, file: !50, line: 270, baseType: !279, size: 32, offset: 10144)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !252, file: !50, line: 272, baseType: !475, size: 64, offset: 10176)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !50, line: 54, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !252, file: !50, line: 275, baseType: !478, size: 64, offset: 10240)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !50, line: 275, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !252, file: !50, line: 277, baseType: !481, size: 64, offset: 10304)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !50, line: 56, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !252, file: !50, line: 277, baseType: !481, size: 64, offset: 10368)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !252, file: !50, line: 278, baseType: !485, size: 64, offset: 10432)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !486, line: 27, baseType: !487)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !488, line: 45, baseType: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!489 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !252, file: !50, line: 279, baseType: !485, size: 64, offset: 10496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !252, file: !50, line: 280, baseType: !7, size: 32, offset: 10560)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !252, file: !50, line: 281, baseType: !7, size: 32, offset: 10592)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !252, file: !50, line: 283, baseType: !124, size: 128, offset: 10624)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !252, file: !50, line: 284, baseType: !124, size: 128, offset: 10752)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !252, file: !50, line: 285, baseType: !496, size: 64, offset: 10880)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !252, file: !50, line: 287, baseType: !498, size: 64, offset: 10944)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !50, line: 59, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !252, file: !50, line: 288, baseType: !501, size: 64, offset: 11008)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !50, line: 288, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !252, file: !50, line: 290, baseType: !504, size: 64, offset: 11072)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 64, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 2)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !252, file: !50, line: 291, baseType: !508, size: 64, offset: 11136)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !510, line: 65, baseType: !511)
!510 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !510, line: 50, size: 320, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !511, file: !510, line: 51, baseType: !241, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !511, file: !510, line: 53, baseType: !99, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !511, file: !510, line: 54, baseType: !99, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !511, file: !510, line: 55, baseType: !99, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !511, file: !510, line: 55, baseType: !99, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !511, file: !510, line: 56, baseType: !84, size: 8, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !511, file: !510, line: 56, baseType: !84, size: 8, offset: 200)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !511, file: !510, line: 57, baseType: !84, size: 8, offset: 208)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !511, file: !510, line: 57, baseType: !84, size: 8, offset: 216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !511, file: !510, line: 59, baseType: !97, size: 16, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !511, file: !510, line: 59, baseType: !97, size: 16, offset: 240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !511, file: !510, line: 59, baseType: !97, size: 16, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !510, line: 61, baseType: !97, size: 16, offset: 272)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !511, file: !510, line: 63, baseType: !99, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !252, file: !50, line: 293, baseType: !124, size: 128, offset: 11200)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !252, file: !50, line: 294, baseType: !529, size: 64, offset: 11328)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !50, line: 113, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !50, line: 108, size: 256, elements: !532)
!532 = !{!533, !535, !536, !537, !538}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !50, line: 109, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !531, file: !50, line: 109, baseType: !534, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !531, file: !50, line: 110, baseType: !251, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !531, file: !50, line: 111, baseType: !99, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !531, file: !50, line: 112, baseType: !279, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !242, file: !243, line: 1221, baseType: !540, size: 64, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !243, line: 52, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !242, file: !243, line: 1223, baseType: !241, size: 64, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !242, file: !243, line: 1225, baseType: !124, size: 128, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !242, file: !243, line: 1226, baseType: !545, size: 64, offset: 1344)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !243, line: 69, size: 320, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !243, line: 70, baseType: !545, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !546, file: !243, line: 70, baseType: !545, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !546, file: !243, line: 71, baseType: !7, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !546, file: !243, line: 71, baseType: !7, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !243, line: 72, baseType: !99, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !546, file: !243, line: 73, baseType: !97, size: 16, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !546, file: !243, line: 73, baseType: !97, size: 16, offset: 240)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !546, file: !243, line: 74, baseType: !251, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !242, file: !243, line: 1227, baseType: !251, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !242, file: !243, line: 1229, baseType: !313, size: 96, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !242, file: !243, line: 1230, baseType: !313, size: 96, offset: 1568)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !242, file: !243, line: 1231, baseType: !313, size: 96, offset: 1664)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !242, file: !243, line: 1231, baseType: !313, size: 96, offset: 1760)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !242, file: !243, line: 1233, baseType: !7, size: 32, offset: 1856)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !242, file: !243, line: 1234, baseType: !99, size: 32, offset: 1888)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !242, file: !243, line: 1235, baseType: !7, size: 32, offset: 1920)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !242, file: !243, line: 1237, baseType: !97, size: 16, offset: 1952)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !242, file: !243, line: 1239, baseType: !84, size: 8, offset: 1968)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !242, file: !243, line: 1240, baseType: !567, size: 8, offset: 1976)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 1)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !242, file: !243, line: 1242, baseType: !571, size: 64, offset: 1984)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !573, line: 328, size: 3456, elements: !574)
!573 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!574 = !{!575, !576, !577, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !607, !608, !609, !612, !617, !618, !621, !625, !629, !633, !637, !638, !639, !640}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !572, file: !573, line: 329, baseType: !65, size: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !572, file: !573, line: 330, baseType: !247, size: 64, offset: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !572, file: !573, line: 332, baseType: !578, size: 64, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !573, line: 332, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !572, file: !573, line: 333, baseType: !114, size: 512, offset: 1088)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !572, file: !573, line: 335, baseType: !205, size: 64, offset: 1600)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !572, file: !573, line: 337, baseType: !343, size: 64, offset: 1664)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !572, file: !573, line: 338, baseType: !504, size: 64, offset: 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !572, file: !573, line: 340, baseType: !124, size: 128, offset: 1792)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !572, file: !573, line: 340, baseType: !124, size: 128, offset: 1920)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !572, file: !573, line: 342, baseType: !99, size: 32, offset: 2048)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !572, file: !573, line: 342, baseType: !99, size: 32, offset: 2080)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !572, file: !573, line: 343, baseType: !99, size: 32, offset: 2112)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !572, file: !573, line: 345, baseType: !99, size: 32, offset: 2144)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !572, file: !573, line: 346, baseType: !99, size: 32, offset: 2176)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !572, file: !573, line: 347, baseType: !97, size: 16, offset: 2208)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !572, file: !573, line: 348, baseType: !97, size: 16, offset: 2224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !572, file: !573, line: 349, baseType: !99, size: 32, offset: 2240)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !572, file: !573, line: 351, baseType: !99, size: 32, offset: 2272)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !572, file: !573, line: 353, baseType: !97, size: 16, offset: 2304)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !572, file: !573, line: 354, baseType: !97, size: 16, offset: 2320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !572, file: !573, line: 355, baseType: !99, size: 32, offset: 2336)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !572, file: !573, line: 357, baseType: !599, size: 128, offset: 2368)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !600, line: 95, baseType: !601)
!600 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !600, line: 92, size: 128, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !601, file: !600, line: 93, baseType: !279, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !601, file: !600, line: 93, baseType: !279, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !601, file: !600, line: 94, baseType: !279, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !601, file: !600, line: 94, baseType: !279, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !572, file: !573, line: 363, baseType: !124, size: 128, offset: 2496)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !572, file: !573, line: 363, baseType: !124, size: 128, offset: 2624)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !572, file: !573, line: 368, baseType: !610, size: 64, offset: 2752)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !573, line: 48, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !572, file: !573, line: 372, baseType: !613, size: 32, offset: 2816)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !573, line: 274, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !573, line: 271, size: 32, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !614, file: !573, line: 273, baseType: !7, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !572, file: !573, line: 373, baseType: !99, size: 32, offset: 2848)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !572, file: !573, line: 382, baseType: !619, size: 64, offset: 2880)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !573, line: 46, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !572, file: !573, line: 385, baseType: !622, size: 64, offset: 2944)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !63, !279}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !572, file: !573, line: 386, baseType: !626, size: 64, offset: 3008)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !63, !373}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !572, file: !573, line: 387, baseType: !630, size: 64, offset: 3072)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!99, !63}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !572, file: !573, line: 388, baseType: !634, size: 64, offset: 3136)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !63}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !572, file: !573, line: 389, baseType: !63, size: 64, offset: 3200)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !572, file: !573, line: 389, baseType: !63, size: 64, offset: 3264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !572, file: !573, line: 389, baseType: !63, size: 64, offset: 3328)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !572, file: !573, line: 389, baseType: !63, size: 64, offset: 3392)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !242, file: !243, line: 1244, baseType: !642, size: 64, offset: 2048)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !644, line: 200, size: 17024, elements: !645)
!644 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!645 = !{!646, !647, !648, !649, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !643, file: !644, line: 201, baseType: !496, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !643, file: !644, line: 202, baseType: !124, size: 128, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !643, file: !644, line: 203, baseType: !124, size: 128, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !643, file: !644, line: 206, baseType: !650, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !644, line: 190, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !644, line: 126, size: 2816, elements: !653)
!653 = !{!654, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !752, !753, !754, !755, !1033, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1062}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !644, line: 127, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !644, line: 127, baseType: !655, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !652, file: !644, line: 128, baseType: !63, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !652, file: !644, line: 129, baseType: !63, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !652, file: !644, line: 130, baseType: !114, size: 512, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !652, file: !644, line: 132, baseType: !99, size: 32, offset: 768)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !644, line: 132, baseType: !99, size: 32, offset: 800)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !652, file: !644, line: 133, baseType: !99, size: 32, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !652, file: !644, line: 134, baseType: !99, size: 32, offset: 864)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !652, file: !644, line: 134, baseType: !99, size: 32, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !652, file: !644, line: 134, baseType: !99, size: 32, offset: 928)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !652, file: !644, line: 135, baseType: !99, size: 32, offset: 960)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !652, file: !644, line: 135, baseType: !99, size: 32, offset: 992)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !652, file: !644, line: 136, baseType: !99, size: 32, offset: 1024)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !652, file: !644, line: 136, baseType: !99, size: 32, offset: 1056)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !652, file: !644, line: 137, baseType: !99, size: 32, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !652, file: !644, line: 137, baseType: !99, size: 32, offset: 1120)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !652, file: !644, line: 138, baseType: !279, size: 32, offset: 1152)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !652, file: !644, line: 139, baseType: !279, size: 32, offset: 1184)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !652, file: !644, line: 139, baseType: !279, size: 32, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !652, file: !644, line: 141, baseType: !97, size: 16, offset: 1248)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !652, file: !644, line: 142, baseType: !97, size: 16, offset: 1264)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !652, file: !644, line: 143, baseType: !99, size: 32, offset: 1280)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !652, file: !644, line: 144, baseType: !99, size: 32, offset: 1312)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !652, file: !644, line: 146, baseType: !680, size: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !644, line: 114, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !644, line: 99, size: 7232, elements: !683)
!683 = !{!684, !686, !687, !688, !689, !690, !691, !702, !706, !720, !729, !736, !746}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !644, line: 100, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !682, file: !644, line: 100, baseType: !685, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !682, file: !644, line: 101, baseType: !99, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !682, file: !644, line: 101, baseType: !99, size: 32, offset: 160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !682, file: !644, line: 102, baseType: !99, size: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !682, file: !644, line: 102, baseType: !99, size: 32, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !682, file: !644, line: 103, baseType: !692, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !644, line: 59, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !644, line: 56, size: 2112, elements: !695)
!695 = !{!696, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !644, line: 57, baseType: !697, size: 2048)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !694, file: !644, line: 58, baseType: !99, size: 32, offset: 2048)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !694, file: !644, line: 58, baseType: !99, size: 32, offset: 2080)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !682, file: !644, line: 106, baseType: !703, size: 6144, offset: 320)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 6144, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 768)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !682, file: !644, line: 107, baseType: !707, size: 64, offset: 6464)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !644, line: 97, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !644, line: 83, size: 8320, elements: !710)
!710 = !{!711, !712, !713, !716, !717, !718, !719}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !709, file: !644, line: 84, baseType: !703, size: 6144)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !709, file: !644, line: 87, baseType: !697, size: 2048, offset: 6144)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !709, file: !644, line: 88, baseType: !714, size: 64, offset: 8192)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !510, line: 41, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !709, file: !644, line: 90, baseType: !97, size: 16, offset: 8256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !709, file: !644, line: 92, baseType: !97, size: 16, offset: 8272)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !709, file: !644, line: 93, baseType: !97, size: 16, offset: 8288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !709, file: !644, line: 95, baseType: !97, size: 16, offset: 8304)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !682, file: !644, line: 108, baseType: !721, size: 64, offset: 6528)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !644, line: 66, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !644, line: 61, size: 128, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !723, file: !644, line: 62, baseType: !99, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !723, file: !644, line: 63, baseType: !99, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !723, file: !644, line: 64, baseType: !99, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !723, file: !644, line: 65, baseType: !99, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !682, file: !644, line: 109, baseType: !730, size: 64, offset: 6592)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !644, line: 71, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !644, line: 68, size: 64, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !732, file: !644, line: 69, baseType: !99, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !732, file: !644, line: 70, baseType: !99, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !682, file: !644, line: 110, baseType: !737, size: 64, offset: 6656)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !644, line: 81, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !644, line: 73, size: 352, elements: !740)
!740 = !{!741, !742, !743, !744, !745}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !739, file: !644, line: 74, baseType: !313, size: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !739, file: !644, line: 75, baseType: !313, size: 96, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !739, file: !644, line: 76, baseType: !313, size: 96, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !739, file: !644, line: 77, baseType: !99, size: 32, offset: 288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !739, file: !644, line: 78, baseType: !99, size: 32, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !682, file: !644, line: 113, baseType: !747, size: 512, offset: 6720)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !748, line: 182, baseType: !749)
!748 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !748, line: 180, size: 512, elements: !750)
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !748, line: 181, baseType: !114, size: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !652, file: !644, line: 148, baseType: !271, size: 64, offset: 1408)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !652, file: !644, line: 151, baseType: !241, size: 64, offset: 1472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !652, file: !644, line: 152, baseType: !251, size: 64, offset: 1536)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !652, file: !644, line: 153, baseType: !756, size: 64, offset: 1600)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !758, line: 64, size: 19136, elements: !759)
!758 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!759 = !{!760, !761, !762, !763, !764, !765, !767, !768, !769, !770, !773, !774, !1019, !1020, !1028, !1029, !1030, !1031, !1032}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !757, file: !758, line: 65, baseType: !65, size: 960)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !757, file: !758, line: 66, baseType: !247, size: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !758, line: 68, baseType: !83, size: 8192, offset: 1024)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !757, file: !758, line: 70, baseType: !99, size: 32, offset: 9216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !757, file: !758, line: 71, baseType: !99, size: 32, offset: 9248)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !757, file: !758, line: 72, baseType: !766, size: 64, offset: 9280)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, elements: !505)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !757, file: !758, line: 74, baseType: !279, size: 32, offset: 9344)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !757, file: !758, line: 74, baseType: !279, size: 32, offset: 9376)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !757, file: !758, line: 76, baseType: !714, size: 64, offset: 9408)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !757, file: !758, line: 77, baseType: !771, size: 64, offset: 9472)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !758, line: 77, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !757, file: !758, line: 78, baseType: !343, size: 64, offset: 9536)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !757, file: !758, line: 80, baseType: !775, size: 2624, offset: 9600)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !776, line: 340, size: 2624, elements: !777)
!776 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !806, !824, !825, !826, !841, !899, !900, !999, !1000, !1001, !1002, !1008}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !775, file: !776, line: 341, baseType: !779, size: 576)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !776, line: 251, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !776, line: 207, size: 576, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !780, file: !776, line: 208, baseType: !99, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !780, file: !776, line: 211, baseType: !97, size: 16, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !780, file: !776, line: 212, baseType: !97, size: 16, offset: 48)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !780, file: !776, line: 213, baseType: !279, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !780, file: !776, line: 214, baseType: !97, size: 16, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !780, file: !776, line: 215, baseType: !97, size: 16, offset: 112)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !780, file: !776, line: 216, baseType: !97, size: 16, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !780, file: !776, line: 217, baseType: !97, size: 16, offset: 144)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !780, file: !776, line: 218, baseType: !97, size: 16, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !780, file: !776, line: 219, baseType: !97, size: 16, offset: 176)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !780, file: !776, line: 220, baseType: !279, size: 32, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !780, file: !776, line: 222, baseType: !97, size: 16, offset: 224)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !780, file: !776, line: 225, baseType: !97, size: 16, offset: 240)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !780, file: !776, line: 228, baseType: !99, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !780, file: !776, line: 229, baseType: !99, size: 32, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !780, file: !776, line: 233, baseType: !99, size: 32, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !780, file: !776, line: 236, baseType: !97, size: 16, offset: 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !780, file: !776, line: 236, baseType: !97, size: 16, offset: 368)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !780, file: !776, line: 241, baseType: !279, size: 32, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !780, file: !776, line: 244, baseType: !99, size: 32, offset: 416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !780, file: !776, line: 244, baseType: !99, size: 32, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !780, file: !776, line: 245, baseType: !279, size: 32, offset: 480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !780, file: !776, line: 248, baseType: !279, size: 32, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !780, file: !776, line: 250, baseType: !99, size: 32, offset: 544)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !775, file: !776, line: 342, baseType: !807, size: 448, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !776, line: 79, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !776, line: 61, size: 448, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !808, file: !776, line: 62, baseType: !63, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !808, file: !776, line: 64, baseType: !97, size: 16, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !808, file: !776, line: 65, baseType: !97, size: 16, offset: 80)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !808, file: !776, line: 67, baseType: !279, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !808, file: !776, line: 68, baseType: !279, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !808, file: !776, line: 69, baseType: !279, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !808, file: !776, line: 70, baseType: !97, size: 16, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !808, file: !776, line: 71, baseType: !97, size: 16, offset: 208)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !808, file: !776, line: 72, baseType: !504, size: 64, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !808, file: !776, line: 75, baseType: !279, size: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !808, file: !776, line: 75, baseType: !279, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !808, file: !776, line: 75, baseType: !279, size: 32, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !808, file: !776, line: 78, baseType: !279, size: 32, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !808, file: !776, line: 78, baseType: !279, size: 32, offset: 416)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !775, file: !776, line: 343, baseType: !124, size: 128, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !775, file: !776, line: 344, baseType: !124, size: 128, offset: 1152)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !775, file: !776, line: 345, baseType: !827, size: 192, offset: 1280)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !776, line: 278, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !776, line: 270, size: 192, elements: !829)
!829 = !{!830, !831, !832, !833, !834}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !828, file: !776, line: 271, baseType: !99, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !828, file: !776, line: 273, baseType: !279, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !828, file: !776, line: 275, baseType: !99, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !828, file: !776, line: 276, baseType: !99, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !828, file: !776, line: 277, baseType: !835, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !776, line: 55, size: 576, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !836, file: !776, line: 56, baseType: !99, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !836, file: !776, line: 57, baseType: !279, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !836, file: !776, line: 58, baseType: !394, size: 512, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !775, file: !776, line: 346, baseType: !842, size: 384, offset: 1472)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !776, line: 268, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !776, line: 253, size: 384, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !893, !894, !895, !896, !897, !898}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !776, line: 254, baseType: !99, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !843, file: !776, line: 255, baseType: !99, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !843, file: !776, line: 255, baseType: !99, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !843, file: !776, line: 258, baseType: !279, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !843, file: !776, line: 259, baseType: !850, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !776, line: 164, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !776, line: 108, size: 1664, elements: !853)
!853 = !{!854, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !852, file: !776, line: 109, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !852, file: !776, line: 109, baseType: !855, size: 64, offset: 64)
