; ModuleID = 'blender/source/blender/blenkernel/intern/softbody.c'
source_filename = "blender/source/blender/blenkernel/intern/softbody.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.SoftBody = type { i32, i32, %struct.BodyPoint*, %struct.BodySpring*, i8, i8, i16, float, [64 x i8], float, float, float, float, float, float, float, float, float, i16, [64 x i8], i16, float, float, [64 x i8], i32, i32, i32, i16, i16, %struct.SBVertex**, i32, i32, float, float, float, float, i16, i16, i16, i16, i16, i16, i16, i16, %struct.SBScratch*, float, float, %struct.PointCache*, %struct.ListBase, %struct.EffectorWeights*, [3 x float], [3 x [3 x float]], [3 x [3 x float]], i32 }
%struct.BodyPoint = type { [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], float, [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], i32, i32*, float, float, float, float, i16, float, float }
%struct.BodySpring = type { i32, i32, float, float, float, [3 x float], i32, i16 }
%struct.SBVertex = type { [4 x float] }

!44 = !DIEnumerator(name: "eModifierType_Curve", value: 3, isUnsigned: true)
!45 = !DIEnumerator(name: "eModifierType_Build", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "eModifierType_Mirror", value: 5, isUnsigned: true)
!47 = !DIEnumerator(name: "eModifierType_Decimate", value: 6, isUnsigned: true)
!48 = !DIEnumerator(name: "eModifierType_Wave", value: 7, isUnsigned: true)
!49 = !DIEnumerator(name: "eModifierType_Armature", value: 8, isUnsigned: true)
!50 = !DIEnumerator(name: "eModifierType_Hook", value: 9, isUnsigned: true)
!51 = !DIEnumerator(name: "eModifierType_Softbody", value: 10, isUnsigned: true)
!52 = !DIEnumerator(name: "eModifierType_Boolean", value: 11, isUnsigned: true)
!53 = !DIEnumerator(name: "eModifierType_Array", value: 12, isUnsigned: true)
!54 = !DIEnumerator(name: "eModifierType_EdgeSplit", value: 13, isUnsigned: true)
!55 = !DIEnumerator(name: "eModifierType_Displace", value: 14, isUnsigned: true)
!56 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!57 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!58 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!59 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!60 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!61 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!62 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!63 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!64 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!65 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!66 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!67 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!68 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!69 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!70 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!71 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!72 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!73 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!74 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!75 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!76 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!77 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!78 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!79 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!80 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!81 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!82 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!83 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!84 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!85 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!86 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!87 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!88 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!89 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!90 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!91 = !{!92, !93, !94, !95, !100, !139, !501, !2146, !2166}
!92 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!94 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashValFreeFP", file: !96, line: 46, baseType: !97)
!96 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !93}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !102, line: 133, baseType: !103)
!102 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !102, line: 58, size: 11008, elements: !104)
!104 = !{!105, !175, !179, !190, !193, !197, !201, !208, !217, !313, !319, !326, !334, !345, !358, !371, !382, !391, !403, !411, !413, !416, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !103, file: !102, line: 59, baseType: !106, size: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !107, line: 130, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !107, line: 117, size: 960, elements: !109)
!109 = !{!110, !111, !112, !114, !134, !138, !140, !141, !142, !143}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !107, line: 118, baseType: !93, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !108, file: !107, line: 118, baseType: !93, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !108, file: !107, line: 119, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !108, file: !107, line: 120, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !107, line: 136, size: 17600, elements: !117)
!117 = !{!118, !119, !121, !124, !129, !130, !131}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !116, file: !107, line: 137, baseType: !106, size: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !116, file: !107, line: 138, baseType: !120, size: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !116, file: !107, line: 139, baseType: !122, size: 64, offset: 1024)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !107, line: 43, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !107, line: 140, baseType: !125, size: 8192, offset: 1088)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8192, elements: !127)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!127 = !{!128}
!128 = !DISubrange(count: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !116, file: !107, line: 141, baseType: !125, size: 8192, offset: 9280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !116, file: !107, line: 148, baseType: !115, size: 64, offset: 17472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !116, file: !107, line: 150, baseType: !132, size: 64, offset: 17536)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !107, line: 45, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !107, line: 121, baseType: !135, size: 528, offset: 256)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 528, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 66)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !108, file: !107, line: 126, baseType: !139, size: 16, offset: 784)
!139 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !108, file: !107, line: 127, baseType: !92, size: 32, offset: 800)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !108, file: !107, line: 128, baseType: !92, size: 32, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !108, file: !107, line: 128, baseType: !92, size: 32, offset: 864)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !108, file: !107, line: 129, baseType: !144, size: 64, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !107, line: 75, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !107, line: 62, size: 1024, elements: !147)
!147 = !{!148, !150, !151, !152, !153, !154, !158, !159, !173, !174}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !107, line: 63, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !107, line: 63, baseType: !149, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !107, line: 64, baseType: !126, size: 8, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !146, file: !107, line: 64, baseType: !126, size: 8, offset: 136)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !107, line: 65, baseType: !139, size: 16, offset: 144)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !107, line: 66, baseType: !155, size: 512, offset: 160)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !146, file: !107, line: 67, baseType: !92, size: 32, offset: 672)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !107, line: 69, baseType: !160, size: 256, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !107, line: 60, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !107, line: 48, size: 256, elements: !162)
!162 = !{!163, !164, !171, !172}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !161, file: !107, line: 49, baseType: !93, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !161, file: !107, line: 58, baseType: !165, size: 128, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !166, line: 71, baseType: !167)
!166 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !166, line: 69, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !167, file: !166, line: 70, baseType: !93, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !167, file: !166, line: 70, baseType: !93, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !161, file: !107, line: 59, baseType: !92, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !161, file: !107, line: 59, baseType: !92, size: 32, offset: 224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !146, file: !107, line: 70, baseType: !92, size: 32, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !146, file: !107, line: 74, baseType: !92, size: 32, offset: 992)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !103, file: !102, line: 60, baseType: !176, size: 64, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !178, line: 45, flags: DIFlagFwdDecl)
!178 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !103, file: !102, line: 62, baseType: !180, size: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !13, line: 97, size: 832, elements: !182)
!182 = !{!183, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !181, file: !13, line: 98, baseType: !184, size: 768)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 768, elements: !185)
!185 = !{!186, !187}
!186 = !DISubrange(count: 8)
!187 = !DISubrange(count: 3)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !13, line: 99, baseType: !92, size: 32, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !181, file: !13, line: 99, baseType: !92, size: 32, offset: 800)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !103, file: !102, line: 64, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !178, line: 46, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !103, file: !102, line: 65, baseType: !194, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !196, line: 41, flags: DIFlagFwdDecl)
!196 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lattice_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !103, file: !102, line: 66, baseType: !198, size: 64, offset: 1216)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !13, line: 50, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !103, file: !102, line: 67, baseType: !202, size: 64, offset: 1280)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !204, line: 154, size: 64, elements: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !203, file: !204, line: 155, baseType: !92, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !204, line: 156, baseType: !92, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !103, file: !102, line: 71, baseType: !209, size: 64, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !204, line: 79, size: 96, elements: !211)
!211 = !{!212, !213, !214, !215, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !210, file: !204, line: 81, baseType: !92, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !210, file: !204, line: 82, baseType: !92, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !210, file: !204, line: 83, baseType: !139, size: 16, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !204, line: 84, baseType: !126, size: 8, offset: 80)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !210, file: !204, line: 84, baseType: !126, size: 8, offset: 88)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !103, file: !102, line: 72, baseType: !218, size: 64, offset: 1408)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !204, line: 93, size: 128, elements: !220)
!220 = !{!221, !308, !309, !310, !311, !312}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !219, file: !204, line: 94, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !224, line: 77, size: 15424, elements: !225)
!224 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!225 = !{!226, !227, !228, !231, !234, !237, !240, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !259, !260, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !289, !290, !291, !297, !298, !302}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !223, file: !224, line: 78, baseType: !106, size: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !224, line: 80, baseType: !125, size: 8192, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !223, file: !224, line: 82, baseType: !229, size: 64, offset: 9152)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !224, line: 43, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !223, file: !224, line: 83, baseType: !232, size: 64, offset: 9216)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !107, line: 46, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !223, file: !224, line: 86, baseType: !235, size: 64, offset: 9280)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !224, line: 41, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !223, file: !224, line: 87, baseType: !238, size: 64, offset: 9344)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !224, line: 44, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !223, file: !224, line: 89, baseType: !241, size: 512, offset: 9408)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 512, elements: !242)
!242 = !{!186}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !223, file: !224, line: 90, baseType: !139, size: 16, offset: 9920)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !223, file: !224, line: 90, baseType: !139, size: 16, offset: 9936)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !223, file: !224, line: 92, baseType: !139, size: 16, offset: 9952)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !224, line: 92, baseType: !139, size: 16, offset: 9968)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !223, file: !224, line: 93, baseType: !139, size: 16, offset: 9984)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !224, line: 93, baseType: !139, size: 16, offset: 10000)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !223, file: !224, line: 94, baseType: !92, size: 32, offset: 10016)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !223, file: !224, line: 97, baseType: !139, size: 16, offset: 10048)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !223, file: !224, line: 97, baseType: !139, size: 16, offset: 10064)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !223, file: !224, line: 98, baseType: !139, size: 16, offset: 10080)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !223, file: !224, line: 98, baseType: !139, size: 16, offset: 10096)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !223, file: !224, line: 99, baseType: !139, size: 16, offset: 10112)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !223, file: !224, line: 99, baseType: !139, size: 16, offset: 10128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !223, file: !224, line: 100, baseType: !6, size: 32, offset: 10144)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !223, file: !224, line: 101, baseType: !258, size: 64, offset: 10176)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !223, file: !224, line: 103, baseType: !132, size: 64, offset: 10240)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !223, file: !224, line: 104, baseType: !261, size: 64, offset: 10304)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !107, line: 159, size: 448, elements: !263)
!263 = !{!264, !268, !269, !271, !272, !274}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !262, file: !107, line: 161, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 2)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !262, file: !107, line: 162, baseType: !265, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !262, file: !107, line: 163, baseType: !270, size: 32, offset: 128)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 32, elements: !266)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !262, file: !107, line: 164, baseType: !270, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !262, file: !107, line: 165, baseType: !273, size: 128, offset: 192)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 128, elements: !266)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !262, file: !107, line: 166, baseType: !275, size: 128, offset: 320)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, elements: !266)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !223, file: !224, line: 107, baseType: !94, size: 32, offset: 10368)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !223, file: !224, line: 108, baseType: !92, size: 32, offset: 10400)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !223, file: !224, line: 109, baseType: !139, size: 16, offset: 10432)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !223, file: !224, line: 110, baseType: !139, size: 16, offset: 10448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !223, file: !224, line: 113, baseType: !92, size: 32, offset: 10464)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !223, file: !224, line: 113, baseType: !92, size: 32, offset: 10496)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !223, file: !224, line: 114, baseType: !126, size: 8, offset: 10528)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !223, file: !224, line: 114, baseType: !126, size: 8, offset: 10536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !223, file: !224, line: 115, baseType: !139, size: 16, offset: 10544)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !223, file: !224, line: 116, baseType: !286, size: 128, offset: 10560)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 4)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !223, file: !224, line: 119, baseType: !94, size: 32, offset: 10688)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !223, file: !224, line: 119, baseType: !94, size: 32, offset: 10720)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !223, file: !224, line: 122, baseType: !292, size: 512, offset: 10752)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !293, line: 182, baseType: !294)
!293 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !293, line: 180, size: 512, elements: !295)
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !293, line: 181, baseType: !155, size: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !223, file: !224, line: 123, baseType: !126, size: 8, offset: 11264)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !223, file: !224, line: 125, baseType: !299, size: 56, offset: 11272)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 56, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 7)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !223, file: !224, line: 126, baseType: !303, size: 4096, offset: 11328)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 4096, elements: !242)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !224, line: 69, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !224, line: 67, size: 512, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !224, line: 68, baseType: !155, size: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !204, line: 95, baseType: !126, size: 8, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !219, file: !204, line: 95, baseType: !126, size: 8, offset: 72)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !219, file: !204, line: 96, baseType: !139, size: 16, offset: 80)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !219, file: !204, line: 96, baseType: !139, size: 16, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !219, file: !204, line: 96, baseType: !139, size: 16, offset: 112)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !103, file: !102, line: 73, baseType: !314, size: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !204, line: 88, size: 64, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !315, file: !204, line: 89, baseType: !6, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !315, file: !204, line: 90, baseType: !6, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !103, file: !102, line: 74, baseType: !320, size: 64, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !204, line: 109, size: 96, elements: !322)
!322 = !{!323, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !321, file: !204, line: 110, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, elements: !266)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !321, file: !204, line: 111, baseType: !92, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !103, file: !102, line: 75, baseType: !327, size: 64, offset: 1600)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !204, line: 129, size: 32, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !328, file: !204, line: 130, baseType: !126, size: 8)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !328, file: !204, line: 130, baseType: !126, size: 8, offset: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !328, file: !204, line: 130, baseType: !126, size: 8, offset: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !328, file: !204, line: 130, baseType: !126, size: 8, offset: 24)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !103, file: !102, line: 80, baseType: !335, size: 64, offset: 1664)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !204, line: 42, size: 160, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !336, file: !204, line: 43, baseType: !6, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !336, file: !204, line: 43, baseType: !6, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !336, file: !204, line: 43, baseType: !6, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !336, file: !204, line: 43, baseType: !6, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !336, file: !204, line: 44, baseType: !139, size: 16, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !336, file: !204, line: 45, baseType: !126, size: 8, offset: 144)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !204, line: 45, baseType: !126, size: 8, offset: 152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !103, file: !102, line: 81, baseType: !346, size: 64, offset: 1728)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !204, line: 160, size: 384, elements: !348)
!348 = !{!349, !352, !353, !354, !355, !356, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !347, file: !204, line: 161, baseType: !350, size: 256)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !351)
!351 = !{!288, !267}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !347, file: !204, line: 162, baseType: !222, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !204, line: 163, baseType: !126, size: 8, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !347, file: !204, line: 163, baseType: !126, size: 8, offset: 328)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !347, file: !204, line: 164, baseType: !139, size: 16, offset: 336)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !347, file: !204, line: 164, baseType: !139, size: 16, offset: 352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !347, file: !204, line: 164, baseType: !139, size: 16, offset: 368)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !103, file: !102, line: 82, baseType: !359, size: 64, offset: 1792)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !102, line: 136, size: 512, elements: !361)
!361 = !{!362, !363, !364, !366, !367, !368, !369, !370}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !360, file: !102, line: 137, baseType: !93, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !360, file: !102, line: 138, baseType: !350, size: 256, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !360, file: !102, line: 139, baseType: !365, size: 128, offset: 320)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !287)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !360, file: !102, line: 140, baseType: !126, size: 8, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !360, file: !102, line: 140, baseType: !126, size: 8, offset: 456)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !360, file: !102, line: 141, baseType: !139, size: 16, offset: 464)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !360, file: !102, line: 141, baseType: !139, size: 16, offset: 480)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !360, file: !102, line: 141, baseType: !139, size: 16, offset: 496)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !103, file: !102, line: 83, baseType: !372, size: 64, offset: 1856)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !204, line: 65, size: 160, elements: !374)
!374 = !{!375, !378, !380, !381}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !373, file: !204, line: 66, baseType: !376, size: 96)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 96, elements: !377)
!377 = !{!187}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !373, file: !204, line: 67, baseType: !379, size: 48, offset: 96)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 48, elements: !377)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !373, file: !204, line: 68, baseType: !126, size: 8, offset: 144)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !373, file: !204, line: 68, baseType: !126, size: 8, offset: 152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !103, file: !102, line: 84, baseType: !383, size: 64, offset: 1920)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !204, line: 48, size: 96, elements: !385)
!385 = !{!386, !387, !388, !389, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !384, file: !204, line: 49, baseType: !6, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !384, file: !204, line: 49, baseType: !6, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !384, file: !204, line: 50, baseType: !126, size: 8, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !384, file: !204, line: 50, baseType: !126, size: 8, offset: 72)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !204, line: 51, baseType: !139, size: 16, offset: 80)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !103, file: !102, line: 85, baseType: !392, size: 64, offset: 1984)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !204, line: 59, size: 128, elements: !394)
!394 = !{!395, !401, !402}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !393, file: !204, line: 60, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !204, line: 54, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !397, file: !204, line: 55, baseType: !92, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !397, file: !204, line: 56, baseType: !94, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !393, file: !204, line: 61, baseType: !92, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !204, line: 62, baseType: !92, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !103, file: !102, line: 89, baseType: !404, size: 64, offset: 2048)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !204, line: 74, size: 32, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !405, file: !204, line: 75, baseType: !126, size: 8)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !405, file: !204, line: 75, baseType: !126, size: 8, offset: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !405, file: !204, line: 75, baseType: !126, size: 8, offset: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !405, file: !204, line: 75, baseType: !126, size: 8, offset: 24)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !103, file: !102, line: 90, baseType: !412, size: 64, offset: 2112)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !103, file: !102, line: 93, baseType: !414, size: 64, offset: 2176)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !102, line: 93, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !103, file: !102, line: 95, baseType: !417, size: 1600, offset: 2240)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !418, line: 64, size: 1600, elements: !419)
!418 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!419 = !{!420, !435, !439, !440, !441, !442, !445}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !417, file: !418, line: 65, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !418, line: 53, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !418, line: 42, size: 832, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !418, line: 43, baseType: !92, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !423, file: !418, line: 44, baseType: !92, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !423, file: !418, line: 45, baseType: !92, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !423, file: !418, line: 46, baseType: !92, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !423, file: !418, line: 47, baseType: !92, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !423, file: !418, line: 48, baseType: !92, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !423, file: !418, line: 49, baseType: !92, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !423, file: !418, line: 50, baseType: !92, size: 32, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !418, line: 51, baseType: !155, size: 512, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !423, file: !418, line: 52, baseType: !93, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !417, file: !418, line: 66, baseType: !436, size: 1312, offset: 64)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1312, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 41)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !417, file: !418, line: 69, baseType: !92, size: 32, offset: 1376)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !417, file: !418, line: 69, baseType: !92, size: 32, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !417, file: !418, line: 70, baseType: !92, size: 32, offset: 1440)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !417, file: !418, line: 71, baseType: !443, size: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !418, line: 71, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !417, file: !418, line: 72, baseType: !446, size: 64, offset: 1536)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !418, line: 59, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !418, line: 57, size: 8192, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !448, file: !418, line: 58, baseType: !125, size: 8192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !103, file: !102, line: 95, baseType: !417, size: 1600, offset: 3840)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !103, file: !102, line: 95, baseType: !417, size: 1600, offset: 5440)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !103, file: !102, line: 98, baseType: !417, size: 1600, offset: 7040)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !103, file: !102, line: 98, baseType: !417, size: 1600, offset: 8640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !103, file: !102, line: 101, baseType: !92, size: 32, offset: 10240)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !103, file: !102, line: 101, baseType: !92, size: 32, offset: 10272)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !103, file: !102, line: 101, baseType: !92, size: 32, offset: 10304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !103, file: !102, line: 101, baseType: !92, size: 32, offset: 10336)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !103, file: !102, line: 104, baseType: !92, size: 32, offset: 10368)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !103, file: !102, line: 104, baseType: !92, size: 32, offset: 10400)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !103, file: !102, line: 111, baseType: !92, size: 32, offset: 10432)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !103, file: !102, line: 114, baseType: !376, size: 96, offset: 10464)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !102, line: 115, baseType: !376, size: 96, offset: 10560)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !103, file: !102, line: 116, baseType: !376, size: 96, offset: 10656)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !103, file: !102, line: 118, baseType: !92, size: 32, offset: 10752)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !103, file: !102, line: 119, baseType: !139, size: 16, offset: 10784)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !103, file: !102, line: 119, baseType: !139, size: 16, offset: 10800)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !103, file: !102, line: 120, baseType: !94, size: 32, offset: 10816)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !103, file: !102, line: 121, baseType: !92, size: 32, offset: 10848)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !103, file: !102, line: 124, baseType: !126, size: 8, offset: 10880)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !103, file: !102, line: 124, baseType: !126, size: 8, offset: 10888)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !103, file: !102, line: 126, baseType: !126, size: 8, offset: 10896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !103, file: !102, line: 126, baseType: !126, size: 8, offset: 10904)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !103, file: !102, line: 127, baseType: !126, size: 8, offset: 10912)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !103, file: !102, line: 128, baseType: !126, size: 8, offset: 10920)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !103, file: !102, line: 130, baseType: !139, size: 16, offset: 10928)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !103, file: !102, line: 132, baseType: !478, size: 64, offset: 10944)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !204, line: 233, size: 3584, elements: !480)
!480 = !{!481, !482, !485, !487, !488, !489, !490, !491, !492, !493, !494, !496, !497, !499}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !479, file: !204, line: 234, baseType: !165, size: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !479, file: !204, line: 235, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !204, line: 69, baseType: !373)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !479, file: !204, line: 237, baseType: !486, size: 8, offset: 192)
!486 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !479, file: !204, line: 237, baseType: !486, size: 8, offset: 200)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !479, file: !204, line: 237, baseType: !486, size: 8, offset: 208)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !479, file: !204, line: 237, baseType: !486, size: 8, offset: 216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !479, file: !204, line: 237, baseType: !486, size: 8, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !479, file: !204, line: 237, baseType: !486, size: 8, offset: 232)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !479, file: !204, line: 238, baseType: !486, size: 8, offset: 240)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !204, line: 238, baseType: !486, size: 8, offset: 248)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !479, file: !204, line: 241, baseType: !495, size: 1600, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !418, line: 73, baseType: !417)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !479, file: !204, line: 242, baseType: !495, size: 1600, offset: 1856)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !479, file: !204, line: 243, baseType: !498, size: 64, offset: 3456)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !479, file: !204, line: 244, baseType: !500, size: 64, offset: 3520)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "CollisionModifierData", file: !39, line: 584, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CollisionModifierData", file: !39, line: 568, size: 1536, elements: !504)
!504 = !{!505, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !503, file: !39, line: 569, baseType: !506, size: 896)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !39, line: 110, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !39, line: 99, size: 896, elements: !508)
!508 = !{!509, !511, !512, !513, !514, !515, !516, !517, !2131}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !39, line: 100, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !507, file: !39, line: 100, baseType: !510, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !507, file: !39, line: 102, baseType: !92, size: 32, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !507, file: !39, line: 102, baseType: !92, size: 32, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !507, file: !39, line: 103, baseType: !92, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !507, file: !39, line: 103, baseType: !92, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !507, file: !39, line: 104, baseType: !155, size: 512, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !507, file: !39, line: 107, baseType: !518, size: 64, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !520, line: 1216, size: 39680, elements: !521)
!520 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!521 = !{!522, !523, !524, !1508, !1511, !1512, !1513, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1540, !1752, !1755, !2005, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2027, !2028, !2029, !2030, !2031, !2039, !2105, !2112, !2113, !2120, !2123, !2124, !2125, !2126, !2127, !2128}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !519, file: !520, line: 1217, baseType: !106, size: 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !519, file: !520, line: 1218, baseType: !176, size: 64, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !519, file: !520, line: 1220, baseType: !525, size: 64, offset: 1024)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !13, line: 115, size: 11392, elements: !527)
!527 = !{!528, !529, !530, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !560, !561, !602, !603, !606, !607, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !739, !740, !741, !742, !743, !744, !745, !746, !747, !1033, !1440, !1441, !1442, !1443, !1444, !1445, !1448, !1471, !1474, !1475, !1479, !1480, !1481, !1482, !1483, !1484, !1486, !1489, !1492, !1493, !1496, !1497}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !526, file: !13, line: 116, baseType: !106, size: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !526, file: !13, line: 117, baseType: !176, size: 64, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !526, file: !13, line: 119, baseType: !531, size: 64, offset: 1024)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !13, line: 57, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !13, line: 121, baseType: !139, size: 16, offset: 1088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !526, file: !13, line: 121, baseType: !139, size: 16, offset: 1104)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !526, file: !13, line: 122, baseType: !92, size: 32, offset: 1120)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !526, file: !13, line: 122, baseType: !92, size: 32, offset: 1152)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !526, file: !13, line: 122, baseType: !92, size: 32, offset: 1184)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !526, file: !13, line: 123, baseType: !155, size: 512, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !526, file: !13, line: 124, baseType: !525, size: 64, offset: 1728)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !526, file: !13, line: 124, baseType: !525, size: 64, offset: 1792)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !526, file: !13, line: 127, baseType: !525, size: 64, offset: 1856)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !526, file: !13, line: 127, baseType: !525, size: 64, offset: 1920)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !526, file: !13, line: 127, baseType: !525, size: 64, offset: 1984)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !526, file: !13, line: 128, baseType: !191, size: 64, offset: 2048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !526, file: !13, line: 130, baseType: !180, size: 64, offset: 2112)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !526, file: !13, line: 131, baseType: !547, size: 64, offset: 2176)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !549, line: 486, size: 1600, elements: !550)
!549 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !548, file: !549, line: 487, baseType: !106, size: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !548, file: !549, line: 489, baseType: !165, size: 128, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !548, file: !549, line: 490, baseType: !165, size: 128, offset: 1088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !548, file: !549, line: 491, baseType: !165, size: 128, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !548, file: !549, line: 492, baseType: !165, size: 128, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !548, file: !549, line: 494, baseType: !92, size: 32, offset: 1472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !548, file: !549, line: 495, baseType: !92, size: 32, offset: 1504)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !548, file: !549, line: 497, baseType: !92, size: 32, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !548, file: !549, line: 498, baseType: !92, size: 32, offset: 1568)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !526, file: !13, line: 132, baseType: !547, size: 64, offset: 2240)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !526, file: !13, line: 133, baseType: !562, size: 64, offset: 2304)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !549, line: 334, size: 1728, elements: !564)
!564 = !{!565, !566, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !601}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !563, file: !549, line: 335, baseType: !165, size: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !563, file: !549, line: 336, baseType: !567, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !549, line: 47, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !563, file: !549, line: 338, baseType: !139, size: 16, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !563, file: !549, line: 338, baseType: !139, size: 16, offset: 208)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !563, file: !549, line: 339, baseType: !6, size: 32, offset: 224)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !563, file: !549, line: 340, baseType: !92, size: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !563, file: !549, line: 342, baseType: !94, size: 32, offset: 288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !563, file: !549, line: 343, baseType: !376, size: 96, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !563, file: !549, line: 344, baseType: !376, size: 96, offset: 416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !563, file: !549, line: 347, baseType: !165, size: 128, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !563, file: !549, line: 349, baseType: !92, size: 32, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !563, file: !549, line: 350, baseType: !92, size: 32, offset: 672)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !563, file: !549, line: 351, baseType: !93, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !563, file: !549, line: 352, baseType: !93, size: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !563, file: !549, line: 354, baseType: !582, size: 384, offset: 832)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !549, line: 116, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !549, line: 94, size: 384, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !583, file: !549, line: 96, baseType: !92, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !583, file: !549, line: 96, baseType: !92, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !583, file: !549, line: 97, baseType: !92, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !583, file: !549, line: 97, baseType: !92, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !583, file: !549, line: 99, baseType: !139, size: 16, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !583, file: !549, line: 100, baseType: !139, size: 16, offset: 144)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !583, file: !549, line: 102, baseType: !139, size: 16, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !583, file: !549, line: 105, baseType: !139, size: 16, offset: 176)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !583, file: !549, line: 108, baseType: !139, size: 16, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !583, file: !549, line: 109, baseType: !139, size: 16, offset: 208)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !583, file: !549, line: 111, baseType: !139, size: 16, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !583, file: !549, line: 112, baseType: !139, size: 16, offset: 240)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !583, file: !549, line: 114, baseType: !92, size: 32, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !583, file: !549, line: 114, baseType: !92, size: 32, offset: 288)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !583, file: !549, line: 115, baseType: !92, size: 32, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !583, file: !549, line: 115, baseType: !92, size: 32, offset: 352)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !563, file: !549, line: 355, baseType: !155, size: 512, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !526, file: !13, line: 134, baseType: !93, size: 64, offset: 2368)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !526, file: !13, line: 136, baseType: !604, size: 64, offset: 2432)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !13, line: 58, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !526, file: !13, line: 138, baseType: !582, size: 384, offset: 2496)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !526, file: !13, line: 139, baseType: !608, size: 64, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !549, line: 80, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !549, line: 72, size: 192, elements: !611)
!611 = !{!612, !619, !620, !621, !622}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !610, file: !549, line: 73, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !549, line: 59, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !549, line: 56, size: 128, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !615, file: !549, line: 57, baseType: !376, size: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !549, line: 58, baseType: !92, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !610, file: !549, line: 74, baseType: !92, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !610, file: !549, line: 76, baseType: !92, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !610, file: !549, line: 77, baseType: !92, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !549, line: 79, baseType: !92, size: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !526, file: !13, line: 141, baseType: !165, size: 128, offset: 2944)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !526, file: !13, line: 142, baseType: !165, size: 128, offset: 3072)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !526, file: !13, line: 143, baseType: !165, size: 128, offset: 3200)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !526, file: !13, line: 144, baseType: !165, size: 128, offset: 3328)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !526, file: !13, line: 146, baseType: !92, size: 32, offset: 3456)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !526, file: !13, line: 147, baseType: !92, size: 32, offset: 3488)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !526, file: !13, line: 150, baseType: !198, size: 64, offset: 3520)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !526, file: !13, line: 151, baseType: !500, size: 64, offset: 3584)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !526, file: !13, line: 152, baseType: !92, size: 32, offset: 3648)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !526, file: !13, line: 153, baseType: !92, size: 32, offset: 3680)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !526, file: !13, line: 156, baseType: !376, size: 96, offset: 3712)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !526, file: !13, line: 156, baseType: !376, size: 96, offset: 3808)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !526, file: !13, line: 156, baseType: !376, size: 96, offset: 3904)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !526, file: !13, line: 157, baseType: !376, size: 96, offset: 4000)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !526, file: !13, line: 158, baseType: !376, size: 96, offset: 4096)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !526, file: !13, line: 159, baseType: !376, size: 96, offset: 4192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !526, file: !13, line: 160, baseType: !376, size: 96, offset: 4288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !526, file: !13, line: 160, baseType: !376, size: 96, offset: 4384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !526, file: !13, line: 161, baseType: !286, size: 128, offset: 4480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !526, file: !13, line: 161, baseType: !286, size: 128, offset: 4608)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !526, file: !13, line: 162, baseType: !376, size: 96, offset: 4736)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !526, file: !13, line: 162, baseType: !376, size: 96, offset: 4832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !526, file: !13, line: 163, baseType: !94, size: 32, offset: 4928)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !526, file: !13, line: 163, baseType: !94, size: 32, offset: 4960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !526, file: !13, line: 164, baseType: !648, size: 512, offset: 4992)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 512, elements: !649)
!649 = !{!288, !288}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !526, file: !13, line: 165, baseType: !648, size: 512, offset: 5504)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !526, file: !13, line: 166, baseType: !648, size: 512, offset: 6016)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !526, file: !13, line: 167, baseType: !648, size: 512, offset: 6528)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !526, file: !13, line: 176, baseType: !648, size: 512, offset: 7040)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !526, file: !13, line: 178, baseType: !6, size: 32, offset: 7552)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !526, file: !13, line: 180, baseType: !139, size: 16, offset: 7584)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !526, file: !13, line: 181, baseType: !139, size: 16, offset: 7600)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !526, file: !13, line: 183, baseType: !139, size: 16, offset: 7616)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !526, file: !13, line: 183, baseType: !139, size: 16, offset: 7632)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !526, file: !13, line: 184, baseType: !139, size: 16, offset: 7648)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !526, file: !13, line: 184, baseType: !139, size: 16, offset: 7664)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !526, file: !13, line: 185, baseType: !139, size: 16, offset: 7680)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !526, file: !13, line: 186, baseType: !139, size: 16, offset: 7696)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !526, file: !13, line: 187, baseType: !139, size: 16, offset: 7712)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !526, file: !13, line: 188, baseType: !126, size: 8, offset: 7728)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !526, file: !13, line: 189, baseType: !126, size: 8, offset: 7736)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !526, file: !13, line: 192, baseType: !92, size: 32, offset: 7744)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !526, file: !13, line: 192, baseType: !92, size: 32, offset: 7776)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !526, file: !13, line: 192, baseType: !92, size: 32, offset: 7808)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !526, file: !13, line: 192, baseType: !92, size: 32, offset: 7840)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !526, file: !13, line: 194, baseType: !92, size: 32, offset: 7872)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !526, file: !13, line: 202, baseType: !94, size: 32, offset: 7904)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !526, file: !13, line: 202, baseType: !94, size: 32, offset: 7936)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !526, file: !13, line: 202, baseType: !94, size: 32, offset: 7968)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !526, file: !13, line: 211, baseType: !94, size: 32, offset: 8000)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !526, file: !13, line: 212, baseType: !94, size: 32, offset: 8032)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !526, file: !13, line: 213, baseType: !94, size: 32, offset: 8064)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !526, file: !13, line: 214, baseType: !94, size: 32, offset: 8096)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !526, file: !13, line: 215, baseType: !94, size: 32, offset: 8128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !526, file: !13, line: 216, baseType: !94, size: 32, offset: 8160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !526, file: !13, line: 219, baseType: !94, size: 32, offset: 8192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !526, file: !13, line: 220, baseType: !94, size: 32, offset: 8224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !526, file: !13, line: 221, baseType: !94, size: 32, offset: 8256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !526, file: !13, line: 224, baseType: !684, size: 16, offset: 8288)
!684 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !526, file: !13, line: 224, baseType: !684, size: 16, offset: 8304)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !526, file: !13, line: 226, baseType: !139, size: 16, offset: 8320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !526, file: !13, line: 228, baseType: !126, size: 8, offset: 8336)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !526, file: !13, line: 229, baseType: !126, size: 8, offset: 8344)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !526, file: !13, line: 231, baseType: !139, size: 16, offset: 8352)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !526, file: !13, line: 232, baseType: !126, size: 8, offset: 8368)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !526, file: !13, line: 233, baseType: !126, size: 8, offset: 8376)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !526, file: !13, line: 234, baseType: !94, size: 32, offset: 8384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !526, file: !13, line: 235, baseType: !94, size: 32, offset: 8416)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !526, file: !13, line: 237, baseType: !165, size: 128, offset: 8448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !526, file: !13, line: 238, baseType: !165, size: 128, offset: 8576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !526, file: !13, line: 239, baseType: !165, size: 128, offset: 8704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !526, file: !13, line: 240, baseType: !165, size: 128, offset: 8832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !526, file: !13, line: 242, baseType: !94, size: 32, offset: 8960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !526, file: !13, line: 244, baseType: !139, size: 16, offset: 8992)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !526, file: !13, line: 245, baseType: !684, size: 16, offset: 9008)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !526, file: !13, line: 246, baseType: !286, size: 128, offset: 9024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !526, file: !13, line: 248, baseType: !92, size: 32, offset: 9152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !526, file: !13, line: 249, baseType: !92, size: 32, offset: 9184)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !526, file: !13, line: 251, baseType: !705, size: 64, offset: 9216)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !707, line: 215, size: 960, elements: !708)
!707 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !706, file: !707, line: 216, baseType: !92, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !706, file: !707, line: 217, baseType: !94, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !706, file: !707, line: 218, baseType: !94, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !706, file: !707, line: 219, baseType: !94, size: 32, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !706, file: !707, line: 221, baseType: !92, size: 32, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !706, file: !707, line: 222, baseType: !92, size: 32, offset: 160)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !706, file: !707, line: 223, baseType: !92, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !706, file: !707, line: 224, baseType: !92, size: 32, offset: 224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !706, file: !707, line: 226, baseType: !94, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !706, file: !707, line: 227, baseType: !94, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !706, file: !707, line: 228, baseType: !94, size: 32, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !706, file: !707, line: 229, baseType: !94, size: 32, offset: 352)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !706, file: !707, line: 231, baseType: !94, size: 32, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !706, file: !707, line: 232, baseType: !94, size: 32, offset: 416)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !706, file: !707, line: 233, baseType: !94, size: 32, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !706, file: !707, line: 234, baseType: !94, size: 32, offset: 480)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !706, file: !707, line: 236, baseType: !94, size: 32, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !706, file: !707, line: 237, baseType: !94, size: 32, offset: 544)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !706, file: !707, line: 238, baseType: !94, size: 32, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !706, file: !707, line: 239, baseType: !94, size: 32, offset: 608)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !706, file: !707, line: 241, baseType: !94, size: 32, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !706, file: !707, line: 242, baseType: !94, size: 32, offset: 672)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !706, file: !707, line: 243, baseType: !94, size: 32, offset: 704)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !706, file: !707, line: 244, baseType: !94, size: 32, offset: 736)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !706, file: !707, line: 246, baseType: !94, size: 32, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !706, file: !707, line: 247, baseType: !94, size: 32, offset: 800)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !706, file: !707, line: 248, baseType: !92, size: 32, offset: 832)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !706, file: !707, line: 249, baseType: !92, size: 32, offset: 864)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !706, file: !707, line: 250, baseType: !94, size: 32, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !706, file: !707, line: 251, baseType: !94, size: 32, offset: 928)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !526, file: !13, line: 253, baseType: !126, size: 8, offset: 9280)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !526, file: !13, line: 254, baseType: !126, size: 8, offset: 9288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !526, file: !13, line: 255, baseType: !139, size: 16, offset: 9296)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !526, file: !13, line: 256, baseType: !376, size: 96, offset: 9312)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !526, file: !13, line: 258, baseType: !165, size: 128, offset: 9408)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !526, file: !13, line: 259, baseType: !165, size: 128, offset: 9536)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !526, file: !13, line: 260, baseType: !165, size: 128, offset: 9664)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !526, file: !13, line: 261, baseType: !165, size: 128, offset: 9792)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !526, file: !13, line: 263, baseType: !748, size: 64, offset: 9920)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !707, line: 61, size: 1280, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !1026, !1030, !1031, !1032}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !749, file: !707, line: 62, baseType: !92, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !749, file: !707, line: 63, baseType: !139, size: 16, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !749, file: !707, line: 64, baseType: !139, size: 16, offset: 48)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !749, file: !707, line: 65, baseType: !139, size: 16, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !749, file: !707, line: 66, baseType: !139, size: 16, offset: 80)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !749, file: !707, line: 67, baseType: !139, size: 16, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !749, file: !707, line: 68, baseType: !139, size: 16, offset: 112)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !749, file: !707, line: 68, baseType: !139, size: 16, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !749, file: !707, line: 69, baseType: !139, size: 16, offset: 144)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !749, file: !707, line: 72, baseType: !94, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !749, file: !707, line: 73, baseType: !94, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !749, file: !707, line: 74, baseType: !94, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !749, file: !707, line: 77, baseType: !94, size: 32, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !749, file: !707, line: 80, baseType: !94, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !749, file: !707, line: 81, baseType: !94, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !749, file: !707, line: 82, baseType: !94, size: 32, offset: 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !749, file: !707, line: 83, baseType: !94, size: 32, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !749, file: !707, line: 84, baseType: !94, size: 32, offset: 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !749, file: !707, line: 85, baseType: !94, size: 32, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !749, file: !707, line: 88, baseType: !94, size: 32, offset: 480)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !749, file: !707, line: 89, baseType: !94, size: 32, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !749, file: !707, line: 90, baseType: !94, size: 32, offset: 544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !749, file: !707, line: 91, baseType: !94, size: 32, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !749, file: !707, line: 92, baseType: !94, size: 32, offset: 608)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !749, file: !707, line: 93, baseType: !94, size: 32, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !749, file: !707, line: 95, baseType: !94, size: 32, offset: 672)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !749, file: !707, line: 98, baseType: !94, size: 32, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !749, file: !707, line: 99, baseType: !94, size: 32, offset: 736)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !749, file: !707, line: 100, baseType: !94, size: 32, offset: 768)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !749, file: !707, line: 103, baseType: !94, size: 32, offset: 800)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !749, file: !707, line: 103, baseType: !94, size: 32, offset: 832)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !749, file: !707, line: 104, baseType: !94, size: 32, offset: 864)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !749, file: !707, line: 104, baseType: !94, size: 32, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !749, file: !707, line: 104, baseType: !94, size: 32, offset: 928)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !749, file: !707, line: 104, baseType: !94, size: 32, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !749, file: !707, line: 107, baseType: !94, size: 32, offset: 992)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !749, file: !707, line: 108, baseType: !788, size: 64, offset: 1024)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !178, line: 202, size: 3328, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !859, !862, !863, !864, !890, !918, !919, !995, !1016, !1024, !1025}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !789, file: !178, line: 203, baseType: !106, size: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !789, file: !178, line: 204, baseType: !176, size: 64, offset: 960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !789, file: !178, line: 206, baseType: !94, size: 32, offset: 1024)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !789, file: !178, line: 206, baseType: !94, size: 32, offset: 1056)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !789, file: !178, line: 207, baseType: !94, size: 32, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !789, file: !178, line: 207, baseType: !94, size: 32, offset: 1120)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !789, file: !178, line: 207, baseType: !94, size: 32, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !789, file: !178, line: 207, baseType: !94, size: 32, offset: 1184)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !789, file: !178, line: 207, baseType: !94, size: 32, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !789, file: !178, line: 207, baseType: !94, size: 32, offset: 1248)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !789, file: !178, line: 208, baseType: !94, size: 32, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !789, file: !178, line: 208, baseType: !94, size: 32, offset: 1312)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !789, file: !178, line: 211, baseType: !94, size: 32, offset: 1344)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !789, file: !178, line: 211, baseType: !94, size: 32, offset: 1376)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !789, file: !178, line: 211, baseType: !94, size: 32, offset: 1408)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !789, file: !178, line: 211, baseType: !94, size: 32, offset: 1440)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !789, file: !178, line: 211, baseType: !94, size: 32, offset: 1472)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !789, file: !178, line: 214, baseType: !94, size: 32, offset: 1504)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !789, file: !178, line: 214, baseType: !94, size: 32, offset: 1536)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !789, file: !178, line: 217, baseType: !94, size: 32, offset: 1568)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !789, file: !178, line: 218, baseType: !94, size: 32, offset: 1600)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !789, file: !178, line: 219, baseType: !94, size: 32, offset: 1632)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !789, file: !178, line: 220, baseType: !94, size: 32, offset: 1664)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !789, file: !178, line: 221, baseType: !94, size: 32, offset: 1696)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !789, file: !178, line: 222, baseType: !139, size: 16, offset: 1728)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !789, file: !178, line: 222, baseType: !139, size: 16, offset: 1744)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !789, file: !178, line: 224, baseType: !139, size: 16, offset: 1760)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !789, file: !178, line: 224, baseType: !139, size: 16, offset: 1776)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !789, file: !178, line: 227, baseType: !139, size: 16, offset: 1792)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !789, file: !178, line: 227, baseType: !139, size: 16, offset: 1808)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !789, file: !178, line: 229, baseType: !139, size: 16, offset: 1824)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !789, file: !178, line: 229, baseType: !139, size: 16, offset: 1840)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !789, file: !178, line: 230, baseType: !139, size: 16, offset: 1856)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !789, file: !178, line: 230, baseType: !139, size: 16, offset: 1872)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !789, file: !178, line: 232, baseType: !94, size: 32, offset: 1888)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !789, file: !178, line: 232, baseType: !94, size: 32, offset: 1920)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !789, file: !178, line: 232, baseType: !94, size: 32, offset: 1952)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !789, file: !178, line: 232, baseType: !94, size: 32, offset: 1984)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !789, file: !178, line: 233, baseType: !92, size: 32, offset: 2016)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !789, file: !178, line: 234, baseType: !92, size: 32, offset: 2048)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !789, file: !178, line: 235, baseType: !139, size: 16, offset: 2080)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !789, file: !178, line: 235, baseType: !139, size: 16, offset: 2096)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !789, file: !178, line: 236, baseType: !139, size: 16, offset: 2112)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !789, file: !178, line: 239, baseType: !139, size: 16, offset: 2128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !789, file: !178, line: 240, baseType: !92, size: 32, offset: 2144)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !789, file: !178, line: 241, baseType: !92, size: 32, offset: 2176)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !789, file: !178, line: 241, baseType: !92, size: 32, offset: 2208)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !789, file: !178, line: 241, baseType: !92, size: 32, offset: 2240)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !789, file: !178, line: 243, baseType: !94, size: 32, offset: 2272)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !789, file: !178, line: 243, baseType: !94, size: 32, offset: 2304)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !789, file: !178, line: 244, baseType: !94, size: 32, offset: 2336)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !789, file: !178, line: 246, baseType: !843, size: 320, offset: 2368)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !224, line: 50, size: 320, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !843, file: !224, line: 51, baseType: !518, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !843, file: !224, line: 53, baseType: !92, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !843, file: !224, line: 54, baseType: !92, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !843, file: !224, line: 55, baseType: !92, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !843, file: !224, line: 55, baseType: !92, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !843, file: !224, line: 56, baseType: !126, size: 8, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !843, file: !224, line: 56, baseType: !126, size: 8, offset: 200)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !843, file: !224, line: 57, baseType: !126, size: 8, offset: 208)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !843, file: !224, line: 57, baseType: !126, size: 8, offset: 216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !843, file: !224, line: 59, baseType: !139, size: 16, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !843, file: !224, line: 59, baseType: !139, size: 16, offset: 240)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !843, file: !224, line: 59, baseType: !139, size: 16, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !224, line: 61, baseType: !139, size: 16, offset: 272)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !843, file: !224, line: 63, baseType: !92, size: 32, offset: 288)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !789, file: !178, line: 248, baseType: !860, size: 64, offset: 2688)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !178, line: 248, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !789, file: !178, line: 249, baseType: !191, size: 64, offset: 2752)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !789, file: !178, line: 250, baseType: !222, size: 64, offset: 2816)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !789, file: !178, line: 251, baseType: !865, size: 64, offset: 2880)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !178, line: 113, size: 6208, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !877}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !866, file: !178, line: 114, baseType: !139, size: 16)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !866, file: !178, line: 114, baseType: !139, size: 16, offset: 16)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !866, file: !178, line: 115, baseType: !126, size: 8, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !866, file: !178, line: 115, baseType: !126, size: 8, offset: 40)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !866, file: !178, line: 116, baseType: !126, size: 8, offset: 48)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !866, file: !178, line: 117, baseType: !874, size: 8, offset: 56)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 1)
