; ModuleID = 'blender/source/blender/modifiers/intern/MOD_wireframe.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_wireframe.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 182, baseType: !7, size: 32, elements: !92)
!92 = !{!93, !94, !95, !96, !97}
!93 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 1360, baseType: !7, size: 32, elements: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !{!101, !102, !103, !104, !105, !106}
!101 = !DIEnumerator(name: "MOD_WIREFRAME_INVERT_VGROUP", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "MOD_WIREFRAME_REPLACE", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "MOD_WIREFRAME_BOUNDARY", value: 4, isUnsigned: true)
!104 = !DIEnumerator(name: "MOD_WIREFRAME_OFS_EVEN", value: 8, isUnsigned: true)
!105 = !DIEnumerator(name: "MOD_WIREFRAME_OFS_RELATIVE", value: 16, isUnsigned: true)
!106 = !DIEnumerator(name: "MOD_WIREFRAME_CREASE", value: 32, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !108, line: 76, baseType: !7, size: 32, elements: !109)
!108 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150}
!110 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!144 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!145 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!146 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!147 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!148 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!149 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!150 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "WireframeModifierData", file: !99, line: 1358, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WireframeModifierData", file: !99, line: 1349, size: 1600, elements: !155)
!155 = !{!156, !179, !180, !182, !183, !184, !185, !187, !188}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !154, file: !99, line: 1350, baseType: !157, size: 896)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !99, line: 110, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !99, line: 99, size: 896, elements: !159)
!159 = !{!160, !162, !163, !165, !166, !167, !168, !173, !177}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !99, line: 100, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !158, file: !99, line: 100, baseType: !161, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !158, file: !99, line: 102, baseType: !164, size: 32, offset: 128)
!164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !158, file: !99, line: 102, baseType: !164, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !158, file: !99, line: 103, baseType: !164, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !158, file: !99, line: 103, baseType: !164, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !99, line: 104, baseType: !169, size: 512, offset: 256)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 512, elements: !171)
!170 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !{!172}
!172 = !DISubrange(count: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !158, file: !99, line: 107, baseType: !174, size: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !176, line: 40, flags: DIFlagFwdDecl)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !158, file: !99, line: 109, baseType: !178, size: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !154, file: !99, line: 1351, baseType: !169, size: 512, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !154, file: !99, line: 1352, baseType: !181, size: 32, offset: 1408)
!181 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "offset_fac", scope: !154, file: !99, line: 1353, baseType: !181, size: 32, offset: 1440)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "offset_fac_vg", scope: !154, file: !99, line: 1354, baseType: !181, size: 32, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "crease_weight", scope: !154, file: !99, line: 1355, baseType: !181, size: 32, offset: 1504)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !99, line: 1356, baseType: !186, size: 16, offset: 1536)
!186 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mat_ofs", scope: !154, file: !99, line: 1356, baseType: !186, size: 16, offset: 1552)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !99, line: 1357, baseType: !189, size: 32, offset: 1568)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 32, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 2)
!192 = !{!0}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !195)
!195 = !{!196, !200, !201, !202, !204, !206, !210, !1049, !1056, !1062, !1066, !1070, !1074, !1078, !1084, !1085, !1089, !1097, !1101, !1102, !1111, !1120}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !6, line: 123, baseType: !197, size: 256)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 256, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !194, file: !6, line: 128, baseType: !197, size: 256, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !194, file: !6, line: 131, baseType: !164, size: 32, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !6, line: 133, baseType: !203, size: 32, offset: 544)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !6, line: 134, baseType: !205, size: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !194, file: !6, line: 142, baseType: !207, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !161, !161}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !194, file: !6, line: 151, baseType: !211, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !161, !214, !513, !814, !164, !1048}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !216, line: 115, size: 11392, elements: !217)
!216 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!217 = !{!218, !284, !288, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !305, !316, !330, !331, !374, !375, !378, !379, !395, !396, !397, !398, !399, !400, !401, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !420, !421, !422, !423, !424, !425, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !485, !486, !487, !488, !489, !490, !491, !492, !493, !496, !499, !502, !503, !504, !505, !506, !509, !512, !995, !996, !1002, !1003, !1004, !1005, !1006, !1007, !1009, !1012, !1015, !1017, !1036, !1037}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !215, file: !216, line: 116, baseType: !219, size: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !220, line: 130, baseType: !221)
!220 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !220, line: 117, size: 960, elements: !222)
!222 = !{!223, !225, !226, !228, !247, !251, !252, !253, !254, !255}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !220, line: 118, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !221, file: !220, line: 118, baseType: !224, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !221, file: !220, line: 119, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !221, file: !220, line: 120, baseType: !229, size: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !220, line: 136, size: 17600, elements: !231)
!231 = !{!232, !233, !235, !238, !242, !243, !244}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !230, file: !220, line: 137, baseType: !219, size: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !230, file: !220, line: 138, baseType: !234, size: 64, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !230, file: !220, line: 139, baseType: !236, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !220, line: 43, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !220, line: 140, baseType: !239, size: 8192, offset: 1088)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 8192, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !230, file: !220, line: 141, baseType: !239, size: 8192, offset: 9280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !230, file: !220, line: 148, baseType: !229, size: 64, offset: 17472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !230, file: !220, line: 150, baseType: !245, size: 64, offset: 17536)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !220, line: 45, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !221, file: !220, line: 121, baseType: !248, size: 528, offset: 256)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 528, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 66)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !220, line: 126, baseType: !186, size: 16, offset: 784)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !221, file: !220, line: 127, baseType: !164, size: 32, offset: 800)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !221, file: !220, line: 128, baseType: !164, size: 32, offset: 832)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !221, file: !220, line: 128, baseType: !164, size: 32, offset: 864)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !221, file: !220, line: 129, baseType: !256, size: 64, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !220, line: 75, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !220, line: 62, size: 1024, elements: !259)
!259 = !{!260, !262, !263, !264, !265, !266, !267, !268, !282, !283}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !220, line: 63, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !258, file: !220, line: 63, baseType: !261, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !220, line: 64, baseType: !170, size: 8, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !258, file: !220, line: 64, baseType: !170, size: 8, offset: 136)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !258, file: !220, line: 65, baseType: !186, size: 16, offset: 144)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !220, line: 66, baseType: !169, size: 512, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !258, file: !220, line: 67, baseType: !164, size: 32, offset: 672)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !220, line: 69, baseType: !269, size: 256, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !220, line: 60, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !220, line: 48, size: 256, elements: !271)
!271 = !{!272, !273, !280, !281}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !270, file: !220, line: 49, baseType: !224, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !270, file: !220, line: 58, baseType: !274, size: 128, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !275, line: 71, baseType: !276)
!275 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !275, line: 69, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !276, file: !275, line: 70, baseType: !224, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !276, file: !275, line: 70, baseType: !224, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !270, file: !220, line: 59, baseType: !164, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !270, file: !220, line: 59, baseType: !164, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !220, line: 70, baseType: !164, size: 32, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !258, file: !220, line: 74, baseType: !164, size: 32, offset: 992)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !215, file: !216, line: 117, baseType: !285, size: 64, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !287, line: 45, flags: DIFlagFwdDecl)
!287 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !215, file: !216, line: 119, baseType: !289, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !216, line: 57, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !216, line: 121, baseType: !186, size: 16, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !215, file: !216, line: 121, baseType: !186, size: 16, offset: 1104)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !215, file: !216, line: 122, baseType: !164, size: 32, offset: 1120)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !215, file: !216, line: 122, baseType: !164, size: 32, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !215, file: !216, line: 122, baseType: !164, size: 32, offset: 1184)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !215, file: !216, line: 123, baseType: !169, size: 512, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !215, file: !216, line: 124, baseType: !214, size: 64, offset: 1728)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !215, file: !216, line: 124, baseType: !214, size: 64, offset: 1792)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !215, file: !216, line: 127, baseType: !214, size: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !215, file: !216, line: 127, baseType: !214, size: 64, offset: 1920)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !215, file: !216, line: 127, baseType: !214, size: 64, offset: 1984)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !215, file: !216, line: 128, baseType: !303, size: 64, offset: 2048)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !287, line: 46, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !215, file: !216, line: 130, baseType: !306, size: 64, offset: 2112)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !216, line: 97, size: 832, elements: !308)
!308 = !{!309, !314, !315}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !307, file: !216, line: 98, baseType: !310, size: 768)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 768, elements: !311)
!311 = !{!312, !313}
!312 = !DISubrange(count: 8)
!313 = !DISubrange(count: 3)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !307, file: !216, line: 99, baseType: !164, size: 32, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !307, file: !216, line: 99, baseType: !164, size: 32, offset: 800)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !215, file: !216, line: 131, baseType: !317, size: 64, offset: 2176)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !319, line: 486, size: 1600, elements: !320)
!319 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !318, file: !319, line: 487, baseType: !219, size: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !318, file: !319, line: 489, baseType: !274, size: 128, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !318, file: !319, line: 490, baseType: !274, size: 128, offset: 1088)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !318, file: !319, line: 491, baseType: !274, size: 128, offset: 1216)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !318, file: !319, line: 492, baseType: !274, size: 128, offset: 1344)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !319, line: 494, baseType: !164, size: 32, offset: 1472)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !318, file: !319, line: 495, baseType: !164, size: 32, offset: 1504)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !318, file: !319, line: 497, baseType: !164, size: 32, offset: 1536)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !318, file: !319, line: 498, baseType: !164, size: 32, offset: 1568)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !215, file: !216, line: 132, baseType: !317, size: 64, offset: 2240)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !215, file: !216, line: 133, baseType: !332, size: 64, offset: 2304)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !319, line: 334, size: 1728, elements: !334)
!334 = !{!335, !336, !339, !340, !341, !342, !343, !344, !347, !348, !349, !350, !351, !352, !353, !373}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !333, file: !319, line: 335, baseType: !274, size: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !333, file: !319, line: 336, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !319, line: 47, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !319, line: 338, baseType: !186, size: 16, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !333, file: !319, line: 338, baseType: !186, size: 16, offset: 208)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !333, file: !319, line: 339, baseType: !7, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !333, file: !319, line: 340, baseType: !164, size: 32, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !333, file: !319, line: 342, baseType: !181, size: 32, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !333, file: !319, line: 343, baseType: !345, size: 96, offset: 320)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 96, elements: !346)
!346 = !{!313}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !333, file: !319, line: 344, baseType: !345, size: 96, offset: 416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !333, file: !319, line: 347, baseType: !274, size: 128, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !333, file: !319, line: 349, baseType: !164, size: 32, offset: 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !333, file: !319, line: 350, baseType: !164, size: 32, offset: 672)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !333, file: !319, line: 351, baseType: !224, size: 64, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !333, file: !319, line: 352, baseType: !224, size: 64, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !333, file: !319, line: 354, baseType: !354, size: 384, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !319, line: 116, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !319, line: 94, size: 384, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !355, file: !319, line: 96, baseType: !164, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !355, file: !319, line: 96, baseType: !164, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !355, file: !319, line: 97, baseType: !164, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !355, file: !319, line: 97, baseType: !164, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !355, file: !319, line: 99, baseType: !186, size: 16, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !355, file: !319, line: 100, baseType: !186, size: 16, offset: 144)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !355, file: !319, line: 102, baseType: !186, size: 16, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !355, file: !319, line: 105, baseType: !186, size: 16, offset: 176)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !355, file: !319, line: 108, baseType: !186, size: 16, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !355, file: !319, line: 109, baseType: !186, size: 16, offset: 208)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !355, file: !319, line: 111, baseType: !186, size: 16, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !355, file: !319, line: 112, baseType: !186, size: 16, offset: 240)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !355, file: !319, line: 114, baseType: !164, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !355, file: !319, line: 114, baseType: !164, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !355, file: !319, line: 115, baseType: !164, size: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !355, file: !319, line: 115, baseType: !164, size: 32, offset: 352)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !333, file: !319, line: 355, baseType: !169, size: 512, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !216, line: 134, baseType: !224, size: 64, offset: 2368)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !215, file: !216, line: 136, baseType: !376, size: 64, offset: 2432)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !216, line: 58, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !215, file: !216, line: 138, baseType: !354, size: 384, offset: 2496)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !215, file: !216, line: 139, baseType: !380, size: 64, offset: 2880)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !319, line: 80, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !319, line: 72, size: 192, elements: !383)
!383 = !{!384, !391, !392, !393, !394}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !382, file: !319, line: 73, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !319, line: 59, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !319, line: 56, size: 128, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !387, file: !319, line: 57, baseType: !345, size: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !319, line: 58, baseType: !164, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !382, file: !319, line: 74, baseType: !164, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !382, file: !319, line: 76, baseType: !164, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !382, file: !319, line: 77, baseType: !164, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !382, file: !319, line: 79, baseType: !164, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !215, file: !216, line: 141, baseType: !274, size: 128, offset: 2944)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !215, file: !216, line: 142, baseType: !274, size: 128, offset: 3072)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !215, file: !216, line: 143, baseType: !274, size: 128, offset: 3200)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !215, file: !216, line: 144, baseType: !274, size: 128, offset: 3328)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !215, file: !216, line: 146, baseType: !164, size: 32, offset: 3456)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !215, file: !216, line: 147, baseType: !164, size: 32, offset: 3488)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !215, file: !216, line: 150, baseType: !402, size: 64, offset: 3520)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !216, line: 50, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !215, file: !216, line: 151, baseType: !178, size: 64, offset: 3584)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !215, file: !216, line: 152, baseType: !164, size: 32, offset: 3648)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !215, file: !216, line: 153, baseType: !164, size: 32, offset: 3680)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !215, file: !216, line: 156, baseType: !345, size: 96, offset: 3712)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !215, file: !216, line: 156, baseType: !345, size: 96, offset: 3808)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !215, file: !216, line: 156, baseType: !345, size: 96, offset: 3904)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !216, line: 157, baseType: !345, size: 96, offset: 4000)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !215, file: !216, line: 158, baseType: !345, size: 96, offset: 4096)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !215, file: !216, line: 159, baseType: !345, size: 96, offset: 4192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !215, file: !216, line: 160, baseType: !345, size: 96, offset: 4288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !215, file: !216, line: 160, baseType: !345, size: 96, offset: 4384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !215, file: !216, line: 161, baseType: !417, size: 128, offset: 4480)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 4)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !215, file: !216, line: 161, baseType: !417, size: 128, offset: 4608)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !215, file: !216, line: 162, baseType: !345, size: 96, offset: 4736)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !215, file: !216, line: 162, baseType: !345, size: 96, offset: 4832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !215, file: !216, line: 163, baseType: !181, size: 32, offset: 4928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !215, file: !216, line: 163, baseType: !181, size: 32, offset: 4960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !215, file: !216, line: 164, baseType: !426, size: 512, offset: 4992)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 512, elements: !427)
!427 = !{!419, !419}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !215, file: !216, line: 165, baseType: !426, size: 512, offset: 5504)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !215, file: !216, line: 166, baseType: !426, size: 512, offset: 6016)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !215, file: !216, line: 167, baseType: !426, size: 512, offset: 6528)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !215, file: !216, line: 176, baseType: !426, size: 512, offset: 7040)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !215, file: !216, line: 178, baseType: !7, size: 32, offset: 7552)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !216, line: 180, baseType: !186, size: 16, offset: 7584)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !215, file: !216, line: 181, baseType: !186, size: 16, offset: 7600)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !215, file: !216, line: 183, baseType: !186, size: 16, offset: 7616)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !215, file: !216, line: 183, baseType: !186, size: 16, offset: 7632)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !215, file: !216, line: 184, baseType: !186, size: 16, offset: 7648)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !215, file: !216, line: 184, baseType: !186, size: 16, offset: 7664)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !215, file: !216, line: 185, baseType: !186, size: 16, offset: 7680)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !215, file: !216, line: 186, baseType: !186, size: 16, offset: 7696)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !215, file: !216, line: 187, baseType: !186, size: 16, offset: 7712)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !215, file: !216, line: 188, baseType: !170, size: 8, offset: 7728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !215, file: !216, line: 189, baseType: !170, size: 8, offset: 7736)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !215, file: !216, line: 192, baseType: !164, size: 32, offset: 7744)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !215, file: !216, line: 192, baseType: !164, size: 32, offset: 7776)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !215, file: !216, line: 192, baseType: !164, size: 32, offset: 7808)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !215, file: !216, line: 192, baseType: !164, size: 32, offset: 7840)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !216, line: 194, baseType: !164, size: 32, offset: 7872)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !215, file: !216, line: 202, baseType: !181, size: 32, offset: 7904)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !215, file: !216, line: 202, baseType: !181, size: 32, offset: 7936)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !215, file: !216, line: 202, baseType: !181, size: 32, offset: 7968)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !215, file: !216, line: 211, baseType: !181, size: 32, offset: 8000)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !215, file: !216, line: 212, baseType: !181, size: 32, offset: 8032)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !215, file: !216, line: 213, baseType: !181, size: 32, offset: 8064)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !215, file: !216, line: 214, baseType: !181, size: 32, offset: 8096)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !215, file: !216, line: 215, baseType: !181, size: 32, offset: 8128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !215, file: !216, line: 216, baseType: !181, size: 32, offset: 8160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !215, file: !216, line: 219, baseType: !181, size: 32, offset: 8192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !215, file: !216, line: 220, baseType: !181, size: 32, offset: 8224)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !215, file: !216, line: 221, baseType: !181, size: 32, offset: 8256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !215, file: !216, line: 224, baseType: !462, size: 16, offset: 8288)
!462 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !215, file: !216, line: 224, baseType: !462, size: 16, offset: 8304)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !215, file: !216, line: 226, baseType: !186, size: 16, offset: 8320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !215, file: !216, line: 228, baseType: !170, size: 8, offset: 8336)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !215, file: !216, line: 229, baseType: !170, size: 8, offset: 8344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !215, file: !216, line: 231, baseType: !186, size: 16, offset: 8352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !215, file: !216, line: 232, baseType: !170, size: 8, offset: 8368)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !215, file: !216, line: 233, baseType: !170, size: 8, offset: 8376)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !215, file: !216, line: 234, baseType: !181, size: 32, offset: 8384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !215, file: !216, line: 235, baseType: !181, size: 32, offset: 8416)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !215, file: !216, line: 237, baseType: !274, size: 128, offset: 8448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !215, file: !216, line: 238, baseType: !274, size: 128, offset: 8576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !215, file: !216, line: 239, baseType: !274, size: 128, offset: 8704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !215, file: !216, line: 240, baseType: !274, size: 128, offset: 8832)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !215, file: !216, line: 242, baseType: !181, size: 32, offset: 8960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !215, file: !216, line: 244, baseType: !186, size: 16, offset: 8992)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !215, file: !216, line: 245, baseType: !462, size: 16, offset: 9008)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !215, file: !216, line: 246, baseType: !417, size: 128, offset: 9024)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !215, file: !216, line: 248, baseType: !164, size: 32, offset: 9152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !215, file: !216, line: 249, baseType: !164, size: 32, offset: 9184)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !215, file: !216, line: 251, baseType: !483, size: 64, offset: 9216)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !216, line: 251, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !215, file: !216, line: 253, baseType: !170, size: 8, offset: 9280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !215, file: !216, line: 254, baseType: !170, size: 8, offset: 9288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !215, file: !216, line: 255, baseType: !186, size: 16, offset: 9296)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !215, file: !216, line: 256, baseType: !345, size: 96, offset: 9312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !215, file: !216, line: 258, baseType: !274, size: 128, offset: 9408)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !215, file: !216, line: 259, baseType: !274, size: 128, offset: 9536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !215, file: !216, line: 260, baseType: !274, size: 128, offset: 9664)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !215, file: !216, line: 261, baseType: !274, size: 128, offset: 9792)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !215, file: !216, line: 263, baseType: !494, size: 64, offset: 9920)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !216, line: 52, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !215, file: !216, line: 264, baseType: !497, size: 64, offset: 9984)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !216, line: 53, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !215, file: !216, line: 265, baseType: !500, size: 64, offset: 10048)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !319, line: 46, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !215, file: !216, line: 267, baseType: !170, size: 8, offset: 10112)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !215, file: !216, line: 268, baseType: !170, size: 8, offset: 10120)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !215, file: !216, line: 269, baseType: !186, size: 16, offset: 10128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !215, file: !216, line: 270, baseType: !181, size: 32, offset: 10144)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !215, file: !216, line: 272, baseType: !507, size: 64, offset: 10176)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !216, line: 54, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !215, file: !216, line: 275, baseType: !510, size: 64, offset: 10240)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !216, line: 275, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !215, file: !216, line: 277, baseType: !513, size: 64, offset: 10304)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !515)
!515 = !{!516, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !567, !570, !572, !573, !575, !576, !577, !578, !584, !589, !590, !594, !595, !596, !597, !598, !611, !623, !637, !641, !645, !649, !658, !670, !674, !678, !682, !686, !690, !691, !692, !693, !694, !695, !699, !700, !701, !702, !706, !707, !708, !709, !710, !715, !716, !717, !718, !719, !723, !724, !725, !726, !727, !734, !745, !750, !756, !766, !772, !783, !790, !797, !801, !806, !810, !815, !816, !817, !824, !830, !831, !832, !837, !838, !847, !952, !956, !964, !968, !972, !976, !984, !994}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !514, file: !28, line: 180, baseType: !517, size: 1600)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !108, line: 73, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !108, line: 64, size: 1600, elements: !519)
!519 = !{!520, !535, !539, !540, !541, !542, !545}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !518, file: !108, line: 65, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !108, line: 53, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !108, line: 42, size: 832, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !108, line: 43, baseType: !164, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !523, file: !108, line: 44, baseType: !164, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !523, file: !108, line: 45, baseType: !164, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !523, file: !108, line: 46, baseType: !164, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !523, file: !108, line: 47, baseType: !164, size: 32, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !523, file: !108, line: 48, baseType: !164, size: 32, offset: 160)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !523, file: !108, line: 49, baseType: !164, size: 32, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !523, file: !108, line: 50, baseType: !164, size: 32, offset: 224)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !523, file: !108, line: 51, baseType: !169, size: 512, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !523, file: !108, line: 52, baseType: !224, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !518, file: !108, line: 66, baseType: !536, size: 1312, offset: 64)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1312, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 41)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !518, file: !108, line: 69, baseType: !164, size: 32, offset: 1376)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !518, file: !108, line: 69, baseType: !164, size: 32, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !518, file: !108, line: 70, baseType: !164, size: 32, offset: 1440)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !518, file: !108, line: 71, baseType: !543, size: 64, offset: 1472)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !108, line: 71, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !518, file: !108, line: 72, baseType: !546, size: 64, offset: 1536)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !108, line: 59, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !108, line: 57, size: 8192, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !548, file: !108, line: 58, baseType: !239, size: 8192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !514, file: !28, line: 180, baseType: !517, size: 1600, offset: 1600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !514, file: !28, line: 180, baseType: !517, size: 1600, offset: 3200)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !514, file: !28, line: 180, baseType: !517, size: 1600, offset: 4800)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !514, file: !28, line: 180, baseType: !517, size: 1600, offset: 6400)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !514, file: !28, line: 181, baseType: !164, size: 32, offset: 8000)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !514, file: !28, line: 181, baseType: !164, size: 32, offset: 8032)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !514, file: !28, line: 181, baseType: !164, size: 32, offset: 8064)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !514, file: !28, line: 181, baseType: !164, size: 32, offset: 8096)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !514, file: !28, line: 181, baseType: !164, size: 32, offset: 8128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !514, file: !28, line: 182, baseType: !164, size: 32, offset: 8160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !514, file: !28, line: 183, baseType: !164, size: 32, offset: 8192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !514, file: !28, line: 184, baseType: !563, size: 64, offset: 8256)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !564, line: 124, baseType: !565)
!564 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !564, line: 124, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !514, file: !28, line: 185, baseType: !568, size: 64, offset: 8320)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !28, line: 186, baseType: !571, size: 32, offset: 8384)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !514, file: !28, line: 187, baseType: !181, size: 32, offset: 8416)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !514, file: !28, line: 188, baseType: !574, size: 32, offset: 8448)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !514, file: !28, line: 189, baseType: !164, size: 32, offset: 8480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !514, file: !28, line: 190, baseType: !402, size: 64, offset: 8512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !514, file: !28, line: 193, baseType: !170, size: 8, offset: 8576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !514, file: !28, line: 196, baseType: !579, size: 64, offset: 8640)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !514)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !514, file: !28, line: 199, baseType: !585, size: 64, offset: 8704)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !582, !588}
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !514, file: !28, line: 202, baseType: !579, size: 64, offset: 8768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !514, file: !28, line: 207, baseType: !591, size: 64, offset: 8832)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!164, !582}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !514, file: !28, line: 208, baseType: !591, size: 64, offset: 8896)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !514, file: !28, line: 209, baseType: !591, size: 64, offset: 8960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !514, file: !28, line: 210, baseType: !591, size: 64, offset: 9024)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !514, file: !28, line: 211, baseType: !591, size: 64, offset: 9088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !514, file: !28, line: 218, baseType: !599, size: 64, offset: 9152)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !582, !164, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !604, line: 65, size: 160, elements: !605)
!604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = !{!606, !607, !609, !610}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !603, file: !604, line: 66, baseType: !345, size: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !603, file: !604, line: 67, baseType: !608, size: 48, offset: 96)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 48, elements: !346)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !603, file: !604, line: 68, baseType: !170, size: 8, offset: 144)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !603, file: !604, line: 68, baseType: !170, size: 8, offset: 152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !514, file: !28, line: 219, baseType: !612, size: 64, offset: 9216)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !582, !164, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !604, line: 48, size: 96, elements: !617)
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !616, file: !604, line: 49, baseType: !7, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !616, file: !604, line: 49, baseType: !7, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !616, file: !604, line: 50, baseType: !170, size: 8, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !616, file: !604, line: 50, baseType: !170, size: 8, offset: 72)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !616, file: !604, line: 51, baseType: !186, size: 16, offset: 80)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !514, file: !28, line: 220, baseType: !624, size: 64, offset: 9280)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !582, !164, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !604, line: 42, size: 160, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !628, file: !604, line: 43, baseType: !7, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !628, file: !604, line: 43, baseType: !7, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !628, file: !604, line: 43, baseType: !7, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !628, file: !604, line: 43, baseType: !7, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !628, file: !604, line: 44, baseType: !186, size: 16, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !628, file: !604, line: 45, baseType: !170, size: 8, offset: 144)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !604, line: 45, baseType: !170, size: 8, offset: 152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !514, file: !28, line: 227, baseType: !638, size: 64, offset: 9344)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!602, !582}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !514, file: !28, line: 228, baseType: !642, size: 64, offset: 9408)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!615, !582}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !514, file: !28, line: 229, baseType: !646, size: 64, offset: 9472)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!627, !582}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !514, file: !28, line: 230, baseType: !650, size: 64, offset: 9536)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!653, !582}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !604, line: 88, size: 64, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !654, file: !604, line: 89, baseType: !7, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !654, file: !604, line: 90, baseType: !7, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !514, file: !28, line: 231, baseType: !659, size: 64, offset: 9600)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !582}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !604, line: 79, size: 96, elements: !664)
!664 = !{!665, !666, !667, !668, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !663, file: !604, line: 81, baseType: !164, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !663, file: !604, line: 82, baseType: !164, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !663, file: !604, line: 83, baseType: !186, size: 16, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !604, line: 84, baseType: !170, size: 8, offset: 80)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !663, file: !604, line: 84, baseType: !170, size: 8, offset: 88)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !514, file: !28, line: 236, baseType: !671, size: 64, offset: 9664)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !582, !602}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !514, file: !28, line: 237, baseType: !675, size: 64, offset: 9728)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !582, !615}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !514, file: !28, line: 238, baseType: !679, size: 64, offset: 9792)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !582, !627}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !514, file: !28, line: 239, baseType: !683, size: 64, offset: 9856)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !582, !653}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !514, file: !28, line: 240, baseType: !687, size: 64, offset: 9920)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !582, !662}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !514, file: !28, line: 245, baseType: !638, size: 64, offset: 9984)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !514, file: !28, line: 246, baseType: !642, size: 64, offset: 10048)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !514, file: !28, line: 247, baseType: !646, size: 64, offset: 10112)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !514, file: !28, line: 248, baseType: !650, size: 64, offset: 10176)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !514, file: !28, line: 249, baseType: !659, size: 64, offset: 10240)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !514, file: !28, line: 255, baseType: !696, size: 64, offset: 10304)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!224, !582, !164, !164}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !514, file: !28, line: 256, baseType: !696, size: 64, offset: 10368)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !514, file: !28, line: 257, baseType: !696, size: 64, offset: 10432)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !514, file: !28, line: 258, baseType: !696, size: 64, offset: 10496)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !514, file: !28, line: 264, baseType: !703, size: 64, offset: 10560)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!224, !582, !164}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !514, file: !28, line: 265, baseType: !703, size: 64, offset: 10624)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !514, file: !28, line: 266, baseType: !703, size: 64, offset: 10688)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !514, file: !28, line: 267, baseType: !703, size: 64, offset: 10752)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !514, file: !28, line: 268, baseType: !703, size: 64, offset: 10816)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !514, file: !28, line: 272, baseType: !711, size: 64, offset: 10880)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!714, !582}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !514, file: !28, line: 273, baseType: !711, size: 64, offset: 10944)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !514, file: !28, line: 274, baseType: !711, size: 64, offset: 11008)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !514, file: !28, line: 275, baseType: !711, size: 64, offset: 11072)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !514, file: !28, line: 276, baseType: !711, size: 64, offset: 11136)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !514, file: !28, line: 279, baseType: !720, size: 64, offset: 11200)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !582, !164, !714, !164}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !514, file: !28, line: 280, baseType: !720, size: 64, offset: 11264)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !514, file: !28, line: 281, baseType: !720, size: 64, offset: 11328)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !514, file: !28, line: 284, baseType: !591, size: 64, offset: 11392)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !514, file: !28, line: 285, baseType: !591, size: 64, offset: 11456)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !514, file: !28, line: 286, baseType: !728, size: 64, offset: 11520)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !582}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !514, file: !28, line: 287, baseType: !735, size: 64, offset: 11584)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!738, !582}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !741)
!741 = !{!742, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !740, file: !28, line: 118, baseType: !743, size: 128)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !418)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !740, file: !28, line: 119, baseType: !743, size: 128, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !514, file: !28, line: 288, baseType: !746, size: 64, offset: 11648)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!749, !582}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !514, file: !28, line: 289, baseType: !751, size: 64, offset: 11712)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !582, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !514, file: !28, line: 290, baseType: !757, size: 64, offset: 11776)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!760, !582}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !762, file: !28, line: 124, baseType: !186, size: 16)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !28, line: 125, baseType: !170, size: 8, offset: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !514, file: !28, line: 291, baseType: !767, size: 64, offset: 11840)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!770, !582}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !514, file: !28, line: 299, baseType: !773, size: 64, offset: 11904)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !582, !776, !224, !782}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !224, !164, !779, !779, !780}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !514, file: !28, line: 309, baseType: !784, size: 64, offset: 11968)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !582, !787, !224}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !224, !164, !779, !779}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !514, file: !28, line: 317, baseType: !791, size: 64, offset: 12032)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !582, !794, !224, !782}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !224, !164, !164, !779, !779}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !514, file: !28, line: 327, baseType: !798, size: 64, offset: 12096)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !582, !787, !224, !782}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !514, file: !28, line: 337, baseType: !802, size: 64, offset: 12160)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !582, !805, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !514, file: !28, line: 344, baseType: !807, size: 64, offset: 12224)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !582, !164, !805}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !514, file: !28, line: 347, baseType: !811, size: 64, offset: 12288)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !582, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !514, file: !28, line: 350, baseType: !807, size: 64, offset: 12352)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !514, file: !28, line: 351, baseType: !807, size: 64, offset: 12416)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !514, file: !28, line: 355, baseType: !818, size: 64, offset: 12480)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!821, !214, !582}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !514, file: !28, line: 359, baseType: !825, size: 64, offset: 12544)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!828, !214, !582}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !514, file: !28, line: 364, baseType: !579, size: 64, offset: 12608)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !514, file: !28, line: 367, baseType: !579, size: 64, offset: 12672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !514, file: !28, line: 373, baseType: !833, size: 64, offset: 12736)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !582, !836, !836}
!836 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !514, file: !28, line: 376, baseType: !579, size: 64, offset: 12800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !514, file: !28, line: 385, baseType: !839, size: 64, offset: 12864)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !582, !842, !836, !843}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!164, !164, !224}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !514, file: !28, line: 391, baseType: !848, size: 64, offset: 12928)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !582, !851, !947, !224, !951}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!855, !856, !946, !164}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !604, line: 160, size: 384, elements: !858)
!858 = !{!859, !862, !941, !942, !943, !944, !945}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !857, file: !604, line: 161, baseType: !860, size: 256)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 256, elements: !861)
!861 = !{!419, !191}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !857, file: !604, line: 162, baseType: !863, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !176, line: 77, size: 15424, elements: !865)
!865 = !{!866, !867, !868, !871, !874, !877, !880, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !930, !931, !935}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !864, file: !176, line: 78, baseType: !219, size: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !864, file: !176, line: 80, baseType: !239, size: 8192, offset: 960)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !864, file: !176, line: 82, baseType: !869, size: 64, offset: 9152)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !176, line: 43, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !864, file: !176, line: 83, baseType: !872, size: 64, offset: 9216)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !220, line: 46, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !864, file: !176, line: 86, baseType: !875, size: 64, offset: 9280)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !176, line: 41, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !864, file: !176, line: 87, baseType: !878, size: 64, offset: 9344)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !176, line: 44, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !864, file: !176, line: 89, baseType: !881, size: 512, offset: 9408)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 512, elements: !882)
!882 = !{!312}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !864, file: !176, line: 90, baseType: !186, size: 16, offset: 9920)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !864, file: !176, line: 90, baseType: !186, size: 16, offset: 9936)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !864, file: !176, line: 92, baseType: !186, size: 16, offset: 9952)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !864, file: !176, line: 92, baseType: !186, size: 16, offset: 9968)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !864, file: !176, line: 93, baseType: !186, size: 16, offset: 9984)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !864, file: !176, line: 93, baseType: !186, size: 16, offset: 10000)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !864, file: !176, line: 94, baseType: !164, size: 32, offset: 10016)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !864, file: !176, line: 97, baseType: !186, size: 16, offset: 10048)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !864, file: !176, line: 97, baseType: !186, size: 16, offset: 10064)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !864, file: !176, line: 98, baseType: !186, size: 16, offset: 10080)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !864, file: !176, line: 98, baseType: !186, size: 16, offset: 10096)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !864, file: !176, line: 99, baseType: !186, size: 16, offset: 10112)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !864, file: !176, line: 99, baseType: !186, size: 16, offset: 10128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !864, file: !176, line: 100, baseType: !7, size: 32, offset: 10144)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !864, file: !176, line: 101, baseType: !771, size: 64, offset: 10176)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !864, file: !176, line: 103, baseType: !245, size: 64, offset: 10240)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !864, file: !176, line: 104, baseType: !900, size: 64, offset: 10304)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !220, line: 159, size: 448, elements: !902)
!902 = !{!903, !905, !906, !907, !908, !910}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !901, file: !220, line: 161, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !190)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !901, file: !220, line: 162, baseType: !904, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !901, file: !220, line: 163, baseType: !189, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !901, file: !220, line: 164, baseType: !189, size: 32, offset: 160)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !901, file: !220, line: 165, baseType: !909, size: 128, offset: 192)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 128, elements: !190)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !901, file: !220, line: 166, baseType: !911, size: 128, offset: 320)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 128, elements: !190)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !864, file: !176, line: 107, baseType: !181, size: 32, offset: 10368)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !864, file: !176, line: 108, baseType: !164, size: 32, offset: 10400)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !864, file: !176, line: 109, baseType: !186, size: 16, offset: 10432)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !864, file: !176, line: 110, baseType: !186, size: 16, offset: 10448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !864, file: !176, line: 113, baseType: !164, size: 32, offset: 10464)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !864, file: !176, line: 113, baseType: !164, size: 32, offset: 10496)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !864, file: !176, line: 114, baseType: !170, size: 8, offset: 10528)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !864, file: !176, line: 114, baseType: !170, size: 8, offset: 10536)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !864, file: !176, line: 115, baseType: !186, size: 16, offset: 10544)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !864, file: !176, line: 116, baseType: !417, size: 128, offset: 10560)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !864, file: !176, line: 119, baseType: !181, size: 32, offset: 10688)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !864, file: !176, line: 119, baseType: !181, size: 32, offset: 10720)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !864, file: !176, line: 122, baseType: !925, size: 512, offset: 10752)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !926, line: 182, baseType: !927)
!926 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !926, line: 180, size: 512, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !927, file: !926, line: 181, baseType: !169, size: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !864, file: !176, line: 123, baseType: !170, size: 8, offset: 11264)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !864, file: !176, line: 125, baseType: !932, size: 56, offset: 11272)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 56, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 7)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !864, file: !176, line: 126, baseType: !936, size: 4096, offset: 11328)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 4096, elements: !882)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !176, line: 69, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !176, line: 67, size: 512, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !176, line: 68, baseType: !169, size: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !857, file: !604, line: 163, baseType: !170, size: 8, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !857, file: !604, line: 163, baseType: !170, size: 8, offset: 328)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !857, file: !604, line: 164, baseType: !186, size: 16, offset: 336)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !857, file: !604, line: 164, baseType: !186, size: 16, offset: 352)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !857, file: !604, line: 164, baseType: !186, size: 16, offset: 368)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!164, !224, !164, !164}
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !514, file: !28, line: 400, baseType: !953, size: 64, offset: 12992)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !582, !843}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !514, file: !28, line: 415, baseType: !957, size: 64, offset: 13056)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !582, !960, !843, !947, !224, !951}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!855, !224, !164}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !514, file: !28, line: 425, baseType: !965, size: 64, offset: 13120)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !582, !960, !947, !224, !951}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !514, file: !28, line: 435, baseType: !969, size: 64, offset: 13184)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !582, !843, !960, !224}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !514, file: !28, line: 444, baseType: !973, size: 64, offset: 13248)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !582, !960, !224}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !514, file: !28, line: 455, baseType: !977, size: 64, offset: 13312)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !582, !960, !980, !224}
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !224, !164, !181}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !514, file: !28, line: 464, baseType: !985, size: 64, offset: 13376)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !582, !988, !991, !224}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !224, !164, !224}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!836, !224, !164}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !514, file: !28, line: 470, baseType: !579, size: 64, offset: 13440)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !215, file: !216, line: 277, baseType: !513, size: 64, offset: 10368)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !215, file: !216, line: 278, baseType: !997, size: 64, offset: 10432)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !998, line: 27, baseType: !999)
!998 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1000, line: 45, baseType: !1001)
!1000 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1001 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !215, file: !216, line: 279, baseType: !997, size: 64, offset: 10496)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !215, file: !216, line: 280, baseType: !7, size: 32, offset: 10560)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !215, file: !216, line: 281, baseType: !7, size: 32, offset: 10592)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !215, file: !216, line: 283, baseType: !274, size: 128, offset: 10624)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !215, file: !216, line: 284, baseType: !274, size: 128, offset: 10752)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !215, file: !216, line: 285, baseType: !1008, size: 64, offset: 10880)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !215, file: !216, line: 287, baseType: !1010, size: 64, offset: 10944)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !216, line: 59, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !215, file: !216, line: 288, baseType: !1013, size: 64, offset: 11008)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !216, line: 288, flags: DIFlagFwdDecl)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !215, file: !216, line: 290, baseType: !1016, size: 64, offset: 11072)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 64, elements: !190)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !215, file: !216, line: 291, baseType: !1018, size: 64, offset: 11136)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !176, line: 65, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !176, line: 50, size: 320, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1020, file: !176, line: 51, baseType: !174, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1020, file: !176, line: 53, baseType: !164, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1020, file: !176, line: 54, baseType: !164, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1020, file: !176, line: 55, baseType: !164, size: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1020, file: !176, line: 55, baseType: !164, size: 32, offset: 160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1020, file: !176, line: 56, baseType: !170, size: 8, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1020, file: !176, line: 56, baseType: !170, size: 8, offset: 200)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1020, file: !176, line: 57, baseType: !170, size: 8, offset: 208)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1020, file: !176, line: 57, baseType: !170, size: 8, offset: 216)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1020, file: !176, line: 59, baseType: !186, size: 16, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1020, file: !176, line: 59, baseType: !186, size: 16, offset: 240)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1020, file: !176, line: 59, baseType: !186, size: 16, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1020, file: !176, line: 61, baseType: !186, size: 16, offset: 272)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1020, file: !176, line: 63, baseType: !164, size: 32, offset: 288)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !215, file: !216, line: 293, baseType: !274, size: 128, offset: 11200)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !215, file: !216, line: 294, baseType: !1038, size: 64, offset: 11328)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !216, line: 113, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !216, line: 108, size: 256, elements: !1041)
!1041 = !{!1042, !1044, !1045, !1046, !1047}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !216, line: 109, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1040, file: !216, line: 109, baseType: !1043, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1040, file: !216, line: 110, baseType: !214, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1040, file: !216, line: 111, baseType: !164, size: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1040, file: !216, line: 112, baseType: !181, size: 32, offset: 224)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierApplyFlag", file: !6, line: 118, baseType: !54)
