; ModuleID = 'blender/source/blender/imbuf/intern/jpeg.c'
source_filename = "blender/source/blender/imbuf/intern/jpeg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type { %struct.ImMetaData*, %struct.ImMetaData*, i8*, i8*, i32 }
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type { %struct.ColorSpace*, %struct.ColorSpace*, i32, [64 x i8], [512 x i8], %struct.OCIO_ConstProcessorRcPtr*, %struct.OCIO_ConstProcessorRcPtr*, i8, i8 }
%struct.OCIO_ConstProcessorRcPtr = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ibuf_ftype", scope: !2, file: !3, line: 85, type: !55, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !211, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/imbuf/intern/jpeg.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !15, !20, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 206, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/jpeglib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "JCS_RGB", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "JCS_YCbCr", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "JCS_CMYK", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "JCS_YCCK", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 217, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "JDCT_ISLOW", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "JDCT_IFAST", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "JDCT_FLOAT", value: 2, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 232, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIEnumerator(name: "JDITHER_NONE", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "JDITHER_ORDERED", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "JDITHER_FS", value: 2, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 201, baseType: !7, size: 32, elements: !27)
!26 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31, !32, !33}
!28 = !DIEnumerator(name: "COLOR_ROLE_SCENE_LINEAR", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "COLOR_ROLE_COLOR_PICKING", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "COLOR_ROLE_TEXTURE_PAINTING", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_SEQUENCER", value: 3, isUnsigned: true)
!32 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_BYTE", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_FLOAT", value: 5, isUnsigned: true)
!34 = !{!35, !38, !102, !103, !122, !193, !109, !206, !209, !7, !210}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 46, baseType: !37)
!36 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!37 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_error_ptr", file: !3, line: 103, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_error_mgr", file: !3, line: 101, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "my_error_mgr", file: !3, line: 97, size: 2944, elements: !42)
!42 = !{!43, !80}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !41, file: !3, line: 98, baseType: !44, size: 1344)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !6, line: 643, size: 1344, elements: !45)
!45 = !{!46, !50, !51, !52, !53, !54, !56, !68, !69, !71, !76, !77, !78, !79}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !44, file: !6, line: 645, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, null}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !44, file: !6, line: 647, baseType: !47, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !44, file: !6, line: 649, baseType: !47, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !44, file: !6, line: 651, baseType: !47, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !44, file: !6, line: 654, baseType: !47, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !44, file: !6, line: 659, baseType: !55, size: 32, offset: 320)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !44, file: !6, line: 664, baseType: !57, size: 640, offset: 352)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !44, file: !6, line: 661, size: 640, elements: !58)
!58 = !{!59, !63}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !57, file: !6, line: 662, baseType: !60, size: 256)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 256, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !57, file: !6, line: 663, baseType: !64, size: 640)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 640, elements: !66)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !{!67}
!67 = !DISubrange(count: 80)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !44, file: !6, line: 668, baseType: !55, size: 32, offset: 992)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !44, file: !6, line: 676, baseType: !70, size: 64, offset: 1024)
!70 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !44, file: !6, line: 688, baseType: !72, size: 64, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !44, file: !6, line: 689, baseType: !55, size: 32, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !44, file: !6, line: 693, baseType: !72, size: 64, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !44, file: !6, line: 694, baseType: !55, size: 32, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !44, file: !6, line: 695, baseType: !55, size: 32, offset: 1312)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "setjmp_buffer", scope: !41, file: !3, line: 100, baseType: !81, size: 1600, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !82, line: 45, baseType: !83)
!82 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1600, elements: !100)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !82, line: 33, size: 1600, elements: !85)
!85 = !{!86, !90, !91}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !84, file: !82, line: 39, baseType: !87, size: 512)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !88, line: 31, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, elements: !61)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !84, file: !82, line: 40, baseType: !55, size: 32, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !84, file: !82, line: 41, baseType: !92, size: 1024, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !93, line: 8, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 5, size: 1024, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !94, file: !93, line: 7, baseType: !97, size: 1024)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 16)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !6, line: 725, size: 448, elements: !105)
!105 = !{!106, !112, !113, !114, !119, !120, !121}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !104, file: !6, line: 726, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !110, line: 110, baseType: !111)
!110 = !DIFile(filename: "include/jmorecfg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !104, file: !6, line: 727, baseType: !35, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !104, file: !6, line: 729, baseType: !47, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !104, file: !6, line: 730, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, null}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !110, line: 227, baseType: !55)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !104, file: !6, line: 731, baseType: !47, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !104, file: !6, line: 732, baseType: !115, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !104, file: !6, line: 733, baseType: !47, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !6, line: 261, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !6, line: 253, size: 320, elements: !125)
!125 = !{!126, !128, !181, !190, !191, !192}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !124, file: !6, line: 254, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !124, file: !6, line: 254, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !6, line: 756, size: 832, elements: !131)
!131 = !{!132, !136, !137, !146, !160, !167, !174, !175, !176, !177, !178, !179, !180}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !130, file: !6, line: 758, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!102, null}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !130, file: !6, line: 760, baseType: !133, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !130, file: !6, line: 762, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, null}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !6, line: 67, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !6, line: 66, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !110, line: 59, baseType: !111)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !130, file: !6, line: 765, baseType: !147, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, null}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !6, line: 72, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !6, line: 71, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !6, line: 70, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 1024, elements: !158)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !110, line: 99, baseType: !157)
!157 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!158 = !{!159}
!159 = !DISubrange(count: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !130, file: !6, line: 768, baseType: !161, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, null}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !6, line: 752, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !6, line: 752, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !130, file: !6, line: 774, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, null}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !6, line: 753, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !6, line: 753, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !130, file: !6, line: 780, baseType: !47, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !130, file: !6, line: 781, baseType: !138, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !130, file: !6, line: 786, baseType: !147, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !130, file: !6, line: 791, baseType: !47, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !130, file: !6, line: 792, baseType: !47, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !130, file: !6, line: 799, baseType: !70, size: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "max_alloc_chunk", scope: !130, file: !6, line: 802, baseType: !70, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !124, file: !6, line: 254, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !6, line: 701, size: 256, elements: !184)
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !183, file: !6, line: 702, baseType: !47, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !183, file: !6, line: 704, baseType: !70, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !183, file: !6, line: 705, baseType: !70, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !183, file: !6, line: 706, baseType: !55, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !183, file: !6, line: 707, baseType: !55, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !124, file: !6, line: 254, baseType: !102, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !124, file: !6, line: 254, baseType: !118, size: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !124, file: !6, line: 254, baseType: !55, size: 32, offset: 288)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_src_ptr", file: !3, line: 138, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_source_mgr", file: !3, line: 136, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 130, size: 576, elements: !197)
!197 = !{!198, !199, !201, !202}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !196, file: !3, line: 131, baseType: !104, size: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !196, file: !3, line: 133, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !196, file: !3, line: 134, baseType: !55, size: 32, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "terminal", scope: !196, file: !3, line: 135, baseType: !203, size: 16, offset: 544)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 16, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 2)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !208, line: 78, baseType: !111)
!208 = !DIFile(filename: "blender/source/blender/imbuf/intern/imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!211 = !{!0, !212}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "jpeg_default_quality", scope: !2, file: !3, line: 84, type: !55, isLocal: true, isDefinition: true)
!214 = !{i32 7, !"Dwarf Version", i32 4}
!215 = !{i32 2, !"Debug Info Version", i32 3}
!216 = !{i32 1, !"wchar_size", i32 4}
!217 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!218 = distinct !DISubprogram(name: "imb_is_a_jpeg", scope: !3, file: !3, line: 87, type: !219, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{!55, !200}
!221 = !{}
!222 = !DILocalVariable(name: "mem", arg: 1, scope: !218, file: !3, line: 87, type: !200)
!223 = !DILocation(line: 87, column: 34, scope: !218)
!224 = !DILocation(line: 89, column: 7, scope: !225)
!225 = distinct !DILexicalBlock(scope: !218, file: !3, line: 89, column: 6)
!226 = !DILocation(line: 89, column: 14, scope: !225)
!227 = !DILocation(line: 89, column: 23, scope: !225)
!228 = !DILocation(line: 89, column: 27, scope: !225)
!229 = !DILocation(line: 89, column: 34, scope: !225)
!230 = !DILocation(line: 89, column: 6, scope: !218)
!231 = !DILocation(line: 89, column: 44, scope: !225)
!232 = !DILocation(line: 90, column: 2, scope: !218)
!233 = !DILocation(line: 91, column: 1, scope: !218)
!234 = distinct !DISubprogram(name: "imb_load_jpeg", scope: !3, file: !3, line: 443, type: !235, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !221)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !200, !35, !55, !209}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !239, line: 70, size: 19840, elements: !240)
!239 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !251, !254, !257, !258, !259, !260, !261, !263, !265, !266, !267, !271, !272, !273, !274, !275, !285, !286, !287, !291, !292, !295, !296, !297, !298, !299, !319, !320, !321, !324, !325, !334}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !239, line: 71, baseType: !237, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !239, line: 71, baseType: !237, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !238, file: !239, line: 74, baseType: !55, size: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !238, file: !239, line: 74, baseType: !55, size: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !238, file: !239, line: 79, baseType: !111, size: 8, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !238, file: !239, line: 80, baseType: !55, size: 32, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !238, file: !239, line: 83, baseType: !55, size: 32, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !238, file: !239, line: 84, baseType: !55, size: 32, offset: 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !238, file: !239, line: 87, baseType: !250, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !238, file: !239, line: 88, baseType: !252, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !238, file: !239, line: 93, baseType: !255, size: 128, offset: 448)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 128, elements: !204)
!256 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !238, file: !239, line: 96, baseType: !55, size: 32, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !238, file: !239, line: 96, baseType: !55, size: 32, offset: 608)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !238, file: !239, line: 97, baseType: !55, size: 32, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !238, file: !239, line: 97, baseType: !55, size: 32, offset: 672)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !238, file: !239, line: 98, baseType: !262, size: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !238, file: !239, line: 101, baseType: !264, size: 64, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !238, file: !239, line: 102, baseType: !252, size: 64, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !238, file: !239, line: 105, baseType: !253, size: 32, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !238, file: !239, line: 108, baseType: !268, size: 1280, offset: 960)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 1280, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 20)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !238, file: !239, line: 109, baseType: !55, size: 32, offset: 2240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !238, file: !239, line: 109, baseType: !55, size: 32, offset: 2272)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !238, file: !239, line: 112, baseType: !55, size: 32, offset: 2304)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !238, file: !239, line: 113, baseType: !55, size: 32, offset: 2336)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !238, file: !239, line: 114, baseType: !276, size: 64, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !278, line: 38, size: 320, elements: !279)
!278 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_metadata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !278, line: 39, baseType: !276, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !277, file: !278, line: 39, baseType: !276, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !277, file: !278, line: 40, baseType: !209, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !278, line: 41, baseType: !209, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !277, file: !278, line: 42, baseType: !55, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !238, file: !239, line: 115, baseType: !102, size: 64, offset: 2432)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !238, file: !239, line: 118, baseType: !55, size: 32, offset: 2496)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !239, line: 119, baseType: !288, size: 8192, offset: 2528)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8192, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 1024)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !238, file: !239, line: 120, baseType: !288, size: 8192, offset: 10720)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !238, file: !239, line: 123, baseType: !293, size: 64, offset: 18944)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !239, line: 123, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !238, file: !239, line: 124, baseType: !55, size: 32, offset: 19008)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !238, file: !239, line: 127, baseType: !200, size: 64, offset: 19072)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !238, file: !239, line: 128, baseType: !7, size: 32, offset: 19136)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !238, file: !239, line: 129, baseType: !7, size: 32, offset: 19168)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !238, file: !239, line: 132, baseType: !300, size: 64, offset: 19200)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !302, line: 47, size: 4992, elements: !303)
!302 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_colormanagement_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!303 = !{!304, !305, !306, !307, !309, !313, !316, !317, !318}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !302, line: 48, baseType: !300, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !301, file: !302, line: 48, baseType: !300, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !301, file: !302, line: 49, baseType: !55, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !301, file: !302, line: 50, baseType: !308, size: 512, offset: 160)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !158)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !301, file: !302, line: 51, baseType: !310, size: 4096, offset: 672)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 4096, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "to_scene_linear", scope: !301, file: !302, line: 53, baseType: !314, size: 64, offset: 4800)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "OCIO_ConstProcessorRcPtr", file: !302, line: 41, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "from_scene_linear", scope: !301, file: !302, line: 54, baseType: !314, size: 64, offset: 4864)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "is_invertible", scope: !301, file: !302, line: 56, baseType: !111, size: 8, offset: 4928)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "is_data", scope: !301, file: !302, line: 57, baseType: !111, size: 8, offset: 4936)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !238, file: !239, line: 133, baseType: !300, size: 64, offset: 19264)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !238, file: !239, line: 134, baseType: !250, size: 64, offset: 19328)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !238, file: !239, line: 135, baseType: !322, size: 64, offset: 19392)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !239, line: 135, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !238, file: !239, line: 136, baseType: !55, size: 32, offset: 19456)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !238, file: !239, line: 137, baseType: !326, size: 128, offset: 19488)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !327, line: 89, baseType: !328)
!327 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !327, line: 86, size: 128, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !328, file: !327, line: 87, baseType: !55, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !328, file: !327, line: 87, baseType: !55, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !328, file: !327, line: 88, baseType: !55, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !328, file: !327, line: 88, baseType: !55, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !238, file: !239, line: 140, baseType: !335, size: 192, offset: 19648)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !239, line: 55, size: 192, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !335, file: !239, line: 56, baseType: !7, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !335, file: !239, line: 57, baseType: !7, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !335, file: !239, line: 58, baseType: !200, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !239, line: 59, baseType: !7, size: 32, offset: 128)
!341 = !DILocalVariable(name: "buffer", arg: 1, scope: !234, file: !3, line: 443, type: !200)
!342 = !DILocation(line: 443, column: 37, scope: !234)
!343 = !DILocalVariable(name: "size", arg: 2, scope: !234, file: !3, line: 443, type: !35)
!344 = !DILocation(line: 443, column: 52, scope: !234)
!345 = !DILocalVariable(name: "flags", arg: 3, scope: !234, file: !3, line: 443, type: !55)
!346 = !DILocation(line: 443, column: 62, scope: !234)
!347 = !DILocalVariable(name: "colorspace", arg: 4, scope: !234, file: !3, line: 443, type: !209)
!348 = !DILocation(line: 443, column: 74, scope: !234)
!349 = !DILocalVariable(name: "_cinfo", scope: !234, file: !3, line: 445, type: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !6, line: 411, size: 5056, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !361, !362, !363, !365, !366, !367, !368, !369, !370, !371, !373, !374, !375, !376, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !398, !410, !426, !427, !428, !454, !455, !456, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !480, !481, !482, !483, !484, !485, !486, !488, !489, !490, !491, !495, !496, !497, !498, !499, !500, !503, !506, !509, !512, !515, !518, !521, !524, !527, !530}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !350, file: !6, line: 412, baseType: !127, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !350, file: !6, line: 412, baseType: !129, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !350, file: !6, line: 412, baseType: !182, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !350, file: !6, line: 412, baseType: !102, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !350, file: !6, line: 412, baseType: !118, size: 32, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !350, file: !6, line: 412, baseType: !55, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !350, file: !6, line: 415, baseType: !103, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !350, file: !6, line: 420, baseType: !360, size: 32, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !110, line: 171, baseType: !7)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !350, file: !6, line: 421, baseType: !360, size: 32, offset: 416)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !350, file: !6, line: 422, baseType: !55, size: 32, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !350, file: !6, line: 423, baseType: !364, size: 32, offset: 480)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !6, line: 213, baseType: !5)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !350, file: !6, line: 430, baseType: !364, size: 32, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !350, file: !6, line: 432, baseType: !7, size: 32, offset: 544)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !350, file: !6, line: 432, baseType: !7, size: 32, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !350, file: !6, line: 434, baseType: !256, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !350, file: !6, line: 436, baseType: !118, size: 32, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !350, file: !6, line: 437, baseType: !118, size: 32, offset: 736)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !350, file: !6, line: 439, baseType: !372, size: 32, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !6, line: 221, baseType: !15)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !350, file: !6, line: 440, baseType: !118, size: 32, offset: 800)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !350, file: !6, line: 441, baseType: !118, size: 32, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !350, file: !6, line: 443, baseType: !118, size: 32, offset: 864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !350, file: !6, line: 445, baseType: !377, size: 32, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !6, line: 236, baseType: !20)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !350, file: !6, line: 446, baseType: !118, size: 32, offset: 928)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !350, file: !6, line: 447, baseType: !55, size: 32, offset: 960)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !350, file: !6, line: 449, baseType: !118, size: 32, offset: 992)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !350, file: !6, line: 450, baseType: !118, size: 32, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !350, file: !6, line: 451, baseType: !118, size: 32, offset: 1056)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !350, file: !6, line: 459, baseType: !360, size: 32, offset: 1088)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !350, file: !6, line: 460, baseType: !360, size: 32, offset: 1120)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !350, file: !6, line: 461, baseType: !55, size: 32, offset: 1152)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !350, file: !6, line: 462, baseType: !55, size: 32, offset: 1184)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !350, file: !6, line: 466, baseType: !55, size: 32, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !350, file: !6, line: 478, baseType: !55, size: 32, offset: 1248)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !350, file: !6, line: 479, baseType: !141, size: 64, offset: 1280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !350, file: !6, line: 489, baseType: !360, size: 32, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !350, file: !6, line: 494, baseType: !55, size: 32, offset: 1376)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !350, file: !6, line: 495, baseType: !360, size: 32, offset: 1408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !350, file: !6, line: 501, baseType: !55, size: 32, offset: 1440)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !350, file: !6, line: 502, baseType: !360, size: 32, offset: 1472)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !350, file: !6, line: 511, baseType: !396, size: 64, offset: 1536)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !158)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !350, file: !6, line: 522, baseType: !399, size: 256, offset: 1600)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 256, elements: !408)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !6, line: 95, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 2080, elements: !403)
!403 = !{!404, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !402, file: !6, line: 88, baseType: !405, size: 2048)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 2048, elements: !158)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !110, line: 149, baseType: !7)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !402, file: !6, line: 94, baseType: !118, size: 32, offset: 2048)
!408 = !{!409}
!409 = !DISubrange(count: 4)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !350, file: !6, line: 525, baseType: !411, size: 256, offset: 1856)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 256, elements: !408)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !6, line: 111, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 100, size: 2240, elements: !415)
!415 = !{!416, !421, !425}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !414, file: !6, line: 102, baseType: !417, size: 136)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 136, elements: !419)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !110, line: 135, baseType: !111)
!419 = !{!420}
!420 = !DISubrange(count: 17)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !414, file: !6, line: 104, baseType: !422, size: 2048, offset: 136)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 2048, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !414, file: !6, line: 110, baseType: !118, size: 32, offset: 2208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !350, file: !6, line: 526, baseType: !411, size: 256, offset: 2112)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !350, file: !6, line: 533, baseType: !55, size: 32, offset: 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !350, file: !6, line: 535, baseType: !429, size: 64, offset: 2432)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !6, line: 179, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 116, size: 768, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !431, file: !6, line: 120, baseType: !55, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !431, file: !6, line: 121, baseType: !55, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !431, file: !6, line: 122, baseType: !55, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !431, file: !6, line: 123, baseType: !55, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !431, file: !6, line: 124, baseType: !55, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !431, file: !6, line: 129, baseType: !55, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !431, file: !6, line: 130, baseType: !55, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !431, file: !6, line: 139, baseType: !360, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !431, file: !6, line: 140, baseType: !360, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !431, file: !6, line: 147, baseType: !55, size: 32, offset: 288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !431, file: !6, line: 154, baseType: !360, size: 32, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !431, file: !6, line: 155, baseType: !360, size: 32, offset: 352)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !431, file: !6, line: 160, baseType: !118, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !431, file: !6, line: 164, baseType: !55, size: 32, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !431, file: !6, line: 165, baseType: !55, size: 32, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !431, file: !6, line: 166, baseType: !55, size: 32, offset: 480)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !431, file: !6, line: 167, baseType: !55, size: 32, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !431, file: !6, line: 168, baseType: !55, size: 32, offset: 544)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !431, file: !6, line: 169, baseType: !55, size: 32, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !431, file: !6, line: 175, baseType: !400, size: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !431, file: !6, line: 178, baseType: !102, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !350, file: !6, line: 538, baseType: !118, size: 32, offset: 2496)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !350, file: !6, line: 539, baseType: !118, size: 32, offset: 2528)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !350, file: !6, line: 541, baseType: !457, size: 128, offset: 2560)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 128, elements: !98)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !350, file: !6, line: 542, baseType: !457, size: 128, offset: 2688)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !350, file: !6, line: 543, baseType: !457, size: 128, offset: 2816)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !350, file: !6, line: 545, baseType: !7, size: 32, offset: 2944)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !350, file: !6, line: 550, baseType: !118, size: 32, offset: 2976)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "JFIF_major_version", scope: !350, file: !6, line: 552, baseType: !418, size: 8, offset: 3008)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "JFIF_minor_version", scope: !350, file: !6, line: 553, baseType: !418, size: 8, offset: 3016)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !350, file: !6, line: 554, baseType: !418, size: 8, offset: 3024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !350, file: !6, line: 555, baseType: !406, size: 32, offset: 3040)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !350, file: !6, line: 556, baseType: !406, size: 32, offset: 3072)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !350, file: !6, line: 557, baseType: !118, size: 32, offset: 3104)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !350, file: !6, line: 558, baseType: !418, size: 8, offset: 3136)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !350, file: !6, line: 560, baseType: !118, size: 32, offset: 3168)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "marker_list", scope: !350, file: !6, line: 566, baseType: !471, size: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_saved_marker_ptr", file: !6, line: 193, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_struct", file: !6, line: 195, size: 256, elements: !474)
!474 = !{!475, !476, !477, !478, !479}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !6, line: 196, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !473, file: !6, line: 197, baseType: !418, size: 8, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "original_length", scope: !473, file: !6, line: 198, baseType: !7, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data_length", scope: !473, file: !6, line: 199, baseType: !7, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !473, file: !6, line: 200, baseType: !210, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !350, file: !6, line: 575, baseType: !55, size: 32, offset: 3264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !350, file: !6, line: 576, baseType: !55, size: 32, offset: 3296)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !350, file: !6, line: 578, baseType: !55, size: 32, offset: 3328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !350, file: !6, line: 580, baseType: !360, size: 32, offset: 3360)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !350, file: !6, line: 589, baseType: !144, size: 64, offset: 3392)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !350, file: !6, line: 596, baseType: !55, size: 32, offset: 3456)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !350, file: !6, line: 597, baseType: !487, size: 256, offset: 3520)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 256, elements: !408)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !350, file: !6, line: 600, baseType: !360, size: 32, offset: 3776)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !350, file: !6, line: 601, baseType: !360, size: 32, offset: 3808)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !350, file: !6, line: 603, baseType: !55, size: 32, offset: 3840)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !350, file: !6, line: 604, baseType: !492, size: 320, offset: 3872)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 320, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 10)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !350, file: !6, line: 608, baseType: !55, size: 32, offset: 4192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !350, file: !6, line: 608, baseType: !55, size: 32, offset: 4224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !350, file: !6, line: 608, baseType: !55, size: 32, offset: 4256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !350, file: !6, line: 608, baseType: !55, size: 32, offset: 4288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !350, file: !6, line: 614, baseType: !55, size: 32, offset: 4320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !350, file: !6, line: 619, baseType: !501, size: 64, offset: 4352)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !6, line: 619, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !350, file: !6, line: 620, baseType: !504, size: 64, offset: 4416)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !6, line: 620, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !350, file: !6, line: 621, baseType: !507, size: 64, offset: 4480)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !6, line: 621, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !350, file: !6, line: 622, baseType: !510, size: 64, offset: 4544)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !6, line: 622, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !350, file: !6, line: 623, baseType: !513, size: 64, offset: 4608)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !6, line: 623, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !350, file: !6, line: 624, baseType: !516, size: 64, offset: 4672)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !6, line: 624, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !350, file: !6, line: 625, baseType: !519, size: 64, offset: 4736)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !6, line: 625, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !350, file: !6, line: 626, baseType: !522, size: 64, offset: 4800)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !6, line: 626, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !350, file: !6, line: 627, baseType: !525, size: 64, offset: 4864)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !6, line: 627, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !350, file: !6, line: 628, baseType: !528, size: 64, offset: 4928)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !6, line: 628, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !350, file: !6, line: 629, baseType: !531, size: 64, offset: 4992)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !6, line: 629, flags: DIFlagFwdDecl)
!533 = !DILocation(line: 445, column: 32, scope: !234)
!534 = !DILocalVariable(name: "cinfo", scope: !234, file: !3, line: 445, type: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!536 = !DILocation(line: 445, column: 41, scope: !234)
!537 = !DILocalVariable(name: "jerr", scope: !234, file: !3, line: 446, type: !41)
!538 = !DILocation(line: 446, column: 22, scope: !234)
!539 = !DILocalVariable(name: "ibuf", scope: !234, file: !3, line: 447, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !239, line: 141, baseType: !238)
!542 = !DILocation(line: 447, column: 9, scope: !234)
!543 = !DILocation(line: 449, column: 21, scope: !544)
!544 = distinct !DILexicalBlock(scope: !234, file: !3, line: 449, column: 6)
!545 = !DILocation(line: 449, column: 7, scope: !544)
!546 = !DILocation(line: 449, column: 6, scope: !234)
!547 = !DILocation(line: 449, column: 30, scope: !544)
!548 = !DILocation(line: 451, column: 30, scope: !234)
!549 = !DILocation(line: 451, column: 2, scope: !234)
!550 = !DILocation(line: 453, column: 36, scope: !234)
!551 = !DILocation(line: 453, column: 15, scope: !234)
!552 = !DILocation(line: 453, column: 2, scope: !234)
!553 = !DILocation(line: 453, column: 9, scope: !234)
!554 = !DILocation(line: 453, column: 13, scope: !234)
!555 = !DILocation(line: 454, column: 7, scope: !234)
!556 = !DILocation(line: 454, column: 11, scope: !234)
!557 = !DILocation(line: 454, column: 22, scope: !234)
!558 = !DILocation(line: 457, column: 6, scope: !559)
!559 = distinct !DILexicalBlock(scope: !234, file: !3, line: 457, column: 6)
!560 = !DILocation(line: 457, column: 6, scope: !234)
!561 = !DILocation(line: 461, column: 27, scope: !562)
!562 = distinct !DILexicalBlock(scope: !559, file: !3, line: 457, column: 34)
!563 = !DILocation(line: 461, column: 3, scope: !562)
!564 = !DILocation(line: 462, column: 3, scope: !562)
!565 = !DILocation(line: 465, column: 2, scope: !234)
!566 = !DILocation(line: 466, column: 16, scope: !234)
!567 = !DILocation(line: 466, column: 23, scope: !234)
!568 = !DILocation(line: 466, column: 31, scope: !234)
!569 = !DILocation(line: 466, column: 2, scope: !234)
!570 = !DILocation(line: 468, column: 30, scope: !234)
!571 = !DILocation(line: 468, column: 37, scope: !234)
!572 = !DILocation(line: 468, column: 9, scope: !234)
!573 = !DILocation(line: 468, column: 7, scope: !234)
!574 = !DILocation(line: 470, column: 9, scope: !234)
!575 = !DILocation(line: 470, column: 2, scope: !234)
!576 = !DILocation(line: 471, column: 1, scope: !234)
!577 = distinct !DISubprogram(name: "jpeg_error", scope: !3, file: !3, line: 105, type: !578, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !221)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !122}
!580 = !DILocalVariable(name: "cinfo", arg: 1, scope: !577, file: !3, line: 105, type: !122)
!581 = !DILocation(line: 105, column: 37, scope: !577)
!582 = !DILocalVariable(name: "err", scope: !577, file: !3, line: 107, type: !38)
!583 = !DILocation(line: 107, column: 15, scope: !577)
!584 = !DILocation(line: 107, column: 35, scope: !577)
!585 = !DILocation(line: 107, column: 42, scope: !577)
!586 = !DILocation(line: 107, column: 21, scope: !577)
!587 = !DILocation(line: 110, column: 4, scope: !577)
!588 = !DILocation(line: 110, column: 11, scope: !577)
!589 = !DILocation(line: 110, column: 16, scope: !577)
!590 = !DILocation(line: 110, column: 32, scope: !577)
!591 = !DILocation(line: 110, column: 2, scope: !577)
!592 = !DILocation(line: 113, column: 15, scope: !577)
!593 = !DILocation(line: 113, column: 2, scope: !577)
!594 = !DILocation(line: 116, column: 10, scope: !577)
!595 = !DILocation(line: 116, column: 15, scope: !577)
!596 = !DILocation(line: 116, column: 2, scope: !577)
!597 = distinct !DISubprogram(name: "memory_source", scope: !3, file: !3, line: 182, type: !598, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !221)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600, !200, !35}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !6, line: 263, baseType: !535)
!601 = !DILocalVariable(name: "cinfo", arg: 1, scope: !597, file: !3, line: 182, type: !600)
!602 = !DILocation(line: 182, column: 44, scope: !597)
!603 = !DILocalVariable(name: "buffer", arg: 2, scope: !597, file: !3, line: 182, type: !200)
!604 = !DILocation(line: 182, column: 66, scope: !597)
!605 = !DILocalVariable(name: "size", arg: 3, scope: !597, file: !3, line: 182, type: !35)
!606 = !DILocation(line: 182, column: 81, scope: !597)
!607 = !DILocalVariable(name: "src", scope: !597, file: !3, line: 184, type: !193)
!608 = !DILocation(line: 184, column: 13, scope: !597)
!609 = !DILocation(line: 186, column: 6, scope: !610)
!610 = distinct !DILexicalBlock(scope: !597, file: !3, line: 186, column: 6)
!611 = !DILocation(line: 186, column: 13, scope: !610)
!612 = !DILocation(line: 186, column: 17, scope: !610)
!613 = !DILocation(line: 186, column: 6, scope: !597)
!614 = !DILocation(line: 187, column: 44, scope: !615)
!615 = distinct !DILexicalBlock(scope: !610, file: !3, line: 186, column: 26)
!616 = !DILocation(line: 187, column: 51, scope: !615)
!617 = !DILocation(line: 187, column: 56, scope: !615)
!618 = !DILocation(line: 188, column: 36, scope: !615)
!619 = !DILocation(line: 188, column: 21, scope: !615)
!620 = !DILocation(line: 187, column: 42, scope: !615)
!621 = !DILocation(line: 187, column: 16, scope: !615)
!622 = !DILocation(line: 187, column: 3, scope: !615)
!623 = !DILocation(line: 187, column: 10, scope: !615)
!624 = !DILocation(line: 187, column: 14, scope: !615)
!625 = !DILocation(line: 189, column: 2, scope: !615)
!626 = !DILocation(line: 191, column: 21, scope: !597)
!627 = !DILocation(line: 191, column: 28, scope: !597)
!628 = !DILocation(line: 191, column: 8, scope: !597)
!629 = !DILocation(line: 191, column: 6, scope: !597)
!630 = !DILocation(line: 192, column: 2, scope: !597)
!631 = !DILocation(line: 192, column: 7, scope: !597)
!632 = !DILocation(line: 192, column: 11, scope: !597)
!633 = !DILocation(line: 192, column: 30, scope: !597)
!634 = !DILocation(line: 193, column: 2, scope: !597)
!635 = !DILocation(line: 193, column: 7, scope: !597)
!636 = !DILocation(line: 193, column: 11, scope: !597)
!637 = !DILocation(line: 193, column: 30, scope: !597)
!638 = !DILocation(line: 194, column: 2, scope: !597)
!639 = !DILocation(line: 194, column: 7, scope: !597)
!640 = !DILocation(line: 194, column: 11, scope: !597)
!641 = !DILocation(line: 194, column: 30, scope: !597)
!642 = !DILocation(line: 195, column: 2, scope: !597)
!643 = !DILocation(line: 195, column: 7, scope: !597)
!644 = !DILocation(line: 195, column: 11, scope: !597)
!645 = !DILocation(line: 195, column: 30, scope: !597)
!646 = !DILocation(line: 196, column: 2, scope: !597)
!647 = !DILocation(line: 196, column: 7, scope: !597)
!648 = !DILocation(line: 196, column: 11, scope: !597)
!649 = !DILocation(line: 196, column: 30, scope: !597)
!650 = !DILocation(line: 198, column: 32, scope: !597)
!651 = !DILocation(line: 198, column: 2, scope: !597)
!652 = !DILocation(line: 198, column: 7, scope: !597)
!653 = !DILocation(line: 198, column: 11, scope: !597)
!654 = !DILocation(line: 198, column: 30, scope: !597)
!655 = !DILocation(line: 199, column: 32, scope: !597)
!656 = !DILocation(line: 199, column: 2, scope: !597)
!657 = !DILocation(line: 199, column: 7, scope: !597)
!658 = !DILocation(line: 199, column: 11, scope: !597)
!659 = !DILocation(line: 199, column: 30, scope: !597)
!660 = !DILocation(line: 201, column: 16, scope: !597)
!661 = !DILocation(line: 201, column: 2, scope: !597)
!662 = !DILocation(line: 201, column: 7, scope: !597)
!663 = !DILocation(line: 201, column: 14, scope: !597)
!664 = !DILocation(line: 202, column: 14, scope: !597)
!665 = !DILocation(line: 202, column: 2, scope: !597)
!666 = !DILocation(line: 202, column: 7, scope: !597)
!667 = !DILocation(line: 202, column: 12, scope: !597)
!668 = !DILocation(line: 203, column: 1, scope: !597)
!669 = distinct !DISubprogram(name: "ibJpegImageFromCinfo", scope: !3, file: !3, line: 279, type: !670, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !221)
!670 = !DISubroutineType(types: !671)
!671 = !{!540, !535, !55}
!672 = !DILocalVariable(name: "cinfo", arg: 1, scope: !669, file: !3, line: 279, type: !535)
!673 = !DILocation(line: 279, column: 67, scope: !669)
!674 = !DILocalVariable(name: "flags", arg: 2, scope: !669, file: !3, line: 279, type: !55)
!675 = !DILocation(line: 279, column: 78, scope: !669)
!676 = !DILocalVariable(name: "row_pointer", scope: !669, file: !3, line: 281, type: !141)
!677 = !DILocation(line: 281, column: 13, scope: !669)
!678 = !DILocalVariable(name: "buffer", scope: !669, file: !3, line: 282, type: !144)
!679 = !DILocation(line: 282, column: 11, scope: !669)
!680 = !DILocalVariable(name: "row_stride", scope: !669, file: !3, line: 283, type: !55)
!681 = !DILocation(line: 283, column: 6, scope: !669)
!682 = !DILocalVariable(name: "x", scope: !669, file: !3, line: 284, type: !55)
!683 = !DILocation(line: 284, column: 6, scope: !669)
!684 = !DILocalVariable(name: "y", scope: !669, file: !3, line: 284, type: !55)
!685 = !DILocation(line: 284, column: 9, scope: !669)
!686 = !DILocalVariable(name: "depth", scope: !669, file: !3, line: 284, type: !55)
!687 = !DILocation(line: 284, column: 12, scope: !669)
!688 = !DILocalVariable(name: "r", scope: !669, file: !3, line: 284, type: !55)
!689 = !DILocation(line: 284, column: 19, scope: !669)
!690 = !DILocalVariable(name: "g", scope: !669, file: !3, line: 284, type: !55)
!691 = !DILocation(line: 284, column: 22, scope: !669)
!692 = !DILocalVariable(name: "b", scope: !669, file: !3, line: 284, type: !55)
!693 = !DILocation(line: 284, column: 25, scope: !669)
!694 = !DILocalVariable(name: "k", scope: !669, file: !3, line: 284, type: !55)
!695 = !DILocation(line: 284, column: 28, scope: !669)
!696 = !DILocalVariable(name: "ibuf", scope: !669, file: !3, line: 285, type: !237)
!697 = !DILocation(line: 285, column: 16, scope: !669)
!698 = !DILocalVariable(name: "rect", scope: !669, file: !3, line: 286, type: !206)
!699 = !DILocation(line: 286, column: 9, scope: !669)
!700 = !DILocalVariable(name: "marker", scope: !669, file: !3, line: 287, type: !471)
!701 = !DILocation(line: 287, column: 24, scope: !669)
!702 = !DILocalVariable(name: "str", scope: !669, file: !3, line: 288, type: !209)
!703 = !DILocation(line: 288, column: 8, scope: !669)
!704 = !DILocalVariable(name: "key", scope: !669, file: !3, line: 288, type: !209)
!705 = !DILocation(line: 288, column: 14, scope: !669)
!706 = !DILocalVariable(name: "value", scope: !669, file: !3, line: 288, type: !209)
!707 = !DILocation(line: 288, column: 20, scope: !669)
!708 = !DILocation(line: 291, column: 13, scope: !669)
!709 = !DILocation(line: 292, column: 28, scope: !669)
!710 = !DILocation(line: 292, column: 2, scope: !669)
!711 = !DILocation(line: 293, column: 2, scope: !669)
!712 = !DILocation(line: 293, column: 9, scope: !669)
!713 = !DILocation(line: 293, column: 20, scope: !669)
!714 = !DILocation(line: 294, column: 20, scope: !669)
!715 = !DILocation(line: 294, column: 2, scope: !669)
!716 = !DILocation(line: 296, column: 23, scope: !717)
!717 = distinct !DILexicalBlock(scope: !669, file: !3, line: 296, column: 6)
!718 = !DILocation(line: 296, column: 6, scope: !717)
!719 = !DILocation(line: 296, column: 37, scope: !717)
!720 = !DILocation(line: 296, column: 6, scope: !669)
!721 = !DILocation(line: 297, column: 7, scope: !722)
!722 = distinct !DILexicalBlock(scope: !717, file: !3, line: 296, column: 56)
!723 = !DILocation(line: 297, column: 14, scope: !722)
!724 = !DILocation(line: 297, column: 5, scope: !722)
!725 = !DILocation(line: 298, column: 7, scope: !722)
!726 = !DILocation(line: 298, column: 14, scope: !722)
!727 = !DILocation(line: 298, column: 5, scope: !722)
!728 = !DILocation(line: 299, column: 11, scope: !722)
!729 = !DILocation(line: 299, column: 18, scope: !722)
!730 = !DILocation(line: 299, column: 9, scope: !722)
!731 = !DILocation(line: 301, column: 7, scope: !732)
!732 = distinct !DILexicalBlock(scope: !722, file: !3, line: 301, column: 7)
!733 = !DILocation(line: 301, column: 14, scope: !732)
!734 = !DILocation(line: 301, column: 31, scope: !732)
!735 = !DILocation(line: 301, column: 7, scope: !722)
!736 = !DILocation(line: 301, column: 44, scope: !732)
!737 = !DILocation(line: 301, column: 51, scope: !732)
!738 = !DILocation(line: 301, column: 67, scope: !732)
!739 = !DILocation(line: 303, column: 25, scope: !722)
!740 = !DILocation(line: 303, column: 3, scope: !722)
!741 = !DILocation(line: 305, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !722, file: !3, line: 305, column: 7)
!743 = !DILocation(line: 305, column: 18, scope: !742)
!744 = !DILocation(line: 305, column: 7, scope: !722)
!745 = !DILocation(line: 306, column: 15, scope: !746)
!746 = distinct !DILexicalBlock(scope: !742, file: !3, line: 305, column: 24)
!747 = !DILocation(line: 307, column: 8, scope: !748)
!748 = distinct !DILexicalBlock(scope: !746, file: !3, line: 307, column: 8)
!749 = !DILocation(line: 307, column: 15, scope: !748)
!750 = !DILocation(line: 307, column: 33, scope: !748)
!751 = !DILocation(line: 307, column: 8, scope: !746)
!752 = !DILocation(line: 308, column: 9, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !3, line: 308, column: 9)
!754 = distinct !DILexicalBlock(scope: !748, file: !3, line: 307, column: 39)
!755 = !DILocation(line: 308, column: 16, scope: !753)
!756 = !DILocation(line: 308, column: 34, scope: !753)
!757 = !DILocation(line: 308, column: 9, scope: !754)
!758 = !DILocation(line: 308, column: 51, scope: !753)
!759 = !DILocation(line: 308, column: 40, scope: !753)
!760 = !DILocation(line: 309, column: 21, scope: !753)
!761 = !DILocation(line: 310, column: 4, scope: !754)
!762 = !DILocation(line: 311, column: 3, scope: !746)
!763 = !DILocation(line: 313, column: 7, scope: !764)
!764 = distinct !DILexicalBlock(scope: !722, file: !3, line: 313, column: 7)
!765 = !DILocation(line: 313, column: 13, scope: !764)
!766 = !DILocation(line: 313, column: 7, scope: !722)
!767 = !DILocation(line: 314, column: 26, scope: !768)
!768 = distinct !DILexicalBlock(scope: !764, file: !3, line: 313, column: 24)
!769 = !DILocation(line: 314, column: 4, scope: !768)
!770 = !DILocation(line: 315, column: 26, scope: !768)
!771 = !DILocation(line: 315, column: 29, scope: !768)
!772 = !DILocation(line: 315, column: 36, scope: !768)
!773 = !DILocation(line: 315, column: 34, scope: !768)
!774 = !DILocation(line: 315, column: 32, scope: !768)
!775 = !DILocation(line: 315, column: 11, scope: !768)
!776 = !DILocation(line: 315, column: 9, scope: !768)
!777 = !DILocation(line: 316, column: 3, scope: !768)
!778 = !DILocation(line: 317, column: 35, scope: !779)
!779 = distinct !DILexicalBlock(scope: !764, file: !3, line: 317, column: 12)
!780 = !DILocation(line: 317, column: 38, scope: !779)
!781 = !DILocation(line: 317, column: 45, scope: !779)
!782 = !DILocation(line: 317, column: 43, scope: !779)
!783 = !DILocation(line: 317, column: 41, scope: !779)
!784 = !DILocation(line: 317, column: 20, scope: !779)
!785 = !DILocation(line: 317, column: 18, scope: !779)
!786 = !DILocation(line: 317, column: 62, scope: !779)
!787 = !DILocation(line: 317, column: 12, scope: !764)
!788 = !DILocation(line: 318, column: 26, scope: !789)
!789 = distinct !DILexicalBlock(scope: !779, file: !3, line: 317, column: 71)
!790 = !DILocation(line: 318, column: 4, scope: !789)
!791 = !DILocation(line: 319, column: 3, scope: !789)
!792 = !DILocation(line: 321, column: 17, scope: !793)
!793 = distinct !DILexicalBlock(scope: !779, file: !3, line: 320, column: 8)
!794 = !DILocation(line: 321, column: 24, scope: !793)
!795 = !DILocation(line: 321, column: 39, scope: !793)
!796 = !DILocation(line: 321, column: 37, scope: !793)
!797 = !DILocation(line: 321, column: 15, scope: !793)
!798 = !DILocation(line: 323, column: 20, scope: !793)
!799 = !DILocation(line: 323, column: 27, scope: !793)
!800 = !DILocation(line: 323, column: 32, scope: !793)
!801 = !DILocation(line: 323, column: 61, scope: !793)
!802 = !DILocation(line: 323, column: 46, scope: !793)
!803 = !DILocation(line: 323, column: 81, scope: !793)
!804 = !DILocation(line: 323, column: 18, scope: !793)
!805 = !DILocation(line: 323, column: 16, scope: !793)
!806 = !DILocation(line: 325, column: 13, scope: !807)
!807 = distinct !DILexicalBlock(scope: !793, file: !3, line: 325, column: 4)
!808 = !DILocation(line: 325, column: 19, scope: !807)
!809 = !DILocation(line: 325, column: 21, scope: !807)
!810 = !DILocation(line: 325, column: 11, scope: !807)
!811 = !DILocation(line: 325, column: 9, scope: !807)
!812 = !DILocation(line: 325, column: 26, scope: !813)
!813 = distinct !DILexicalBlock(scope: !807, file: !3, line: 325, column: 4)
!814 = !DILocation(line: 325, column: 28, scope: !813)
!815 = !DILocation(line: 325, column: 4, scope: !807)
!816 = !DILocation(line: 326, column: 25, scope: !817)
!817 = distinct !DILexicalBlock(scope: !813, file: !3, line: 325, column: 39)
!818 = !DILocation(line: 326, column: 32, scope: !817)
!819 = !DILocation(line: 326, column: 5, scope: !817)
!820 = !DILocation(line: 327, column: 23, scope: !817)
!821 = !DILocation(line: 327, column: 29, scope: !817)
!822 = !DILocation(line: 327, column: 36, scope: !817)
!823 = !DILocation(line: 327, column: 40, scope: !817)
!824 = !DILocation(line: 327, column: 46, scope: !817)
!825 = !DILocation(line: 327, column: 38, scope: !817)
!826 = !DILocation(line: 327, column: 34, scope: !817)
!827 = !DILocation(line: 327, column: 12, scope: !817)
!828 = !DILocation(line: 327, column: 10, scope: !817)
!829 = !DILocation(line: 328, column: 14, scope: !817)
!830 = !DILocation(line: 328, column: 12, scope: !817)
!831 = !DILocation(line: 330, column: 13, scope: !817)
!832 = !DILocation(line: 330, column: 5, scope: !817)
!833 = !DILocation(line: 332, column: 16, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !3, line: 332, column: 7)
!835 = distinct !DILexicalBlock(scope: !817, file: !3, line: 330, column: 20)
!836 = !DILocation(line: 332, column: 22, scope: !834)
!837 = !DILocation(line: 332, column: 14, scope: !834)
!838 = !DILocation(line: 332, column: 12, scope: !834)
!839 = !DILocation(line: 332, column: 25, scope: !840)
!840 = distinct !DILexicalBlock(scope: !834, file: !3, line: 332, column: 7)
!841 = !DILocation(line: 332, column: 27, scope: !840)
!842 = !DILocation(line: 332, column: 7, scope: !834)
!843 = !DILocation(line: 333, column: 8, scope: !844)
!844 = distinct !DILexicalBlock(scope: !840, file: !3, line: 332, column: 37)
!845 = !DILocation(line: 333, column: 16, scope: !844)
!846 = !DILocation(line: 334, column: 45, scope: !844)
!847 = !DILocation(line: 334, column: 38, scope: !844)
!848 = !DILocation(line: 334, column: 28, scope: !844)
!849 = !DILocation(line: 334, column: 36, scope: !844)
!850 = !DILocation(line: 334, column: 18, scope: !844)
!851 = !DILocation(line: 334, column: 26, scope: !844)
!852 = !DILocation(line: 334, column: 8, scope: !844)
!853 = !DILocation(line: 334, column: 16, scope: !844)
!854 = !DILocation(line: 335, column: 13, scope: !844)
!855 = !DILocation(line: 336, column: 7, scope: !844)
!856 = !DILocation(line: 332, column: 33, scope: !840)
!857 = !DILocation(line: 332, column: 7, scope: !840)
!858 = distinct !{!858, !842, !859}
!859 = !DILocation(line: 336, column: 7, scope: !834)
!860 = !DILocation(line: 337, column: 7, scope: !835)
!861 = !DILocation(line: 339, column: 16, scope: !862)
!862 = distinct !DILexicalBlock(scope: !835, file: !3, line: 339, column: 7)
!863 = !DILocation(line: 339, column: 22, scope: !862)
!864 = !DILocation(line: 339, column: 14, scope: !862)
!865 = !DILocation(line: 339, column: 12, scope: !862)
!866 = !DILocation(line: 339, column: 25, scope: !867)
!867 = distinct !DILexicalBlock(scope: !862, file: !3, line: 339, column: 7)
!868 = !DILocation(line: 339, column: 27, scope: !867)
!869 = !DILocation(line: 339, column: 7, scope: !862)
!870 = !DILocation(line: 340, column: 8, scope: !871)
!871 = distinct !DILexicalBlock(scope: !867, file: !3, line: 339, column: 37)
!872 = !DILocation(line: 340, column: 16, scope: !871)
!873 = !DILocation(line: 341, column: 25, scope: !871)
!874 = !DILocation(line: 341, column: 18, scope: !871)
!875 = !DILocation(line: 341, column: 8, scope: !871)
!876 = !DILocation(line: 341, column: 16, scope: !871)
!877 = !DILocation(line: 342, column: 25, scope: !871)
!878 = !DILocation(line: 342, column: 18, scope: !871)
!879 = !DILocation(line: 342, column: 8, scope: !871)
!880 = !DILocation(line: 342, column: 16, scope: !871)
!881 = !DILocation(line: 343, column: 25, scope: !871)
!882 = !DILocation(line: 343, column: 18, scope: !871)
!883 = !DILocation(line: 343, column: 8, scope: !871)
!884 = !DILocation(line: 343, column: 16, scope: !871)
!885 = !DILocation(line: 344, column: 13, scope: !871)
!886 = !DILocation(line: 345, column: 7, scope: !871)
!887 = !DILocation(line: 339, column: 33, scope: !867)
!888 = !DILocation(line: 339, column: 7, scope: !867)
!889 = distinct !{!889, !869, !890}
!890 = !DILocation(line: 345, column: 7, scope: !862)
!891 = !DILocation(line: 346, column: 7, scope: !835)
!892 = !DILocation(line: 348, column: 16, scope: !893)
!893 = distinct !DILexicalBlock(scope: !835, file: !3, line: 348, column: 7)
!894 = !DILocation(line: 348, column: 22, scope: !893)
!895 = !DILocation(line: 348, column: 14, scope: !893)
!896 = !DILocation(line: 348, column: 12, scope: !893)
!897 = !DILocation(line: 348, column: 25, scope: !898)
!898 = distinct !DILexicalBlock(scope: !893, file: !3, line: 348, column: 7)
!899 = !DILocation(line: 348, column: 27, scope: !898)
!900 = !DILocation(line: 348, column: 7, scope: !893)
!901 = !DILocation(line: 349, column: 19, scope: !902)
!902 = distinct !DILexicalBlock(scope: !898, file: !3, line: 348, column: 37)
!903 = !DILocation(line: 349, column: 12, scope: !902)
!904 = !DILocation(line: 349, column: 10, scope: !902)
!905 = !DILocation(line: 350, column: 19, scope: !902)
!906 = !DILocation(line: 350, column: 12, scope: !902)
!907 = !DILocation(line: 350, column: 10, scope: !902)
!908 = !DILocation(line: 351, column: 19, scope: !902)
!909 = !DILocation(line: 351, column: 12, scope: !902)
!910 = !DILocation(line: 351, column: 10, scope: !902)
!911 = !DILocation(line: 352, column: 19, scope: !902)
!912 = !DILocation(line: 352, column: 12, scope: !902)
!913 = !DILocation(line: 352, column: 10, scope: !902)
!914 = !DILocation(line: 354, column: 13, scope: !902)
!915 = !DILocation(line: 354, column: 17, scope: !902)
!916 = !DILocation(line: 354, column: 15, scope: !902)
!917 = !DILocation(line: 354, column: 20, scope: !902)
!918 = !DILocation(line: 354, column: 10, scope: !902)
!919 = !DILocation(line: 355, column: 13, scope: !902)
!920 = !DILocation(line: 355, column: 17, scope: !902)
!921 = !DILocation(line: 355, column: 15, scope: !902)
!922 = !DILocation(line: 355, column: 20, scope: !902)
!923 = !DILocation(line: 355, column: 10, scope: !902)
!924 = !DILocation(line: 356, column: 13, scope: !902)
!925 = !DILocation(line: 356, column: 17, scope: !902)
!926 = !DILocation(line: 356, column: 15, scope: !902)
!927 = !DILocation(line: 356, column: 20, scope: !902)
!928 = !DILocation(line: 356, column: 10, scope: !902)
!929 = !DILocation(line: 358, column: 8, scope: !902)
!930 = !DILocation(line: 358, column: 16, scope: !902)
!931 = !DILocation(line: 359, column: 18, scope: !902)
!932 = !DILocation(line: 359, column: 8, scope: !902)
!933 = !DILocation(line: 359, column: 16, scope: !902)
!934 = !DILocation(line: 360, column: 18, scope: !902)
!935 = !DILocation(line: 360, column: 8, scope: !902)
!936 = !DILocation(line: 360, column: 16, scope: !902)
!937 = !DILocation(line: 361, column: 18, scope: !902)
!938 = !DILocation(line: 361, column: 8, scope: !902)
!939 = !DILocation(line: 361, column: 16, scope: !902)
!940 = !DILocation(line: 362, column: 13, scope: !902)
!941 = !DILocation(line: 363, column: 7, scope: !902)
!942 = !DILocation(line: 348, column: 33, scope: !898)
!943 = !DILocation(line: 348, column: 7, scope: !898)
!944 = distinct !{!944, !900, !945}
!945 = !DILocation(line: 363, column: 7, scope: !893)
!946 = !DILocation(line: 364, column: 7, scope: !835)
!947 = !DILocation(line: 366, column: 4, scope: !817)
!948 = !DILocation(line: 325, column: 35, scope: !813)
!949 = !DILocation(line: 325, column: 4, scope: !813)
!950 = distinct !{!950, !815, !951}
!951 = !DILocation(line: 366, column: 4, scope: !807)
!952 = !DILocation(line: 368, column: 13, scope: !793)
!953 = !DILocation(line: 368, column: 20, scope: !793)
!954 = !DILocation(line: 368, column: 11, scope: !793)
!955 = !DILocation(line: 369, column: 4, scope: !793)
!956 = !DILocation(line: 369, column: 11, scope: !793)
!957 = !DILocation(line: 370, column: 9, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 370, column: 9)
!959 = distinct !DILexicalBlock(scope: !793, file: !3, line: 369, column: 19)
!960 = !DILocation(line: 370, column: 17, scope: !958)
!961 = !DILocation(line: 370, column: 24, scope: !958)
!962 = !DILocation(line: 370, column: 9, scope: !959)
!963 = !DILocation(line: 371, column: 6, scope: !958)
!964 = !DILocation(line: 377, column: 31, scope: !959)
!965 = !DILocation(line: 377, column: 39, scope: !959)
!966 = !DILocation(line: 377, column: 45, scope: !959)
!967 = !DILocation(line: 377, column: 53, scope: !959)
!968 = !DILocation(line: 377, column: 11, scope: !959)
!969 = !DILocation(line: 377, column: 9, scope: !959)
!970 = !DILocation(line: 388, column: 17, scope: !971)
!971 = distinct !DILexicalBlock(scope: !959, file: !3, line: 388, column: 9)
!972 = !DILocation(line: 388, column: 9, scope: !971)
!973 = !DILocation(line: 388, column: 9, scope: !959)
!974 = !DILocation(line: 398, column: 29, scope: !975)
!975 = distinct !DILexicalBlock(scope: !971, file: !3, line: 388, column: 37)
!976 = !DILocation(line: 398, column: 43, scope: !975)
!977 = !DILocation(line: 398, column: 6, scope: !975)
!978 = !DILocation(line: 399, column: 6, scope: !975)
!979 = !DILocation(line: 399, column: 12, scope: !975)
!980 = !DILocation(line: 399, column: 18, scope: !975)
!981 = !DILocation(line: 400, column: 6, scope: !975)
!982 = !DILocation(line: 400, column: 16, scope: !975)
!983 = !DILocation(line: 401, column: 6, scope: !975)
!984 = !DILocation(line: 404, column: 18, scope: !959)
!985 = !DILocation(line: 404, column: 11, scope: !959)
!986 = !DILocation(line: 404, column: 9, scope: !959)
!987 = !DILocation(line: 410, column: 10, scope: !988)
!988 = distinct !DILexicalBlock(scope: !959, file: !3, line: 410, column: 9)
!989 = !DILocation(line: 410, column: 9, scope: !959)
!990 = !DILocation(line: 411, column: 6, scope: !991)
!991 = distinct !DILexicalBlock(scope: !988, file: !3, line: 410, column: 15)
!992 = !DILocation(line: 411, column: 16, scope: !991)
!993 = !DILocation(line: 412, column: 6, scope: !991)
!994 = !DILocation(line: 415, column: 8, scope: !959)
!995 = !DILocation(line: 416, column: 20, scope: !959)
!996 = !DILocation(line: 416, column: 13, scope: !959)
!997 = !DILocation(line: 416, column: 11, scope: !959)
!998 = !DILocation(line: 417, column: 10, scope: !999)
!999 = distinct !DILexicalBlock(scope: !959, file: !3, line: 417, column: 9)
!1000 = !DILocation(line: 417, column: 9, scope: !959)
!1001 = !DILocation(line: 418, column: 6, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !999, file: !3, line: 417, column: 17)
!1003 = !DILocation(line: 418, column: 16, scope: !1002)
!1004 = !DILocation(line: 419, column: 6, scope: !1002)
!1005 = !DILocation(line: 422, column: 6, scope: !959)
!1006 = !DILocation(line: 422, column: 12, scope: !959)
!1007 = !DILocation(line: 423, column: 10, scope: !959)
!1008 = !DILocation(line: 424, column: 28, scope: !959)
!1009 = !DILocation(line: 424, column: 34, scope: !959)
!1010 = !DILocation(line: 424, column: 39, scope: !959)
!1011 = !DILocation(line: 424, column: 5, scope: !959)
!1012 = !DILocation(line: 425, column: 5, scope: !959)
!1013 = !DILocation(line: 425, column: 11, scope: !959)
!1014 = !DILocation(line: 425, column: 17, scope: !959)
!1015 = !DILocation(line: 426, column: 5, scope: !959)
!1016 = !DILocation(line: 426, column: 15, scope: !959)
!1017 = !DILabel(scope: !959, name: "next_stamp_marker", file: !3, line: 427)
!1018 = !DILocation(line: 427, column: 1, scope: !959)
!1019 = !DILocation(line: 428, column: 14, scope: !959)
!1020 = !DILocation(line: 428, column: 22, scope: !959)
!1021 = !DILocation(line: 428, column: 12, scope: !959)
!1022 = distinct !{!1022, !955, !1023}
!1023 = !DILocation(line: 429, column: 4, scope: !793)
!1024 = !DILocation(line: 431, column: 27, scope: !793)
!1025 = !DILocation(line: 431, column: 4, scope: !793)
!1026 = !DILocation(line: 434, column: 31, scope: !722)
!1027 = !DILocation(line: 434, column: 16, scope: !722)
!1028 = !DILocation(line: 434, column: 3, scope: !722)
!1029 = !DILocation(line: 435, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !722, file: !3, line: 435, column: 7)
!1031 = !DILocation(line: 435, column: 7, scope: !722)
!1032 = !DILocation(line: 436, column: 18, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 435, column: 13)
!1034 = !DILocation(line: 436, column: 4, scope: !1033)
!1035 = !DILocation(line: 436, column: 10, scope: !1033)
!1036 = !DILocation(line: 436, column: 16, scope: !1033)
!1037 = !DILocation(line: 437, column: 3, scope: !1033)
!1038 = !DILocation(line: 438, column: 2, scope: !722)
!1039 = !DILocation(line: 440, column: 9, scope: !669)
!1040 = !DILocation(line: 440, column: 2, scope: !669)
!1041 = distinct !DISubprogram(name: "imb_savejpeg", scope: !3, file: !3, line: 751, type: !1042, scopeLine: 752, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !221)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!55, !237, !74, !55}
!1044 = !DILocalVariable(name: "ibuf", arg: 1, scope: !1041, file: !3, line: 751, type: !237)
!1045 = !DILocation(line: 751, column: 32, scope: !1041)
!1046 = !DILocalVariable(name: "name", arg: 2, scope: !1041, file: !3, line: 751, type: !74)
!1047 = !DILocation(line: 751, column: 50, scope: !1041)
!1048 = !DILocalVariable(name: "flags", arg: 3, scope: !1041, file: !3, line: 751, type: !55)
!1049 = !DILocation(line: 751, column: 60, scope: !1041)
!1050 = !DILocation(line: 754, column: 16, scope: !1041)
!1051 = !DILocation(line: 754, column: 2, scope: !1041)
!1052 = !DILocation(line: 754, column: 8, scope: !1041)
!1053 = !DILocation(line: 754, column: 14, scope: !1041)
!1054 = !DILocation(line: 755, column: 6, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 755, column: 6)
!1056 = !DILocation(line: 755, column: 6, scope: !1041)
!1057 = !DILocation(line: 755, column: 43, scope: !1055)
!1058 = !DILocation(line: 755, column: 49, scope: !1055)
!1059 = !DILocation(line: 755, column: 30, scope: !1055)
!1060 = !DILocation(line: 755, column: 23, scope: !1055)
!1061 = !DILocation(line: 756, column: 6, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 756, column: 6)
!1063 = !DILocation(line: 756, column: 6, scope: !1041)
!1064 = !DILocation(line: 756, column: 43, scope: !1062)
!1065 = !DILocation(line: 756, column: 49, scope: !1062)
!1066 = !DILocation(line: 756, column: 30, scope: !1062)
!1067 = !DILocation(line: 756, column: 23, scope: !1062)
!1068 = !DILocation(line: 757, column: 6, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 757, column: 6)
!1070 = !DILocation(line: 757, column: 6, scope: !1041)
!1071 = !DILocation(line: 757, column: 43, scope: !1069)
!1072 = !DILocation(line: 757, column: 49, scope: !1069)
!1073 = !DILocation(line: 757, column: 30, scope: !1069)
!1074 = !DILocation(line: 757, column: 23, scope: !1069)
!1075 = !DILocation(line: 758, column: 22, scope: !1041)
!1076 = !DILocation(line: 758, column: 28, scope: !1041)
!1077 = !DILocation(line: 758, column: 9, scope: !1041)
!1078 = !DILocation(line: 758, column: 2, scope: !1041)
!1079 = !DILocation(line: 759, column: 1, scope: !1041)
!1080 = distinct !DISubprogram(name: "save_stdjpeg", scope: !3, file: !3, line: 608, type: !1081, scopeLine: 609, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !221)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!55, !74, !237}
!1083 = !DILocalVariable(name: "name", arg: 1, scope: !1080, file: !3, line: 608, type: !74)
!1084 = !DILocation(line: 608, column: 37, scope: !1080)
!1085 = !DILocalVariable(name: "ibuf", arg: 2, scope: !1080, file: !3, line: 608, type: !237)
!1086 = !DILocation(line: 608, column: 57, scope: !1080)
!1087 = !DILocalVariable(name: "outfile", scope: !1080, file: !3, line: 610, type: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1090, line: 7, baseType: !1091)
!1090 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1092, line: 49, size: 1728, elements: !1093)
!1092 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1109, !1111, !1112, !1113, !1116, !1118, !1120, !1122, !1125, !1127, !1130, !1133, !1134, !1135, !1136, !1137}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1091, file: !1092, line: 51, baseType: !55, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1091, file: !1092, line: 54, baseType: !209, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1091, file: !1092, line: 55, baseType: !209, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1091, file: !1092, line: 56, baseType: !209, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1091, file: !1092, line: 57, baseType: !209, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1091, file: !1092, line: 58, baseType: !209, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1091, file: !1092, line: 59, baseType: !209, size: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1091, file: !1092, line: 60, baseType: !209, size: 64, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1091, file: !1092, line: 61, baseType: !209, size: 64, offset: 512)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1091, file: !1092, line: 64, baseType: !209, size: 64, offset: 576)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1091, file: !1092, line: 65, baseType: !209, size: 64, offset: 640)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1091, file: !1092, line: 66, baseType: !209, size: 64, offset: 704)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1091, file: !1092, line: 68, baseType: !1107, size: 64, offset: 768)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1092, line: 36, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1091, file: !1092, line: 70, baseType: !1110, size: 64, offset: 832)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1091, file: !1092, line: 72, baseType: !55, size: 32, offset: 896)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1091, file: !1092, line: 73, baseType: !55, size: 32, offset: 928)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1091, file: !1092, line: 74, baseType: !1114, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1115, line: 152, baseType: !70)
!1115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1091, file: !1092, line: 77, baseType: !1117, size: 16, offset: 1024)
!1117 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1091, file: !1092, line: 78, baseType: !1119, size: 8, offset: 1040)
!1119 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1091, file: !1092, line: 79, baseType: !1121, size: 8, offset: 1048)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8, elements: !100)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1091, file: !1092, line: 81, baseType: !1123, size: 64, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1092, line: 43, baseType: null)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1091, file: !1092, line: 89, baseType: !1126, size: 64, offset: 1152)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1115, line: 153, baseType: !70)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1091, file: !1092, line: 91, baseType: !1128, size: 64, offset: 1216)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1092, line: 37, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1091, file: !1092, line: 92, baseType: !1131, size: 64, offset: 1280)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1092, line: 38, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1091, file: !1092, line: 93, baseType: !1110, size: 64, offset: 1344)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1091, file: !1092, line: 94, baseType: !102, size: 64, offset: 1408)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1091, file: !1092, line: 95, baseType: !35, size: 64, offset: 1472)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1091, file: !1092, line: 96, baseType: !55, size: 32, offset: 1536)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1091, file: !1092, line: 98, baseType: !1138, size: 160, offset: 1568)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 160, elements: !269)
!1139 = !DILocation(line: 610, column: 8, scope: !1080)
!1140 = !DILocalVariable(name: "_cinfo", scope: !1080, file: !3, line: 611, type: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !6, line: 268, size: 4224, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1220, !1223, !1226, !1229, !1232, !1235, !1238, !1241, !1244, !1246}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !1141, file: !6, line: 269, baseType: !127, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1141, file: !6, line: 269, baseType: !129, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1141, file: !6, line: 269, baseType: !182, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1141, file: !6, line: 269, baseType: !102, size: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !1141, file: !6, line: 269, baseType: !118, size: 32, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !1141, file: !6, line: 269, baseType: !55, size: 32, offset: 288)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1141, file: !6, line: 272, baseType: !1150, size: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !6, line: 713, size: 320, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !1151, file: !6, line: 714, baseType: !210, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !1151, file: !6, line: 715, baseType: !35, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !1151, file: !6, line: 717, baseType: !47, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !1151, file: !6, line: 718, baseType: !115, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !1151, file: !6, line: 719, baseType: !47, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !1141, file: !6, line: 279, baseType: !360, size: 32, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !1141, file: !6, line: 280, baseType: !360, size: 32, offset: 416)
