; ModuleID = 'blender/source/blender/modifiers/intern/MOD_uvproject.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_uvproject.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!65 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!67 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 339, baseType: !7, size: 32, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!111 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!117 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!118 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!119 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!120 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!121 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 76, baseType: !7, size: 32, elements: !124)
!123 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !{!125, !126, !127}
!125 = !DIEnumerator(name: "CAM_PERSP", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "CAM_ORTHO", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "CAM_PANO", value: 2, isUnsigned: true)
!128 = !{!129, !167, !1007, !1031, !1033, !1034}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVProjectModifierData", file: !61, line: 412, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UVProjectModifierData", file: !61, line: 400, size: 2368, elements: !132)
!132 = !{!133, !156, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !131, file: !61, line: 401, baseType: !134, size: 896)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !136)
!136 = !{!137, !139, !140, !142, !143, !144, !145, !150, !154}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !61, line: 100, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !61, line: 100, baseType: !138, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !61, line: 102, baseType: !141, size: 32, offset: 128)
!141 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !135, file: !61, line: 102, baseType: !141, size: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !135, file: !61, line: 103, baseType: !141, size: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !135, file: !61, line: 103, baseType: !141, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !61, line: 104, baseType: !146, size: 512, offset: 256)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 512, elements: !148)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !{!149}
!149 = !DISubrange(count: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !135, file: !61, line: 107, baseType: !151, size: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !153, line: 40, flags: DIFlagFwdDecl)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !135, file: !61, line: 109, baseType: !155, size: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "projectors", scope: !131, file: !61, line: 404, baseType: !157, size: 640, offset: 896)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 640, elements: !995)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !109, line: 115, size: 11392, elements: !160)
!160 = !{!161, !228, !231, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !248, !260, !274, !275, !318, !319, !322, !323, !339, !340, !341, !342, !343, !344, !345, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !364, !365, !366, !367, !368, !369, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !429, !430, !431, !432, !433, !434, !435, !436, !437, !440, !443, !446, !447, !448, !449, !450, !453, !456, !942, !943, !949, !950, !951, !952, !953, !954, !956, !959, !962, !964, !983, !984}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !159, file: !109, line: 116, baseType: !162, size: 960)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !163, line: 130, baseType: !164)
!163 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !163, line: 117, size: 960, elements: !165)
!165 = !{!166, !168, !169, !171, !190, !194, !196, !197, !198, !199}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !163, line: 118, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !163, line: 118, baseType: !167, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !164, file: !163, line: 119, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !164, file: !163, line: 120, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !163, line: 136, size: 17600, elements: !174)
!174 = !{!175, !176, !178, !181, !185, !186, !187}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !163, line: 137, baseType: !162, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !173, file: !163, line: 138, baseType: !177, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !173, file: !163, line: 139, baseType: !179, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !163, line: 43, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !163, line: 140, baseType: !182, size: 8192, offset: 1088)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 8192, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !173, file: !163, line: 141, baseType: !182, size: 8192, offset: 9280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !173, file: !163, line: 148, baseType: !172, size: 64, offset: 17472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !173, file: !163, line: 150, baseType: !188, size: 64, offset: 17536)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !163, line: 45, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !163, line: 121, baseType: !191, size: 528, offset: 256)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 528, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 66)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !163, line: 126, baseType: !195, size: 16, offset: 784)
!195 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !164, file: !163, line: 127, baseType: !141, size: 32, offset: 800)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !164, file: !163, line: 128, baseType: !141, size: 32, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !164, file: !163, line: 128, baseType: !141, size: 32, offset: 864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !164, file: !163, line: 129, baseType: !200, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !163, line: 75, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !163, line: 62, size: 1024, elements: !203)
!203 = !{!204, !206, !207, !208, !209, !210, !211, !212, !226, !227}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !163, line: 63, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !163, line: 63, baseType: !205, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !163, line: 64, baseType: !147, size: 8, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !202, file: !163, line: 64, baseType: !147, size: 8, offset: 136)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !202, file: !163, line: 65, baseType: !195, size: 16, offset: 144)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !163, line: 66, baseType: !146, size: 512, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !202, file: !163, line: 67, baseType: !141, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !163, line: 69, baseType: !213, size: 256, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !163, line: 60, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !163, line: 48, size: 256, elements: !215)
!215 = !{!216, !217, !224, !225}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !214, file: !163, line: 49, baseType: !167, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !214, file: !163, line: 58, baseType: !218, size: 128, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !219, line: 71, baseType: !220)
!219 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !219, line: 69, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !220, file: !219, line: 70, baseType: !167, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !220, file: !219, line: 70, baseType: !167, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !214, file: !163, line: 59, baseType: !141, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !214, file: !163, line: 59, baseType: !141, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !202, file: !163, line: 70, baseType: !141, size: 32, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !202, file: !163, line: 74, baseType: !141, size: 32, offset: 992)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !159, file: !109, line: 117, baseType: !229, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !123, line: 44, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !159, file: !109, line: 119, baseType: !232, size: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !109, line: 57, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !109, line: 121, baseType: !195, size: 16, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !159, file: !109, line: 121, baseType: !195, size: 16, offset: 1104)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !159, file: !109, line: 122, baseType: !141, size: 32, offset: 1120)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !159, file: !109, line: 122, baseType: !141, size: 32, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !159, file: !109, line: 122, baseType: !141, size: 32, offset: 1184)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !159, file: !109, line: 123, baseType: !146, size: 512, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !159, file: !109, line: 124, baseType: !158, size: 64, offset: 1728)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !159, file: !109, line: 124, baseType: !158, size: 64, offset: 1792)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !159, file: !109, line: 127, baseType: !158, size: 64, offset: 1856)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !159, file: !109, line: 127, baseType: !158, size: 64, offset: 1920)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !159, file: !109, line: 127, baseType: !158, size: 64, offset: 1984)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !159, file: !109, line: 128, baseType: !246, size: 64, offset: 2048)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !123, line: 45, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !159, file: !109, line: 130, baseType: !249, size: 64, offset: 2112)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !109, line: 97, size: 832, elements: !251)
!251 = !{!252, !258, !259}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !250, file: !109, line: 98, baseType: !253, size: 768)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 768, elements: !255)
!254 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!255 = !{!256, !257}
!256 = !DISubrange(count: 8)
!257 = !DISubrange(count: 3)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !250, file: !109, line: 99, baseType: !141, size: 32, offset: 768)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !250, file: !109, line: 99, baseType: !141, size: 32, offset: 800)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !159, file: !109, line: 131, baseType: !261, size: 64, offset: 2176)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !263, line: 486, size: 1600, elements: !264)
!263 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !262, file: !263, line: 487, baseType: !162, size: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !262, file: !263, line: 489, baseType: !218, size: 128, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !262, file: !263, line: 490, baseType: !218, size: 128, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !262, file: !263, line: 491, baseType: !218, size: 128, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !262, file: !263, line: 492, baseType: !218, size: 128, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !263, line: 494, baseType: !141, size: 32, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !262, file: !263, line: 495, baseType: !141, size: 32, offset: 1504)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !262, file: !263, line: 497, baseType: !141, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !262, file: !263, line: 498, baseType: !141, size: 32, offset: 1568)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !159, file: !109, line: 132, baseType: !261, size: 64, offset: 2240)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !159, file: !109, line: 133, baseType: !276, size: 64, offset: 2304)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !263, line: 334, size: 1728, elements: !278)
!278 = !{!279, !280, !283, !284, !285, !286, !287, !288, !291, !292, !293, !294, !295, !296, !297, !317}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !277, file: !263, line: 335, baseType: !218, size: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !277, file: !263, line: 336, baseType: !281, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !263, line: 47, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !263, line: 338, baseType: !195, size: 16, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !277, file: !263, line: 338, baseType: !195, size: 16, offset: 208)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !277, file: !263, line: 339, baseType: !7, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !277, file: !263, line: 340, baseType: !141, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !277, file: !263, line: 342, baseType: !254, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !277, file: !263, line: 343, baseType: !289, size: 96, offset: 320)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 96, elements: !290)
!290 = !{!257}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !277, file: !263, line: 344, baseType: !289, size: 96, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !277, file: !263, line: 347, baseType: !218, size: 128, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !277, file: !263, line: 349, baseType: !141, size: 32, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !277, file: !263, line: 350, baseType: !141, size: 32, offset: 672)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !277, file: !263, line: 351, baseType: !167, size: 64, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !277, file: !263, line: 352, baseType: !167, size: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !277, file: !263, line: 354, baseType: !298, size: 384, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !263, line: 116, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !263, line: 94, size: 384, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !299, file: !263, line: 96, baseType: !141, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !299, file: !263, line: 96, baseType: !141, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !299, file: !263, line: 97, baseType: !141, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !299, file: !263, line: 97, baseType: !141, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !299, file: !263, line: 99, baseType: !195, size: 16, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !299, file: !263, line: 100, baseType: !195, size: 16, offset: 144)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !299, file: !263, line: 102, baseType: !195, size: 16, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !299, file: !263, line: 105, baseType: !195, size: 16, offset: 176)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !299, file: !263, line: 108, baseType: !195, size: 16, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !299, file: !263, line: 109, baseType: !195, size: 16, offset: 208)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !299, file: !263, line: 111, baseType: !195, size: 16, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !299, file: !263, line: 112, baseType: !195, size: 16, offset: 240)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !299, file: !263, line: 114, baseType: !141, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !299, file: !263, line: 114, baseType: !141, size: 32, offset: 288)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !299, file: !263, line: 115, baseType: !141, size: 32, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !299, file: !263, line: 115, baseType: !141, size: 32, offset: 352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !277, file: !263, line: 355, baseType: !146, size: 512, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !109, line: 134, baseType: !167, size: 64, offset: 2368)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !159, file: !109, line: 136, baseType: !320, size: 64, offset: 2432)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !109, line: 58, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !159, file: !109, line: 138, baseType: !298, size: 384, offset: 2496)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !159, file: !109, line: 139, baseType: !324, size: 64, offset: 2880)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !263, line: 80, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !263, line: 72, size: 192, elements: !327)
!327 = !{!328, !335, !336, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !326, file: !263, line: 73, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !263, line: 59, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !263, line: 56, size: 128, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !331, file: !263, line: 57, baseType: !289, size: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !263, line: 58, baseType: !141, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !326, file: !263, line: 74, baseType: !141, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !326, file: !263, line: 76, baseType: !141, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !326, file: !263, line: 77, baseType: !141, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !263, line: 79, baseType: !141, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !159, file: !109, line: 141, baseType: !218, size: 128, offset: 2944)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !159, file: !109, line: 142, baseType: !218, size: 128, offset: 3072)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !159, file: !109, line: 143, baseType: !218, size: 128, offset: 3200)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !159, file: !109, line: 144, baseType: !218, size: 128, offset: 3328)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !159, file: !109, line: 146, baseType: !141, size: 32, offset: 3456)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !159, file: !109, line: 147, baseType: !141, size: 32, offset: 3488)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !159, file: !109, line: 150, baseType: !346, size: 64, offset: 3520)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !109, line: 50, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !159, file: !109, line: 151, baseType: !155, size: 64, offset: 3584)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !159, file: !109, line: 152, baseType: !141, size: 32, offset: 3648)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !159, file: !109, line: 153, baseType: !141, size: 32, offset: 3680)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !159, file: !109, line: 156, baseType: !289, size: 96, offset: 3712)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !159, file: !109, line: 156, baseType: !289, size: 96, offset: 3808)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !159, file: !109, line: 156, baseType: !289, size: 96, offset: 3904)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !159, file: !109, line: 157, baseType: !289, size: 96, offset: 4000)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !159, file: !109, line: 158, baseType: !289, size: 96, offset: 4096)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !159, file: !109, line: 159, baseType: !289, size: 96, offset: 4192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !159, file: !109, line: 160, baseType: !289, size: 96, offset: 4288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !159, file: !109, line: 160, baseType: !289, size: 96, offset: 4384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !159, file: !109, line: 161, baseType: !361, size: 128, offset: 4480)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 4)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !159, file: !109, line: 161, baseType: !361, size: 128, offset: 4608)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !159, file: !109, line: 162, baseType: !289, size: 96, offset: 4736)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !159, file: !109, line: 162, baseType: !289, size: 96, offset: 4832)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !159, file: !109, line: 163, baseType: !254, size: 32, offset: 4928)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !159, file: !109, line: 163, baseType: !254, size: 32, offset: 4960)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !159, file: !109, line: 164, baseType: !370, size: 512, offset: 4992)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 512, elements: !371)
!371 = !{!363, !363}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !159, file: !109, line: 165, baseType: !370, size: 512, offset: 5504)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !159, file: !109, line: 166, baseType: !370, size: 512, offset: 6016)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !159, file: !109, line: 167, baseType: !370, size: 512, offset: 6528)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !159, file: !109, line: 176, baseType: !370, size: 512, offset: 7040)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !159, file: !109, line: 178, baseType: !7, size: 32, offset: 7552)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !109, line: 180, baseType: !195, size: 16, offset: 7584)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !159, file: !109, line: 181, baseType: !195, size: 16, offset: 7600)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !159, file: !109, line: 183, baseType: !195, size: 16, offset: 7616)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !159, file: !109, line: 183, baseType: !195, size: 16, offset: 7632)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !159, file: !109, line: 184, baseType: !195, size: 16, offset: 7648)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !159, file: !109, line: 184, baseType: !195, size: 16, offset: 7664)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !159, file: !109, line: 185, baseType: !195, size: 16, offset: 7680)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !159, file: !109, line: 186, baseType: !195, size: 16, offset: 7696)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !159, file: !109, line: 187, baseType: !195, size: 16, offset: 7712)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !159, file: !109, line: 188, baseType: !147, size: 8, offset: 7728)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !159, file: !109, line: 189, baseType: !147, size: 8, offset: 7736)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !159, file: !109, line: 192, baseType: !141, size: 32, offset: 7744)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !159, file: !109, line: 192, baseType: !141, size: 32, offset: 7776)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !159, file: !109, line: 192, baseType: !141, size: 32, offset: 7808)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !159, file: !109, line: 192, baseType: !141, size: 32, offset: 7840)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !159, file: !109, line: 194, baseType: !141, size: 32, offset: 7872)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !159, file: !109, line: 202, baseType: !254, size: 32, offset: 7904)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !159, file: !109, line: 202, baseType: !254, size: 32, offset: 7936)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !159, file: !109, line: 202, baseType: !254, size: 32, offset: 7968)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !159, file: !109, line: 211, baseType: !254, size: 32, offset: 8000)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !159, file: !109, line: 212, baseType: !254, size: 32, offset: 8032)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !159, file: !109, line: 213, baseType: !254, size: 32, offset: 8064)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !159, file: !109, line: 214, baseType: !254, size: 32, offset: 8096)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !159, file: !109, line: 215, baseType: !254, size: 32, offset: 8128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !159, file: !109, line: 216, baseType: !254, size: 32, offset: 8160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !159, file: !109, line: 219, baseType: !254, size: 32, offset: 8192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !159, file: !109, line: 220, baseType: !254, size: 32, offset: 8224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !159, file: !109, line: 221, baseType: !254, size: 32, offset: 8256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !159, file: !109, line: 224, baseType: !406, size: 16, offset: 8288)
!406 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !159, file: !109, line: 224, baseType: !406, size: 16, offset: 8304)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !159, file: !109, line: 226, baseType: !195, size: 16, offset: 8320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !159, file: !109, line: 228, baseType: !147, size: 8, offset: 8336)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !159, file: !109, line: 229, baseType: !147, size: 8, offset: 8344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !159, file: !109, line: 231, baseType: !195, size: 16, offset: 8352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !159, file: !109, line: 232, baseType: !147, size: 8, offset: 8368)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !159, file: !109, line: 233, baseType: !147, size: 8, offset: 8376)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !159, file: !109, line: 234, baseType: !254, size: 32, offset: 8384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !159, file: !109, line: 235, baseType: !254, size: 32, offset: 8416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !159, file: !109, line: 237, baseType: !218, size: 128, offset: 8448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !159, file: !109, line: 238, baseType: !218, size: 128, offset: 8576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !159, file: !109, line: 239, baseType: !218, size: 128, offset: 8704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !159, file: !109, line: 240, baseType: !218, size: 128, offset: 8832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !159, file: !109, line: 242, baseType: !254, size: 32, offset: 8960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !159, file: !109, line: 244, baseType: !195, size: 16, offset: 8992)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !159, file: !109, line: 245, baseType: !406, size: 16, offset: 9008)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !159, file: !109, line: 246, baseType: !361, size: 128, offset: 9024)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !159, file: !109, line: 248, baseType: !141, size: 32, offset: 9152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !159, file: !109, line: 249, baseType: !141, size: 32, offset: 9184)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !159, file: !109, line: 251, baseType: !427, size: 64, offset: 9216)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !109, line: 251, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !159, file: !109, line: 253, baseType: !147, size: 8, offset: 9280)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !159, file: !109, line: 254, baseType: !147, size: 8, offset: 9288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !159, file: !109, line: 255, baseType: !195, size: 16, offset: 9296)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !159, file: !109, line: 256, baseType: !289, size: 96, offset: 9312)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !159, file: !109, line: 258, baseType: !218, size: 128, offset: 9408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !159, file: !109, line: 259, baseType: !218, size: 128, offset: 9536)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !159, file: !109, line: 260, baseType: !218, size: 128, offset: 9664)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !159, file: !109, line: 261, baseType: !218, size: 128, offset: 9792)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !159, file: !109, line: 263, baseType: !438, size: 64, offset: 9920)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !109, line: 52, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !159, file: !109, line: 264, baseType: !441, size: 64, offset: 9984)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !109, line: 53, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !159, file: !109, line: 265, baseType: !444, size: 64, offset: 10048)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !263, line: 46, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !159, file: !109, line: 267, baseType: !147, size: 8, offset: 10112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !159, file: !109, line: 268, baseType: !147, size: 8, offset: 10120)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !159, file: !109, line: 269, baseType: !195, size: 16, offset: 10128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !159, file: !109, line: 270, baseType: !254, size: 32, offset: 10144)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !159, file: !109, line: 272, baseType: !451, size: 64, offset: 10176)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !109, line: 54, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !159, file: !109, line: 275, baseType: !454, size: 64, offset: 10240)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !109, line: 275, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !159, file: !109, line: 277, baseType: !457, size: 64, offset: 10304)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !459)
!459 = !{!460, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !511, !514, !516, !517, !519, !520, !521, !522, !528, !533, !534, !538, !539, !540, !541, !542, !555, !567, !581, !585, !589, !593, !602, !614, !618, !622, !626, !630, !634, !635, !636, !637, !638, !639, !643, !644, !645, !646, !650, !651, !652, !653, !654, !659, !660, !661, !662, !663, !667, !668, !669, !670, !671, !678, !689, !694, !700, !710, !716, !727, !734, !741, !745, !750, !754, !759, !760, !761, !768, !774, !775, !776, !781, !782, !791, !899, !903, !911, !915, !919, !923, !931, !941}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !458, file: !28, line: 180, baseType: !461, size: 1600)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !65, line: 73, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !65, line: 64, size: 1600, elements: !463)
!463 = !{!464, !479, !483, !484, !485, !486, !489}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !462, file: !65, line: 65, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !65, line: 53, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !65, line: 42, size: 832, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !467, file: !65, line: 43, baseType: !141, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !467, file: !65, line: 44, baseType: !141, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !65, line: 45, baseType: !141, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !467, file: !65, line: 46, baseType: !141, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !467, file: !65, line: 47, baseType: !141, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !467, file: !65, line: 48, baseType: !141, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !467, file: !65, line: 49, baseType: !141, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !467, file: !65, line: 50, baseType: !141, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !65, line: 51, baseType: !146, size: 512, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !467, file: !65, line: 52, baseType: !167, size: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !462, file: !65, line: 66, baseType: !480, size: 1312, offset: 64)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1312, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 41)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !462, file: !65, line: 69, baseType: !141, size: 32, offset: 1376)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !462, file: !65, line: 69, baseType: !141, size: 32, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !462, file: !65, line: 70, baseType: !141, size: 32, offset: 1440)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !462, file: !65, line: 71, baseType: !487, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !65, line: 71, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !462, file: !65, line: 72, baseType: !490, size: 64, offset: 1536)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !65, line: 59, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !65, line: 57, size: 8192, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !492, file: !65, line: 58, baseType: !182, size: 8192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !458, file: !28, line: 180, baseType: !461, size: 1600, offset: 1600)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !458, file: !28, line: 180, baseType: !461, size: 1600, offset: 3200)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !458, file: !28, line: 180, baseType: !461, size: 1600, offset: 4800)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !458, file: !28, line: 180, baseType: !461, size: 1600, offset: 6400)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !458, file: !28, line: 181, baseType: !141, size: 32, offset: 8000)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !458, file: !28, line: 181, baseType: !141, size: 32, offset: 8032)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !458, file: !28, line: 181, baseType: !141, size: 32, offset: 8064)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !458, file: !28, line: 181, baseType: !141, size: 32, offset: 8096)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !458, file: !28, line: 181, baseType: !141, size: 32, offset: 8128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !458, file: !28, line: 182, baseType: !141, size: 32, offset: 8160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !458, file: !28, line: 183, baseType: !141, size: 32, offset: 8192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !458, file: !28, line: 184, baseType: !507, size: 64, offset: 8256)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !508, line: 124, baseType: !509)
!508 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !508, line: 124, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !458, file: !28, line: 185, baseType: !512, size: 64, offset: 8320)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !458, file: !28, line: 186, baseType: !515, size: 32, offset: 8384)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !458, file: !28, line: 187, baseType: !254, size: 32, offset: 8416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !458, file: !28, line: 188, baseType: !518, size: 32, offset: 8448)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !458, file: !28, line: 189, baseType: !141, size: 32, offset: 8480)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !458, file: !28, line: 190, baseType: !346, size: 64, offset: 8512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !458, file: !28, line: 193, baseType: !147, size: 8, offset: 8576)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !458, file: !28, line: 196, baseType: !523, size: 64, offset: 8640)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !458)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !458, file: !28, line: 199, baseType: !529, size: 64, offset: 8704)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !526, !532}
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !458, file: !28, line: 202, baseType: !523, size: 64, offset: 8768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !458, file: !28, line: 207, baseType: !535, size: 64, offset: 8832)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!141, !526}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !458, file: !28, line: 208, baseType: !535, size: 64, offset: 8896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !458, file: !28, line: 209, baseType: !535, size: 64, offset: 8960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !458, file: !28, line: 210, baseType: !535, size: 64, offset: 9024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !458, file: !28, line: 211, baseType: !535, size: 64, offset: 9088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !458, file: !28, line: 218, baseType: !543, size: 64, offset: 9152)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !526, !141, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !548, line: 65, size: 160, elements: !549)
!548 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!549 = !{!550, !551, !553, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !547, file: !548, line: 66, baseType: !289, size: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !547, file: !548, line: 67, baseType: !552, size: 48, offset: 96)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 48, elements: !290)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !547, file: !548, line: 68, baseType: !147, size: 8, offset: 144)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !547, file: !548, line: 68, baseType: !147, size: 8, offset: 152)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !458, file: !28, line: 219, baseType: !556, size: 64, offset: 9216)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !526, !141, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !548, line: 48, size: 96, elements: !561)
!561 = !{!562, !563, !564, !565, !566}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !560, file: !548, line: 49, baseType: !7, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !560, file: !548, line: 49, baseType: !7, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !560, file: !548, line: 50, baseType: !147, size: 8, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !560, file: !548, line: 50, baseType: !147, size: 8, offset: 72)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !548, line: 51, baseType: !195, size: 16, offset: 80)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !458, file: !28, line: 220, baseType: !568, size: 64, offset: 9280)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !526, !141, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !548, line: 42, size: 160, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !572, file: !548, line: 43, baseType: !7, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !572, file: !548, line: 43, baseType: !7, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !572, file: !548, line: 43, baseType: !7, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !572, file: !548, line: 43, baseType: !7, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !572, file: !548, line: 44, baseType: !195, size: 16, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !572, file: !548, line: 45, baseType: !147, size: 8, offset: 144)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !572, file: !548, line: 45, baseType: !147, size: 8, offset: 152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !458, file: !28, line: 227, baseType: !582, size: 64, offset: 9344)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!546, !526}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !458, file: !28, line: 228, baseType: !586, size: 64, offset: 9408)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!559, !526}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !458, file: !28, line: 229, baseType: !590, size: 64, offset: 9472)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!571, !526}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !458, file: !28, line: 230, baseType: !594, size: 64, offset: 9536)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!597, !526}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !548, line: 88, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !598, file: !548, line: 89, baseType: !7, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !598, file: !548, line: 90, baseType: !7, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !458, file: !28, line: 231, baseType: !603, size: 64, offset: 9600)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !526}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !548, line: 79, size: 96, elements: !608)
!608 = !{!609, !610, !611, !612, !613}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !607, file: !548, line: 81, baseType: !141, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !607, file: !548, line: 82, baseType: !141, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !607, file: !548, line: 83, baseType: !195, size: 16, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !607, file: !548, line: 84, baseType: !147, size: 8, offset: 80)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !607, file: !548, line: 84, baseType: !147, size: 8, offset: 88)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !458, file: !28, line: 236, baseType: !615, size: 64, offset: 9664)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !526, !546}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !458, file: !28, line: 237, baseType: !619, size: 64, offset: 9728)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !526, !559}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !458, file: !28, line: 238, baseType: !623, size: 64, offset: 9792)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !526, !571}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !458, file: !28, line: 239, baseType: !627, size: 64, offset: 9856)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !526, !597}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !458, file: !28, line: 240, baseType: !631, size: 64, offset: 9920)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !526, !606}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !458, file: !28, line: 245, baseType: !582, size: 64, offset: 9984)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !458, file: !28, line: 246, baseType: !586, size: 64, offset: 10048)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !458, file: !28, line: 247, baseType: !590, size: 64, offset: 10112)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !458, file: !28, line: 248, baseType: !594, size: 64, offset: 10176)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !458, file: !28, line: 249, baseType: !603, size: 64, offset: 10240)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !458, file: !28, line: 255, baseType: !640, size: 64, offset: 10304)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!167, !526, !141, !141}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !458, file: !28, line: 256, baseType: !640, size: 64, offset: 10368)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !458, file: !28, line: 257, baseType: !640, size: 64, offset: 10432)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !458, file: !28, line: 258, baseType: !640, size: 64, offset: 10496)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !458, file: !28, line: 264, baseType: !647, size: 64, offset: 10560)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!167, !526, !141}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !458, file: !28, line: 265, baseType: !647, size: 64, offset: 10624)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !458, file: !28, line: 266, baseType: !647, size: 64, offset: 10688)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !458, file: !28, line: 267, baseType: !647, size: 64, offset: 10752)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !458, file: !28, line: 268, baseType: !647, size: 64, offset: 10816)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !458, file: !28, line: 272, baseType: !655, size: 64, offset: 10880)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!658, !526}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !458, file: !28, line: 273, baseType: !655, size: 64, offset: 10944)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !458, file: !28, line: 274, baseType: !655, size: 64, offset: 11008)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !458, file: !28, line: 275, baseType: !655, size: 64, offset: 11072)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !458, file: !28, line: 276, baseType: !655, size: 64, offset: 11136)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !458, file: !28, line: 279, baseType: !664, size: 64, offset: 11200)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !526, !141, !658, !141}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !458, file: !28, line: 280, baseType: !664, size: 64, offset: 11264)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !458, file: !28, line: 281, baseType: !664, size: 64, offset: 11328)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !458, file: !28, line: 284, baseType: !535, size: 64, offset: 11392)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !458, file: !28, line: 285, baseType: !535, size: 64, offset: 11456)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !458, file: !28, line: 286, baseType: !672, size: 64, offset: 11520)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!675, !526}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !458, file: !28, line: 287, baseType: !679, size: 64, offset: 11584)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!682, !526}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !685)
!685 = !{!686, !688}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !684, file: !28, line: 118, baseType: !687, size: 128)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !362)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !684, file: !28, line: 119, baseType: !687, size: 128, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !458, file: !28, line: 288, baseType: !690, size: 64, offset: 11648)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!693, !526}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !458, file: !28, line: 289, baseType: !695, size: 64, offset: 11712)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !526, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !458, file: !28, line: 290, baseType: !701, size: 64, offset: 11776)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !526}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !706, file: !28, line: 124, baseType: !195, size: 16)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !706, file: !28, line: 125, baseType: !147, size: 8, offset: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !458, file: !28, line: 291, baseType: !711, size: 64, offset: 11840)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!714, !526}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !458, file: !28, line: 299, baseType: !717, size: 64, offset: 11904)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !526, !720, !167, !726}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !167, !141, !723, !723, !724}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !458, file: !28, line: 309, baseType: !728, size: 64, offset: 11968)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !526, !731, !167}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !167, !141, !723, !723}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !458, file: !28, line: 317, baseType: !735, size: 64, offset: 12032)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !526, !738, !167, !726}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !167, !141, !141, !723, !723}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !458, file: !28, line: 327, baseType: !742, size: 64, offset: 12096)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !526, !731, !167, !726}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !458, file: !28, line: 337, baseType: !746, size: 64, offset: 12160)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !526, !749, !749}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !458, file: !28, line: 344, baseType: !751, size: 64, offset: 12224)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !526, !141, !749}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !458, file: !28, line: 347, baseType: !755, size: 64, offset: 12288)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !526, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !458, file: !28, line: 350, baseType: !751, size: 64, offset: 12352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !458, file: !28, line: 351, baseType: !751, size: 64, offset: 12416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !458, file: !28, line: 355, baseType: !762, size: 64, offset: 12480)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!765, !158, !526}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !458, file: !28, line: 359, baseType: !769, size: 64, offset: 12544)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !158, !526}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !458, file: !28, line: 364, baseType: !523, size: 64, offset: 12608)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !458, file: !28, line: 367, baseType: !523, size: 64, offset: 12672)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !458, file: !28, line: 373, baseType: !777, size: 64, offset: 12736)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !526, !780, !780}
!780 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !458, file: !28, line: 376, baseType: !523, size: 64, offset: 12800)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !458, file: !28, line: 385, baseType: !783, size: 64, offset: 12864)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !526, !786, !780, !787}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!141, !141, !167}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !458, file: !28, line: 391, baseType: !792, size: 64, offset: 12928)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !526, !795, !894, !167, !898}
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!799, !800, !893, !141}
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !548, line: 160, size: 384, elements: !802)
!802 = !{!803, !807, !888, !889, !890, !891, !892}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !801, file: !548, line: 161, baseType: !804, size: 256)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 256, elements: !805)
!805 = !{!363, !806}
!806 = !DISubrange(count: 2)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !801, file: !548, line: 162, baseType: !808, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !153, line: 77, size: 15424, elements: !810)
!810 = !{!811, !812, !813, !816, !819, !822, !825, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !877, !878, !882}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !809, file: !153, line: 78, baseType: !162, size: 960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !153, line: 80, baseType: !182, size: 8192, offset: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !809, file: !153, line: 82, baseType: !814, size: 64, offset: 9152)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !153, line: 43, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !809, file: !153, line: 83, baseType: !817, size: 64, offset: 9216)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !163, line: 46, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !809, file: !153, line: 86, baseType: !820, size: 64, offset: 9280)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !153, line: 41, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !809, file: !153, line: 87, baseType: !823, size: 64, offset: 9344)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !153, line: 44, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !809, file: !153, line: 89, baseType: !826, size: 512, offset: 9408)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 512, elements: !827)
!827 = !{!256}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !809, file: !153, line: 90, baseType: !195, size: 16, offset: 9920)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !809, file: !153, line: 90, baseType: !195, size: 16, offset: 9936)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !809, file: !153, line: 92, baseType: !195, size: 16, offset: 9952)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !153, line: 92, baseType: !195, size: 16, offset: 9968)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !809, file: !153, line: 93, baseType: !195, size: 16, offset: 9984)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !809, file: !153, line: 93, baseType: !195, size: 16, offset: 10000)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !809, file: !153, line: 94, baseType: !141, size: 32, offset: 10016)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !809, file: !153, line: 97, baseType: !195, size: 16, offset: 10048)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !809, file: !153, line: 97, baseType: !195, size: 16, offset: 10064)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !809, file: !153, line: 98, baseType: !195, size: 16, offset: 10080)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !809, file: !153, line: 98, baseType: !195, size: 16, offset: 10096)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !809, file: !153, line: 99, baseType: !195, size: 16, offset: 10112)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !809, file: !153, line: 99, baseType: !195, size: 16, offset: 10128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !809, file: !153, line: 100, baseType: !7, size: 32, offset: 10144)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !809, file: !153, line: 101, baseType: !715, size: 64, offset: 10176)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !809, file: !153, line: 103, baseType: !188, size: 64, offset: 10240)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !809, file: !153, line: 104, baseType: !845, size: 64, offset: 10304)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !163, line: 159, size: 448, elements: !847)
!847 = !{!848, !851, !852, !854, !855, !857}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !846, file: !163, line: 161, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !850)
!850 = !{!806}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !846, file: !163, line: 162, baseType: !849, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !846, file: !163, line: 163, baseType: !853, size: 32, offset: 128)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 32, elements: !850)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !846, file: !163, line: 164, baseType: !853, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !846, file: !163, line: 165, baseType: !856, size: 128, offset: 192)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 128, elements: !850)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !846, file: !163, line: 166, baseType: !858, size: 128, offset: 320)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 128, elements: !850)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !809, file: !153, line: 107, baseType: !254, size: 32, offset: 10368)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !809, file: !153, line: 108, baseType: !141, size: 32, offset: 10400)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !809, file: !153, line: 109, baseType: !195, size: 16, offset: 10432)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !809, file: !153, line: 110, baseType: !195, size: 16, offset: 10448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !809, file: !153, line: 113, baseType: !141, size: 32, offset: 10464)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !809, file: !153, line: 113, baseType: !141, size: 32, offset: 10496)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !809, file: !153, line: 114, baseType: !147, size: 8, offset: 10528)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !809, file: !153, line: 114, baseType: !147, size: 8, offset: 10536)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !809, file: !153, line: 115, baseType: !195, size: 16, offset: 10544)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !809, file: !153, line: 116, baseType: !361, size: 128, offset: 10560)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !809, file: !153, line: 119, baseType: !254, size: 32, offset: 10688)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !809, file: !153, line: 119, baseType: !254, size: 32, offset: 10720)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !809, file: !153, line: 122, baseType: !872, size: 512, offset: 10752)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !873, line: 182, baseType: !874)
!873 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !873, line: 180, size: 512, elements: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !873, line: 181, baseType: !146, size: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !809, file: !153, line: 123, baseType: !147, size: 8, offset: 11264)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !809, file: !153, line: 125, baseType: !879, size: 56, offset: 11272)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 56, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 7)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !809, file: !153, line: 126, baseType: !883, size: 4096, offset: 11328)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 4096, elements: !827)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !153, line: 69, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !153, line: 67, size: 512, elements: !886)
!886 = !{!887}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !153, line: 68, baseType: !146, size: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !801, file: !548, line: 163, baseType: !147, size: 8, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !801, file: !548, line: 163, baseType: !147, size: 8, offset: 328)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !801, file: !548, line: 164, baseType: !195, size: 16, offset: 336)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !801, file: !548, line: 164, baseType: !195, size: 16, offset: 352)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !801, file: !548, line: 164, baseType: !195, size: 16, offset: 368)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!141, !167, !141, !141}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !458, file: !28, line: 400, baseType: !900, size: 64, offset: 12992)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !526, !787}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !458, file: !28, line: 415, baseType: !904, size: 64, offset: 13056)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !526, !907, !787, !894, !167, !898}
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!799, !167, !141}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !458, file: !28, line: 425, baseType: !912, size: 64, offset: 13120)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !526, !907, !894, !167, !898}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !458, file: !28, line: 435, baseType: !916, size: 64, offset: 13184)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !526, !787, !907, !167}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !458, file: !28, line: 444, baseType: !920, size: 64, offset: 13248)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !526, !907, !167}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !458, file: !28, line: 455, baseType: !924, size: 64, offset: 13312)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !526, !907, !927, !167}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !167, !141, !254}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !458, file: !28, line: 464, baseType: !932, size: 64, offset: 13376)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !526, !935, !938, !167}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !167, !141, !167}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!780, !167, !141}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !458, file: !28, line: 470, baseType: !523, size: 64, offset: 13440)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !159, file: !109, line: 277, baseType: !457, size: 64, offset: 10368)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !159, file: !109, line: 278, baseType: !944, size: 64, offset: 10432)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !945, line: 27, baseType: !946)
!945 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !947, line: 45, baseType: !948)
!947 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!948 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !159, file: !109, line: 279, baseType: !944, size: 64, offset: 10496)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !159, file: !109, line: 280, baseType: !7, size: 32, offset: 10560)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !159, file: !109, line: 281, baseType: !7, size: 32, offset: 10592)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !159, file: !109, line: 283, baseType: !218, size: 128, offset: 10624)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !159, file: !109, line: 284, baseType: !218, size: 128, offset: 10752)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !159, file: !109, line: 285, baseType: !955, size: 64, offset: 10880)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !159, file: !109, line: 287, baseType: !957, size: 64, offset: 10944)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !109, line: 59, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !159, file: !109, line: 288, baseType: !960, size: 64, offset: 11008)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !109, line: 288, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !159, file: !109, line: 290, baseType: !963, size: 64, offset: 11072)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 64, elements: !850)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !159, file: !109, line: 291, baseType: !965, size: 64, offset: 11136)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !153, line: 65, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !153, line: 50, size: 320, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !967, file: !153, line: 51, baseType: !151, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !967, file: !153, line: 53, baseType: !141, size: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !967, file: !153, line: 54, baseType: !141, size: 32, offset: 96)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !967, file: !153, line: 55, baseType: !141, size: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !967, file: !153, line: 55, baseType: !141, size: 32, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !967, file: !153, line: 56, baseType: !147, size: 8, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !967, file: !153, line: 56, baseType: !147, size: 8, offset: 200)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !967, file: !153, line: 57, baseType: !147, size: 8, offset: 208)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !967, file: !153, line: 57, baseType: !147, size: 8, offset: 216)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !967, file: !153, line: 59, baseType: !195, size: 16, offset: 224)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !967, file: !153, line: 59, baseType: !195, size: 16, offset: 240)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !967, file: !153, line: 59, baseType: !195, size: 16, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !967, file: !153, line: 61, baseType: !195, size: 16, offset: 272)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !967, file: !153, line: 63, baseType: !141, size: 32, offset: 288)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !159, file: !109, line: 293, baseType: !218, size: 128, offset: 11200)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !159, file: !109, line: 294, baseType: !985, size: 64, offset: 11328)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !109, line: 113, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !109, line: 108, size: 256, elements: !988)
!988 = !{!989, !991, !992, !993, !994}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !987, file: !109, line: 109, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !987, file: !109, line: 109, baseType: !990, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !987, file: !109, line: 110, baseType: !158, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !109, line: 111, baseType: !141, size: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !987, file: !109, line: 112, baseType: !254, size: 32, offset: 224)
!995 = !{!996}
!996 = !DISubrange(count: 10)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !131, file: !61, line: 405, baseType: !808, size: 64, offset: 1536)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !61, line: 406, baseType: !141, size: 32, offset: 1600)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "num_projectors", scope: !131, file: !61, line: 407, baseType: !141, size: 32, offset: 1632)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "aspectx", scope: !131, file: !61, line: 408, baseType: !254, size: 32, offset: 1664)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "aspecty", scope: !131, file: !61, line: 408, baseType: !254, size: 32, offset: 1696)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "scalex", scope: !131, file: !61, line: 409, baseType: !254, size: 32, offset: 1728)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "scaley", scope: !131, file: !61, line: 409, baseType: !254, size: 32, offset: 1760)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "uvlayer_name", scope: !131, file: !61, line: 410, baseType: !146, size: 512, offset: 1792)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "uvlayer_tmp", scope: !131, file: !61, line: 411, baseType: !141, size: 32, offset: 2304)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !131, file: !61, line: 411, baseType: !141, size: 32, offset: 2336)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "Camera", file: !123, line: 71, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !123, line: 47, size: 1600, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1009, file: !123, line: 48, baseType: !162, size: 960)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1009, file: !123, line: 49, baseType: !229, size: 64, offset: 960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1009, file: !123, line: 51, baseType: !147, size: 8, offset: 1024)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1009, file: !123, line: 52, baseType: !147, size: 8, offset: 1032)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1009, file: !123, line: 53, baseType: !195, size: 16, offset: 1040)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "passepartalpha", scope: !1009, file: !123, line: 54, baseType: !254, size: 32, offset: 1056)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !1009, file: !123, line: 55, baseType: !254, size: 32, offset: 1088)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !1009, file: !123, line: 55, baseType: !254, size: 32, offset: 1120)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !1009, file: !123, line: 56, baseType: !254, size: 32, offset: 1152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ortho_scale", scope: !1009, file: !123, line: 56, baseType: !254, size: 32, offset: 1184)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "drawsize", scope: !1009, file: !123, line: 56, baseType: !254, size: 32, offset: 1216)
