; ModuleID = 'blender/source/blender/editors/space_time/time_ops.c'
source_filename = "blender/source/blender/editors/space_time/time_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!190 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!191 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!192 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!193 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!194 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!195 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!196 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!197 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!198 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!199 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!200 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!201 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!202 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!203 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!204 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!205 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!206 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!207 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!208 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!209 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!210 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!211 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!212 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!213 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!214 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!215 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!216 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!217 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!218 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!219 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!220 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!221 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!222 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!223 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!224 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!225 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!226 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!227 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!228 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!229 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !231, line: 351, baseType: !5, size: 32, elements: !232)
!231 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !{!233, !234, !235, !236, !237, !238}
!233 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!234 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!235 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!236 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!237 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!238 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!241 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!242 = !{i32 7, !"Dwarf Version", i32 4}
!243 = !{i32 2, !"Debug Info Version", i32 3}
!244 = !{i32 1, !"wchar_size", i32 4}
!245 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!246 = distinct !DISubprogram(name: "time_operatortypes", scope: !1, file: !1, line: 181, type: !247, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{null}
!249 = !{}
!250 = !DILocation(line: 183, column: 2, scope: !246)
!251 = !DILocation(line: 184, column: 2, scope: !246)
!252 = !DILocation(line: 185, column: 2, scope: !246)
!253 = !DILocation(line: 186, column: 1, scope: !246)
!254 = distinct !DISubprogram(name: "TIME_OT_start_frame_set", scope: !1, file: !1, line: 78, type: !255, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !249)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !259, line: 568, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !259, line: 508, size: 1536, elements: !261)
!261 = !{!262, !266, !267, !268, !269, !1714, !1718, !1724, !1728, !1729, !1733, !1734, !1735, !1736, !1740, !1741, !1756, !1757, !1761, !1787}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !259, line: 509, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !260, file: !259, line: 510, baseType: !263, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !260, file: !259, line: 511, baseType: !263, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !260, file: !259, line: 512, baseType: !263, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !260, file: !259, line: 518, baseType: !270, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !274, !277}
!273 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !276, line: 44, flags: DIFlagFwdDecl)
!276 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !231, line: 328, size: 1344, elements: !279)
!279 = !{!280, !281, !282, !286, !317, !319, !320, !321, !333, !1707, !1708, !1709, !1712, !1713}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !231, line: 329, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !278, file: !231, line: 329, baseType: !277, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !278, file: !231, line: 332, baseType: !283, size: 512, offset: 128)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 512, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !278, file: !231, line: 333, baseType: !287, size: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !289, line: 75, baseType: !290)
!289 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !289, line: 62, size: 1024, elements: !291)
!291 = !{!292, !294, !295, !296, !297, !299, !300, !301, !315, !316}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !289, line: 63, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !289, line: 63, baseType: !293, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !289, line: 64, baseType: !265, size: 8, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !290, file: !289, line: 64, baseType: !265, size: 8, offset: 136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !289, line: 65, baseType: !298, size: 16, offset: 144)
!298 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !289, line: 66, baseType: !283, size: 512, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !290, file: !289, line: 67, baseType: !273, size: 32, offset: 672)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !290, file: !289, line: 69, baseType: !302, size: 256, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !289, line: 60, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !289, line: 48, size: 256, elements: !304)
!304 = !{!305, !306, !313, !314}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !303, file: !289, line: 49, baseType: !240, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !303, file: !289, line: 58, baseType: !307, size: 128, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !308, line: 71, baseType: !309)
!308 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !308, line: 69, size: 128, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !309, file: !308, line: 70, baseType: !240, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !309, file: !308, line: 70, baseType: !240, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !303, file: !289, line: 59, baseType: !273, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !303, file: !289, line: 59, baseType: !273, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !290, file: !289, line: 70, baseType: !273, size: 32, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !290, file: !289, line: 74, baseType: !273, size: 32, offset: 992)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !231, line: 336, baseType: !318, size: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !278, file: !231, line: 337, baseType: !240, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !278, file: !231, line: 338, baseType: !240, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !278, file: !231, line: 340, baseType: !322, size: 64, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !276, line: 55, size: 192, elements: !324)
!324 = !{!325, !329, !332}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !323, file: !276, line: 58, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !323, file: !276, line: 56, size: 64, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !276, line: 57, baseType: !240, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !323, file: !276, line: 60, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !276, line: 41, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !323, file: !276, line: 61, baseType: !240, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !278, file: !231, line: 341, baseType: !334, size: 64, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !231, line: 106, size: 320, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !335, file: !231, line: 107, baseType: !307, size: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !335, file: !231, line: 108, baseType: !273, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !335, file: !231, line: 109, baseType: !273, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !231, line: 110, baseType: !273, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !335, file: !231, line: 110, baseType: !273, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !335, file: !231, line: 111, baseType: !343, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !259, line: 490, size: 768, elements: !345)
!345 = !{!346, !347, !348, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !259, line: 491, baseType: !343, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !344, file: !259, line: 491, baseType: !343, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !344, file: !259, line: 493, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !231, line: 169, size: 2048, elements: !351)
!351 = !{!352, !353, !354, !355, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1673, !1676, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !231, line: 170, baseType: !349, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !231, line: 170, baseType: !349, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !350, file: !231, line: 172, baseType: !240, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !350, file: !231, line: 174, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !358, line: 49, size: 1984, elements: !359)
!358 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!359 = !{!360, !396, !397, !398, !399, !400, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !357, file: !358, line: 50, baseType: !361, size: 960)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !289, line: 130, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !289, line: 117, size: 960, elements: !363)
!363 = !{!364, !365, !366, !368, !387, !391, !392, !393, !394, !395}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !289, line: 118, baseType: !240, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !362, file: !289, line: 118, baseType: !240, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !362, file: !289, line: 119, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !362, file: !289, line: 120, baseType: !369, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !289, line: 136, size: 17600, elements: !371)
!371 = !{!372, !373, !375, !378, !382, !383, !384}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !370, file: !289, line: 137, baseType: !361, size: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !370, file: !289, line: 138, baseType: !374, size: 64, offset: 960)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !370, file: !289, line: 139, baseType: !376, size: 64, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !289, line: 43, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !289, line: 140, baseType: !379, size: 8192, offset: 1088)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 8192, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 1024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !370, file: !289, line: 141, baseType: !379, size: 8192, offset: 9280)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !370, file: !289, line: 148, baseType: !369, size: 64, offset: 17472)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !370, file: !289, line: 150, baseType: !385, size: 64, offset: 17536)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !289, line: 45, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !289, line: 121, baseType: !388, size: 528, offset: 256)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 528, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 66)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !362, file: !289, line: 126, baseType: !298, size: 16, offset: 784)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !362, file: !289, line: 127, baseType: !273, size: 32, offset: 800)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !362, file: !289, line: 128, baseType: !273, size: 32, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !362, file: !289, line: 128, baseType: !273, size: 32, offset: 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !362, file: !289, line: 129, baseType: !287, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !357, file: !358, line: 52, baseType: !307, size: 128, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !357, file: !358, line: 53, baseType: !307, size: 128, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !357, file: !358, line: 54, baseType: !307, size: 128, offset: 1216)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !357, file: !358, line: 55, baseType: !307, size: 128, offset: 1344)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !357, file: !358, line: 57, baseType: !401, size: 64, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !403, line: 1216, size: 39680, elements: !404)
!403 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!404 = !{!405, !406, !409, !412, !415, !416, !417, !429, !430, !434, !435, !436, !437, !438, !439, !440, !441, !442, !446, !523, !961, !1176, !1179, !1468, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1490, !1491, !1492, !1493, !1494, !1502, !1569, !1576, !1577, !1584, !1585, !1591, !1592, !1593, !1594, !1595}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !403, line: 1217, baseType: !361, size: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !402, file: !403, line: 1218, baseType: !407, size: 64, offset: 960)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !403, line: 58, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !402, file: !403, line: 1220, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !403, line: 50, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !402, file: !403, line: 1221, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !403, line: 52, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !402, file: !403, line: 1223, baseType: !401, size: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !402, file: !403, line: 1225, baseType: !307, size: 128, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !402, file: !403, line: 1226, baseType: !418, size: 64, offset: 1344)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !403, line: 69, size: 320, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !403, line: 70, baseType: !418, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !403, line: 70, baseType: !418, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !419, file: !403, line: 71, baseType: !5, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !419, file: !403, line: 71, baseType: !5, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !403, line: 72, baseType: !273, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !419, file: !403, line: 73, baseType: !298, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !419, file: !403, line: 73, baseType: !298, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !419, file: !403, line: 74, baseType: !410, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !402, file: !403, line: 1227, baseType: !410, size: 64, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !402, file: !403, line: 1229, baseType: !431, size: 96, offset: 1472)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 96, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 3)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !402, file: !403, line: 1230, baseType: !431, size: 96, offset: 1568)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !402, file: !403, line: 1231, baseType: !431, size: 96, offset: 1664)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !402, file: !403, line: 1231, baseType: !431, size: 96, offset: 1760)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !402, file: !403, line: 1233, baseType: !5, size: 32, offset: 1856)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !402, file: !403, line: 1234, baseType: !273, size: 32, offset: 1888)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !402, file: !403, line: 1235, baseType: !5, size: 32, offset: 1920)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !403, line: 1237, baseType: !298, size: 16, offset: 1952)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !402, file: !403, line: 1239, baseType: !265, size: 8, offset: 1968)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !403, line: 1240, baseType: !443, size: 8, offset: 1976)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 8, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 1)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !402, file: !403, line: 1242, baseType: !447, size: 64, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !449, line: 328, size: 3456, elements: !450)
!449 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!450 = !{!451, !452, !453, !456, !457, !458, !461, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !488, !489, !490, !493, !498, !499, !502, !506, !511, !515, !519, !520, !521, !522}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !448, file: !449, line: 329, baseType: !361, size: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !448, file: !449, line: 330, baseType: !407, size: 64, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !448, file: !449, line: 332, baseType: !454, size: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !449, line: 332, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !448, file: !449, line: 333, baseType: !283, size: 512, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !448, file: !449, line: 335, baseType: !330, size: 64, offset: 1600)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !448, file: !449, line: 337, baseType: !459, size: 64, offset: 1664)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !403, line: 61, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !448, file: !449, line: 338, baseType: !462, size: 64, offset: 1728)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 2)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !448, file: !449, line: 340, baseType: !307, size: 128, offset: 1792)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !448, file: !449, line: 340, baseType: !307, size: 128, offset: 1920)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !449, line: 342, baseType: !273, size: 32, offset: 2048)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !448, file: !449, line: 342, baseType: !273, size: 32, offset: 2080)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !448, file: !449, line: 343, baseType: !273, size: 32, offset: 2112)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !449, line: 345, baseType: !273, size: 32, offset: 2144)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !448, file: !449, line: 346, baseType: !273, size: 32, offset: 2176)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !448, file: !449, line: 347, baseType: !298, size: 16, offset: 2208)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !448, file: !449, line: 348, baseType: !298, size: 16, offset: 2224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !448, file: !449, line: 349, baseType: !273, size: 32, offset: 2240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !448, file: !449, line: 351, baseType: !273, size: 32, offset: 2272)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !448, file: !449, line: 353, baseType: !298, size: 16, offset: 2304)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !448, file: !449, line: 354, baseType: !298, size: 16, offset: 2320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !448, file: !449, line: 355, baseType: !273, size: 32, offset: 2336)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !448, file: !449, line: 357, baseType: !480, size: 128, offset: 2368)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !481, line: 95, baseType: !482)
!481 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !481, line: 92, size: 128, elements: !483)
!483 = !{!484, !485, !486, !487}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !482, file: !481, line: 93, baseType: !241, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !482, file: !481, line: 93, baseType: !241, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !482, file: !481, line: 94, baseType: !241, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !482, file: !481, line: 94, baseType: !241, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !448, file: !449, line: 363, baseType: !307, size: 128, offset: 2496)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !448, file: !449, line: 363, baseType: !307, size: 128, offset: 2624)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !448, file: !449, line: 368, baseType: !491, size: 64, offset: 2752)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !449, line: 48, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !448, file: !449, line: 372, baseType: !494, size: 32, offset: 2816)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !449, line: 274, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !449, line: 271, size: 32, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !495, file: !449, line: 273, baseType: !5, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !448, file: !449, line: 373, baseType: !273, size: 32, offset: 2848)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !448, file: !449, line: 382, baseType: !500, size: 64, offset: 2880)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !449, line: 46, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !448, file: !449, line: 385, baseType: !503, size: 64, offset: 2944)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !240, !241}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !448, file: !449, line: 386, baseType: !507, size: 64, offset: 3008)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !240, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !448, file: !449, line: 387, baseType: !512, size: 64, offset: 3072)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!273, !240}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !448, file: !449, line: 388, baseType: !516, size: 64, offset: 3136)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !240}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !448, file: !449, line: 389, baseType: !240, size: 64, offset: 3200)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !448, file: !449, line: 389, baseType: !240, size: 64, offset: 3264)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !448, file: !449, line: 389, baseType: !240, size: 64, offset: 3328)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !448, file: !449, line: 389, baseType: !240, size: 64, offset: 3392)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !402, file: !403, line: 1244, baseType: !524, size: 64, offset: 2048)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !526, line: 200, size: 17024, elements: !527)
!526 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!527 = !{!528, !530, !531, !532, !954, !955, !956, !957, !958, !959, !960}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !525, file: !526, line: 201, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !525, file: !526, line: 202, baseType: !307, size: 128, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !525, file: !526, line: 203, baseType: !307, size: 128, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !525, file: !526, line: 206, baseType: !533, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !526, line: 190, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !526, line: 126, size: 2816, elements: !536)
!536 = !{!537, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !636, !639, !640, !641, !925, !929, !930, !931, !932, !933, !934, !935, !936, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !953}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !526, line: 127, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !535, file: !526, line: 127, baseType: !538, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !535, file: !526, line: 128, baseType: !240, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !535, file: !526, line: 129, baseType: !240, size: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !535, file: !526, line: 130, baseType: !283, size: 512, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !535, file: !526, line: 132, baseType: !273, size: 32, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !535, file: !526, line: 132, baseType: !273, size: 32, offset: 800)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !535, file: !526, line: 133, baseType: !273, size: 32, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !535, file: !526, line: 134, baseType: !273, size: 32, offset: 864)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !535, file: !526, line: 134, baseType: !273, size: 32, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !535, file: !526, line: 134, baseType: !273, size: 32, offset: 928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !535, file: !526, line: 135, baseType: !273, size: 32, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !535, file: !526, line: 135, baseType: !273, size: 32, offset: 992)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !535, file: !526, line: 136, baseType: !273, size: 32, offset: 1024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !535, file: !526, line: 136, baseType: !273, size: 32, offset: 1056)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !535, file: !526, line: 137, baseType: !273, size: 32, offset: 1088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !535, file: !526, line: 137, baseType: !273, size: 32, offset: 1120)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !535, file: !526, line: 138, baseType: !241, size: 32, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !535, file: !526, line: 139, baseType: !241, size: 32, offset: 1184)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !535, file: !526, line: 139, baseType: !241, size: 32, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !535, file: !526, line: 141, baseType: !298, size: 16, offset: 1248)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !535, file: !526, line: 142, baseType: !298, size: 16, offset: 1264)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !535, file: !526, line: 143, baseType: !273, size: 32, offset: 1280)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !535, file: !526, line: 144, baseType: !273, size: 32, offset: 1312)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !535, file: !526, line: 146, baseType: !563, size: 64, offset: 1344)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !526, line: 114, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !526, line: 99, size: 7232, elements: !566)
!566 = !{!567, !569, !570, !571, !572, !573, !574, !585, !589, !604, !613, !620, !630}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !526, line: 100, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !565, file: !526, line: 100, baseType: !568, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !565, file: !526, line: 101, baseType: !273, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !565, file: !526, line: 101, baseType: !273, size: 32, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !565, file: !526, line: 102, baseType: !273, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !565, file: !526, line: 102, baseType: !273, size: 32, offset: 224)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !565, file: !526, line: 103, baseType: !575, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !526, line: 59, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !526, line: 56, size: 2112, elements: !578)
!578 = !{!579, !583, !584}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !577, file: !526, line: 57, baseType: !580, size: 2048)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 2048, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !577, file: !526, line: 58, baseType: !273, size: 32, offset: 2048)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !577, file: !526, line: 58, baseType: !273, size: 32, offset: 2080)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !565, file: !526, line: 106, baseType: !586, size: 6144, offset: 320)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 6144, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 768)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !565, file: !526, line: 107, baseType: !590, size: 64, offset: 6464)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !526, line: 97, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !526, line: 83, size: 8320, elements: !593)
!593 = !{!594, !595, !596, !600, !601, !602, !603}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !592, file: !526, line: 84, baseType: !586, size: 6144)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !592, file: !526, line: 87, baseType: !580, size: 2048, offset: 6144)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !592, file: !526, line: 88, baseType: !597, size: 64, offset: 8192)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !599, line: 41, flags: DIFlagFwdDecl)
!599 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !592, file: !526, line: 90, baseType: !298, size: 16, offset: 8256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !592, file: !526, line: 92, baseType: !298, size: 16, offset: 8272)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !592, file: !526, line: 93, baseType: !298, size: 16, offset: 8288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !592, file: !526, line: 95, baseType: !298, size: 16, offset: 8304)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !565, file: !526, line: 108, baseType: !605, size: 64, offset: 6528)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !526, line: 66, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !526, line: 61, size: 128, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !607, file: !526, line: 62, baseType: !273, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !607, file: !526, line: 63, baseType: !273, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !607, file: !526, line: 64, baseType: !273, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !607, file: !526, line: 65, baseType: !273, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !565, file: !526, line: 109, baseType: !614, size: 64, offset: 6592)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !526, line: 71, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !526, line: 68, size: 64, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !616, file: !526, line: 69, baseType: !273, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !616, file: !526, line: 70, baseType: !273, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !565, file: !526, line: 110, baseType: !621, size: 64, offset: 6656)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !526, line: 81, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !526, line: 73, size: 352, elements: !624)
!624 = !{!625, !626, !627, !628, !629}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !623, file: !526, line: 74, baseType: !431, size: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !623, file: !526, line: 75, baseType: !431, size: 96, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !623, file: !526, line: 76, baseType: !431, size: 96, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !623, file: !526, line: 77, baseType: !273, size: 32, offset: 288)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !623, file: !526, line: 78, baseType: !273, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !565, file: !526, line: 113, baseType: !631, size: 512, offset: 6720)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !632, line: 182, baseType: !633)
!632 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !632, line: 180, size: 512, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !632, line: 181, baseType: !283, size: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !535, file: !526, line: 148, baseType: !637, size: 64, offset: 1408)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !526, line: 49, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !535, file: !526, line: 151, baseType: !401, size: 64, offset: 1472)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !535, file: !526, line: 152, baseType: !410, size: 64, offset: 1536)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !535, file: !526, line: 153, baseType: !642, size: 64, offset: 1600)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !644, line: 64, size: 19136, elements: !645)
!644 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!645 = !{!646, !647, !648, !649, !650, !651, !653, !654, !655, !656, !659, !660, !911, !912, !920, !921, !922, !923, !924}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !643, file: !644, line: 65, baseType: !361, size: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !643, file: !644, line: 66, baseType: !407, size: 64, offset: 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !644, line: 68, baseType: !379, size: 8192, offset: 1024)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !643, file: !644, line: 70, baseType: !273, size: 32, offset: 9216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !643, file: !644, line: 71, baseType: !273, size: 32, offset: 9248)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !643, file: !644, line: 72, baseType: !652, size: 64, offset: 9280)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 64, elements: !463)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !643, file: !644, line: 74, baseType: !241, size: 32, offset: 9344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !643, file: !644, line: 74, baseType: !241, size: 32, offset: 9376)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !643, file: !644, line: 76, baseType: !597, size: 64, offset: 9408)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !643, file: !644, line: 77, baseType: !657, size: 64, offset: 9472)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !644, line: 77, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !643, file: !644, line: 78, baseType: !459, size: 64, offset: 9536)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !643, file: !644, line: 80, baseType: !661, size: 2624, offset: 9600)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !662, line: 340, size: 2624, elements: !663)
!662 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!663 = !{!664, !692, !710, !711, !712, !730, !788, !789, !891, !892, !893, !894, !900}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !661, file: !662, line: 341, baseType: !665, size: 576)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !662, line: 251, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !662, line: 207, size: 576, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !666, file: !662, line: 208, baseType: !273, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !666, file: !662, line: 211, baseType: !298, size: 16, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !666, file: !662, line: 212, baseType: !298, size: 16, offset: 48)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !666, file: !662, line: 213, baseType: !241, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !666, file: !662, line: 214, baseType: !298, size: 16, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !666, file: !662, line: 215, baseType: !298, size: 16, offset: 112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !666, file: !662, line: 216, baseType: !298, size: 16, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !666, file: !662, line: 217, baseType: !298, size: 16, offset: 144)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !666, file: !662, line: 218, baseType: !298, size: 16, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !666, file: !662, line: 219, baseType: !298, size: 16, offset: 176)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !666, file: !662, line: 220, baseType: !241, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !666, file: !662, line: 222, baseType: !298, size: 16, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !666, file: !662, line: 225, baseType: !298, size: 16, offset: 240)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !666, file: !662, line: 228, baseType: !273, size: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !666, file: !662, line: 229, baseType: !273, size: 32, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !666, file: !662, line: 233, baseType: !273, size: 32, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !666, file: !662, line: 236, baseType: !298, size: 16, offset: 352)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !666, file: !662, line: 236, baseType: !298, size: 16, offset: 368)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !666, file: !662, line: 241, baseType: !241, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !666, file: !662, line: 244, baseType: !273, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !666, file: !662, line: 244, baseType: !273, size: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !666, file: !662, line: 245, baseType: !241, size: 32, offset: 480)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !666, file: !662, line: 248, baseType: !241, size: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !666, file: !662, line: 250, baseType: !273, size: 32, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !661, file: !662, line: 342, baseType: !693, size: 448, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !662, line: 79, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !662, line: 61, size: 448, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !694, file: !662, line: 62, baseType: !240, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !694, file: !662, line: 64, baseType: !298, size: 16, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !694, file: !662, line: 65, baseType: !298, size: 16, offset: 80)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !694, file: !662, line: 67, baseType: !241, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !694, file: !662, line: 68, baseType: !241, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !694, file: !662, line: 69, baseType: !241, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !694, file: !662, line: 70, baseType: !298, size: 16, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !694, file: !662, line: 71, baseType: !298, size: 16, offset: 208)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !694, file: !662, line: 72, baseType: !462, size: 64, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !694, file: !662, line: 75, baseType: !241, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !694, file: !662, line: 75, baseType: !241, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !694, file: !662, line: 75, baseType: !241, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !694, file: !662, line: 78, baseType: !241, size: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !694, file: !662, line: 78, baseType: !241, size: 32, offset: 416)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !661, file: !662, line: 343, baseType: !307, size: 128, offset: 1024)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !661, file: !662, line: 344, baseType: !307, size: 128, offset: 1152)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !661, file: !662, line: 345, baseType: !713, size: 192, offset: 1280)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !662, line: 278, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !662, line: 270, size: 192, elements: !715)
!715 = !{!716, !717, !718, !719, !720}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !662, line: 271, baseType: !273, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !714, file: !662, line: 273, baseType: !241, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !714, file: !662, line: 275, baseType: !273, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !714, file: !662, line: 276, baseType: !273, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !714, file: !662, line: 277, baseType: !721, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !662, line: 55, size: 576, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !722, file: !662, line: 56, baseType: !273, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !722, file: !662, line: 57, baseType: !241, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !722, file: !662, line: 58, baseType: !727, size: 512, offset: 64)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 512, elements: !728)
!728 = !{!729, !729}
!729 = !DISubrange(count: 4)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !661, file: !662, line: 346, baseType: !731, size: 384, offset: 1472)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !662, line: 268, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !662, line: 253, size: 384, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !782, !783, !784, !785, !786, !787}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !732, file: !662, line: 254, baseType: !273, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !732, file: !662, line: 255, baseType: !273, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !732, file: !662, line: 255, baseType: !273, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !732, file: !662, line: 258, baseType: !241, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !732, file: !662, line: 259, baseType: !739, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !662, line: 164, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !662, line: 108, size: 1664, elements: !742)
!742 = !{!743, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !741, file: !662, line: 109, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !741, file: !662, line: 109, baseType: !744, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !741, file: !662, line: 111, baseType: !283, size: 512, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !741, file: !662, line: 119, baseType: !462, size: 64, offset: 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !741, file: !662, line: 119, baseType: !462, size: 64, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !741, file: !662, line: 125, baseType: !462, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !741, file: !662, line: 125, baseType: !462, size: 64, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !741, file: !662, line: 127, baseType: !462, size: 64, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !741, file: !662, line: 130, baseType: !273, size: 32, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !741, file: !662, line: 131, baseType: !273, size: 32, offset: 992)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !741, file: !662, line: 132, baseType: !755, size: 64, offset: 1024)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !662, line: 106, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !662, line: 81, size: 512, elements: !758)
!758 = !{!759, !760, !763, !764, !765, !766}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !757, file: !662, line: 82, baseType: !462, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !757, file: !662, line: 97, baseType: !761, size: 256, offset: 64)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 256, elements: !762)
!762 = !{!729, !464}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !757, file: !662, line: 102, baseType: !462, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !757, file: !662, line: 102, baseType: !462, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !757, file: !662, line: 104, baseType: !273, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !757, file: !662, line: 105, baseType: !273, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !741, file: !662, line: 135, baseType: !431, size: 96, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !741, file: !662, line: 136, baseType: !241, size: 32, offset: 1184)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !741, file: !662, line: 139, baseType: !273, size: 32, offset: 1216)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !741, file: !662, line: 139, baseType: !273, size: 32, offset: 1248)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !741, file: !662, line: 139, baseType: !273, size: 32, offset: 1280)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !741, file: !662, line: 140, baseType: !431, size: 96, offset: 1312)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !741, file: !662, line: 143, baseType: !298, size: 16, offset: 1408)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !741, file: !662, line: 144, baseType: !298, size: 16, offset: 1424)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !741, file: !662, line: 145, baseType: !298, size: 16, offset: 1440)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !741, file: !662, line: 148, baseType: !298, size: 16, offset: 1456)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !741, file: !662, line: 149, baseType: !273, size: 32, offset: 1472)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !741, file: !662, line: 150, baseType: !241, size: 32, offset: 1504)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !741, file: !662, line: 152, baseType: !459, size: 64, offset: 1536)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !741, file: !662, line: 163, baseType: !241, size: 32, offset: 1600)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !741, file: !662, line: 163, baseType: !241, size: 32, offset: 1632)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !732, file: !662, line: 261, baseType: !241, size: 32, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !732, file: !662, line: 261, baseType: !241, size: 32, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !732, file: !662, line: 261, baseType: !241, size: 32, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !732, file: !662, line: 263, baseType: !273, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !732, file: !662, line: 266, baseType: !273, size: 32, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !732, file: !662, line: 267, baseType: !241, size: 32, offset: 352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !661, file: !662, line: 347, baseType: !739, size: 64, offset: 1856)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !661, file: !662, line: 348, baseType: !790, size: 64, offset: 1920)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !662, line: 205, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !662, line: 186, size: 1024, elements: !793)
!793 = !{!794, !796, !797, !798, !800, !801, !802, !810, !811, !812, !889, !890}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !662, line: 187, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !792, file: !662, line: 187, baseType: !795, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !792, file: !662, line: 189, baseType: !283, size: 512, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !792, file: !662, line: 191, baseType: !799, size: 64, offset: 640)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !792, file: !662, line: 193, baseType: !273, size: 32, offset: 704)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !792, file: !662, line: 193, baseType: !273, size: 32, offset: 736)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !792, file: !662, line: 195, baseType: !803, size: 64, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !662, line: 184, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !662, line: 166, size: 320, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !805, file: !662, line: 180, baseType: !761, size: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !805, file: !662, line: 182, baseType: !273, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !662, line: 183, baseType: !273, size: 32, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !792, file: !662, line: 196, baseType: !273, size: 32, offset: 832)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !662, line: 198, baseType: !273, size: 32, offset: 864)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !792, file: !662, line: 200, baseType: !813, size: 64, offset: 896)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !599, line: 77, size: 15424, elements: !815)
!815 = !{!816, !817, !818, !821, !824, !825, !828, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !848, !849, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !875, !876, !877, !878, !879, !883}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !814, file: !599, line: 78, baseType: !361, size: 960)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !599, line: 80, baseType: !379, size: 8192, offset: 960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !814, file: !599, line: 82, baseType: !819, size: 64, offset: 9152)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !599, line: 43, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !814, file: !599, line: 83, baseType: !822, size: 64, offset: 9216)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !289, line: 46, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !814, file: !599, line: 86, baseType: !597, size: 64, offset: 9280)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !814, file: !599, line: 87, baseType: !826, size: 64, offset: 9344)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !599, line: 44, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !814, file: !599, line: 89, baseType: !829, size: 512, offset: 9408)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 512, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 8)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !814, file: !599, line: 90, baseType: !298, size: 16, offset: 9920)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !814, file: !599, line: 90, baseType: !298, size: 16, offset: 9936)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !814, file: !599, line: 92, baseType: !298, size: 16, offset: 9952)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !599, line: 92, baseType: !298, size: 16, offset: 9968)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !814, file: !599, line: 93, baseType: !298, size: 16, offset: 9984)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !814, file: !599, line: 93, baseType: !298, size: 16, offset: 10000)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !814, file: !599, line: 94, baseType: !273, size: 32, offset: 10016)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !814, file: !599, line: 97, baseType: !298, size: 16, offset: 10048)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !814, file: !599, line: 97, baseType: !298, size: 16, offset: 10064)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !814, file: !599, line: 98, baseType: !298, size: 16, offset: 10080)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !814, file: !599, line: 98, baseType: !298, size: 16, offset: 10096)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !814, file: !599, line: 99, baseType: !298, size: 16, offset: 10112)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !814, file: !599, line: 99, baseType: !298, size: 16, offset: 10128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !814, file: !599, line: 100, baseType: !5, size: 32, offset: 10144)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !814, file: !599, line: 101, baseType: !847, size: 64, offset: 10176)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !814, file: !599, line: 103, baseType: !385, size: 64, offset: 10240)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !814, file: !599, line: 104, baseType: !850, size: 64, offset: 10304)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !289, line: 159, size: 448, elements: !852)
!852 = !{!853, !855, !856, !858, !859, !861}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !851, file: !289, line: 161, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !463)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !851, file: !289, line: 162, baseType: !854, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !851, file: !289, line: 163, baseType: !857, size: 32, offset: 128)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 32, elements: !463)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !851, file: !289, line: 164, baseType: !857, size: 32, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !851, file: !289, line: 165, baseType: !860, size: 128, offset: 192)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 128, elements: !463)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !851, file: !289, line: 166, baseType: !862, size: 128, offset: 320)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 128, elements: !463)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !814, file: !599, line: 107, baseType: !241, size: 32, offset: 10368)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !814, file: !599, line: 108, baseType: !273, size: 32, offset: 10400)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !814, file: !599, line: 109, baseType: !298, size: 16, offset: 10432)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !814, file: !599, line: 110, baseType: !298, size: 16, offset: 10448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !814, file: !599, line: 113, baseType: !273, size: 32, offset: 10464)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !814, file: !599, line: 113, baseType: !273, size: 32, offset: 10496)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !814, file: !599, line: 114, baseType: !265, size: 8, offset: 10528)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !814, file: !599, line: 114, baseType: !265, size: 8, offset: 10536)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !814, file: !599, line: 115, baseType: !298, size: 16, offset: 10544)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !814, file: !599, line: 116, baseType: !873, size: 128, offset: 10560)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, elements: !874)
!874 = !{!729}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !814, file: !599, line: 119, baseType: !241, size: 32, offset: 10688)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !814, file: !599, line: 119, baseType: !241, size: 32, offset: 10720)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !814, file: !599, line: 122, baseType: !631, size: 512, offset: 10752)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !814, file: !599, line: 123, baseType: !265, size: 8, offset: 11264)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !814, file: !599, line: 125, baseType: !880, size: 56, offset: 11272)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 56, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 7)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !814, file: !599, line: 126, baseType: !884, size: 4096, offset: 11328)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 4096, elements: !830)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !599, line: 69, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !599, line: 67, size: 512, elements: !887)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !886, file: !599, line: 68, baseType: !283, size: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !792, file: !662, line: 201, baseType: !241, size: 32, offset: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !792, file: !662, line: 204, baseType: !273, size: 32, offset: 992)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !661, file: !662, line: 350, baseType: !307, size: 128, offset: 1984)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !661, file: !662, line: 351, baseType: !273, size: 32, offset: 2112)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !661, file: !662, line: 351, baseType: !273, size: 32, offset: 2144)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !661, file: !662, line: 353, baseType: !895, size: 64, offset: 2176)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !662, line: 297, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !662, line: 295, size: 2048, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !897, file: !662, line: 296, baseType: !580, size: 2048)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !661, file: !662, line: 355, baseType: !901, size: 384, offset: 2240)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !662, line: 338, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !662, line: 322, size: 384, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !902, file: !662, line: 323, baseType: !273, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !902, file: !662, line: 325, baseType: !298, size: 16, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !902, file: !662, line: 326, baseType: !298, size: 16, offset: 48)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !902, file: !662, line: 331, baseType: !307, size: 128, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !902, file: !662, line: 334, baseType: !307, size: 128, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !902, file: !662, line: 335, baseType: !273, size: 32, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !902, file: !662, line: 337, baseType: !273, size: 32, offset: 352)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !643, file: !644, line: 81, baseType: !240, size: 64, offset: 12224)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !643, file: !644, line: 85, baseType: !913, size: 6208, offset: 12288)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !644, line: 55, size: 6208, elements: !914)
!914 = !{!915, !916, !917, !918, !919}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !913, file: !644, line: 56, baseType: !586, size: 6144)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !913, file: !644, line: 58, baseType: !298, size: 16, offset: 6144)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !913, file: !644, line: 59, baseType: !298, size: 16, offset: 6160)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !913, file: !644, line: 60, baseType: !298, size: 16, offset: 6176)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !913, file: !644, line: 61, baseType: !298, size: 16, offset: 6192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !643, file: !644, line: 86, baseType: !273, size: 32, offset: 18496)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !643, file: !644, line: 88, baseType: !273, size: 32, offset: 18528)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !643, file: !644, line: 90, baseType: !273, size: 32, offset: 18560)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !643, file: !644, line: 94, baseType: !273, size: 32, offset: 18592)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !643, file: !644, line: 100, baseType: !631, size: 512, offset: 18624)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !535, file: !526, line: 154, baseType: !926, size: 64, offset: 1664)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !928, line: 264, flags: DIFlagFwdDecl)
!928 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!929 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !535, file: !526, line: 156, baseType: !597, size: 64, offset: 1728)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !535, file: !526, line: 158, baseType: !241, size: 32, offset: 1792)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !535, file: !526, line: 159, baseType: !241, size: 32, offset: 1824)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !535, file: !526, line: 162, baseType: !538, size: 64, offset: 1856)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !535, file: !526, line: 162, baseType: !538, size: 64, offset: 1920)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !535, file: !526, line: 162, baseType: !538, size: 64, offset: 1984)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !535, file: !526, line: 164, baseType: !307, size: 128, offset: 2048)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !535, file: !526, line: 166, baseType: !937, size: 64, offset: 2176)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !526, line: 51, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !535, file: !526, line: 167, baseType: !240, size: 64, offset: 2240)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !535, file: !526, line: 168, baseType: !241, size: 32, offset: 2304)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !535, file: !526, line: 170, baseType: !241, size: 32, offset: 2336)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !535, file: !526, line: 170, baseType: !241, size: 32, offset: 2368)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !535, file: !526, line: 171, baseType: !241, size: 32, offset: 2400)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !535, file: !526, line: 173, baseType: !240, size: 64, offset: 2432)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !535, file: !526, line: 175, baseType: !273, size: 32, offset: 2496)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !535, file: !526, line: 176, baseType: !273, size: 32, offset: 2528)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !535, file: !526, line: 179, baseType: !273, size: 32, offset: 2560)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !535, file: !526, line: 180, baseType: !241, size: 32, offset: 2592)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !535, file: !526, line: 183, baseType: !273, size: 32, offset: 2624)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !535, file: !526, line: 185, baseType: !265, size: 8, offset: 2656)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !535, file: !526, line: 186, baseType: !952, size: 24, offset: 2664)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 24, elements: !432)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !535, file: !526, line: 189, baseType: !307, size: 128, offset: 2688)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !525, file: !526, line: 207, baseType: !379, size: 8192, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !525, file: !526, line: 208, baseType: !379, size: 8192, offset: 8576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !525, file: !526, line: 210, baseType: !273, size: 32, offset: 16768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !525, file: !526, line: 210, baseType: !273, size: 32, offset: 16800)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !525, file: !526, line: 211, baseType: !273, size: 32, offset: 16832)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !525, file: !526, line: 211, baseType: !273, size: 32, offset: 16864)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !525, file: !526, line: 212, baseType: !480, size: 128, offset: 16896)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !402, file: !403, line: 1246, baseType: !962, size: 64, offset: 2112)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !403, line: 1067, size: 5184, elements: !964)
!964 = !{!965, !995, !996, !1011, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1033, !1049, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1159}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !963, file: !403, line: 1068, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !403, line: 934, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !403, line: 925, size: 576, elements: !969)
!969 = !{!970, !987, !988, !989, !990, !991, !994}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !968, file: !403, line: 926, baseType: !971, size: 320)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !403, line: 830, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !403, line: 813, size: 320, elements: !973)
!973 = !{!974, !977, !980, !981, !984, !985, !986}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !972, file: !403, line: 814, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !403, line: 51, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !972, file: !403, line: 815, baseType: !978, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !403, line: 815, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !972, file: !403, line: 818, baseType: !240, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !972, file: !403, line: 819, baseType: !982, size: 32, offset: 192)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 32, elements: !874)
!983 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !403, line: 822, baseType: !273, size: 32, offset: 224)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !972, file: !403, line: 826, baseType: !273, size: 32, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !972, file: !403, line: 829, baseType: !273, size: 32, offset: 288)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !968, file: !403, line: 928, baseType: !298, size: 16, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !968, file: !403, line: 928, baseType: !298, size: 16, offset: 336)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !968, file: !403, line: 929, baseType: !273, size: 32, offset: 352)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !968, file: !403, line: 930, baseType: !847, size: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !968, file: !403, line: 931, baseType: !992, size: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !403, line: 931, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !968, file: !403, line: 933, baseType: !240, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !963, file: !403, line: 1069, baseType: !966, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !963, file: !403, line: 1070, baseType: !997, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !403, line: 916, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !403, line: 891, size: 704, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1005, !1006, !1007, !1008, !1009, !1010}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !999, file: !403, line: 892, baseType: !971, size: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !999, file: !403, line: 896, baseType: !273, size: 32, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !999, file: !403, line: 900, baseType: !1004, size: 96, offset: 352)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 96, elements: !432)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !999, file: !403, line: 903, baseType: !241, size: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !999, file: !403, line: 906, baseType: !273, size: 32, offset: 480)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !999, file: !403, line: 909, baseType: !241, size: 32, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !999, file: !403, line: 912, baseType: !241, size: 32, offset: 544)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !999, file: !403, line: 914, baseType: !410, size: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !999, file: !403, line: 915, baseType: !240, size: 64, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !963, file: !403, line: 1071, baseType: !1012, size: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !403, line: 920, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !403, line: 918, size: 320, elements: !1015)
!1015 = !{!1016}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1014, file: !403, line: 919, baseType: !971, size: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !963, file: !403, line: 1075, baseType: !241, size: 32, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !963, file: !403, line: 1077, baseType: !241, size: 32, offset: 288)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !963, file: !403, line: 1078, baseType: !241, size: 32, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !963, file: !403, line: 1079, baseType: !298, size: 16, offset: 352)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !963, file: !403, line: 1082, baseType: !298, size: 16, offset: 368)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !963, file: !403, line: 1085, baseType: !265, size: 8, offset: 384)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !963, file: !403, line: 1086, baseType: !265, size: 8, offset: 392)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !963, file: !403, line: 1087, baseType: !265, size: 8, offset: 400)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !963, file: !403, line: 1088, baseType: !265, size: 8, offset: 408)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !963, file: !403, line: 1090, baseType: !241, size: 32, offset: 416)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !963, file: !403, line: 1093, baseType: !298, size: 16, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !963, file: !403, line: 1096, baseType: !265, size: 8, offset: 464)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !963, file: !403, line: 1098, baseType: !1030, size: 40, offset: 472)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 40, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 5)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !963, file: !403, line: 1101, baseType: !1034, size: 832, offset: 512)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !403, line: 836, size: 832, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1034, file: !403, line: 837, baseType: !971, size: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1034, file: !403, line: 839, baseType: !298, size: 16, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1034, file: !403, line: 839, baseType: !298, size: 16, offset: 336)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1034, file: !403, line: 842, baseType: !298, size: 16, offset: 352)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1034, file: !403, line: 842, baseType: !298, size: 16, offset: 368)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1034, file: !403, line: 843, baseType: !857, size: 32, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1034, file: !403, line: 845, baseType: !273, size: 32, offset: 416)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1034, file: !403, line: 847, baseType: !240, size: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1034, file: !403, line: 848, baseType: !813, size: 64, offset: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !1034, file: !403, line: 849, baseType: !813, size: 64, offset: 576)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !1034, file: !403, line: 850, baseType: !813, size: 64, offset: 640)
