; ModuleID = 'blender/source/blender/editors/sound/sound_ops.c'
source_filename = "blender/source/blender/editors/sound/sound_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!72 = !DIEnumerator(name: "SEQ_TYPE_GLOW", value: 26, isUnsigned: true)
!73 = !DIEnumerator(name: "SEQ_TYPE_TRANSFORM", value: 27, isUnsigned: true)
!74 = !DIEnumerator(name: "SEQ_TYPE_COLOR", value: 28, isUnsigned: true)
!75 = !DIEnumerator(name: "SEQ_TYPE_SPEED", value: 29, isUnsigned: true)
!76 = !DIEnumerator(name: "SEQ_TYPE_MULTICAM", value: 30, isUnsigned: true)
!77 = !DIEnumerator(name: "SEQ_TYPE_ADJUSTMENT", value: 31, isUnsigned: true)
!78 = !DIEnumerator(name: "SEQ_TYPE_GAUSSIAN_BLUR", value: 40, isUnsigned: true)
!79 = !DIEnumerator(name: "SEQ_TYPE_EFFECT_MAX", value: 40, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PF_FileStatus", file: !81, line: 43, baseType: !5, size: 32, elements: !82)
!81 = !DIFile(filename: "blender/source/blender/makesdna/DNA_packedFile_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!83 = !DIEnumerator(name: "PF_EQUAL", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "PF_DIFFERS", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "PF_NOFILE", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "PF_WRITE_ORIGINAL", value: 3, isUnsigned: true)
!87 = !DIEnumerator(name: "PF_WRITE_LOCAL", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "PF_USE_LOCAL", value: 5, isUnsigned: true)
!89 = !DIEnumerator(name: "PF_USE_ORIGINAL", value: 6, isUnsigned: true)
!90 = !DIEnumerator(name: "PF_KEEP", value: 7, isUnsigned: true)
!91 = !DIEnumerator(name: "PF_REMOVE", value: 8, isUnsigned: true)
!92 = !DIEnumerator(name: "PF_NOOP", value: 9, isUnsigned: true)
!93 = !DIEnumerator(name: "PF_ASK", value: 10, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 335, baseType: !95, size: 32, elements: !96)
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!97 = !DIEnumerator(name: "SEQ_LEFTSEL", value: 2)
!98 = !DIEnumerator(name: "SEQ_RIGHTSEL", value: 4)
!99 = !DIEnumerator(name: "SEQ_OVERLAP", value: 8)
!100 = !DIEnumerator(name: "SEQ_FILTERY", value: 16)
!101 = !DIEnumerator(name: "SEQ_MUTE", value: 32)
!102 = !DIEnumerator(name: "SEQ_MAKE_PREMUL", value: 64)
!103 = !DIEnumerator(name: "SEQ_REVERSE_FRAMES", value: 128)
!104 = !DIEnumerator(name: "SEQ_IPO_FRAME_LOCKED", value: 256)
!105 = !DIEnumerator(name: "SEQ_EFFECT_NOT_LOADED", value: 512)
!106 = !DIEnumerator(name: "SEQ_FLAG_DELETE", value: 1024)
!107 = !DIEnumerator(name: "SEQ_FLIPX", value: 2048)
!108 = !DIEnumerator(name: "SEQ_FLIPY", value: 4096)
!109 = !DIEnumerator(name: "SEQ_MAKE_FLOAT", value: 8192)
!110 = !DIEnumerator(name: "SEQ_LOCK", value: 16384)
!111 = !DIEnumerator(name: "SEQ_USE_PROXY", value: 32768)
!112 = !DIEnumerator(name: "SEQ_USE_TRANSFORM", value: 65536)
!113 = !DIEnumerator(name: "SEQ_USE_CROP", value: 131072)
!114 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_DIR", value: 524288)
!115 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_FILE", value: 2097152)
!116 = !DIEnumerator(name: "SEQ_USE_EFFECT_DEFAULT_FADE", value: 4194304)
!117 = !DIEnumerator(name: "SEQ_USE_LINEAR_MODIFIERS", value: 8388608)
!118 = !DIEnumerator(name: "SEQ_AUDIO_VOLUME_ANIMATED", value: 16777216)
!119 = !DIEnumerator(name: "SEQ_AUDIO_PITCH_ANIMATED", value: 33554432)
!120 = !DIEnumerator(name: "SEQ_AUDIO_PAN_ANIMATED", value: 67108864)
!121 = !DIEnumerator(name: "SEQ_AUDIO_DRAW_WAVEFORM", value: 134217728)
!122 = !DIEnumerator(name: "SEQ_INVALID_EFFECT", value: -2147483648)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!125 = !{i32 7, !"Dwarf Version", i32 4}
!126 = !{i32 2, !"Debug Info Version", i32 3}
!127 = !{i32 1, !"wchar_size", i32 4}
!128 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!129 = distinct !DISubprogram(name: "ED_operatortypes_sound", scope: !1, file: !1, line: 786, type: !130, scopeLine: 787, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{null}
!132 = !{}
!133 = !DILocation(line: 788, column: 2, scope: !129)
!134 = !DILocation(line: 789, column: 2, scope: !129)
!135 = !DILocation(line: 790, column: 2, scope: !129)
!136 = !DILocation(line: 791, column: 2, scope: !129)
!137 = !DILocation(line: 792, column: 2, scope: !129)
!138 = !DILocation(line: 793, column: 2, scope: !129)
!139 = !DILocation(line: 794, column: 2, scope: !129)
!140 = !DILocation(line: 795, column: 1, scope: !129)
!141 = distinct !DISubprogram(name: "SOUND_OT_open", scope: !1, file: !1, line: 171, type: !142, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !146, line: 568, baseType: !147)
!146 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !146, line: 508, size: 1536, elements: !148)
!148 = !{!149, !153, !154, !155, !156, !354, !359, !365, !369, !370, !374, !375, !376, !377, !381, !382, !397, !398, !402, !431}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !146, line: 509, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !147, file: !146, line: 510, baseType: !150, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !147, file: !146, line: 511, baseType: !150, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !147, file: !146, line: 512, baseType: !150, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !147, file: !146, line: 518, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!95, !160, !163}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !162, line: 44, flags: DIFlagFwdDecl)
!162 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !32, line: 328, size: 1344, elements: !165)
!165 = !{!166, !167, !168, !172, !203, !205, !206, !207, !220, !344, !345, !346, !349, !350}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !32, line: 329, baseType: !163, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !32, line: 329, baseType: !163, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !164, file: !32, line: 332, baseType: !169, size: 512, offset: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !164, file: !32, line: 333, baseType: !173, size: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !175, line: 75, baseType: !176)
!175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !175, line: 62, size: 1024, elements: !177)
!177 = !{!178, !180, !181, !182, !183, !185, !186, !187, !201, !202}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !175, line: 63, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !176, file: !175, line: 63, baseType: !179, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !175, line: 64, baseType: !152, size: 8, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !176, file: !175, line: 64, baseType: !152, size: 8, offset: 136)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !176, file: !175, line: 65, baseType: !184, size: 16, offset: 144)
!184 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !176, file: !175, line: 66, baseType: !169, size: 512, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !176, file: !175, line: 67, baseType: !95, size: 32, offset: 672)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !175, line: 69, baseType: !188, size: 256, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !175, line: 60, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !175, line: 48, size: 256, elements: !190)
!190 = !{!191, !192, !199, !200}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !189, file: !175, line: 49, baseType: !124, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !189, file: !175, line: 58, baseType: !193, size: 128, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !194, line: 71, baseType: !195)
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !194, line: 69, size: 128, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !195, file: !194, line: 70, baseType: !124, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !195, file: !194, line: 70, baseType: !124, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !189, file: !175, line: 59, baseType: !95, size: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !189, file: !175, line: 59, baseType: !95, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !176, file: !175, line: 70, baseType: !95, size: 32, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !176, file: !175, line: 74, baseType: !95, size: 32, offset: 992)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !32, line: 336, baseType: !204, size: 64, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !164, file: !32, line: 337, baseType: !124, size: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !164, file: !32, line: 338, baseType: !124, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !164, file: !32, line: 340, baseType: !208, size: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !162, line: 55, size: 192, elements: !210)
!210 = !{!211, !215, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !209, file: !162, line: 58, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !162, line: 56, size: 64, elements: !213)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !162, line: 57, baseType: !124, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !162, line: 60, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !218, line: 335, flags: DIFlagFwdDecl)
!218 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !209, file: !162, line: 61, baseType: !124, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !164, file: !32, line: 341, baseType: !221, size: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !32, line: 106, size: 320, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !222, file: !32, line: 107, baseType: !193, size: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !222, file: !32, line: 108, baseType: !95, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !222, file: !32, line: 109, baseType: !95, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !222, file: !32, line: 110, baseType: !95, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !222, file: !32, line: 110, baseType: !95, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !222, file: !32, line: 111, baseType: !230, size: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !146, line: 490, size: 768, elements: !232)
!232 = !{!233, !234, !235, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !146, line: 491, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !146, line: 491, baseType: !230, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !231, file: !146, line: 493, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !32, line: 169, size: 2048, elements: !238)
!238 = !{!239, !240, !241, !242, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !310, !313, !327, !328, !329, !330, !331, !332, !333, !334}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !32, line: 170, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !237, file: !32, line: 170, baseType: !236, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !237, file: !32, line: 172, baseType: !124, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !237, file: !32, line: 174, baseType: !243, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !4, line: 67, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !237, file: !32, line: 175, baseType: !243, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !237, file: !32, line: 176, baseType: !169, size: 512, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !237, file: !32, line: 178, baseType: !184, size: 16, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !237, file: !32, line: 178, baseType: !184, size: 16, offset: 848)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !237, file: !32, line: 178, baseType: !184, size: 16, offset: 864)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !237, file: !32, line: 178, baseType: !184, size: 16, offset: 880)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !237, file: !32, line: 179, baseType: !184, size: 16, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !237, file: !32, line: 180, baseType: !184, size: 16, offset: 912)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !237, file: !32, line: 181, baseType: !184, size: 16, offset: 928)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !237, file: !32, line: 182, baseType: !184, size: 16, offset: 944)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !237, file: !32, line: 183, baseType: !184, size: 16, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !237, file: !32, line: 184, baseType: !184, size: 16, offset: 976)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !237, file: !32, line: 185, baseType: !184, size: 16, offset: 992)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !237, file: !32, line: 186, baseType: !184, size: 16, offset: 1008)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !237, file: !32, line: 188, baseType: !95, size: 32, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !237, file: !32, line: 190, baseType: !184, size: 16, offset: 1056)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !237, file: !32, line: 191, baseType: !184, size: 16, offset: 1072)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !237, file: !32, line: 194, baseType: !263, size: 64, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !146, line: 421, size: 960, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !276, !280, !281, !282, !283, !284, !285, !286, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !306, !307, !308, !309}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !146, line: 422, baseType: !263, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !264, file: !146, line: 422, baseType: !263, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !146, line: 424, baseType: !184, size: 16, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !264, file: !146, line: 425, baseType: !184, size: 16, offset: 144)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !264, file: !146, line: 426, baseType: !95, size: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !264, file: !146, line: 426, baseType: !95, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !264, file: !146, line: 427, baseType: !273, size: 64, offset: 224)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 2)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !264, file: !146, line: 428, baseType: !277, size: 48, offset: 288)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 48, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 6)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !264, file: !146, line: 431, baseType: !152, size: 8, offset: 336)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !264, file: !146, line: 432, baseType: !152, size: 8, offset: 344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !264, file: !146, line: 435, baseType: !184, size: 16, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !264, file: !146, line: 436, baseType: !184, size: 16, offset: 368)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !264, file: !146, line: 437, baseType: !95, size: 32, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !264, file: !146, line: 437, baseType: !95, size: 32, offset: 416)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !264, file: !146, line: 438, baseType: !287, size: 64, offset: 448)
!287 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !264, file: !146, line: 439, baseType: !95, size: 32, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !264, file: !146, line: 439, baseType: !95, size: 32, offset: 544)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !264, file: !146, line: 442, baseType: !184, size: 16, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !264, file: !146, line: 442, baseType: !184, size: 16, offset: 592)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !264, file: !146, line: 442, baseType: !184, size: 16, offset: 608)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !264, file: !146, line: 442, baseType: !184, size: 16, offset: 624)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !264, file: !146, line: 443, baseType: !184, size: 16, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !264, file: !146, line: 446, baseType: !184, size: 16, offset: 656)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !264, file: !146, line: 449, baseType: !150, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !264, file: !146, line: 452, baseType: !298, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !146, line: 463, size: 128, elements: !300)
!300 = !{!301, !302, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !299, file: !146, line: 464, baseType: !95, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !299, file: !146, line: 465, baseType: !303, size: 32, offset: 32)
!303 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !299, file: !146, line: 466, baseType: !303, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !299, file: !146, line: 467, baseType: !303, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !264, file: !146, line: 455, baseType: !184, size: 16, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !264, file: !146, line: 456, baseType: !184, size: 16, offset: 848)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !264, file: !146, line: 457, baseType: !95, size: 32, offset: 864)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !264, file: !146, line: 458, baseType: !124, size: 64, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !237, file: !32, line: 196, baseType: !311, size: 64, offset: 1152)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !32, line: 55, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !237, file: !32, line: 198, baseType: !314, size: 64, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !146, line: 398, size: 448, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !146, line: 399, baseType: !314, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !315, file: !146, line: 399, baseType: !314, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !315, file: !146, line: 400, baseType: !95, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !315, file: !146, line: 401, baseType: !95, size: 32, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !146, line: 402, baseType: !95, size: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !315, file: !146, line: 403, baseType: !95, size: 32, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !315, file: !146, line: 404, baseType: !95, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !315, file: !146, line: 405, baseType: !95, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !315, file: !146, line: 407, baseType: !124, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !315, file: !146, line: 414, baseType: !124, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !237, file: !32, line: 200, baseType: !95, size: 32, offset: 1280)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !237, file: !32, line: 200, baseType: !95, size: 32, offset: 1312)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !237, file: !32, line: 201, baseType: !124, size: 64, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !237, file: !32, line: 203, baseType: !193, size: 128, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !237, file: !32, line: 204, baseType: !193, size: 128, offset: 1536)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !237, file: !32, line: 205, baseType: !193, size: 128, offset: 1664)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !237, file: !32, line: 207, baseType: !193, size: 128, offset: 1792)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !237, file: !32, line: 208, baseType: !193, size: 128, offset: 1920)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !231, file: !146, line: 495, baseType: !287, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !231, file: !146, line: 496, baseType: !95, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !231, file: !146, line: 497, baseType: !124, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !231, file: !146, line: 499, baseType: !287, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !231, file: !146, line: 500, baseType: !287, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !231, file: !146, line: 502, baseType: !287, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !231, file: !146, line: 503, baseType: !287, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !231, file: !146, line: 504, baseType: !287, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !231, file: !146, line: 505, baseType: !95, size: 32, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !164, file: !32, line: 343, baseType: !193, size: 128, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "opm", scope: !164, file: !32, line: 344, baseType: !163, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !164, file: !32, line: 345, baseType: !347, size: 64, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !32, line: 61, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !32, line: 346, baseType: !184, size: 16, offset: 1280)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !32, line: 346, baseType: !351, size: 48, offset: 1296)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 48, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 3)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !147, file: !146, line: 524, baseType: !355, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !160, !163}
!358 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !147, file: !146, line: 530, baseType: !360, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!95, !160, !163, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !147, file: !146, line: 531, baseType: !366, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !160, !163}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !147, file: !146, line: 532, baseType: !360, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !147, file: !146, line: 536, baseType: !371, size: 64, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!95, !160}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !147, file: !146, line: 539, baseType: !366, size: 64, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !147, file: !146, line: 542, baseType: !216, size: 64, offset: 704)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !147, file: !146, line: 545, baseType: !179, size: 64, offset: 768)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !147, file: !146, line: 549, baseType: !378, size: 64, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !162, line: 333, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !162, line: 39, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !147, file: !146, line: 552, baseType: !193, size: 128, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !147, file: !146, line: 555, baseType: !383, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !32, line: 281, size: 1088, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !32, line: 282, baseType: !383, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !32, line: 282, baseType: !383, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !384, file: !32, line: 284, baseType: !193, size: 128, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !384, file: !32, line: 285, baseType: !193, size: 128, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !384, file: !32, line: 287, baseType: !169, size: 512, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !384, file: !32, line: 288, baseType: !184, size: 16, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !384, file: !32, line: 289, baseType: !184, size: 16, offset: 912)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !32, line: 291, baseType: !184, size: 16, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !384, file: !32, line: 292, baseType: !184, size: 16, offset: 944)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !384, file: !32, line: 295, baseType: !371, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !384, file: !32, line: 296, baseType: !124, size: 64, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !147, file: !146, line: 559, baseType: !124, size: 64, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !147, file: !146, line: 560, baseType: !399, size: 64, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!95, !160, !204}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !147, file: !146, line: 563, baseType: !403, size: 256, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !162, line: 436, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !162, line: 430, size: 256, elements: !405)
!405 = !{!406, !407, !410, !426}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !162, line: 431, baseType: !124, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !404, file: !162, line: 432, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !162, line: 417, baseType: !217)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !404, file: !162, line: 433, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !162, line: 408, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!95, !160, !208, !415, !417}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !162, line: 38, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !162, line: 348, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !162, line: 337, size: 256, elements: !420)
!420 = !{!421, !422, !423, !424, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !419, file: !162, line: 339, baseType: !124, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !419, file: !162, line: 342, baseType: !415, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !419, file: !162, line: 345, baseType: !95, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !419, file: !162, line: 347, baseType: !95, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !419, file: !162, line: 347, baseType: !95, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !404, file: !162, line: 434, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !162, line: 409, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !124}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !146, line: 566, baseType: !184, size: 16, offset: 1472)
!432 = !DILocalVariable(name: "ot", arg: 1, scope: !141, file: !1, line: 171, type: !144)
!433 = !DILocation(line: 171, column: 43, scope: !141)
!434 = !DILocation(line: 174, column: 2, scope: !141)
!435 = !DILocation(line: 174, column: 6, scope: !141)
!436 = !DILocation(line: 174, column: 11, scope: !141)
!437 = !DILocation(line: 175, column: 2, scope: !141)
!438 = !DILocation(line: 175, column: 6, scope: !141)
!439 = !DILocation(line: 175, column: 18, scope: !141)
!440 = !DILocation(line: 176, column: 2, scope: !141)
!441 = !DILocation(line: 176, column: 6, scope: !141)
!442 = !DILocation(line: 176, column: 13, scope: !141)
!443 = !DILocation(line: 179, column: 2, scope: !141)
!444 = !DILocation(line: 179, column: 6, scope: !141)
!445 = !DILocation(line: 179, column: 11, scope: !141)
!446 = !DILocation(line: 180, column: 2, scope: !141)
!447 = !DILocation(line: 180, column: 6, scope: !141)
!448 = !DILocation(line: 180, column: 13, scope: !141)
!449 = !DILocation(line: 181, column: 2, scope: !141)
!450 = !DILocation(line: 181, column: 6, scope: !141)
!451 = !DILocation(line: 181, column: 13, scope: !141)
!452 = !DILocation(line: 184, column: 2, scope: !141)
!453 = !DILocation(line: 184, column: 6, scope: !141)
!454 = !DILocation(line: 184, column: 11, scope: !141)
!455 = !DILocation(line: 187, column: 33, scope: !141)
!456 = !DILocation(line: 187, column: 2, scope: !141)
!457 = !DILocation(line: 189, column: 18, scope: !141)
!458 = !DILocation(line: 189, column: 22, scope: !141)
!459 = !DILocation(line: 189, column: 2, scope: !141)
!460 = !DILocation(line: 190, column: 18, scope: !141)
!461 = !DILocation(line: 190, column: 22, scope: !141)
!462 = !DILocation(line: 190, column: 2, scope: !141)
!463 = !DILocation(line: 191, column: 1, scope: !141)
!464 = distinct !DISubprogram(name: "SOUND_OT_open_mono", scope: !1, file: !1, line: 193, type: !142, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!465 = !DILocalVariable(name: "ot", arg: 1, scope: !464, file: !1, line: 193, type: !144)
!466 = !DILocation(line: 193, column: 48, scope: !464)
!467 = !DILocation(line: 196, column: 2, scope: !464)
!468 = !DILocation(line: 196, column: 6, scope: !464)
!469 = !DILocation(line: 196, column: 11, scope: !464)
!470 = !DILocation(line: 197, column: 2, scope: !464)
!471 = !DILocation(line: 197, column: 6, scope: !464)
!472 = !DILocation(line: 197, column: 18, scope: !464)
!473 = !DILocation(line: 198, column: 2, scope: !464)
!474 = !DILocation(line: 198, column: 6, scope: !464)
!475 = !DILocation(line: 198, column: 13, scope: !464)
!476 = !DILocation(line: 201, column: 2, scope: !464)
!477 = !DILocation(line: 201, column: 6, scope: !464)
!478 = !DILocation(line: 201, column: 11, scope: !464)
!479 = !DILocation(line: 202, column: 2, scope: !464)
!480 = !DILocation(line: 202, column: 6, scope: !464)
!481 = !DILocation(line: 202, column: 13, scope: !464)
!482 = !DILocation(line: 203, column: 2, scope: !464)
!483 = !DILocation(line: 203, column: 6, scope: !464)
!484 = !DILocation(line: 203, column: 13, scope: !464)
!485 = !DILocation(line: 206, column: 2, scope: !464)
!486 = !DILocation(line: 206, column: 6, scope: !464)
!487 = !DILocation(line: 206, column: 11, scope: !464)
!488 = !DILocation(line: 209, column: 33, scope: !464)
!489 = !DILocation(line: 209, column: 2, scope: !464)
!490 = !DILocation(line: 211, column: 18, scope: !464)
!491 = !DILocation(line: 211, column: 22, scope: !464)
!492 = !DILocation(line: 211, column: 2, scope: !464)
!493 = !DILocation(line: 212, column: 18, scope: !464)
!494 = !DILocation(line: 212, column: 22, scope: !464)
!495 = !DILocation(line: 212, column: 2, scope: !464)
!496 = !DILocation(line: 213, column: 1, scope: !464)
!497 = distinct !DISubprogram(name: "SOUND_OT_mixdown", scope: !1, file: !1, line: 607, type: !142, scopeLine: 608, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!498 = !DILocalVariable(name: "ot", arg: 1, scope: !497, file: !1, line: 607, type: !144)
!499 = !DILocation(line: 607, column: 46, scope: !497)
!500 = !DILocation(line: 638, column: 2, scope: !497)
!501 = !DILocation(line: 638, column: 6, scope: !497)
!502 = !DILocation(line: 638, column: 11, scope: !497)
!503 = !DILocation(line: 639, column: 2, scope: !497)
!504 = !DILocation(line: 639, column: 6, scope: !497)
!505 = !DILocation(line: 639, column: 18, scope: !497)
!506 = !DILocation(line: 640, column: 2, scope: !497)
!507 = !DILocation(line: 640, column: 6, scope: !497)
!508 = !DILocation(line: 640, column: 13, scope: !497)
!509 = !DILocation(line: 643, column: 2, scope: !497)
!510 = !DILocation(line: 643, column: 6, scope: !497)
!511 = !DILocation(line: 643, column: 11, scope: !497)
!512 = !DILocation(line: 644, column: 2, scope: !497)
!513 = !DILocation(line: 644, column: 6, scope: !497)
!514 = !DILocation(line: 644, column: 13, scope: !497)
!515 = !DILocation(line: 651, column: 2, scope: !497)
!516 = !DILocation(line: 651, column: 6, scope: !497)
!517 = !DILocation(line: 651, column: 11, scope: !497)
!518 = !DILocation(line: 654, column: 33, scope: !497)
!519 = !DILocation(line: 654, column: 2, scope: !497)
!520 = !DILocation(line: 664, column: 1, scope: !497)
!521 = distinct !DISubprogram(name: "SOUND_OT_pack", scope: !1, file: !1, line: 699, type: !142, scopeLine: 700, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!522 = !DILocalVariable(name: "ot", arg: 1, scope: !521, file: !1, line: 699, type: !144)
!523 = !DILocation(line: 699, column: 43, scope: !521)
!524 = !DILocation(line: 702, column: 2, scope: !521)
!525 = !DILocation(line: 702, column: 6, scope: !521)
!526 = !DILocation(line: 702, column: 11, scope: !521)
!527 = !DILocation(line: 703, column: 2, scope: !521)
!528 = !DILocation(line: 703, column: 6, scope: !521)
!529 = !DILocation(line: 703, column: 18, scope: !521)
!530 = !DILocation(line: 704, column: 2, scope: !521)
!531 = !DILocation(line: 704, column: 6, scope: !521)
!532 = !DILocation(line: 704, column: 13, scope: !521)
!533 = !DILocation(line: 707, column: 2, scope: !521)
!534 = !DILocation(line: 707, column: 6, scope: !521)
!535 = !DILocation(line: 707, column: 11, scope: !521)
!536 = !DILocation(line: 708, column: 2, scope: !521)
!537 = !DILocation(line: 708, column: 6, scope: !521)
!538 = !DILocation(line: 708, column: 11, scope: !521)
!539 = !DILocation(line: 711, column: 2, scope: !521)
!540 = !DILocation(line: 711, column: 6, scope: !521)
!541 = !DILocation(line: 711, column: 11, scope: !521)
!542 = !DILocation(line: 712, column: 1, scope: !521)
!543 = distinct !DISubprogram(name: "SOUND_OT_unpack", scope: !1, file: !1, line: 764, type: !142, scopeLine: 765, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!544 = !DILocalVariable(name: "ot", arg: 1, scope: !543, file: !1, line: 764, type: !144)
!545 = !DILocation(line: 764, column: 45, scope: !543)
!546 = !DILocation(line: 767, column: 2, scope: !543)
!547 = !DILocation(line: 767, column: 6, scope: !543)
!548 = !DILocation(line: 767, column: 11, scope: !543)
!549 = !DILocation(line: 768, column: 2, scope: !543)
!550 = !DILocation(line: 768, column: 6, scope: !543)
!551 = !DILocation(line: 768, column: 18, scope: !543)
!552 = !DILocation(line: 769, column: 2, scope: !543)
!553 = !DILocation(line: 769, column: 6, scope: !543)
!554 = !DILocation(line: 769, column: 13, scope: !543)
!555 = !DILocation(line: 772, column: 2, scope: !543)
!556 = !DILocation(line: 772, column: 6, scope: !543)
!557 = !DILocation(line: 772, column: 11, scope: !543)
!558 = !DILocation(line: 773, column: 2, scope: !543)
!559 = !DILocation(line: 773, column: 6, scope: !543)
!560 = !DILocation(line: 773, column: 13, scope: !543)
!561 = !DILocation(line: 774, column: 2, scope: !543)
!562 = !DILocation(line: 774, column: 6, scope: !543)
!563 = !DILocation(line: 774, column: 11, scope: !543)
!564 = !DILocation(line: 777, column: 2, scope: !543)
!565 = !DILocation(line: 777, column: 6, scope: !543)
!566 = !DILocation(line: 777, column: 11, scope: !543)
!567 = !DILocation(line: 780, column: 15, scope: !543)
!568 = !DILocation(line: 780, column: 19, scope: !543)
!569 = !DILocation(line: 780, column: 2, scope: !543)
!570 = !DILocation(line: 781, column: 17, scope: !543)
!571 = !DILocation(line: 781, column: 21, scope: !543)
!572 = !DILocation(line: 781, column: 2, scope: !543)
!573 = !DILocation(line: 782, column: 1, scope: !543)
!574 = distinct !DISubprogram(name: "SOUND_OT_update_animation_flags", scope: !1, file: !1, line: 255, type: !142, scopeLine: 256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!575 = !DILocalVariable(name: "ot", arg: 1, scope: !574, file: !1, line: 255, type: !144)
!576 = !DILocation(line: 255, column: 61, scope: !574)
!577 = !DILocation(line: 265, column: 2, scope: !574)
!578 = !DILocation(line: 265, column: 6, scope: !574)
!579 = !DILocation(line: 265, column: 11, scope: !574)
!580 = !DILocation(line: 266, column: 2, scope: !574)
!581 = !DILocation(line: 266, column: 6, scope: !574)
!582 = !DILocation(line: 266, column: 18, scope: !574)
!583 = !DILocation(line: 267, column: 2, scope: !574)
!584 = !DILocation(line: 267, column: 6, scope: !574)
!585 = !DILocation(line: 267, column: 13, scope: !574)
!586 = !DILocation(line: 270, column: 2, scope: !574)
!587 = !DILocation(line: 270, column: 6, scope: !574)
!588 = !DILocation(line: 270, column: 11, scope: !574)
!589 = !DILocation(line: 273, column: 2, scope: !574)
!590 = !DILocation(line: 273, column: 6, scope: !574)
!591 = !DILocation(line: 273, column: 11, scope: !574)
!592 = !DILocation(line: 274, column: 1, scope: !574)
!593 = distinct !DISubprogram(name: "SOUND_OT_bake_animation", scope: !1, file: !1, line: 298, type: !142, scopeLine: 299, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!594 = !DILocalVariable(name: "ot", arg: 1, scope: !593, file: !1, line: 298, type: !144)
!595 = !DILocation(line: 298, column: 53, scope: !593)
!596 = !DILocation(line: 301, column: 2, scope: !593)
!597 = !DILocation(line: 301, column: 6, scope: !593)
!598 = !DILocation(line: 301, column: 11, scope: !593)
!599 = !DILocation(line: 302, column: 2, scope: !593)
!600 = !DILocation(line: 302, column: 6, scope: !593)
!601 = !DILocation(line: 302, column: 18, scope: !593)
!602 = !DILocation(line: 303, column: 2, scope: !593)
!603 = !DILocation(line: 303, column: 6, scope: !593)
!604 = !DILocation(line: 303, column: 13, scope: !593)
!605 = !DILocation(line: 306, column: 2, scope: !593)
!606 = !DILocation(line: 306, column: 6, scope: !593)
!607 = !DILocation(line: 306, column: 11, scope: !593)
!608 = !DILocation(line: 309, column: 2, scope: !593)
!609 = !DILocation(line: 309, column: 6, scope: !593)
!610 = !DILocation(line: 309, column: 11, scope: !593)
!611 = !DILocation(line: 310, column: 1, scope: !593)
!612 = distinct !DISubprogram(name: "sound_open_exec", scope: !1, file: !1, line: 152, type: !613, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!613 = !DISubroutineType(types: !614)
!614 = !{!95, !615, !618}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !617, line: 69, baseType: !161)
!617 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperator", file: !32, line: 348, baseType: !164)
!620 = !DILocalVariable(name: "UNUSED_C", arg: 1, scope: !612, file: !1, line: 152, type: !615)
!621 = !DILocation(line: 152, column: 38, scope: !612)
!622 = !DILocalVariable(name: "op", arg: 2, scope: !612, file: !1, line: 152, type: !618)
!623 = !DILocation(line: 152, column: 61, scope: !612)
!624 = !DILocation(line: 154, column: 13, scope: !612)
!625 = !DILocation(line: 154, column: 17, scope: !612)
!626 = !DILocation(line: 154, column: 2, scope: !612)
!627 = !DILocation(line: 156, column: 2, scope: !612)
!628 = distinct !DISubprogram(name: "sound_open_invoke", scope: !1, file: !1, line: 161, type: !629, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!629 = !DISubroutineType(types: !630)
!630 = !{!95, !615, !618, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmEvent", file: !146, line: 460, baseType: !264)
!634 = !DILocalVariable(name: "C", arg: 1, scope: !628, file: !1, line: 161, type: !615)
!635 = !DILocation(line: 161, column: 40, scope: !628)
!636 = !DILocalVariable(name: "op", arg: 2, scope: !628, file: !1, line: 161, type: !618)
!637 = !DILocation(line: 161, column: 55, scope: !628)
!638 = !DILocalVariable(name: "event", arg: 3, scope: !628, file: !1, line: 161, type: !631)
!639 = !DILocation(line: 161, column: 74, scope: !628)
!640 = !DILocation(line: 163, column: 33, scope: !641)
!641 = distinct !DILexicalBlock(scope: !628, file: !1, line: 163, column: 6)
!642 = !DILocation(line: 163, column: 37, scope: !641)
!643 = !DILocation(line: 163, column: 6, scope: !641)
!644 = !DILocation(line: 163, column: 6, scope: !628)
!645 = !DILocation(line: 164, column: 26, scope: !641)
!646 = !DILocation(line: 164, column: 29, scope: !641)
!647 = !DILocation(line: 164, column: 10, scope: !641)
!648 = !DILocation(line: 164, column: 3, scope: !641)
!649 = !DILocation(line: 166, column: 18, scope: !628)
!650 = !DILocation(line: 166, column: 21, scope: !628)
!651 = !DILocation(line: 166, column: 2, scope: !628)
!652 = !DILocation(line: 168, column: 29, scope: !628)
!653 = !DILocation(line: 168, column: 32, scope: !628)
!654 = !DILocation(line: 168, column: 36, scope: !628)
!655 = !DILocation(line: 168, column: 9, scope: !628)
!656 = !DILocation(line: 168, column: 2, scope: !628)
!657 = !DILocation(line: 169, column: 1, scope: !628)
!658 = distinct !DISubprogram(name: "sound_open_cancel", scope: !1, file: !1, line: 79, type: !659, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !615, !618}
!661 = !DILocalVariable(name: "UNUSED_C", arg: 1, scope: !658, file: !1, line: 79, type: !615)
!662 = !DILocation(line: 79, column: 41, scope: !658)
!663 = !DILocalVariable(name: "op", arg: 2, scope: !658, file: !1, line: 79, type: !618)
!664 = !DILocation(line: 79, column: 64, scope: !658)
!665 = !DILocation(line: 81, column: 2, scope: !658)
!666 = !DILocation(line: 81, column: 12, scope: !658)
!667 = !DILocation(line: 81, column: 16, scope: !658)
!668 = !DILocation(line: 82, column: 2, scope: !658)
!669 = !DILocation(line: 82, column: 6, scope: !658)
!670 = !DILocation(line: 82, column: 17, scope: !658)
!671 = !DILocation(line: 83, column: 1, scope: !658)
!672 = distinct !DISubprogram(name: "sound_open_init", scope: !1, file: !1, line: 85, type: !659, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!673 = !DILocalVariable(name: "C", arg: 1, scope: !672, file: !1, line: 85, type: !615)
!674 = !DILocation(line: 85, column: 39, scope: !672)
!675 = !DILocalVariable(name: "op", arg: 2, scope: !672, file: !1, line: 85, type: !618)
!676 = !DILocation(line: 85, column: 54, scope: !672)
!677 = !DILocalVariable(name: "pprop", scope: !672, file: !1, line: 87, type: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyPointerRNA", file: !162, line: 67, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyPointerRNA", file: !162, line: 64, size: 256, elements: !681)
!681 = !{!682, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !680, file: !162, line: 65, baseType: !683, size: 192)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !162, line: 62, baseType: !209)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !680, file: !162, line: 66, baseType: !685, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!686 = !DILocation(line: 87, column: 22, scope: !672)
!687 = !DILocation(line: 89, column: 27, scope: !672)
!688 = !DILocation(line: 89, column: 25, scope: !672)
!689 = !DILocation(line: 89, column: 19, scope: !672)
!690 = !DILocation(line: 89, column: 2, scope: !672)
!691 = !DILocation(line: 89, column: 6, scope: !672)
!692 = !DILocation(line: 89, column: 17, scope: !672)
!693 = !DILocation(line: 90, column: 22, scope: !672)
!694 = !DILocation(line: 90, column: 26, scope: !672)
!695 = !DILocation(line: 90, column: 33, scope: !672)
!696 = !DILocation(line: 90, column: 39, scope: !672)
!697 = !DILocation(line: 90, column: 46, scope: !672)
!698 = !DILocation(line: 90, column: 2, scope: !672)
!699 = !DILocation(line: 91, column: 1, scope: !672)
!700 = distinct !DISubprogram(name: "sound_mixdown_exec", scope: !1, file: !1, line: 315, type: !613, scopeLine: 316, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!701 = !DILocalVariable(name: "C", arg: 1, scope: !700, file: !1, line: 315, type: !615)
!702 = !DILocation(line: 315, column: 41, scope: !700)
!703 = !DILocalVariable(name: "op", arg: 2, scope: !700, file: !1, line: 315, type: !618)
!704 = !DILocation(line: 315, column: 56, scope: !700)
!705 = !DILocation(line: 359, column: 8, scope: !700)
!706 = !DILocation(line: 360, column: 8, scope: !700)
!707 = !DILocation(line: 362, column: 2, scope: !700)
!708 = distinct !DISubprogram(name: "sound_mixdown_invoke", scope: !1, file: !1, line: 440, type: !629, scopeLine: 441, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!709 = !DILocalVariable(name: "C", arg: 1, scope: !708, file: !1, line: 440, type: !615)
!710 = !DILocation(line: 440, column: 43, scope: !708)
!711 = !DILocalVariable(name: "op", arg: 2, scope: !708, file: !1, line: 440, type: !618)
!712 = !DILocation(line: 440, column: 58, scope: !708)
!713 = !DILocalVariable(name: "event", arg: 3, scope: !708, file: !1, line: 440, type: !631)
!714 = !DILocation(line: 440, column: 77, scope: !708)
!715 = !DILocation(line: 442, column: 33, scope: !716)
!716 = distinct !DILexicalBlock(scope: !708, file: !1, line: 442, column: 6)
!717 = !DILocation(line: 442, column: 37, scope: !716)
!718 = !DILocation(line: 442, column: 6, scope: !716)
!719 = !DILocation(line: 442, column: 6, scope: !708)
!720 = !DILocation(line: 443, column: 29, scope: !716)
!721 = !DILocation(line: 443, column: 32, scope: !716)
!722 = !DILocation(line: 443, column: 10, scope: !716)
!723 = !DILocation(line: 443, column: 3, scope: !716)
!724 = !DILocation(line: 445, column: 29, scope: !708)
!725 = !DILocation(line: 445, column: 32, scope: !708)
!726 = !DILocation(line: 445, column: 36, scope: !708)
!727 = !DILocation(line: 445, column: 9, scope: !708)
!728 = !DILocation(line: 445, column: 2, scope: !708)
!729 = !DILocation(line: 446, column: 1, scope: !708)
!730 = distinct !DISubprogram(name: "sound_pack_exec", scope: !1, file: !1, line: 679, type: !613, scopeLine: 680, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!731 = !DILocalVariable(name: "C", arg: 1, scope: !730, file: !1, line: 679, type: !615)
!732 = !DILocation(line: 679, column: 38, scope: !730)
!733 = !DILocalVariable(name: "op", arg: 2, scope: !730, file: !1, line: 679, type: !618)
!734 = !DILocation(line: 679, column: 53, scope: !730)
!735 = !DILocalVariable(name: "bmain", scope: !730, file: !1, line: 681, type: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "Main", file: !738, line: 104, baseType: !739)
!738 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !738, line: 53, size: 15232, elements: !740)
!740 = !{!741, !743, !744, !748, !749, !750, !751, !752, !758, !762, !763, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !838, !841}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !739, file: !738, line: 54, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !739, file: !738, line: 54, baseType: !742, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !739, file: !738, line: 55, baseType: !745, size: 8192, offset: 128)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8192, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !739, file: !738, line: 56, baseType: !184, size: 16, offset: 8320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !739, file: !738, line: 56, baseType: !184, size: 16, offset: 8336)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !739, file: !738, line: 57, baseType: !184, size: 16, offset: 8352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !739, file: !738, line: 57, baseType: !184, size: 16, offset: 8368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !739, file: !738, line: 58, baseType: !753, size: 64, offset: 8384)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !754, line: 27, baseType: !755)
!754 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !756, line: 45, baseType: !757)
!756 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!757 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !739, file: !738, line: 59, baseType: !759, size: 128, offset: 8448)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 16)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !739, file: !738, line: 60, baseType: !184, size: 16, offset: 8576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !739, file: !738, line: 62, baseType: !764, size: 64, offset: 8640)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !175, line: 136, size: 17600, elements: !766)
!766 = !{!767, !785, !787, !790, !791, !792, !793}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !765, file: !175, line: 137, baseType: !768, size: 960)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !175, line: 130, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !175, line: 117, size: 960, elements: !770)
!770 = !{!771, !772, !773, !775, !776, !780, !781, !782, !783, !784}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !769, file: !175, line: 118, baseType: !124, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !769, file: !175, line: 118, baseType: !124, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !769, file: !175, line: 119, baseType: !774, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !769, file: !175, line: 120, baseType: !764, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !769, file: !175, line: 121, baseType: !777, size: 528, offset: 256)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 528, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 66)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !769, file: !175, line: 126, baseType: !184, size: 16, offset: 784)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !769, file: !175, line: 127, baseType: !95, size: 32, offset: 800)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !769, file: !175, line: 128, baseType: !95, size: 32, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !769, file: !175, line: 128, baseType: !95, size: 32, offset: 864)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !769, file: !175, line: 129, baseType: !173, size: 64, offset: 896)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !765, file: !175, line: 138, baseType: !786, size: 64, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !765, file: !175, line: 139, baseType: !788, size: 64, offset: 1024)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !175, line: 43, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !765, file: !175, line: 140, baseType: !745, size: 8192, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !765, file: !175, line: 141, baseType: !745, size: 8192, offset: 9280)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !765, file: !175, line: 148, baseType: !764, size: 64, offset: 17472)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !765, file: !175, line: 150, baseType: !794, size: 64, offset: 17536)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !81, line: 37, size: 128, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !795, file: !81, line: 38, baseType: !95, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !795, file: !81, line: 39, baseType: !95, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !795, file: !81, line: 40, baseType: !124, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !739, file: !738, line: 63, baseType: !193, size: 128, offset: 8704)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !739, file: !738, line: 64, baseType: !193, size: 128, offset: 8832)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !739, file: !738, line: 65, baseType: !193, size: 128, offset: 8960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !739, file: !738, line: 66, baseType: !193, size: 128, offset: 9088)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !739, file: !738, line: 67, baseType: !193, size: 128, offset: 9216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !739, file: !738, line: 68, baseType: !193, size: 128, offset: 9344)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !739, file: !738, line: 69, baseType: !193, size: 128, offset: 9472)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !739, file: !738, line: 70, baseType: !193, size: 128, offset: 9600)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !739, file: !738, line: 71, baseType: !193, size: 128, offset: 9728)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !739, file: !738, line: 72, baseType: !193, size: 128, offset: 9856)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !739, file: !738, line: 73, baseType: !193, size: 128, offset: 9984)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !739, file: !738, line: 74, baseType: !193, size: 128, offset: 10112)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !739, file: !738, line: 75, baseType: !193, size: 128, offset: 10240)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !739, file: !738, line: 76, baseType: !193, size: 128, offset: 10368)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !739, file: !738, line: 77, baseType: !193, size: 128, offset: 10496)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !739, file: !738, line: 78, baseType: !193, size: 128, offset: 10624)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !739, file: !738, line: 79, baseType: !193, size: 128, offset: 10752)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !739, file: !738, line: 80, baseType: !193, size: 128, offset: 10880)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !739, file: !738, line: 81, baseType: !193, size: 128, offset: 11008)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !739, file: !738, line: 82, baseType: !193, size: 128, offset: 11136)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !739, file: !738, line: 83, baseType: !193, size: 128, offset: 11264)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !739, file: !738, line: 84, baseType: !193, size: 128, offset: 11392)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !739, file: !738, line: 85, baseType: !193, size: 128, offset: 11520)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !739, file: !738, line: 86, baseType: !193, size: 128, offset: 11648)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !739, file: !738, line: 87, baseType: !193, size: 128, offset: 11776)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !739, file: !738, line: 88, baseType: !193, size: 128, offset: 11904)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !739, file: !738, line: 89, baseType: !193, size: 128, offset: 12032)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !739, file: !738, line: 90, baseType: !193, size: 128, offset: 12160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !739, file: !738, line: 91, baseType: !193, size: 128, offset: 12288)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !739, file: !738, line: 92, baseType: !193, size: 128, offset: 12416)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !739, file: !738, line: 93, baseType: !193, size: 128, offset: 12544)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !739, file: !738, line: 94, baseType: !193, size: 128, offset: 12672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !739, file: !738, line: 95, baseType: !193, size: 128, offset: 12800)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !739, file: !738, line: 96, baseType: !193, size: 128, offset: 12928)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !739, file: !738, line: 98, baseType: !835, size: 2048, offset: 13056)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !739, file: !738, line: 101, baseType: !839, size: 64, offset: 15104)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !738, line: 49, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !739, file: !738, line: 103, baseType: !842, size: 64, offset: 15168)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !738, line: 51, flags: DIFlagFwdDecl)
!844 = !DILocation(line: 681, column: 8, scope: !730)
!845 = !DILocation(line: 681, column: 30, scope: !730)
!846 = !DILocation(line: 681, column: 16, scope: !730)
!847 = !DILocalVariable(name: "ed", scope: !730, file: !1, line: 682, type: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "Editing", file: !52, line: 213, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !52, line: 200, size: 17024, elements: !851)
!851 = !{!852, !854, !855, !856, !2035, !2036, !2037, !2038, !2039, !2040, !2041}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !850, file: !52, line: 201, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !850, file: !52, line: 202, baseType: !193, size: 128, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !850, file: !52, line: 203, baseType: !193, size: 128, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !850, file: !52, line: 206, baseType: !857, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !52, line: 190, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !52, line: 126, size: 2816, elements: !860)
!860 = !{!861, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !958, !961, !1987, !1988, !1989, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !859, file: !52, line: 127, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !859, file: !52, line: 127, baseType: !862, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !859, file: !52, line: 128, baseType: !124, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !859, file: !52, line: 129, baseType: !124, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !859, file: !52, line: 130, baseType: !169, size: 512, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !859, file: !52, line: 132, baseType: !95, size: 32, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !859, file: !52, line: 132, baseType: !95, size: 32, offset: 800)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !859, file: !52, line: 133, baseType: !95, size: 32, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !859, file: !52, line: 134, baseType: !95, size: 32, offset: 864)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !859, file: !52, line: 134, baseType: !95, size: 32, offset: 896)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !859, file: !52, line: 134, baseType: !95, size: 32, offset: 928)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !859, file: !52, line: 135, baseType: !95, size: 32, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !859, file: !52, line: 135, baseType: !95, size: 32, offset: 992)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !859, file: !52, line: 136, baseType: !95, size: 32, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !859, file: !52, line: 136, baseType: !95, size: 32, offset: 1056)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !859, file: !52, line: 137, baseType: !95, size: 32, offset: 1088)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !859, file: !52, line: 137, baseType: !95, size: 32, offset: 1120)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !859, file: !52, line: 138, baseType: !303, size: 32, offset: 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !859, file: !52, line: 139, baseType: !303, size: 32, offset: 1184)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !859, file: !52, line: 139, baseType: !303, size: 32, offset: 1216)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !859, file: !52, line: 141, baseType: !184, size: 16, offset: 1248)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !859, file: !52, line: 142, baseType: !184, size: 16, offset: 1264)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !859, file: !52, line: 143, baseType: !95, size: 32, offset: 1280)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !859, file: !52, line: 144, baseType: !95, size: 32, offset: 1312)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !859, file: !52, line: 146, baseType: !887, size: 64, offset: 1344)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !52, line: 114, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !52, line: 99, size: 7232, elements: !890)
!890 = !{!891, !893, !894, !895, !896, !897, !898, !906, !910, !925, !934, !941, !952}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !889, file: !52, line: 100, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !889, file: !52, line: 100, baseType: !892, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !889, file: !52, line: 101, baseType: !95, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !889, file: !52, line: 101, baseType: !95, size: 32, offset: 160)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !889, file: !52, line: 102, baseType: !95, size: 32, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !889, file: !52, line: 102, baseType: !95, size: 32, offset: 224)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !889, file: !52, line: 103, baseType: !899, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !52, line: 59, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !52, line: 56, size: 2112, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !901, file: !52, line: 57, baseType: !835, size: 2048)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !901, file: !52, line: 58, baseType: !95, size: 32, offset: 2048)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !901, file: !52, line: 58, baseType: !95, size: 32, offset: 2080)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !889, file: !52, line: 106, baseType: !907, size: 6144, offset: 320)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 6144, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 768)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !889, file: !52, line: 107, baseType: !911, size: 64, offset: 6464)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !52, line: 97, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !52, line: 83, size: 8320, elements: !914)
!914 = !{!915, !916, !917, !921, !922, !923, !924}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !913, file: !52, line: 84, baseType: !907, size: 6144)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !913, file: !52, line: 87, baseType: !835, size: 2048, offset: 6144)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !913, file: !52, line: 88, baseType: !918, size: 64, offset: 8192)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !920, line: 41, flags: DIFlagFwdDecl)
!920 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !913, file: !52, line: 90, baseType: !184, size: 16, offset: 8256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !913, file: !52, line: 92, baseType: !184, size: 16, offset: 8272)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !913, file: !52, line: 93, baseType: !184, size: 16, offset: 8288)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !913, file: !52, line: 95, baseType: !184, size: 16, offset: 8304)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !889, file: !52, line: 108, baseType: !926, size: 64, offset: 6528)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !52, line: 66, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !52, line: 61, size: 128, elements: !929)
!929 = !{!930, !931, !932, !933}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !928, file: !52, line: 62, baseType: !95, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !928, file: !52, line: 63, baseType: !95, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !928, file: !52, line: 64, baseType: !95, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !928, file: !52, line: 65, baseType: !95, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !889, file: !52, line: 109, baseType: !935, size: 64, offset: 6592)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !52, line: 71, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !52, line: 68, size: 64, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !937, file: !52, line: 69, baseType: !95, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !937, file: !52, line: 70, baseType: !95, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !889, file: !52, line: 110, baseType: !942, size: 64, offset: 6656)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !52, line: 81, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !52, line: 73, size: 352, elements: !945)
!945 = !{!946, !948, !949, !950, !951}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !944, file: !52, line: 74, baseType: !947, size: 96)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 96, elements: !352)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !944, file: !52, line: 75, baseType: !947, size: 96, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !944, file: !52, line: 76, baseType: !947, size: 96, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !944, file: !52, line: 77, baseType: !95, size: 32, offset: 288)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !944, file: !52, line: 78, baseType: !95, size: 32, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !889, file: !52, line: 113, baseType: !953, size: 512, offset: 6720)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !954, line: 182, baseType: !955)
!954 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !954, line: 180, size: 512, elements: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !954, line: 181, baseType: !169, size: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !859, file: !52, line: 148, baseType: !959, size: 64, offset: 1408)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !52, line: 49, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !859, file: !52, line: 151, baseType: !962, size: 64, offset: 1472)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !964, line: 1216, size: 39680, elements: !965)
!964 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!965 = !{!966, !967, !970, !973, !976, !977, !978, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1004, !1075, !1077, !1369, !1372, !1658, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1680, !1681, !1682, !1683, !1684, !1692, !1758, !1765, !1766, !1773, !1979, !1980, !1981, !1982, !1983, !1984}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !963, file: !964, line: 1217, baseType: !768, size: 960)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !963, file: !964, line: 1218, baseType: !968, size: 64, offset: 960)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !964, line: 58, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !963, file: !964, line: 1220, baseType: !971, size: 64, offset: 1024)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !964, line: 50, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !963, file: !964, line: 1221, baseType: !974, size: 64, offset: 1088)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !964, line: 52, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !963, file: !964, line: 1223, baseType: !962, size: 64, offset: 1152)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !963, file: !964, line: 1225, baseType: !193, size: 128, offset: 1216)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !963, file: !964, line: 1226, baseType: !979, size: 64, offset: 1344)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !964, line: 69, size: 320, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !980, file: !964, line: 70, baseType: !979, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !980, file: !964, line: 70, baseType: !979, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !980, file: !964, line: 71, baseType: !5, size: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !980, file: !964, line: 71, baseType: !5, size: 32, offset: 160)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !980, file: !964, line: 72, baseType: !95, size: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !980, file: !964, line: 73, baseType: !184, size: 16, offset: 224)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !980, file: !964, line: 73, baseType: !184, size: 16, offset: 240)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !980, file: !964, line: 74, baseType: !971, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !963, file: !964, line: 1227, baseType: !971, size: 64, offset: 1408)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !963, file: !964, line: 1229, baseType: !947, size: 96, offset: 1472)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !963, file: !964, line: 1230, baseType: !947, size: 96, offset: 1568)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !963, file: !964, line: 1231, baseType: !947, size: 96, offset: 1664)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !963, file: !964, line: 1231, baseType: !947, size: 96, offset: 1760)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !963, file: !964, line: 1233, baseType: !5, size: 32, offset: 1856)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !963, file: !964, line: 1234, baseType: !95, size: 32, offset: 1888)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !963, file: !964, line: 1235, baseType: !5, size: 32, offset: 1920)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !963, file: !964, line: 1237, baseType: !184, size: 16, offset: 1952)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !963, file: !964, line: 1239, baseType: !152, size: 8, offset: 1968)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !963, file: !964, line: 1240, baseType: !1001, size: 8, offset: 1976)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 1)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !963, file: !964, line: 1242, baseType: !1005, size: 64, offset: 1984)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !218, line: 328, size: 3456, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1013, !1014, !1015, !1018, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1043, !1044, !1045, !1048, !1053, !1054, !1057, !1061, !1066, !1070, !1071, !1072, !1073, !1074}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1006, file: !218, line: 329, baseType: !768, size: 960)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1006, file: !218, line: 330, baseType: !968, size: 64, offset: 960)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1006, file: !218, line: 332, baseType: !1011, size: 64, offset: 1024)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !218, line: 332, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1006, file: !218, line: 333, baseType: !169, size: 512, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1006, file: !218, line: 335, baseType: !216, size: 64, offset: 1600)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1006, file: !218, line: 337, baseType: !1016, size: 64, offset: 1664)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !964, line: 61, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1006, file: !218, line: 338, baseType: !1019, size: 64, offset: 1728)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 64, elements: !274)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1006, file: !218, line: 340, baseType: !193, size: 128, offset: 1792)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1006, file: !218, line: 340, baseType: !193, size: 128, offset: 1920)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1006, file: !218, line: 342, baseType: !95, size: 32, offset: 2048)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1006, file: !218, line: 342, baseType: !95, size: 32, offset: 2080)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1006, file: !218, line: 343, baseType: !95, size: 32, offset: 2112)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1006, file: !218, line: 345, baseType: !95, size: 32, offset: 2144)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1006, file: !218, line: 346, baseType: !95, size: 32, offset: 2176)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1006, file: !218, line: 347, baseType: !184, size: 16, offset: 2208)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1006, file: !218, line: 348, baseType: !184, size: 16, offset: 2224)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1006, file: !218, line: 349, baseType: !95, size: 32, offset: 2240)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1006, file: !218, line: 351, baseType: !95, size: 32, offset: 2272)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1006, file: !218, line: 353, baseType: !184, size: 16, offset: 2304)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1006, file: !218, line: 354, baseType: !184, size: 16, offset: 2320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1006, file: !218, line: 355, baseType: !95, size: 32, offset: 2336)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1006, file: !218, line: 357, baseType: !1035, size: 128, offset: 2368)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1036, line: 95, baseType: !1037)
!1036 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1036, line: 92, size: 128, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1037, file: !1036, line: 93, baseType: !303, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1037, file: !1036, line: 93, baseType: !303, size: 32, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1037, file: !1036, line: 94, baseType: !303, size: 32, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1037, file: !1036, line: 94, baseType: !303, size: 32, offset: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1006, file: !218, line: 363, baseType: !193, size: 128, offset: 2496)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1006, file: !218, line: 363, baseType: !193, size: 128, offset: 2624)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1006, file: !218, line: 368, baseType: !1046, size: 64, offset: 2752)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !218, line: 48, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1006, file: !218, line: 372, baseType: !1049, size: 32, offset: 2816)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !218, line: 274, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !218, line: 271, size: 32, elements: !1051)
!1051 = !{!1052}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1050, file: !218, line: 273, baseType: !5, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1006, file: !218, line: 373, baseType: !95, size: 32, offset: 2848)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1006, file: !218, line: 382, baseType: !1055, size: 64, offset: 2880)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !218, line: 46, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1006, file: !218, line: 385, baseType: !1058, size: 64, offset: 2944)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{null, !124, !303}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1006, file: !218, line: 386, baseType: !1062, size: 64, offset: 3008)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !124, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1006, file: !218, line: 387, baseType: !1067, size: 64, offset: 3072)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!95, !124}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1006, file: !218, line: 388, baseType: !428, size: 64, offset: 3136)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1006, file: !218, line: 389, baseType: !124, size: 64, offset: 3200)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1006, file: !218, line: 389, baseType: !124, size: 64, offset: 3264)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1006, file: !218, line: 389, baseType: !124, size: 64, offset: 3328)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1006, file: !218, line: 389, baseType: !124, size: 64, offset: 3392)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !963, file: !964, line: 1244, baseType: !1076, size: 64, offset: 2048)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !963, file: !964, line: 1246, baseType: !1078, size: 64, offset: 2112)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !964, line: 1067, size: 5184, elements: !1080)
!1080 = !{!1081, !1113, !1114, !1129, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1151, !1241, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1352}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1079, file: !964, line: 1068, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !964, line: 934, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !964, line: 925, size: 576, elements: !1085)
!1085 = !{!1086, !1104, !1105, !1106, !1107, !1109, !1112}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1084, file: !964, line: 926, baseType: !1087, size: 320)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !964, line: 830, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !964, line: 813, size: 320, elements: !1089)
