; ModuleID = 'blender/source/blender/editors/space_node/node_view.c'
source_filename = "blender/source/blender/editors/space_node/node_view.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bNodeTreeType = type { i32, [64 x i8], [64 x i8], [256 x i8], i32, void (%struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNode*)*, void (%struct.Scene*, i8*, void (i8*, i32, i8*)*)*, i32 (%struct.bContext*, %struct.bNodeTreeType*)*, void (%struct.bContext*, %struct.bNodeTreeType*, %struct.bNodeTree**, %struct.ID**, %struct.ID**)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*)*, i32 (%struct.bNodeTree*, %struct.bNodeLink*)*, void (%struct.bNodeTree*, %struct.bNode*)*, %struct.ExtensionRNA }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !27, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_node/node_view.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceNode_Flag", file: !4, line: 966, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!7 = !DIEnumerator(name: "SNODE_BACKDRAW", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "SNODE_SHOW_GPENCIL", value: 4, isUnsigned: true)
!9 = !DIEnumerator(name: "SNODE_USE_ALPHA", value: 8, isUnsigned: true)
!10 = !DIEnumerator(name: "SNODE_SHOW_ALPHA", value: 16, isUnsigned: true)
!11 = !DIEnumerator(name: "SNODE_SHOW_R", value: 128, isUnsigned: true)
!12 = !DIEnumerator(name: "SNODE_SHOW_G", value: 256, isUnsigned: true)
!13 = !DIEnumerator(name: "SNODE_SHOW_B", value: 512, isUnsigned: true)
!14 = !DIEnumerator(name: "SNODE_AUTO_RENDER", value: 32, isUnsigned: true)
!15 = !DIEnumerator(name: "SNODE_SHOW_HIGHLIGHT", value: 64, isUnsigned: true)
!16 = !DIEnumerator(name: "SNODE_NEW_SHADERS", value: 2048, isUnsigned: true)
!17 = !DIEnumerator(name: "SNODE_PIN", value: 4096, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 351, baseType: !5, size: 32, elements: !20)
!19 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = !{!21, !22, !23, !24, !25, !26}
!21 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!27 = !{!28, !29, !30, !32}
!28 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !{i32 7, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{i32 1, !"wchar_size", i32 4}
!36 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!37 = distinct !DISubprogram(name: "space_node_view_flag", scope: !1, file: !1, line: 67, type: !38, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2517)
!38 = !DISubroutineType(types: !39)
!39 = !{!29, !40, !45, !2514, !2516, !2516}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !42, line: 69, baseType: !43)
!42 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !44, line: 44, flags: DIFlagFwdDecl)
!44 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceNode", file: !4, line: 963, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !4, line: 925, size: 3200, elements: !48)
!48 = !{!49, !71, !72, !73, !74, !75, !76, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !4, line: 926, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !53)
!53 = !{!54, !56, !57, !64, !65, !66}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !4, line: 86, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !4, line: 86, baseType: !55, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !52, file: !4, line: 87, baseType: !58, size: 128, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !32, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !32, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !52, file: !4, line: 88, baseType: !29, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !52, file: !4, line: 89, baseType: !28, size: 32, offset: 288)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !52, file: !4, line: 90, baseType: !67, size: 128, offset: 320)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !69)
!68 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !47, file: !4, line: 926, baseType: !50, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !47, file: !4, line: 927, baseType: !58, size: 128, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !47, file: !4, line: 928, baseType: !29, size: 32, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !47, file: !4, line: 929, baseType: !28, size: 32, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !47, file: !4, line: 930, baseType: !67, size: 128, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !47, file: !4, line: 932, baseType: !77, size: 1280, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !78, line: 71, baseType: !79)
!78 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !78, line: 40, size: 1280, elements: !80)
!80 = !{!81, !90, !91, !99, !100, !101, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !122, !123, !124, !127}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !79, file: !78, line: 41, baseType: !82, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !83, line: 95, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !83, line: 92, size: 128, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !84, file: !83, line: 93, baseType: !28, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !84, file: !83, line: 93, baseType: !28, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !84, file: !83, line: 94, baseType: !28, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !84, file: !83, line: 94, baseType: !28, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !79, file: !78, line: 41, baseType: !82, size: 128, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !79, file: !78, line: 42, baseType: !92, size: 128, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !83, line: 89, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !83, line: 86, size: 128, elements: !94)
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !93, file: !83, line: 87, baseType: !29, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !93, file: !83, line: 87, baseType: !29, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !93, file: !83, line: 88, baseType: !29, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !93, file: !83, line: 88, baseType: !29, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !79, file: !78, line: 42, baseType: !92, size: 128, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !79, file: !78, line: 43, baseType: !92, size: 128, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !79, file: !78, line: 45, baseType: !102, size: 64, offset: 640)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 2)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !79, file: !78, line: 45, baseType: !102, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !79, file: !78, line: 46, baseType: !28, size: 32, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !79, file: !78, line: 46, baseType: !28, size: 32, offset: 800)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !79, file: !78, line: 48, baseType: !68, size: 16, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !79, file: !78, line: 49, baseType: !68, size: 16, offset: 848)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !79, file: !78, line: 51, baseType: !68, size: 16, offset: 864)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !79, file: !78, line: 52, baseType: !68, size: 16, offset: 880)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !79, file: !78, line: 53, baseType: !68, size: 16, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !79, file: !78, line: 55, baseType: !68, size: 16, offset: 912)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !79, file: !78, line: 56, baseType: !68, size: 16, offset: 928)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !79, file: !78, line: 58, baseType: !68, size: 16, offset: 944)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !79, file: !78, line: 58, baseType: !68, size: 16, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !79, file: !78, line: 59, baseType: !68, size: 16, offset: 976)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !79, file: !78, line: 59, baseType: !68, size: 16, offset: 992)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !79, file: !78, line: 61, baseType: !68, size: 16, offset: 1008)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !79, file: !78, line: 63, baseType: !121, size: 64, offset: 1024)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !79, file: !78, line: 64, baseType: !29, size: 32, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !79, file: !78, line: 65, baseType: !29, size: 32, offset: 1120)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !79, file: !78, line: 68, baseType: !125, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !78, line: 68, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !79, file: !78, line: 69, baseType: !128, size: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !130, line: 490, size: 768, elements: !131)
!130 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!131 = !{!132, !133, !134, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !130, line: 491, baseType: !128, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !130, line: 491, baseType: !128, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !129, file: !130, line: 493, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !19, line: 169, size: 2048, elements: !137)
!137 = !{!138, !139, !140, !141, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2458, !2461, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !19, line: 170, baseType: !135, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !136, file: !19, line: 170, baseType: !135, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !136, file: !19, line: 172, baseType: !32, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !136, file: !19, line: 174, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !144, line: 49, size: 1984, elements: !145)
!144 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!145 = !{!146, !209, !210, !211, !212, !213, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !144, line: 50, baseType: !147, size: 960)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !148, line: 130, baseType: !149)
!148 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !148, line: 117, size: 960, elements: !150)
!150 = !{!151, !152, !153, !155, !175, !179, !180, !181, !182, !183}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !148, line: 118, baseType: !32, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !148, line: 118, baseType: !32, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !149, file: !148, line: 119, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !149, file: !148, line: 120, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !148, line: 136, size: 17600, elements: !158)
!158 = !{!159, !160, !162, !165, !170, !171, !172}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !157, file: !148, line: 137, baseType: !147, size: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !157, file: !148, line: 138, baseType: !161, size: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !157, file: !148, line: 139, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !148, line: 43, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !148, line: 140, baseType: !166, size: 8192, offset: 1088)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 8192, elements: !168)
!167 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !{!169}
!169 = !DISubrange(count: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !157, file: !148, line: 141, baseType: !166, size: 8192, offset: 9280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !157, file: !148, line: 148, baseType: !156, size: 64, offset: 17472)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !157, file: !148, line: 150, baseType: !173, size: 64, offset: 17536)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !148, line: 45, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !148, line: 121, baseType: !176, size: 528, offset: 256)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 528, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 66)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !149, file: !148, line: 126, baseType: !68, size: 16, offset: 784)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !149, file: !148, line: 127, baseType: !29, size: 32, offset: 800)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !149, file: !148, line: 128, baseType: !29, size: 32, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !149, file: !148, line: 128, baseType: !29, size: 32, offset: 864)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !149, file: !148, line: 129, baseType: !184, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !148, line: 75, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !148, line: 62, size: 1024, elements: !187)
!187 = !{!188, !190, !191, !192, !193, !194, !198, !199, !207, !208}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !148, line: 63, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !148, line: 63, baseType: !189, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !148, line: 64, baseType: !167, size: 8, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !186, file: !148, line: 64, baseType: !167, size: 8, offset: 136)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !148, line: 65, baseType: !68, size: 16, offset: 144)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !148, line: 66, baseType: !195, size: 512, offset: 160)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 512, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !186, file: !148, line: 67, baseType: !29, size: 32, offset: 672)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !148, line: 69, baseType: !200, size: 256, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !148, line: 60, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !148, line: 48, size: 256, elements: !202)
!202 = !{!203, !204, !205, !206}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !201, file: !148, line: 49, baseType: !32, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !201, file: !148, line: 58, baseType: !58, size: 128, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !201, file: !148, line: 59, baseType: !29, size: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !201, file: !148, line: 59, baseType: !29, size: 32, offset: 224)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !186, file: !148, line: 70, baseType: !29, size: 32, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !186, file: !148, line: 74, baseType: !29, size: 32, offset: 992)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !143, file: !144, line: 52, baseType: !58, size: 128, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !143, file: !144, line: 53, baseType: !58, size: 128, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !143, file: !144, line: 54, baseType: !58, size: 128, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !143, file: !144, line: 55, baseType: !58, size: 128, offset: 1344)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !143, file: !144, line: 57, baseType: !214, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !216, line: 1216, size: 39680, elements: !217)
!216 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!217 = !{!218, !219, !223, !226, !1430, !1431, !1432, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1801, !2012, !2015, !2255, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2277, !2278, !2279, !2280, !2281, !2289, !2355, !2362, !2363, !2370, !2371, !2377, !2378, !2379, !2380, !2381}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !215, file: !216, line: 1217, baseType: !147, size: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !215, file: !216, line: 1218, baseType: !220, size: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !222, line: 45, flags: DIFlagFwdDecl)
!222 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !215, file: !216, line: 1220, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !222, line: 49, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !215, file: !216, line: 1221, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !229, line: 52, size: 4224, elements: !230)
!229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !303, !1425, !1426, !1427, !1428, !1429}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !228, file: !229, line: 53, baseType: !147, size: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !228, file: !229, line: 54, baseType: !220, size: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !228, file: !229, line: 56, baseType: !68, size: 16, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !228, file: !229, line: 56, baseType: !68, size: 16, offset: 1040)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !228, file: !229, line: 57, baseType: !68, size: 16, offset: 1056)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !228, file: !229, line: 57, baseType: !68, size: 16, offset: 1072)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !228, file: !229, line: 59, baseType: !28, size: 32, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !228, file: !229, line: 59, baseType: !28, size: 32, offset: 1120)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !228, file: !229, line: 59, baseType: !28, size: 32, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !228, file: !229, line: 60, baseType: !28, size: 32, offset: 1184)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !228, file: !229, line: 60, baseType: !28, size: 32, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !228, file: !229, line: 60, baseType: !28, size: 32, offset: 1248)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !228, file: !229, line: 61, baseType: !28, size: 32, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !228, file: !229, line: 61, baseType: !28, size: 32, offset: 1312)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !228, file: !229, line: 61, baseType: !28, size: 32, offset: 1344)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !228, file: !229, line: 68, baseType: !28, size: 32, offset: 1376)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !228, file: !229, line: 68, baseType: !28, size: 32, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !228, file: !229, line: 68, baseType: !28, size: 32, offset: 1440)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !228, file: !229, line: 69, baseType: !28, size: 32, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !228, file: !229, line: 69, baseType: !28, size: 32, offset: 1504)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !228, file: !229, line: 74, baseType: !28, size: 32, offset: 1536)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !228, file: !229, line: 79, baseType: !28, size: 32, offset: 1568)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !228, file: !229, line: 81, baseType: !68, size: 16, offset: 1600)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !228, file: !229, line: 91, baseType: !68, size: 16, offset: 1616)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !228, file: !229, line: 92, baseType: !68, size: 16, offset: 1632)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !228, file: !229, line: 93, baseType: !68, size: 16, offset: 1648)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !228, file: !229, line: 94, baseType: !68, size: 16, offset: 1664)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !228, file: !229, line: 94, baseType: !68, size: 16, offset: 1680)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !228, file: !229, line: 94, baseType: !68, size: 16, offset: 1696)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !228, file: !229, line: 94, baseType: !68, size: 16, offset: 1712)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !228, file: !229, line: 96, baseType: !28, size: 32, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !228, file: !229, line: 96, baseType: !28, size: 32, offset: 1760)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !228, file: !229, line: 96, baseType: !28, size: 32, offset: 1792)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !228, file: !229, line: 96, baseType: !28, size: 32, offset: 1824)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !228, file: !229, line: 98, baseType: !28, size: 32, offset: 1856)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !228, file: !229, line: 98, baseType: !28, size: 32, offset: 1888)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !228, file: !229, line: 98, baseType: !28, size: 32, offset: 1920)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !228, file: !229, line: 98, baseType: !28, size: 32, offset: 1952)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !228, file: !229, line: 99, baseType: !28, size: 32, offset: 1984)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !228, file: !229, line: 99, baseType: !28, size: 32, offset: 2016)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !228, file: !229, line: 100, baseType: !28, size: 32, offset: 2048)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !228, file: !229, line: 100, baseType: !28, size: 32, offset: 2080)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !228, file: !229, line: 103, baseType: !68, size: 16, offset: 2112)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !228, file: !229, line: 103, baseType: !68, size: 16, offset: 2128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !228, file: !229, line: 103, baseType: !68, size: 16, offset: 2144)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !228, file: !229, line: 103, baseType: !68, size: 16, offset: 2160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !228, file: !229, line: 106, baseType: !28, size: 32, offset: 2176)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !228, file: !229, line: 106, baseType: !28, size: 32, offset: 2208)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !228, file: !229, line: 106, baseType: !28, size: 32, offset: 2240)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !228, file: !229, line: 106, baseType: !28, size: 32, offset: 2272)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !228, file: !229, line: 107, baseType: !68, size: 16, offset: 2304)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !228, file: !229, line: 107, baseType: !68, size: 16, offset: 2320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !228, file: !229, line: 107, baseType: !68, size: 16, offset: 2336)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !228, file: !229, line: 107, baseType: !68, size: 16, offset: 2352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !228, file: !229, line: 108, baseType: !28, size: 32, offset: 2368)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !228, file: !229, line: 108, baseType: !28, size: 32, offset: 2400)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !228, file: !229, line: 109, baseType: !28, size: 32, offset: 2432)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !228, file: !229, line: 109, baseType: !28, size: 32, offset: 2464)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !228, file: !229, line: 110, baseType: !28, size: 32, offset: 2496)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !228, file: !229, line: 110, baseType: !28, size: 32, offset: 2528)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !228, file: !229, line: 110, baseType: !28, size: 32, offset: 2560)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !228, file: !229, line: 111, baseType: !68, size: 16, offset: 2592)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !228, file: !229, line: 111, baseType: !68, size: 16, offset: 2608)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !228, file: !229, line: 112, baseType: !68, size: 16, offset: 2624)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !228, file: !229, line: 112, baseType: !68, size: 16, offset: 2640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !228, file: !229, line: 112, baseType: !68, size: 16, offset: 2656)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !228, file: !229, line: 115, baseType: !68, size: 16, offset: 2672)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !228, file: !229, line: 118, baseType: !121, size: 64, offset: 2688)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !228, file: !229, line: 118, baseType: !121, size: 64, offset: 2752)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !228, file: !229, line: 121, baseType: !301, size: 64, offset: 2816)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !222, line: 46, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !228, file: !229, line: 122, baseType: !304, size: 1152, offset: 2880)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1152, elements: !1423)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !222, line: 57, size: 2496, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !306, file: !222, line: 59, baseType: !68, size: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !306, file: !222, line: 59, baseType: !68, size: 16, offset: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !306, file: !222, line: 59, baseType: !68, size: 16, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !306, file: !222, line: 59, baseType: !68, size: 16, offset: 48)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !306, file: !222, line: 60, baseType: !224, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !306, file: !222, line: 61, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !222, line: 202, size: 3328, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !386, !1134, !1135, !1210, !1236, !1264, !1265, !1333, !1354, !1362, !1363}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !315, file: !222, line: 203, baseType: !147, size: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !315, file: !222, line: 204, baseType: !220, size: 64, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !315, file: !222, line: 206, baseType: !28, size: 32, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !315, file: !222, line: 206, baseType: !28, size: 32, offset: 1056)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !315, file: !222, line: 207, baseType: !28, size: 32, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !315, file: !222, line: 207, baseType: !28, size: 32, offset: 1120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !315, file: !222, line: 207, baseType: !28, size: 32, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !315, file: !222, line: 207, baseType: !28, size: 32, offset: 1184)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !315, file: !222, line: 207, baseType: !28, size: 32, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !315, file: !222, line: 207, baseType: !28, size: 32, offset: 1248)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !315, file: !222, line: 208, baseType: !28, size: 32, offset: 1280)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !315, file: !222, line: 208, baseType: !28, size: 32, offset: 1312)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !315, file: !222, line: 211, baseType: !28, size: 32, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !315, file: !222, line: 211, baseType: !28, size: 32, offset: 1376)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !315, file: !222, line: 211, baseType: !28, size: 32, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !315, file: !222, line: 211, baseType: !28, size: 32, offset: 1440)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !315, file: !222, line: 211, baseType: !28, size: 32, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !315, file: !222, line: 214, baseType: !28, size: 32, offset: 1504)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !315, file: !222, line: 214, baseType: !28, size: 32, offset: 1536)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !315, file: !222, line: 217, baseType: !28, size: 32, offset: 1568)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !315, file: !222, line: 218, baseType: !28, size: 32, offset: 1600)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !315, file: !222, line: 219, baseType: !28, size: 32, offset: 1632)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !315, file: !222, line: 220, baseType: !28, size: 32, offset: 1664)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !315, file: !222, line: 221, baseType: !28, size: 32, offset: 1696)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !315, file: !222, line: 222, baseType: !68, size: 16, offset: 1728)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !315, file: !222, line: 222, baseType: !68, size: 16, offset: 1744)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !315, file: !222, line: 224, baseType: !68, size: 16, offset: 1760)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !315, file: !222, line: 224, baseType: !68, size: 16, offset: 1776)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !315, file: !222, line: 227, baseType: !68, size: 16, offset: 1792)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !315, file: !222, line: 227, baseType: !68, size: 16, offset: 1808)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !315, file: !222, line: 229, baseType: !68, size: 16, offset: 1824)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !222, line: 229, baseType: !68, size: 16, offset: 1840)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !222, line: 230, baseType: !68, size: 16, offset: 1856)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !315, file: !222, line: 230, baseType: !68, size: 16, offset: 1872)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !315, file: !222, line: 232, baseType: !28, size: 32, offset: 1888)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !315, file: !222, line: 232, baseType: !28, size: 32, offset: 1920)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !315, file: !222, line: 232, baseType: !28, size: 32, offset: 1952)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !315, file: !222, line: 232, baseType: !28, size: 32, offset: 1984)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !315, file: !222, line: 233, baseType: !29, size: 32, offset: 2016)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !315, file: !222, line: 234, baseType: !29, size: 32, offset: 2048)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !315, file: !222, line: 235, baseType: !68, size: 16, offset: 2080)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !315, file: !222, line: 235, baseType: !68, size: 16, offset: 2096)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !315, file: !222, line: 236, baseType: !68, size: 16, offset: 2112)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !315, file: !222, line: 239, baseType: !68, size: 16, offset: 2128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !315, file: !222, line: 240, baseType: !29, size: 32, offset: 2144)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !315, file: !222, line: 241, baseType: !29, size: 32, offset: 2176)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !315, file: !222, line: 241, baseType: !29, size: 32, offset: 2208)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !315, file: !222, line: 241, baseType: !29, size: 32, offset: 2240)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !315, file: !222, line: 243, baseType: !28, size: 32, offset: 2272)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !315, file: !222, line: 243, baseType: !28, size: 32, offset: 2304)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !315, file: !222, line: 244, baseType: !28, size: 32, offset: 2336)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !315, file: !222, line: 246, baseType: !369, size: 320, offset: 2368)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !370, line: 50, size: 320, elements: !371)
!370 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !369, file: !370, line: 51, baseType: !214, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !369, file: !370, line: 53, baseType: !29, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !369, file: !370, line: 54, baseType: !29, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !369, file: !370, line: 55, baseType: !29, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !369, file: !370, line: 55, baseType: !29, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !369, file: !370, line: 56, baseType: !167, size: 8, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !369, file: !370, line: 56, baseType: !167, size: 8, offset: 200)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !369, file: !370, line: 57, baseType: !167, size: 8, offset: 208)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !369, file: !370, line: 57, baseType: !167, size: 8, offset: 216)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !369, file: !370, line: 59, baseType: !68, size: 16, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !369, file: !370, line: 59, baseType: !68, size: 16, offset: 240)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !369, file: !370, line: 59, baseType: !68, size: 16, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !370, line: 61, baseType: !68, size: 16, offset: 272)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !369, file: !370, line: 63, baseType: !29, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !315, file: !222, line: 248, baseType: !387, size: 64, offset: 2688)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !389, line: 328, size: 3456, elements: !390)
!389 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = !{!391, !392, !393, !1080, !1081, !1082, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1112, !1113, !1114, !1117, !1121, !1125, !1129, !1130, !1131, !1132, !1133}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !389, line: 329, baseType: !147, size: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !388, file: !389, line: 330, baseType: !220, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !388, file: !389, line: 332, baseType: !394, size: 64, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !396, line: 283, size: 4096, elements: !397)
!396 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!397 = !{!398, !399, !400, !401, !405, !406, !410, !1049, !1057, !1061, !1067, !1071, !1072, !1073, !1074, !1078, !1079}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !395, file: !396, line: 284, baseType: !29, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !395, file: !396, line: 285, baseType: !195, size: 512, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !395, file: !396, line: 287, baseType: !195, size: 512, offset: 544)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !395, file: !396, line: 288, baseType: !402, size: 2048, offset: 1056)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 2048, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !395, file: !396, line: 289, baseType: !29, size: 32, offset: 3104)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !395, file: !396, line: 292, baseType: !407, size: 64, offset: 3136)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !387}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !395, file: !396, line: 293, baseType: !411, size: 64, offset: 3200)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !387, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !389, line: 167, size: 3712, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !389, line: 168, baseType: !414, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !415, file: !389, line: 168, baseType: !414, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !415, file: !389, line: 168, baseType: !414, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !415, file: !389, line: 170, baseType: !184, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !415, file: !389, line: 172, baseType: !422, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !396, line: 144, size: 6016, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !603, !604, !605, !849, !853, !857, !858, !929, !933, !937, !938, !939, !940, !944, !945, !949, !953, !957, !961, !965, !969, !973, !974, !981, !983, !992, !1001}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !423, file: !396, line: 145, baseType: !32, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !423, file: !396, line: 145, baseType: !32, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !423, file: !396, line: 146, baseType: !68, size: 16, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !423, file: !396, line: 148, baseType: !195, size: 512, offset: 144)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !396, line: 149, baseType: !29, size: 32, offset: 672)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !423, file: !396, line: 151, baseType: !195, size: 512, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !423, file: !396, line: 152, baseType: !402, size: 2048, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !423, file: !396, line: 153, baseType: !29, size: 32, offset: 3264)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !423, file: !396, line: 155, baseType: !28, size: 32, offset: 3296)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !423, file: !396, line: 155, baseType: !28, size: 32, offset: 3328)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !423, file: !396, line: 155, baseType: !28, size: 32, offset: 3360)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !423, file: !396, line: 156, baseType: !28, size: 32, offset: 3392)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !423, file: !396, line: 156, baseType: !28, size: 32, offset: 3424)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !423, file: !396, line: 156, baseType: !28, size: 32, offset: 3456)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !423, file: !396, line: 157, baseType: !68, size: 16, offset: 3488)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !423, file: !396, line: 157, baseType: !68, size: 16, offset: 3504)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !423, file: !396, line: 157, baseType: !68, size: 16, offset: 3520)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !423, file: !396, line: 160, baseType: !443, size: 64, offset: 3584)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !396, line: 109, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !396, line: 98, size: 1408, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !602}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !445, file: !396, line: 99, baseType: !29, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !445, file: !396, line: 99, baseType: !29, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !396, line: 100, baseType: !195, size: 512, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !445, file: !396, line: 101, baseType: !28, size: 32, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !445, file: !396, line: 101, baseType: !28, size: 32, offset: 608)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !445, file: !396, line: 101, baseType: !28, size: 32, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !445, file: !396, line: 101, baseType: !28, size: 32, offset: 672)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !445, file: !396, line: 102, baseType: !28, size: 32, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !445, file: !396, line: 102, baseType: !28, size: 32, offset: 736)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !445, file: !396, line: 103, baseType: !29, size: 32, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !396, line: 104, baseType: !29, size: 32, offset: 800)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !445, file: !396, line: 107, baseType: !459, size: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !389, line: 87, size: 2816, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !583}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !389, line: 88, baseType: !459, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !460, file: !389, line: 88, baseType: !459, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !460, file: !389, line: 88, baseType: !459, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !460, file: !389, line: 90, baseType: !184, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !460, file: !389, line: 92, baseType: !195, size: 512, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !460, file: !389, line: 94, baseType: !195, size: 512, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !460, file: !389, line: 99, baseType: !32, size: 64, offset: 1280)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !389, line: 101, baseType: !68, size: 16, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !460, file: !389, line: 101, baseType: !68, size: 16, offset: 1360)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !460, file: !389, line: 102, baseType: !68, size: 16, offset: 1376)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !460, file: !389, line: 103, baseType: !68, size: 16, offset: 1392)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !460, file: !389, line: 104, baseType: !474, size: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !396, line: 114, size: 1600, elements: !476)
!476 = !{!477, !478, !499, !503, !507, !511, !515, !519, !520, !524, !553, !554, !555}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !475, file: !396, line: 115, baseType: !195, size: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !475, file: !396, line: 117, baseType: !479, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482, !483, !486, !486, !497}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !485, line: 48, flags: DIFlagFwdDecl)
!485 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !44, line: 55, size: 192, elements: !488)
!488 = !{!489, !493, !496}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !487, file: !44, line: 58, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !44, line: 56, size: 64, elements: !491)
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !44, line: 57, baseType: !32, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !44, line: 60, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !389, line: 335, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !487, file: !44, line: 61, baseType: !32, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !475, file: !396, line: 118, baseType: !500, size: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !482, !486, !486, !121}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !475, file: !396, line: 120, baseType: !504, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !482, !483, !486}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !475, file: !396, line: 121, baseType: !508, size: 64, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !482, !486, !121}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !475, file: !396, line: 122, baseType: !512, size: 64, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !387, !459, !494}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !475, file: !396, line: 123, baseType: !516, size: 64, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !387, !459, !414, !459, !497}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !475, file: !396, line: 124, baseType: !516, size: 64, offset: 896)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !475, file: !396, line: 125, baseType: !521, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !387, !459, !414, !459}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !475, file: !396, line: 128, baseType: !525, size: 256, offset: 1024)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !44, line: 436, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !44, line: 430, size: 256, elements: !527)
!527 = !{!528, !529, !532, !548}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !526, file: !44, line: 431, baseType: !32, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !526, file: !44, line: 432, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !44, line: 417, baseType: !495)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !526, file: !44, line: 433, baseType: !533, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !44, line: 408, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!29, !482, !486, !537, !539}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !44, line: 38, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !44, line: 348, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !44, line: 337, size: 256, elements: !542)
!542 = !{!543, !544, !545, !546, !547}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !541, file: !44, line: 339, baseType: !32, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !541, file: !44, line: 342, baseType: !537, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !541, file: !44, line: 345, baseType: !29, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !541, file: !44, line: 347, baseType: !29, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !541, file: !44, line: 347, baseType: !29, size: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !526, file: !44, line: 434, baseType: !549, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !44, line: 409, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !32}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !475, file: !396, line: 129, baseType: !525, size: 256, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !396, line: 132, baseType: !29, size: 32, offset: 1536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !475, file: !396, line: 132, baseType: !29, size: 32, offset: 1568)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !460, file: !389, line: 105, baseType: !195, size: 512, offset: 1472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !460, file: !389, line: 107, baseType: !28, size: 32, offset: 1984)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !460, file: !389, line: 107, baseType: !28, size: 32, offset: 2016)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !460, file: !389, line: 109, baseType: !32, size: 64, offset: 2048)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !460, file: !389, line: 112, baseType: !68, size: 16, offset: 2112)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !460, file: !389, line: 114, baseType: !68, size: 16, offset: 2128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !460, file: !389, line: 115, baseType: !29, size: 32, offset: 2144)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !460, file: !389, line: 117, baseType: !32, size: 64, offset: 2176)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !460, file: !389, line: 122, baseType: !29, size: 32, offset: 2240)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !460, file: !389, line: 124, baseType: !29, size: 32, offset: 2272)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !460, file: !389, line: 126, baseType: !459, size: 64, offset: 2304)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !460, file: !389, line: 128, baseType: !568, size: 64, offset: 2368)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !389, line: 298, size: 448, elements: !570)
!570 = !{!571, !572, !573, !576, !577, !580, !581, !582}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !389, line: 299, baseType: !568, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !569, file: !389, line: 299, baseType: !568, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !569, file: !389, line: 301, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !389, line: 218, baseType: !415)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !569, file: !389, line: 301, baseType: !574, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !569, file: !389, line: 302, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !389, line: 132, baseType: !460)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !569, file: !389, line: 302, baseType: !578, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !389, line: 304, baseType: !29, size: 32, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !569, file: !389, line: 305, baseType: !29, size: 32, offset: 416)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !460, file: !389, line: 131, baseType: !584, size: 384, offset: 2432)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !389, line: 73, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !389, line: 62, size: 384, elements: !586)
!586 = !{!587, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !585, file: !389, line: 63, baseType: !588, size: 128)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 4)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !585, file: !389, line: 64, baseType: !28, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !585, file: !389, line: 64, baseType: !28, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !389, line: 65, baseType: !32, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !585, file: !389, line: 66, baseType: !68, size: 16, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !585, file: !389, line: 67, baseType: !68, size: 16, offset: 272)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !585, file: !389, line: 68, baseType: !68, size: 16, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !585, file: !389, line: 69, baseType: !68, size: 16, offset: 304)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !585, file: !389, line: 70, baseType: !68, size: 16, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !585, file: !389, line: 71, baseType: !68, size: 16, offset: 336)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !585, file: !389, line: 72, baseType: !601, size: 32, offset: 352)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !103)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !445, file: !396, line: 108, baseType: !195, size: 512, offset: 896)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !423, file: !396, line: 160, baseType: !443, size: 64, offset: 3648)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !423, file: !396, line: 162, baseType: !195, size: 512, offset: 3712)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !423, file: !396, line: 165, baseType: !606, size: 64, offset: 4224)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609, !611, !844, !387, !414, !845}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !144, line: 230, size: 3072, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !833, !834, !835, !836, !837, !838, !839, !840, !841, !843}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !144, line: 231, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !612, file: !144, line: 231, baseType: !611, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !612, file: !144, line: 233, baseType: !77, size: 1280, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !612, file: !144, line: 234, baseType: !92, size: 128, offset: 1408)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !612, file: !144, line: 235, baseType: !92, size: 128, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !612, file: !144, line: 236, baseType: !68, size: 16, offset: 1664)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !612, file: !144, line: 236, baseType: !68, size: 16, offset: 1680)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !612, file: !144, line: 238, baseType: !68, size: 16, offset: 1696)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !612, file: !144, line: 239, baseType: !68, size: 16, offset: 1712)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !612, file: !144, line: 240, baseType: !68, size: 16, offset: 1728)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !612, file: !144, line: 241, baseType: !68, size: 16, offset: 1744)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !612, file: !144, line: 243, baseType: !28, size: 32, offset: 1760)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !612, file: !144, line: 244, baseType: !68, size: 16, offset: 1792)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !612, file: !144, line: 244, baseType: !68, size: 16, offset: 1808)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !612, file: !144, line: 246, baseType: !68, size: 16, offset: 1824)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !612, file: !144, line: 247, baseType: !68, size: 16, offset: 1840)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !612, file: !144, line: 248, baseType: !68, size: 16, offset: 1856)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !612, file: !144, line: 249, baseType: !68, size: 16, offset: 1872)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !612, file: !144, line: 250, baseType: !68, size: 16, offset: 1888)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !612, file: !144, line: 251, baseType: !68, size: 16, offset: 1904)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !612, file: !144, line: 253, baseType: !635, size: 64, offset: 1920)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !485, line: 116, size: 1472, elements: !637)
!637 = !{!638, !639, !640, !641, !690, !691, !695, !807, !811, !815, !816, !817, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !636, file: !485, line: 117, baseType: !635, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !636, file: !485, line: 117, baseType: !635, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !636, file: !485, line: 119, baseType: !29, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !636, file: !485, line: 122, baseType: !642, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !645, !611}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !19, line: 128, size: 2816, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !666, !667, !668, !669, !670, !681, !682, !683, !684, !685, !686}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !646, file: !19, line: 129, baseType: !147, size: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !646, file: !19, line: 131, baseType: !135, size: 64, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "winactive", scope: !646, file: !19, line: 131, baseType: !135, size: 64, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !646, file: !19, line: 132, baseType: !58, size: 128, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !646, file: !19, line: 134, baseType: !29, size: 32, offset: 1216)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "file_saved", scope: !646, file: !19, line: 135, baseType: !68, size: 16, offset: 1248)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "op_undo_depth", scope: !646, file: !19, line: 136, baseType: !68, size: 16, offset: 1264)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "operators", scope: !646, file: !19, line: 138, baseType: !58, size: 128, offset: 1280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !646, file: !19, line: 140, baseType: !58, size: 128, offset: 1408)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !646, file: !19, line: 142, baseType: !658, size: 320, offset: 1536)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !19, line: 106, size: 320, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !658, file: !19, line: 107, baseType: !58, size: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !658, file: !19, line: 108, baseType: !29, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !658, file: !19, line: 109, baseType: !29, size: 32, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !19, line: 110, baseType: !29, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !658, file: !19, line: 110, baseType: !29, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !658, file: !19, line: 111, baseType: !128, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !646, file: !19, line: 144, baseType: !58, size: 128, offset: 1856)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursors", scope: !646, file: !19, line: 146, baseType: !58, size: 128, offset: 1984)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "drags", scope: !646, file: !19, line: 148, baseType: !58, size: 128, offset: 2112)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigs", scope: !646, file: !19, line: 150, baseType: !58, size: 128, offset: 2240)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "defaultconf", scope: !646, file: !19, line: 151, baseType: !671, size: 64, offset: 2368)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !19, line: 310, size: 1344, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !672, file: !19, line: 311, baseType: !671, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !672, file: !19, line: 311, baseType: !671, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !672, file: !19, line: 313, baseType: !195, size: 512, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !672, file: !19, line: 314, baseType: !195, size: 512, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !672, file: !19, line: 316, baseType: !58, size: 128, offset: 1152)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !672, file: !19, line: 317, baseType: !29, size: 32, offset: 1280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !19, line: 317, baseType: !29, size: 32, offset: 1312)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "addonconf", scope: !646, file: !19, line: 152, baseType: !671, size: 64, offset: 2432)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "userconf", scope: !646, file: !19, line: 153, baseType: !671, size: 64, offset: 2496)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "timers", scope: !646, file: !19, line: 155, baseType: !58, size: 128, offset: 2560)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "autosavetimer", scope: !646, file: !19, line: 156, baseType: !128, size: 64, offset: 2688)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "is_interface_locked", scope: !646, file: !19, line: 158, baseType: !167, size: 8, offset: 2752)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !646, file: !19, line: 159, baseType: !687, size: 56, offset: 2760)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 56, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 7)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !636, file: !485, line: 124, baseType: !642, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !636, file: !485, line: 126, baseType: !692, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !609, !611}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !636, file: !485, line: 128, baseType: !696, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !142, !699, !611, !764}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !144, line: 203, size: 1280, elements: !701)
!701 = !{!702, !703, !704, !721, !722, !723, !724, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !803, !804, !805, !806}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !144, line: 204, baseType: !699, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !700, file: !144, line: 204, baseType: !699, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !700, file: !144, line: 206, baseType: !705, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !144, line: 87, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !144, line: 82, size: 256, elements: !708)
!708 = !{!709, !711, !712, !713, !719, !720}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !144, line: 83, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !707, file: !144, line: 83, baseType: !710, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !707, file: !144, line: 83, baseType: !710, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !707, file: !144, line: 84, baseType: !714, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !83, line: 43, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !83, line: 41, size: 32, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !715, file: !83, line: 42, baseType: !68, size: 16)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !715, file: !83, line: 42, baseType: !68, size: 16, offset: 16)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !144, line: 86, baseType: !68, size: 16, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !707, file: !144, line: 86, baseType: !68, size: 16, offset: 240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !700, file: !144, line: 206, baseType: !705, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !700, file: !144, line: 206, baseType: !705, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !700, file: !144, line: 206, baseType: !705, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !700, file: !144, line: 207, baseType: !725, size: 64, offset: 384)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !144, line: 80, baseType: !143)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "totrct", scope: !700, file: !144, line: 209, baseType: !92, size: 128, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !700, file: !144, line: 211, baseType: !167, size: 8, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "butspacetype", scope: !700, file: !144, line: 211, baseType: !167, size: 8, offset: 584)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !700, file: !144, line: 212, baseType: !68, size: 16, offset: 592)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !700, file: !144, line: 212, baseType: !68, size: 16, offset: 608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "headertype", scope: !700, file: !144, line: 214, baseType: !68, size: 16, offset: 624)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !700, file: !144, line: 215, baseType: !68, size: 16, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !700, file: !144, line: 216, baseType: !68, size: 16, offset: 656)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "region_active_win", scope: !700, file: !144, line: 217, baseType: !68, size: 16, offset: 672)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !700, file: !144, line: 219, baseType: !167, size: 8, offset: 688)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !700, file: !144, line: 219, baseType: !167, size: 8, offset: 696)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !144, line: 221, baseType: !739, size: 64, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !485, line: 66, size: 1728, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !751, !755, !759, !760, !777, !781, !785, !789, !793, !794, !800, !801, !802}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !740, file: !485, line: 67, baseType: !739, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !740, file: !485, line: 67, baseType: !739, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !740, file: !485, line: 69, baseType: !195, size: 512, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !740, file: !485, line: 70, baseType: !29, size: 32, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !740, file: !485, line: 71, baseType: !29, size: 32, offset: 672)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !740, file: !485, line: 74, baseType: !748, size: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!55, !609}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !740, file: !485, line: 76, baseType: !752, size: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !55}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !740, file: !485, line: 79, baseType: !756, size: 64, offset: 832)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !645, !699}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !740, file: !485, line: 81, baseType: !756, size: 64, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !740, file: !485, line: 83, baseType: !761, size: 64, offset: 960)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !142, !699, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmNotifier", file: !130, line: 195, size: 512, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !130, line: 196, baseType: !764, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !765, file: !130, line: 196, baseType: !764, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !765, file: !130, line: 198, baseType: !645, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !765, file: !130, line: 199, baseType: !135, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !765, file: !130, line: 201, baseType: !29, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !765, file: !130, line: 202, baseType: !5, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !765, file: !130, line: 202, baseType: !5, size: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !765, file: !130, line: 202, baseType: !5, size: 32, offset: 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !765, file: !130, line: 202, baseType: !5, size: 32, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !765, file: !130, line: 204, baseType: !32, size: 64, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !740, file: !485, line: 86, baseType: !778, size: 64, offset: 1024)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !609, !699}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !740, file: !485, line: 89, baseType: !782, size: 64, offset: 1088)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!55, !55}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "operatortypes", scope: !740, file: !485, line: 92, baseType: !786, size: 64, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !740, file: !485, line: 94, baseType: !790, size: 64, offset: 1216)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !671}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dropboxes", scope: !740, file: !485, line: 96, baseType: !786, size: 64, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !740, file: !485, line: 99, baseType: !795, size: 64, offset: 1344)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!29, !609, !497, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContextDataResult", file: !42, line: 71, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "regiontypes", scope: !740, file: !485, line: 102, baseType: !58, size: 128, offset: 1408)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "toolshelf", scope: !740, file: !485, line: 105, baseType: !58, size: 128, offset: 1536)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "keymapflag", scope: !740, file: !485, line: 110, baseType: !29, size: 32, offset: 1664)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "spacedata", scope: !700, file: !144, line: 223, baseType: !58, size: 128, offset: 768)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !700, file: !144, line: 224, baseType: !58, size: 128, offset: 896)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !700, file: !144, line: 225, baseType: !58, size: 128, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "actionzones", scope: !700, file: !144, line: 227, baseType: !58, size: 128, offset: 1152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !636, file: !485, line: 130, baseType: !808, size: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !611}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !636, file: !485, line: 133, baseType: !812, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!32, !32}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "operatortypes", scope: !636, file: !485, line: 137, baseType: !786, size: 64, offset: 576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !636, file: !485, line: 139, baseType: !790, size: 64, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !636, file: !485, line: 141, baseType: !818, size: 64, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !135, !699, !611}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !636, file: !485, line: 144, baseType: !795, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "drawcalls", scope: !636, file: !485, line: 147, baseType: !58, size: 128, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "paneltypes", scope: !636, file: !485, line: 150, baseType: !58, size: 128, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "headertypes", scope: !636, file: !485, line: 153, baseType: !58, size: 128, offset: 1088)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "minsizex", scope: !636, file: !485, line: 156, baseType: !29, size: 32, offset: 1216)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "minsizey", scope: !636, file: !485, line: 156, baseType: !29, size: 32, offset: 1248)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "prefsizex", scope: !636, file: !485, line: 158, baseType: !29, size: 32, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "prefsizey", scope: !636, file: !485, line: 158, baseType: !29, size: 32, offset: 1312)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "keymapflag", scope: !636, file: !485, line: 160, baseType: !29, size: 32, offset: 1344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "do_lock", scope: !636, file: !485, line: 162, baseType: !68, size: 16, offset: 1376)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !636, file: !485, line: 162, baseType: !68, size: 16, offset: 1392)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "event_cursor", scope: !636, file: !485, line: 164, baseType: !68, size: 16, offset: 1408)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !612, file: !144, line: 255, baseType: !58, size: 128, offset: 1984)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !612, file: !144, line: 256, baseType: !58, size: 128, offset: 2112)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !612, file: !144, line: 257, baseType: !58, size: 128, offset: 2240)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !612, file: !144, line: 258, baseType: !58, size: 128, offset: 2368)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !612, file: !144, line: 259, baseType: !58, size: 128, offset: 2496)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !612, file: !144, line: 260, baseType: !58, size: 128, offset: 2624)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !612, file: !144, line: 261, baseType: !58, size: 128, offset: 2752)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !612, file: !144, line: 263, baseType: !128, size: 64, offset: 2880)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !612, file: !144, line: 265, baseType: !842, size: 64, offset: 2944)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !612, file: !144, line: 266, baseType: !32, size: 64, offset: 3008)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !389, line: 274, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !389, line: 271, size: 32, elements: !847)
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !846, file: !389, line: 273, baseType: !5, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !423, file: !396, line: 168, baseType: !850, size: 64, offset: 4288)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !609, !387, !414}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !423, file: !396, line: 171, baseType: !854, size: 64, offset: 4352)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !483, !482, !486}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !423, file: !396, line: 173, baseType: !854, size: 64, offset: 4416)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !423, file: !396, line: 176, baseType: !859, size: 64, offset: 4480)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !844, !862, !414, !29, !29}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !864, line: 70, size: 19840, elements: !865)
