; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_common.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 230, type: !2249, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_sh_group", scope: !3, file: !3, line: 228, type: !4, scopeLine: 229, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2248)
!3 = !DIFile(filename: "blender/source/blender/nodes/shader/nodes/node_shader_common.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !22, globals: !2247, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !{!23, !34, !2245}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeTree", file: !25, line: 391, baseType: !26)
!25 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !25, line: 328, size: 3456, elements: !27)
!27 = !{!28, !100, !104, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2228, !2232, !2236, !2240, !2241, !2242, !2243, !2244}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !26, file: !25, line: 329, baseType: !29, size: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !30, line: 130, baseType: !31)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !30, line: 117, size: 960, elements: !32)
!32 = !{!33, !35, !36, !38, !58, !62, !64, !66, !67, !68}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !30, line: 118, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !30, line: 118, baseType: !34, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !31, file: !30, line: 119, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !31, file: !30, line: 120, baseType: !39, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !30, line: 136, size: 17600, elements: !41)
!41 = !{!42, !43, !45, !48, !53, !54, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !30, line: 137, baseType: !29, size: 960)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !40, file: !30, line: 138, baseType: !44, size: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !40, file: !30, line: 139, baseType: !46, size: 64, offset: 1024)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !30, line: 43, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !30, line: 140, baseType: !49, size: 8192, offset: 1088)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8192, elements: !51)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !{!52}
!52 = !DISubrange(count: 1024)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !40, file: !30, line: 141, baseType: !49, size: 8192, offset: 9280)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !40, file: !30, line: 148, baseType: !39, size: 64, offset: 17472)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !40, file: !30, line: 150, baseType: !56, size: 64, offset: 17536)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !30, line: 45, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !30, line: 121, baseType: !59, size: 528, offset: 256)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 528, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 66)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !31, file: !30, line: 126, baseType: !63, size: 16, offset: 784)
!63 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !31, file: !30, line: 127, baseType: !65, size: 32, offset: 800)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !31, file: !30, line: 128, baseType: !65, size: 32, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !31, file: !30, line: 128, baseType: !65, size: 32, offset: 864)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !31, file: !30, line: 129, baseType: !69, size: 64, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !30, line: 75, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !30, line: 62, size: 1024, elements: !72)
!72 = !{!73, !75, !76, !77, !78, !79, !83, !84, !98, !99}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !30, line: 63, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !30, line: 63, baseType: !74, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !30, line: 64, baseType: !50, size: 8, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !71, file: !30, line: 64, baseType: !50, size: 8, offset: 136)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !30, line: 65, baseType: !63, size: 16, offset: 144)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !30, line: 66, baseType: !80, size: 512, offset: 160)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !71, file: !30, line: 67, baseType: !65, size: 32, offset: 672)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !30, line: 69, baseType: !85, size: 256, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !30, line: 60, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !30, line: 48, size: 256, elements: !87)
!87 = !{!88, !89, !96, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !86, file: !30, line: 49, baseType: !34, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !86, file: !30, line: 58, baseType: !90, size: 128, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !91, line: 71, baseType: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !91, line: 69, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !92, file: !91, line: 70, baseType: !34, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !92, file: !91, line: 70, baseType: !34, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !86, file: !30, line: 59, baseType: !65, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !86, file: !30, line: 59, baseType: !65, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !30, line: 70, baseType: !65, size: 32, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !71, file: !30, line: 74, baseType: !65, size: 32, offset: 992)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !26, file: !25, line: 330, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !103, line: 45, flags: DIFlagFwdDecl)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !26, file: !25, line: 332, baseType: !105, size: 64, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !107, line: 283, size: 4096, elements: !108)
!107 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !{!109, !110, !111, !112, !116, !117, !122, !594, !2163, !2167, !2173, !2177, !2178, !2179, !2180, !2184, !2185}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !107, line: 284, baseType: !65, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !106, file: !107, line: 285, baseType: !80, size: 512, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !106, file: !107, line: 287, baseType: !80, size: 512, offset: 544)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !106, file: !107, line: 288, baseType: !113, size: 2048, offset: 1056)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !106, file: !107, line: 289, baseType: !65, size: 32, offset: 3104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !106, file: !107, line: 292, baseType: !118, size: 64, offset: 3136)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !106, file: !107, line: 293, baseType: !123, size: 64, offset: 3200)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !121, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !25, line: 167, size: 3712, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !586, !587, !588, !589, !590, !591}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !25, line: 168, baseType: !126, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !127, file: !25, line: 168, baseType: !126, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !127, file: !25, line: 168, baseType: !126, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !127, file: !25, line: 170, baseType: !69, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !127, file: !25, line: 172, baseType: !134, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !107, line: 144, size: 6016, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !147, !148, !149, !150, !151, !152, !153, !154, !155, !320, !321, !322, !336, !340, !344, !345, !427, !432, !436, !437, !438, !439, !443, !444, !448, !452, !456, !460, !464, !468, !472, !473, !491, !493, !519, !539}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !107, line: 145, baseType: !34, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !107, line: 145, baseType: !34, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !135, file: !107, line: 146, baseType: !63, size: 16, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !135, file: !107, line: 148, baseType: !80, size: 512, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !107, line: 149, baseType: !65, size: 32, offset: 672)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !135, file: !107, line: 151, baseType: !80, size: 512, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !135, file: !107, line: 152, baseType: !113, size: 2048, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !135, file: !107, line: 153, baseType: !65, size: 32, offset: 3264)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !135, file: !107, line: 155, baseType: !146, size: 32, offset: 3296)
!146 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !135, file: !107, line: 155, baseType: !146, size: 32, offset: 3328)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !135, file: !107, line: 155, baseType: !146, size: 32, offset: 3360)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !135, file: !107, line: 156, baseType: !146, size: 32, offset: 3392)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !135, file: !107, line: 156, baseType: !146, size: 32, offset: 3424)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !135, file: !107, line: 156, baseType: !146, size: 32, offset: 3456)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !135, file: !107, line: 157, baseType: !63, size: 16, offset: 3488)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !107, line: 157, baseType: !63, size: 16, offset: 3504)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !135, file: !107, line: 157, baseType: !63, size: 16, offset: 3520)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !135, file: !107, line: 160, baseType: !156, size: 64, offset: 3584)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !107, line: 109, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !107, line: 98, size: 1408, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !319}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !158, file: !107, line: 99, baseType: !65, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !158, file: !107, line: 99, baseType: !65, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !107, line: 100, baseType: !80, size: 512, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !158, file: !107, line: 101, baseType: !146, size: 32, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !158, file: !107, line: 101, baseType: !146, size: 32, offset: 608)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !158, file: !107, line: 101, baseType: !146, size: 32, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !158, file: !107, line: 101, baseType: !146, size: 32, offset: 672)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !158, file: !107, line: 102, baseType: !146, size: 32, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !158, file: !107, line: 102, baseType: !146, size: 32, offset: 736)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !158, file: !107, line: 103, baseType: !65, size: 32, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !158, file: !107, line: 104, baseType: !65, size: 32, offset: 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !158, file: !107, line: 107, baseType: !172, size: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !25, line: 87, size: 2816, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !298}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !25, line: 88, baseType: !172, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !25, line: 88, baseType: !172, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !173, file: !25, line: 88, baseType: !172, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !173, file: !25, line: 90, baseType: !69, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !173, file: !25, line: 92, baseType: !80, size: 512, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !25, line: 94, baseType: !80, size: 512, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !173, file: !25, line: 99, baseType: !34, size: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !173, file: !25, line: 101, baseType: !63, size: 16, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !25, line: 101, baseType: !63, size: 16, offset: 1360)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !173, file: !25, line: 102, baseType: !63, size: 16, offset: 1376)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !173, file: !25, line: 103, baseType: !63, size: 16, offset: 1392)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !173, file: !25, line: 104, baseType: !187, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !107, line: 114, size: 1600, elements: !189)
!189 = !{!190, !191, !213, !218, !222, !226, !230, !234, !235, !239, !268, !269, !270}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !188, file: !107, line: 115, baseType: !80, size: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !188, file: !107, line: 117, baseType: !192, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !195, !198, !200, !200, !211}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !197, line: 44, flags: DIFlagFwdDecl)
!197 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !107, line: 73, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !197, line: 55, size: 192, elements: !202)
!202 = !{!203, !207, !210}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !197, line: 58, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !201, file: !197, line: 56, size: 64, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !197, line: 57, baseType: !34, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !201, file: !197, line: 60, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 335, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !197, line: 61, baseType: !34, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !188, file: !107, line: 118, baseType: !214, size: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !195, !200, !200, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !188, file: !107, line: 120, baseType: !219, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !195, !198, !200}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !188, file: !107, line: 121, baseType: !223, size: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !195, !200, !217}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !188, file: !107, line: 122, baseType: !227, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !121, !172, !208}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !188, file: !107, line: 123, baseType: !231, size: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !121, !172, !126, !172, !211}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !188, file: !107, line: 124, baseType: !231, size: 64, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !188, file: !107, line: 125, baseType: !236, size: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !121, !172, !126, !172}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !188, file: !107, line: 128, baseType: !240, size: 256, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !197, line: 436, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !197, line: 430, size: 256, elements: !242)
!242 = !{!243, !244, !247, !263}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !197, line: 431, baseType: !34, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !241, file: !197, line: 432, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !197, line: 417, baseType: !209)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !241, file: !197, line: 433, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !197, line: 408, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!65, !195, !200, !252, !254}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !197, line: 38, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !197, line: 348, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !197, line: 337, size: 256, elements: !257)
!257 = !{!258, !259, !260, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !197, line: 339, baseType: !34, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !256, file: !197, line: 342, baseType: !252, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !256, file: !197, line: 345, baseType: !65, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !256, file: !197, line: 347, baseType: !65, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !256, file: !197, line: 347, baseType: !65, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !241, file: !197, line: 434, baseType: !264, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !197, line: 409, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !34}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !188, file: !107, line: 129, baseType: !240, size: 256, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !107, line: 132, baseType: !65, size: 32, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !188, file: !107, line: 132, baseType: !65, size: 32, offset: 1568)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !173, file: !25, line: 105, baseType: !80, size: 512, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !173, file: !25, line: 107, baseType: !146, size: 32, offset: 1984)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !173, file: !25, line: 107, baseType: !146, size: 32, offset: 2016)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !173, file: !25, line: 109, baseType: !34, size: 64, offset: 2048)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !173, file: !25, line: 112, baseType: !63, size: 16, offset: 2112)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !173, file: !25, line: 114, baseType: !63, size: 16, offset: 2128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !173, file: !25, line: 115, baseType: !65, size: 32, offset: 2144)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !173, file: !25, line: 117, baseType: !34, size: 64, offset: 2176)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !173, file: !25, line: 122, baseType: !65, size: 32, offset: 2240)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !173, file: !25, line: 124, baseType: !65, size: 32, offset: 2272)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !173, file: !25, line: 126, baseType: !172, size: 64, offset: 2304)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !173, file: !25, line: 128, baseType: !283, size: 64, offset: 2368)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !25, line: 298, size: 448, elements: !285)
!285 = !{!286, !287, !288, !291, !292, !295, !296, !297}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !25, line: 299, baseType: !283, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !284, file: !25, line: 299, baseType: !283, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !284, file: !25, line: 301, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !25, line: 218, baseType: !127)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !284, file: !25, line: 301, baseType: !289, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !284, file: !25, line: 302, baseType: !293, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !25, line: 132, baseType: !173)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !284, file: !25, line: 302, baseType: !293, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !25, line: 304, baseType: !65, size: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !284, file: !25, line: 305, baseType: !65, size: 32, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !173, file: !25, line: 131, baseType: !299, size: 384, offset: 2432)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !25, line: 73, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !25, line: 62, size: 384, elements: !301)
!301 = !{!302, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !300, file: !25, line: 63, baseType: !303, size: 128)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 128, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 4)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !300, file: !25, line: 64, baseType: !146, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !300, file: !25, line: 64, baseType: !146, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !25, line: 65, baseType: !34, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !300, file: !25, line: 66, baseType: !63, size: 16, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !300, file: !25, line: 67, baseType: !63, size: 16, offset: 272)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !300, file: !25, line: 68, baseType: !63, size: 16, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !300, file: !25, line: 69, baseType: !63, size: 16, offset: 304)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !300, file: !25, line: 70, baseType: !63, size: 16, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !300, file: !25, line: 71, baseType: !63, size: 16, offset: 336)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !300, file: !25, line: 72, baseType: !316, size: 32, offset: 352)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 2)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !158, file: !107, line: 108, baseType: !80, size: 512, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !135, file: !107, line: 160, baseType: !156, size: 64, offset: 3648)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !135, file: !107, line: 162, baseType: !80, size: 512, offset: 3712)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !135, file: !107, line: 165, baseType: !323, size: 64, offset: 4224)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !326, !328, !330, !121, !126, !332}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !107, line: 81, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !25, line: 43, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !25, line: 274, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !25, line: 271, size: 32, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !333, file: !25, line: 273, baseType: !10, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !135, file: !107, line: 168, baseType: !337, size: 64, offset: 4288)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !326, !121, !126}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !135, file: !107, line: 171, baseType: !341, size: 64, offset: 4352)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !198, !195, !200}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !135, file: !107, line: 173, baseType: !341, size: 64, offset: 4416)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !135, file: !107, line: 176, baseType: !346, size: 64, offset: 4480)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !330, !349, !126, !65, !65}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !351, line: 70, size: 19840, elements: !352)
!351 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355, !356, !357, !359, !360, !361, !362, !364, !365, !368, !369, !370, !371, !372, !374, !376, !377, !378, !382, !383, !384, !385, !386, !389, !390, !391, !392, !393, !396, !397, !399, !400, !401, !405, !406, !407, !410, !411, !420}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !351, line: 71, baseType: !349, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !351, line: 71, baseType: !349, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !350, file: !351, line: 74, baseType: !65, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !350, file: !351, line: 74, baseType: !65, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !350, file: !351, line: 79, baseType: !358, size: 8, offset: 192)
!358 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !350, file: !351, line: 80, baseType: !65, size: 32, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !351, line: 83, baseType: !65, size: 32, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !350, file: !351, line: 84, baseType: !65, size: 32, offset: 288)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !350, file: !351, line: 87, baseType: !363, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !350, file: !351, line: 88, baseType: !217, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !350, file: !351, line: 93, baseType: !366, size: 128, offset: 448)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 128, elements: !317)
!367 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !350, file: !351, line: 96, baseType: !65, size: 32, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !350, file: !351, line: 96, baseType: !65, size: 32, offset: 608)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !350, file: !351, line: 97, baseType: !65, size: 32, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !350, file: !351, line: 97, baseType: !65, size: 32, offset: 672)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !350, file: !351, line: 98, baseType: !373, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !350, file: !351, line: 101, baseType: !375, size: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !350, file: !351, line: 102, baseType: !217, size: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !350, file: !351, line: 105, baseType: !146, size: 32, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !350, file: !351, line: 108, baseType: !379, size: 1280, offset: 960)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1280, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 20)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !350, file: !351, line: 109, baseType: !65, size: 32, offset: 2240)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !350, file: !351, line: 109, baseType: !65, size: 32, offset: 2272)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !350, file: !351, line: 112, baseType: !65, size: 32, offset: 2304)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !350, file: !351, line: 113, baseType: !65, size: 32, offset: 2336)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !350, file: !351, line: 114, baseType: !387, size: 64, offset: 2368)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !351, line: 50, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !350, file: !351, line: 115, baseType: !34, size: 64, offset: 2432)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !350, file: !351, line: 118, baseType: !65, size: 32, offset: 2496)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !351, line: 119, baseType: !49, size: 8192, offset: 2528)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !350, file: !351, line: 120, baseType: !49, size: 8192, offset: 10720)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !350, file: !351, line: 123, baseType: !394, size: 64, offset: 18944)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !351, line: 123, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !350, file: !351, line: 124, baseType: !65, size: 32, offset: 19008)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !350, file: !351, line: 127, baseType: !398, size: 64, offset: 19072)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !350, file: !351, line: 128, baseType: !10, size: 32, offset: 19136)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !350, file: !351, line: 129, baseType: !10, size: 32, offset: 19168)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !350, file: !351, line: 132, baseType: !402, size: 64, offset: 19200)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !404, line: 63, flags: DIFlagFwdDecl)
!404 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!405 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !350, file: !351, line: 133, baseType: !402, size: 64, offset: 19264)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !350, file: !351, line: 134, baseType: !363, size: 64, offset: 19328)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !350, file: !351, line: 135, baseType: !408, size: 64, offset: 19392)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !351, line: 135, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !350, file: !351, line: 136, baseType: !65, size: 32, offset: 19456)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !350, file: !351, line: 137, baseType: !412, size: 128, offset: 19488)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !413, line: 89, baseType: !414)
!413 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !413, line: 86, size: 128, elements: !415)
!415 = !{!416, !417, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !414, file: !413, line: 87, baseType: !65, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !414, file: !413, line: 87, baseType: !65, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !414, file: !413, line: 88, baseType: !65, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !414, file: !413, line: 88, baseType: !65, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !350, file: !351, line: 140, baseType: !421, size: 192, offset: 19648)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !351, line: 55, size: 192, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !421, file: !351, line: 56, baseType: !10, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !421, file: !351, line: 57, baseType: !10, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !421, file: !351, line: 58, baseType: !398, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !421, file: !351, line: 59, baseType: !10, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !135, file: !107, line: 179, baseType: !428, size: 64, offset: 4544)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !121, !126, !431, !65}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !135, file: !107, line: 181, baseType: !433, size: 64, offset: 4608)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!65, !126, !65, !65}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !135, file: !107, line: 183, baseType: !433, size: 64, offset: 4672)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !135, file: !107, line: 185, baseType: !433, size: 64, offset: 4736)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !135, file: !107, line: 188, baseType: !123, size: 64, offset: 4800)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !135, file: !107, line: 190, baseType: !440, size: 64, offset: 4864)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !121, !126, !37}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !135, file: !107, line: 193, baseType: !123, size: 64, offset: 4928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !135, file: !107, line: 195, baseType: !445, size: 64, offset: 4992)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !126}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !135, file: !107, line: 197, baseType: !449, size: 64, offset: 5056)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !121, !126, !126}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !135, file: !107, line: 200, baseType: !453, size: 64, offset: 5120)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !326, !200}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !135, file: !107, line: 201, baseType: !457, size: 64, offset: 5184)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !200}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !135, file: !107, line: 202, baseType: !461, size: 64, offset: 5248)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !200, !126}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !135, file: !107, line: 205, baseType: !465, size: 64, offset: 5312)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!65, !134, !121}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !135, file: !107, line: 207, baseType: !469, size: 64, offset: 5376)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!65, !126, !121}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !135, file: !107, line: 210, baseType: !123, size: 64, offset: 5440)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !135, file: !107, line: 213, baseType: !474, size: 64, offset: 5504)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !107, line: 135, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!34, !478, !126, !332}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !480, line: 54, size: 64, elements: !481)
!480 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !479, file: !480, line: 55, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !107, line: 500, size: 64, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !484, file: !107, line: 502, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !489, line: 48, baseType: !490)
!489 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !489, line: 48, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !135, file: !107, line: 214, baseType: !492, size: 64, offset: 5568)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !107, line: 136, baseType: !265)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !135, file: !107, line: 215, baseType: !494, size: 64, offset: 5632)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !107, line: 137, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !34, !65, !126, !498, !517, !517}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !480, line: 58, size: 128, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !499, file: !480, line: 59, baseType: !34, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !499, file: !480, line: 60, baseType: !503, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !25, line: 289, size: 192, elements: !505)
!505 = !{!506, !513, !514, !515, !516}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !504, file: !25, line: 290, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !25, line: 286, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !25, line: 280, size: 64, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !508, file: !25, line: 281, baseType: !332, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !508, file: !25, line: 284, baseType: !63, size: 16, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !508, file: !25, line: 285, baseType: !63, size: 16, offset: 48)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !504, file: !25, line: 292, baseType: !398, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !504, file: !25, line: 293, baseType: !63, size: 16, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !504, file: !25, line: 293, baseType: !63, size: 16, offset: 144)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !504, file: !25, line: 294, baseType: !65, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !135, file: !107, line: 217, baseType: !520, size: 64, offset: 5696)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !107, line: 138, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!65, !524, !126, !498, !526, !526}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !107, line: 64, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !528)
!528 = !{!529, !531, !532, !533, !536, !537, !538}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !527, file: !9, line: 107, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !527, file: !9, line: 108, baseType: !211, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !527, file: !9, line: 109, baseType: !303, size: 128, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !527, file: !9, line: 110, baseType: !534, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !527, file: !9, line: 111, baseType: !358, size: 8, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !527, file: !9, line: 112, baseType: !358, size: 8, offset: 328)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !527, file: !9, line: 113, baseType: !63, size: 16, offset: 336)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !135, file: !107, line: 220, baseType: !240, size: 256, offset: 5760)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !127, file: !25, line: 173, baseType: !80, size: 512, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !25, line: 175, baseType: !80, size: 512, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !127, file: !25, line: 176, baseType: !65, size: 32, offset: 1344)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !25, line: 177, baseType: !63, size: 16, offset: 1376)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !127, file: !25, line: 177, baseType: !63, size: 16, offset: 1392)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !127, file: !25, line: 178, baseType: !63, size: 16, offset: 1408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !127, file: !25, line: 178, baseType: !63, size: 16, offset: 1424)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !127, file: !25, line: 179, baseType: !63, size: 16, offset: 1440)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !127, file: !25, line: 179, baseType: !63, size: 16, offset: 1456)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !127, file: !25, line: 180, baseType: !63, size: 16, offset: 1472)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !127, file: !25, line: 181, baseType: !63, size: 16, offset: 1488)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !127, file: !25, line: 182, baseType: !552, size: 96, offset: 1504)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 96, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 3)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !127, file: !25, line: 184, baseType: !90, size: 128, offset: 1600)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !127, file: !25, line: 184, baseType: !90, size: 128, offset: 1728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !127, file: !25, line: 185, baseType: !126, size: 64, offset: 1856)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !127, file: !25, line: 186, baseType: !37, size: 64, offset: 1920)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !127, file: !25, line: 187, baseType: !34, size: 64, offset: 1984)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !127, file: !25, line: 188, baseType: !126, size: 64, offset: 2048)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !127, file: !25, line: 189, baseType: !90, size: 128, offset: 2112)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !127, file: !25, line: 191, baseType: !146, size: 32, offset: 2240)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !127, file: !25, line: 191, baseType: !146, size: 32, offset: 2272)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !127, file: !25, line: 192, baseType: !146, size: 32, offset: 2304)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !127, file: !25, line: 192, baseType: !146, size: 32, offset: 2336)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !127, file: !25, line: 193, baseType: !146, size: 32, offset: 2368)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !127, file: !25, line: 194, baseType: !146, size: 32, offset: 2400)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !127, file: !25, line: 194, baseType: !146, size: 32, offset: 2432)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !127, file: !25, line: 196, baseType: !65, size: 32, offset: 2464)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !127, file: !25, line: 198, baseType: !80, size: 512, offset: 2496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !127, file: !25, line: 199, baseType: !63, size: 16, offset: 3008)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !127, file: !25, line: 199, baseType: !63, size: 16, offset: 3024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !127, file: !25, line: 200, baseType: !146, size: 32, offset: 3040)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !127, file: !25, line: 200, baseType: !146, size: 32, offset: 3072)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !127, file: !25, line: 202, baseType: !63, size: 16, offset: 3104)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !127, file: !25, line: 202, baseType: !63, size: 16, offset: 3120)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !127, file: !25, line: 203, baseType: !34, size: 64, offset: 3136)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !127, file: !25, line: 204, baseType: !579, size: 128, offset: 3200)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !413, line: 95, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !413, line: 92, size: 128, elements: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !580, file: !413, line: 93, baseType: !146, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !580, file: !413, line: 93, baseType: !146, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !580, file: !413, line: 94, baseType: !146, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !580, file: !413, line: 94, baseType: !146, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !127, file: !25, line: 205, baseType: !579, size: 128, offset: 3328)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !127, file: !25, line: 206, baseType: !579, size: 128, offset: 3456)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !127, file: !25, line: 215, baseType: !63, size: 16, offset: 3584)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !127, file: !25, line: 215, baseType: !63, size: 16, offset: 3600)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !127, file: !25, line: 216, baseType: !65, size: 32, offset: 3616)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !127, file: !25, line: 217, baseType: !592, size: 64, offset: 3648)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !25, line: 51, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !106, file: !107, line: 294, baseType: !595, size: 64, offset: 3264)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !598, !34, !2159}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !404, line: 1216, size: 39680, elements: !600)
!600 = !{!601, !602, !603, !1466, !1547, !1548, !1549, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1576, !1788, !1791, !2033, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2055, !2056, !2057, !2058, !2059, !2067, !2133, !2140, !2141, !2148, !2151, !2152, !2153, !2154, !2155, !2156}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !599, file: !404, line: 1217, baseType: !29, size: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !599, file: !404, line: 1218, baseType: !101, size: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !599, file: !404, line: 1220, baseType: !604, size: 64, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !606, line: 115, size: 11392, elements: !607)
!606 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!607 = !{!608, !609, !610, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !627, !637, !651, !652, !692, !693, !696, !697, !713, !714, !715, !716, !717, !718, !719, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1413, !1416, !1417, !1418, !1419, !1420, !1421, !1424, !1427, !1430, !1431, !1437, !1438, !1439, !1440, !1441, !1442, !1444, !1447, !1450, !1451, !1454, !1455}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !605, file: !606, line: 116, baseType: !29, size: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !605, file: !606, line: 117, baseType: !101, size: 64, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !605, file: !606, line: 119, baseType: !611, size: 64, offset: 1024)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !606, line: 57, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !606, line: 121, baseType: !63, size: 16, offset: 1088)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !605, file: !606, line: 121, baseType: !63, size: 16, offset: 1104)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !605, file: !606, line: 122, baseType: !65, size: 32, offset: 1120)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !605, file: !606, line: 122, baseType: !65, size: 32, offset: 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !605, file: !606, line: 122, baseType: !65, size: 32, offset: 1184)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !605, file: !606, line: 123, baseType: !80, size: 512, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !605, file: !606, line: 124, baseType: !604, size: 64, offset: 1728)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !605, file: !606, line: 124, baseType: !604, size: 64, offset: 1792)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !605, file: !606, line: 127, baseType: !604, size: 64, offset: 1856)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !605, file: !606, line: 127, baseType: !604, size: 64, offset: 1920)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !605, file: !606, line: 127, baseType: !604, size: 64, offset: 1984)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !605, file: !606, line: 128, baseType: !625, size: 64, offset: 2048)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !103, line: 46, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !605, file: !606, line: 130, baseType: !628, size: 64, offset: 2112)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !606, line: 97, size: 832, elements: !630)
!630 = !{!631, !635, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !629, file: !606, line: 98, baseType: !632, size: 768)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 768, elements: !633)
!633 = !{!634, !554}
!634 = !DISubrange(count: 8)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !606, line: 99, baseType: !65, size: 32, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !629, file: !606, line: 99, baseType: !65, size: 32, offset: 800)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !605, file: !606, line: 131, baseType: !638, size: 64, offset: 2176)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !640, line: 486, size: 1600, elements: !641)
!640 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !639, file: !640, line: 487, baseType: !29, size: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !639, file: !640, line: 489, baseType: !90, size: 128, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !639, file: !640, line: 490, baseType: !90, size: 128, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !639, file: !640, line: 491, baseType: !90, size: 128, offset: 1216)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !639, file: !640, line: 492, baseType: !90, size: 128, offset: 1344)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !639, file: !640, line: 494, baseType: !65, size: 32, offset: 1472)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !639, file: !640, line: 495, baseType: !65, size: 32, offset: 1504)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !639, file: !640, line: 497, baseType: !65, size: 32, offset: 1536)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !639, file: !640, line: 498, baseType: !65, size: 32, offset: 1568)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !605, file: !606, line: 132, baseType: !638, size: 64, offset: 2240)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !605, file: !606, line: 133, baseType: !653, size: 64, offset: 2304)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !640, line: 334, size: 1728, elements: !655)
!655 = !{!656, !657, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !691}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !654, file: !640, line: 335, baseType: !90, size: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !654, file: !640, line: 336, baseType: !658, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !654, file: !640, line: 338, baseType: !63, size: 16, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !654, file: !640, line: 338, baseType: !63, size: 16, offset: 208)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !654, file: !640, line: 339, baseType: !10, size: 32, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !654, file: !640, line: 340, baseType: !65, size: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !654, file: !640, line: 342, baseType: !146, size: 32, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !654, file: !640, line: 343, baseType: !552, size: 96, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !654, file: !640, line: 344, baseType: !552, size: 96, offset: 416)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !654, file: !640, line: 347, baseType: !90, size: 128, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !654, file: !640, line: 349, baseType: !65, size: 32, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !654, file: !640, line: 350, baseType: !65, size: 32, offset: 672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !654, file: !640, line: 351, baseType: !34, size: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !654, file: !640, line: 352, baseType: !34, size: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !654, file: !640, line: 354, baseType: !672, size: 384, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !640, line: 116, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !640, line: 94, size: 384, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !673, file: !640, line: 96, baseType: !65, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !673, file: !640, line: 96, baseType: !65, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !673, file: !640, line: 97, baseType: !65, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !673, file: !640, line: 97, baseType: !65, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !673, file: !640, line: 99, baseType: !63, size: 16, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !673, file: !640, line: 100, baseType: !63, size: 16, offset: 144)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !673, file: !640, line: 102, baseType: !63, size: 16, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !673, file: !640, line: 105, baseType: !63, size: 16, offset: 176)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !673, file: !640, line: 108, baseType: !63, size: 16, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !673, file: !640, line: 109, baseType: !63, size: 16, offset: 208)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !673, file: !640, line: 111, baseType: !63, size: 16, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !673, file: !640, line: 112, baseType: !63, size: 16, offset: 240)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !673, file: !640, line: 114, baseType: !65, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !673, file: !640, line: 114, baseType: !65, size: 32, offset: 288)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !673, file: !640, line: 115, baseType: !65, size: 32, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !673, file: !640, line: 115, baseType: !65, size: 32, offset: 352)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !654, file: !640, line: 355, baseType: !80, size: 512, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !605, file: !606, line: 134, baseType: !34, size: 64, offset: 2368)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !605, file: !606, line: 136, baseType: !694, size: 64, offset: 2432)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !404, line: 61, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !605, file: !606, line: 138, baseType: !672, size: 384, offset: 2496)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !605, file: !606, line: 139, baseType: !698, size: 64, offset: 2880)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !640, line: 80, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !640, line: 72, size: 192, elements: !701)
!701 = !{!702, !709, !710, !711, !712}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !700, file: !640, line: 73, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !640, line: 59, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !640, line: 56, size: 128, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !705, file: !640, line: 57, baseType: !552, size: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !705, file: !640, line: 58, baseType: !65, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !700, file: !640, line: 74, baseType: !65, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !700, file: !640, line: 76, baseType: !65, size: 32, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !700, file: !640, line: 77, baseType: !65, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !700, file: !640, line: 79, baseType: !65, size: 32, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !605, file: !606, line: 141, baseType: !90, size: 128, offset: 2944)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !605, file: !606, line: 142, baseType: !90, size: 128, offset: 3072)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !605, file: !606, line: 143, baseType: !90, size: 128, offset: 3200)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !605, file: !606, line: 144, baseType: !90, size: 128, offset: 3328)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !605, file: !606, line: 146, baseType: !65, size: 32, offset: 3456)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !605, file: !606, line: 147, baseType: !65, size: 32, offset: 3488)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !605, file: !606, line: 150, baseType: !720, size: 64, offset: 3520)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !723, line: 93, size: 7552, elements: !724)
!723 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !773, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1326}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !722, file: !723, line: 94, baseType: !29, size: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !722, file: !723, line: 95, baseType: !101, size: 64, offset: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !722, file: !723, line: 97, baseType: !63, size: 16, offset: 1024)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !722, file: !723, line: 97, baseType: !63, size: 16, offset: 1040)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !722, file: !723, line: 99, baseType: !146, size: 32, offset: 1056)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !722, file: !723, line: 99, baseType: !146, size: 32, offset: 1088)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !722, file: !723, line: 99, baseType: !146, size: 32, offset: 1120)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !722, file: !723, line: 100, baseType: !146, size: 32, offset: 1152)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !722, file: !723, line: 100, baseType: !146, size: 32, offset: 1184)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !722, file: !723, line: 100, baseType: !146, size: 32, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !722, file: !723, line: 101, baseType: !146, size: 32, offset: 1248)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !722, file: !723, line: 101, baseType: !146, size: 32, offset: 1280)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !722, file: !723, line: 101, baseType: !146, size: 32, offset: 1312)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !722, file: !723, line: 102, baseType: !146, size: 32, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !722, file: !723, line: 102, baseType: !146, size: 32, offset: 1376)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !722, file: !723, line: 102, baseType: !146, size: 32, offset: 1408)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !722, file: !723, line: 103, baseType: !146, size: 32, offset: 1440)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !722, file: !723, line: 103, baseType: !146, size: 32, offset: 1472)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !722, file: !723, line: 103, baseType: !146, size: 32, offset: 1504)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !722, file: !723, line: 103, baseType: !146, size: 32, offset: 1536)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !722, file: !723, line: 103, baseType: !146, size: 32, offset: 1568)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !722, file: !723, line: 104, baseType: !146, size: 32, offset: 1600)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !722, file: !723, line: 104, baseType: !146, size: 32, offset: 1632)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !722, file: !723, line: 104, baseType: !146, size: 32, offset: 1664)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !722, file: !723, line: 104, baseType: !146, size: 32, offset: 1696)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !722, file: !723, line: 104, baseType: !146, size: 32, offset: 1728)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !722, file: !723, line: 105, baseType: !146, size: 32, offset: 1760)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !722, file: !723, line: 108, baseType: !753, size: 704, offset: 1792)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !723, line: 53, size: 704, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !753, file: !723, line: 54, baseType: !146, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !753, file: !723, line: 55, baseType: !146, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !753, file: !723, line: 56, baseType: !146, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !753, file: !723, line: 57, baseType: !146, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !753, file: !723, line: 59, baseType: !552, size: 96, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !753, file: !723, line: 60, baseType: !552, size: 96, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !753, file: !723, line: 61, baseType: !552, size: 96, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !753, file: !723, line: 63, baseType: !146, size: 32, offset: 416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !753, file: !723, line: 64, baseType: !146, size: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !753, file: !723, line: 65, baseType: !146, size: 32, offset: 480)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !753, file: !723, line: 67, baseType: !63, size: 16, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !753, file: !723, line: 68, baseType: !63, size: 16, offset: 528)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !753, file: !723, line: 69, baseType: !63, size: 16, offset: 544)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !753, file: !723, line: 70, baseType: !63, size: 16, offset: 560)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !753, file: !723, line: 72, baseType: !146, size: 32, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !753, file: !723, line: 73, baseType: !146, size: 32, offset: 608)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !753, file: !723, line: 74, baseType: !146, size: 32, offset: 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !753, file: !723, line: 75, baseType: !146, size: 32, offset: 672)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !722, file: !723, line: 109, baseType: !774, size: 128, offset: 2496)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !723, line: 79, size: 128, elements: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !774, file: !723, line: 80, baseType: !65, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !774, file: !723, line: 81, baseType: !65, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !774, file: !723, line: 82, baseType: !65, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !774, file: !723, line: 83, baseType: !65, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !722, file: !723, line: 111, baseType: !146, size: 32, offset: 2624)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !722, file: !723, line: 111, baseType: !146, size: 32, offset: 2656)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !722, file: !723, line: 112, baseType: !146, size: 32, offset: 2688)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !722, file: !723, line: 112, baseType: !146, size: 32, offset: 2720)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !722, file: !723, line: 113, baseType: !146, size: 32, offset: 2752)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !722, file: !723, line: 114, baseType: !146, size: 32, offset: 2784)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !722, file: !723, line: 114, baseType: !146, size: 32, offset: 2816)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !722, file: !723, line: 115, baseType: !63, size: 16, offset: 2848)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !722, file: !723, line: 115, baseType: !63, size: 16, offset: 2864)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !722, file: !723, line: 116, baseType: !63, size: 16, offset: 2880)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !722, file: !723, line: 117, baseType: !50, size: 8, offset: 2896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !722, file: !723, line: 117, baseType: !50, size: 8, offset: 2904)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !722, file: !723, line: 119, baseType: !146, size: 32, offset: 2912)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !722, file: !723, line: 119, baseType: !146, size: 32, offset: 2944)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !722, file: !723, line: 120, baseType: !63, size: 16, offset: 2976)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !722, file: !723, line: 120, baseType: !63, size: 16, offset: 2992)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !722, file: !723, line: 121, baseType: !146, size: 32, offset: 3008)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !722, file: !723, line: 121, baseType: !146, size: 32, offset: 3040)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !722, file: !723, line: 122, baseType: !146, size: 32, offset: 3072)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !722, file: !723, line: 123, baseType: !146, size: 32, offset: 3104)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !722, file: !723, line: 124, baseType: !63, size: 16, offset: 3136)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !722, file: !723, line: 125, baseType: !63, size: 16, offset: 3152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !722, file: !723, line: 127, baseType: !65, size: 32, offset: 3168)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !722, file: !723, line: 127, baseType: !65, size: 32, offset: 3200)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !722, file: !723, line: 128, baseType: !65, size: 32, offset: 3232)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !722, file: !723, line: 128, baseType: !65, size: 32, offset: 3264)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !722, file: !723, line: 129, baseType: !63, size: 16, offset: 3296)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !722, file: !723, line: 129, baseType: !63, size: 16, offset: 3312)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !722, file: !723, line: 129, baseType: !63, size: 16, offset: 3328)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !722, file: !723, line: 129, baseType: !63, size: 16, offset: 3344)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !722, file: !723, line: 130, baseType: !146, size: 32, offset: 3360)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !722, file: !723, line: 130, baseType: !146, size: 32, offset: 3392)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !722, file: !723, line: 130, baseType: !146, size: 32, offset: 3424)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !722, file: !723, line: 130, baseType: !146, size: 32, offset: 3456)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !722, file: !723, line: 131, baseType: !146, size: 32, offset: 3488)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !722, file: !723, line: 131, baseType: !146, size: 32, offset: 3520)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !722, file: !723, line: 131, baseType: !146, size: 32, offset: 3552)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !722, file: !723, line: 131, baseType: !146, size: 32, offset: 3584)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !722, file: !723, line: 132, baseType: !146, size: 32, offset: 3616)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !722, file: !723, line: 132, baseType: !146, size: 32, offset: 3648)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !722, file: !723, line: 133, baseType: !80, size: 512, offset: 3680)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !722, file: !723, line: 135, baseType: !146, size: 32, offset: 4192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !722, file: !723, line: 136, baseType: !146, size: 32, offset: 4224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !722, file: !723, line: 137, baseType: !146, size: 32, offset: 4256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !722, file: !723, line: 138, baseType: !65, size: 32, offset: 4288)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !722, file: !723, line: 141, baseType: !50, size: 8, offset: 4320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !722, file: !723, line: 141, baseType: !50, size: 8, offset: 4328)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !722, file: !723, line: 141, baseType: !50, size: 8, offset: 4336)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !722, file: !723, line: 141, baseType: !50, size: 8, offset: 4344)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !722, file: !723, line: 142, baseType: !63, size: 16, offset: 4352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !722, file: !723, line: 142, baseType: !63, size: 16, offset: 4368)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !722, file: !723, line: 142, baseType: !63, size: 16, offset: 4384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !722, file: !723, line: 145, baseType: !50, size: 8, offset: 4400)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !722, file: !723, line: 145, baseType: !50, size: 8, offset: 4408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !722, file: !723, line: 148, baseType: !63, size: 16, offset: 4416)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !722, file: !723, line: 148, baseType: !63, size: 16, offset: 4432)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !722, file: !723, line: 149, baseType: !146, size: 32, offset: 4448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !722, file: !723, line: 149, baseType: !146, size: 32, offset: 4480)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !722, file: !723, line: 152, baseType: !303, size: 128, offset: 4512)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !722, file: !723, line: 153, baseType: !146, size: 32, offset: 4640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !722, file: !723, line: 154, baseType: !146, size: 32, offset: 4672)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !722, file: !723, line: 157, baseType: !63, size: 16, offset: 4704)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !722, file: !723, line: 157, baseType: !63, size: 16, offset: 4720)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !722, file: !723, line: 160, baseType: !844, size: 64, offset: 4736)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !103, line: 113, size: 6208, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !856}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !845, file: !103, line: 114, baseType: !63, size: 16)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !845, file: !103, line: 114, baseType: !63, size: 16, offset: 16)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !845, file: !103, line: 115, baseType: !50, size: 8, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !845, file: !103, line: 115, baseType: !50, size: 8, offset: 40)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !845, file: !103, line: 116, baseType: !50, size: 8, offset: 48)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !845, file: !103, line: 117, baseType: !853, size: 8, offset: 56)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 1)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !845, file: !103, line: 119, baseType: !857, size: 6144, offset: 64)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 6144, elements: !867)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !103, line: 109, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !103, line: 106, size: 192, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !859, file: !103, line: 107, baseType: !146, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !859, file: !103, line: 107, baseType: !146, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !859, file: !103, line: 107, baseType: !146, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !859, file: !103, line: 107, baseType: !146, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !859, file: !103, line: 107, baseType: !146, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !859, file: !103, line: 108, baseType: !65, size: 32, offset: 160)
!867 = !{!868}
!868 = !DISubrange(count: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !722, file: !723, line: 161, baseType: !844, size: 64, offset: 4800)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !722, file: !723, line: 162, baseType: !50, size: 8, offset: 4864)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !722, file: !723, line: 162, baseType: !50, size: 8, offset: 4872)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !722, file: !723, line: 163, baseType: !50, size: 8, offset: 4880)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !722, file: !723, line: 163, baseType: !50, size: 8, offset: 4888)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !722, file: !723, line: 164, baseType: !63, size: 16, offset: 4896)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !722, file: !723, line: 164, baseType: !63, size: 16, offset: 4912)
