; ModuleID = 'blender/source/blender/editors/animation/keyframes_general.c'
source_filename = "blender/source/blender/editors/animation/keyframes_general.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ListBase = type { i8*, i8* }
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.FCurve = type { %struct.FCurve*, %struct.FCurve*, %struct.bActionGroup*, %struct.ChannelDriver*, %struct.ListBase, %struct.BezTriple*, %struct.FPoint*, i32, float, i16, i16, i32, i8*, i32, [3 x float], float, float }
%struct.bActionGroup = type { %struct.bActionGroup*, %struct.bActionGroup*, %struct.ListBase, i32, i32, [64 x i8], %struct.ThemeWireColor }
%struct.ThemeWireColor = type { [4 x i8], [4 x i8], [4 x i8], i16, i16 }
%struct.ChannelDriver = type { %struct.ListBase, [256 x i8], i8*, float, float, i32, i32 }
%struct.BezTriple = type { [3 x [3 x float]], float, float, float, i8, i8, i8, i8, i8, i8, i8, i8, float, float, float, [4 x i8] }
%struct.FPoint = type { [2 x float], i32, i32 }
%struct.tSmooth_Bezt = type { float*, float*, float*, float, float, float }
%struct.TempFrameValCache = type { float, float }

!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "BEZT_KEYTYPE_KEYFRAME", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "BEZT_KEYTYPE_EXTREME", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "BEZT_KEYTYPE_BREAKDOWN", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "BEZT_KEYTYPE_JITTER", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEditKeyframes_Validate", file: !14, line: 53, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/editors/include/ED_keyframes_edit.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !17, !18, !19, !20, !21, !22}
!16 = !DIEnumerator(name: "BEZT_OK_FRAME", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "BEZT_OK_FRAMERANGE", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "BEZT_OK_SELECTED", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "BEZT_OK_VALUE", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "BEZT_OK_VALUERANGE", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "BEZT_OK_REGION", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "BEZT_OK_REGION_LASSO", value: 7, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eKeyPasteOffset", file: !14, line: 169, baseType: !7, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "KEYFRAME_PASTE_OFFSET_CFRA_START", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "KEYFRAME_PASTE_OFFSET_CFRA_END", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "KEYFRAME_PASTE_OFFSET_CFRA_RELATIVE", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "KEYFRAME_PASTE_OFFSET_NONE", value: 3, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eKeyMergeMode", file: !14, line: 180, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "KEYFRAME_PASTE_MERGE_MIX", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "KEYFRAME_PASTE_MERGE_OVER", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "KEYFRAME_PASTE_MERGE_OVER_RANGE", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "KEYFRAME_PASTE_MERGE_OVER_RANGE_ALL", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !36, line: 67, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!43 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!44 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!45 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!46 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnim_Update_Flags", file: !48, line: 197, baseType: !7, size: 32, elements: !49)
!48 = !DIFile(filename: "blender/source/blender/editors/include/ED_anim_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!49 = !{!50, !51, !52}
!50 = !DIEnumerator(name: "ANIM_UPDATE_DEPS", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "ANIM_UPDATE_ORDER", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "ANIM_UPDATE_HANDLES", value: 4, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eInsertKeyFlags", file: !54, line: 788, baseType: !7, size: 32, elements: !55)
!54 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63}
!56 = !DIEnumerator(name: "INSERTKEY_NEEDED", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "INSERTKEY_MATRIX", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "INSERTKEY_FAST", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "INSERTKEY_FASTR", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "INSERTKEY_REPLACE", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "INSERTKEY_XYZ2RGB", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "INSERTKEY_NO_USERPREF", value: 64, isUnsigned: true)
!63 = !DIEnumerator(name: "INSERTKEY_OVERWRITE_FULL", value: 128, isUnsigned: true)
!64 = !{!65, !66, !67, !68, !169, !176}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !54, line: 463, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !54, line: 433, size: 896, elements: !71)
!71 = !{!72, !74, !75, !112, !127, !128, !152, !163, !164, !165, !166, !167, !168, !170, !171, !174, !175}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !54, line: 434, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !70, file: !54, line: 434, baseType: !73, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !70, file: !54, line: 437, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !78, line: 450, baseType: !79)
!78 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !78, line: 440, size: 960, elements: !80)
!80 = !{!81, !83, !84, !91, !92, !93, !98}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !78, line: 441, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !79, file: !78, line: 441, baseType: !82, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !79, file: !78, line: 443, baseType: !85, size: 128, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !86, line: 71, baseType: !87)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !86, line: 69, size: 128, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !87, file: !86, line: 70, baseType: !65, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !87, file: !86, line: 70, baseType: !65, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !79, file: !78, line: 445, baseType: !66, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !79, file: !78, line: 446, baseType: !66, size: 32, offset: 288)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !78, line: 447, baseType: !94, size: 512, offset: 320)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 512, elements: !96)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !{!97}
!97 = !DISubrange(count: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !79, file: !78, line: 449, baseType: !99, size: 128, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !100, line: 347, baseType: !101)
!100 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !100, line: 340, size: 128, elements: !102)
!102 = !{!103, !107, !108, !109, !111}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !101, file: !100, line: 341, baseType: !104, size: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !101, file: !100, line: 342, baseType: !104, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !101, file: !100, line: 343, baseType: !104, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !101, file: !100, line: 345, baseType: !110, size: 16, offset: 96)
!110 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !101, file: !100, line: 346, baseType: !110, size: 16, offset: 112)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !70, file: !54, line: 440, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !54, line: 386, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !54, line: 371, size: 2368, elements: !116)
!116 = !{!117, !118, !122, !123, !124, !125, !126}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !115, file: !54, line: 372, baseType: !85, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !115, file: !54, line: 377, baseType: !119, size: 2048, offset: 128)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2048, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !115, file: !54, line: 378, baseType: !65, size: 64, offset: 2176)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !115, file: !54, line: 380, baseType: !67, size: 32, offset: 2240)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !115, file: !54, line: 381, baseType: !67, size: 32, offset: 2272)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !54, line: 384, baseType: !66, size: 32, offset: 2304)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !115, file: !54, line: 385, baseType: !66, size: 32, offset: 2336)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !70, file: !54, line: 442, baseType: !85, size: 128, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !70, file: !54, line: 445, baseType: !129, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !6, line: 133, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !6, line: 117, size: 576, elements: !132)
!132 = !{!133, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !131, file: !6, line: 118, baseType: !134, size: 288)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 288, elements: !135)
!135 = !{!136, !136}
!136 = !DISubrange(count: 3)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !131, file: !6, line: 119, baseType: !67, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !131, file: !6, line: 119, baseType: !67, size: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !131, file: !6, line: 119, baseType: !67, size: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !131, file: !6, line: 121, baseType: !95, size: 8, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !131, file: !6, line: 123, baseType: !95, size: 8, offset: 392)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !131, file: !6, line: 123, baseType: !95, size: 8, offset: 400)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !131, file: !6, line: 124, baseType: !95, size: 8, offset: 408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !131, file: !6, line: 124, baseType: !95, size: 8, offset: 416)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !131, file: !6, line: 124, baseType: !95, size: 8, offset: 424)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !131, file: !6, line: 126, baseType: !95, size: 8, offset: 432)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !131, file: !6, line: 128, baseType: !95, size: 8, offset: 440)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !131, file: !6, line: 129, baseType: !67, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !131, file: !6, line: 130, baseType: !67, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !131, file: !6, line: 130, baseType: !67, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !131, file: !6, line: 132, baseType: !104, size: 32, offset: 544)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !70, file: !54, line: 446, baseType: !153, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !54, line: 430, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !54, line: 426, size: 128, elements: !156)
!156 = !{!157, !161, !162}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !155, file: !54, line: 427, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 2)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !155, file: !54, line: 428, baseType: !66, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !155, file: !54, line: 429, baseType: !66, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !70, file: !54, line: 447, baseType: !7, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !70, file: !54, line: 450, baseType: !67, size: 32, offset: 544)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !70, file: !54, line: 451, baseType: !110, size: 16, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !70, file: !54, line: 452, baseType: !110, size: 16, offset: 592)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !70, file: !54, line: 455, baseType: !66, size: 32, offset: 608)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !70, file: !54, line: 456, baseType: !169, size: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !70, file: !54, line: 459, baseType: !66, size: 32, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !70, file: !54, line: 460, baseType: !172, size: 96, offset: 736)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 96, elements: !173)
!173 = !{!136}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !70, file: !54, line: 462, baseType: !67, size: 32, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !70, file: !54, line: 462, baseType: !67, size: 32, offset: 864)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!177 = !{!178, !194, !0, !196, !198, !200}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "keyframe_paste_offset_items", scope: !2, file: !3, line: 751, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 1600, elements: !192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !182, line: 308, baseType: !183)
!182 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !182, line: 302, size: 320, elements: !184)
!184 = !{!185, !186, !189, !190, !191}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !183, file: !182, line: 303, baseType: !66, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !183, file: !182, line: 304, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !183, file: !182, line: 305, baseType: !66, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !182, line: 306, baseType: !187, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !183, file: !182, line: 307, baseType: !187, size: 64, offset: 256)
!192 = !{!193}
!193 = !DISubrange(count: 5)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "keyframe_paste_merge_items", scope: !2, file: !3, line: 758, type: !180, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "animcopy_firstframe", scope: !2, file: !3, line: 464, type: !67, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "animcopy_lastframe", scope: !2, file: !3, line: 465, type: !67, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "animcopy_cfra", scope: !2, file: !3, line: 466, type: !67, isLocal: true, isDefinition: true)
!202 = !{i32 7, !"Dwarf Version", i32 4}
!203 = !{i32 2, !"Debug Info Version", i32 3}
!204 = !{i32 1, !"wchar_size", i32 4}
!205 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!206 = distinct !DISubprogram(name: "delete_fcurve_key", scope: !3, file: !3, line: 75, type: !207, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !68, !66, !209}
!209 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!210 = !{}
!211 = !DILocalVariable(name: "fcu", arg: 1, scope: !206, file: !3, line: 75, type: !68)
!212 = !DILocation(line: 75, column: 32, scope: !206)
!213 = !DILocalVariable(name: "index", arg: 2, scope: !206, file: !3, line: 75, type: !66)
!214 = !DILocation(line: 75, column: 41, scope: !206)
!215 = !DILocalVariable(name: "do_recalc", arg: 3, scope: !206, file: !3, line: 75, type: !209)
!216 = !DILocation(line: 75, column: 53, scope: !206)
!217 = !DILocation(line: 78, column: 6, scope: !218)
!218 = distinct !DILexicalBlock(scope: !206, file: !3, line: 78, column: 6)
!219 = !DILocation(line: 78, column: 10, scope: !218)
!220 = !DILocation(line: 78, column: 6, scope: !206)
!221 = !DILocation(line: 79, column: 3, scope: !218)
!222 = !DILocation(line: 85, column: 10, scope: !223)
!223 = distinct !DILexicalBlock(scope: !206, file: !3, line: 85, column: 6)
!224 = !DILocation(line: 85, column: 6, scope: !223)
!225 = !DILocation(line: 85, column: 20, scope: !223)
!226 = !DILocation(line: 85, column: 25, scope: !223)
!227 = !DILocation(line: 85, column: 17, scope: !223)
!228 = !DILocation(line: 85, column: 6, scope: !206)
!229 = !DILocation(line: 86, column: 3, scope: !223)
!230 = !DILocation(line: 87, column: 11, scope: !231)
!231 = distinct !DILexicalBlock(scope: !223, file: !3, line: 87, column: 11)
!232 = !DILocation(line: 87, column: 17, scope: !231)
!233 = !DILocation(line: 87, column: 11, scope: !223)
!234 = !DILocation(line: 88, column: 12, scope: !231)
!235 = !DILocation(line: 88, column: 17, scope: !231)
!236 = !DILocation(line: 88, column: 9, scope: !231)
!237 = !DILocation(line: 88, column: 3, scope: !231)
!238 = !DILocation(line: 91, column: 11, scope: !206)
!239 = !DILocation(line: 91, column: 16, scope: !206)
!240 = !DILocation(line: 91, column: 21, scope: !206)
!241 = !DILocation(line: 91, column: 2, scope: !206)
!242 = !DILocation(line: 91, column: 30, scope: !206)
!243 = !DILocation(line: 91, column: 35, scope: !206)
!244 = !DILocation(line: 91, column: 40, scope: !206)
!245 = !DILocation(line: 91, column: 46, scope: !206)
!246 = !DILocation(line: 91, column: 73, scope: !206)
!247 = !DILocation(line: 91, column: 78, scope: !206)
!248 = !DILocation(line: 91, column: 88, scope: !206)
!249 = !DILocation(line: 91, column: 86, scope: !206)
!250 = !DILocation(line: 91, column: 94, scope: !206)
!251 = !DILocation(line: 91, column: 72, scope: !206)
!252 = !DILocation(line: 91, column: 70, scope: !206)
!253 = !DILocation(line: 92, column: 2, scope: !206)
!254 = !DILocation(line: 92, column: 7, scope: !206)
!255 = !DILocation(line: 92, column: 14, scope: !206)
!256 = !DILocation(line: 94, column: 6, scope: !257)
!257 = distinct !DILexicalBlock(scope: !206, file: !3, line: 94, column: 6)
!258 = !DILocation(line: 94, column: 11, scope: !257)
!259 = !DILocation(line: 94, column: 19, scope: !257)
!260 = !DILocation(line: 94, column: 6, scope: !206)
!261 = !DILocation(line: 95, column: 7, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 95, column: 7)
!263 = distinct !DILexicalBlock(scope: !257, file: !3, line: 94, column: 25)
!264 = !DILocation(line: 95, column: 12, scope: !262)
!265 = !DILocation(line: 95, column: 7, scope: !263)
!266 = !DILocation(line: 96, column: 4, scope: !262)
!267 = !DILocation(line: 96, column: 14, scope: !262)
!268 = !DILocation(line: 96, column: 19, scope: !262)
!269 = !DILocation(line: 97, column: 3, scope: !263)
!270 = !DILocation(line: 97, column: 8, scope: !263)
!271 = !DILocation(line: 97, column: 13, scope: !263)
!272 = !DILocation(line: 98, column: 2, scope: !263)
!273 = !DILocation(line: 101, column: 6, scope: !274)
!274 = distinct !DILexicalBlock(scope: !206, file: !3, line: 101, column: 6)
!275 = !DILocation(line: 101, column: 6, scope: !206)
!276 = !DILocation(line: 102, column: 22, scope: !274)
!277 = !DILocation(line: 102, column: 3, scope: !274)
!278 = !DILocation(line: 103, column: 1, scope: !206)
!279 = distinct !DISubprogram(name: "delete_fcurve_keys", scope: !3, file: !3, line: 106, type: !280, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!280 = !DISubroutineType(types: !281)
!281 = !{!209, !68}
!282 = !DILocalVariable(name: "fcu", arg: 1, scope: !279, file: !3, line: 106, type: !68)
!283 = !DILocation(line: 106, column: 33, scope: !279)
!284 = !DILocalVariable(name: "i", scope: !279, file: !3, line: 108, type: !66)
!285 = !DILocation(line: 108, column: 6, scope: !279)
!286 = !DILocalVariable(name: "changed", scope: !279, file: !3, line: 109, type: !209)
!287 = !DILocation(line: 109, column: 7, scope: !279)
!288 = !DILocation(line: 111, column: 6, scope: !289)
!289 = distinct !DILexicalBlock(scope: !279, file: !3, line: 111, column: 6)
!290 = !DILocation(line: 111, column: 11, scope: !289)
!291 = !DILocation(line: 111, column: 16, scope: !289)
!292 = !DILocation(line: 111, column: 6, scope: !279)
!293 = !DILocation(line: 112, column: 3, scope: !289)
!294 = !DILocation(line: 115, column: 9, scope: !295)
!295 = distinct !DILexicalBlock(scope: !279, file: !3, line: 115, column: 2)
!296 = !DILocation(line: 115, column: 7, scope: !295)
!297 = !DILocation(line: 115, column: 14, scope: !298)
!298 = distinct !DILexicalBlock(scope: !295, file: !3, line: 115, column: 2)
!299 = !DILocation(line: 115, column: 18, scope: !298)
!300 = !DILocation(line: 115, column: 23, scope: !298)
!301 = !DILocation(line: 115, column: 16, scope: !298)
!302 = !DILocation(line: 115, column: 2, scope: !295)
!303 = !DILocation(line: 116, column: 7, scope: !304)
!304 = distinct !DILexicalBlock(scope: !305, file: !3, line: 116, column: 7)
!305 = distinct !DILexicalBlock(scope: !298, file: !3, line: 115, column: 37)
!306 = !DILocation(line: 116, column: 12, scope: !304)
!307 = !DILocation(line: 116, column: 17, scope: !304)
!308 = !DILocation(line: 116, column: 20, scope: !304)
!309 = !DILocation(line: 116, column: 23, scope: !304)
!310 = !DILocation(line: 116, column: 7, scope: !305)
!311 = !DILocation(line: 117, column: 13, scope: !312)
!312 = distinct !DILexicalBlock(scope: !304, file: !3, line: 116, column: 33)
!313 = !DILocation(line: 117, column: 18, scope: !312)
!314 = !DILocation(line: 117, column: 23, scope: !312)
!315 = !DILocation(line: 117, column: 4, scope: !312)
!316 = !DILocation(line: 117, column: 28, scope: !312)
!317 = !DILocation(line: 117, column: 33, scope: !312)
!318 = !DILocation(line: 117, column: 38, scope: !312)
!319 = !DILocation(line: 117, column: 40, scope: !312)
!320 = !DILocation(line: 117, column: 67, scope: !312)
!321 = !DILocation(line: 117, column: 72, scope: !312)
!322 = !DILocation(line: 117, column: 82, scope: !312)
!323 = !DILocation(line: 117, column: 80, scope: !312)
!324 = !DILocation(line: 117, column: 84, scope: !312)
!325 = !DILocation(line: 117, column: 66, scope: !312)
!326 = !DILocation(line: 117, column: 64, scope: !312)
!327 = !DILocation(line: 118, column: 4, scope: !312)
!328 = !DILocation(line: 118, column: 9, scope: !312)
!329 = !DILocation(line: 118, column: 16, scope: !312)
!330 = !DILocation(line: 119, column: 5, scope: !312)
!331 = !DILocation(line: 120, column: 12, scope: !312)
!332 = !DILocation(line: 121, column: 3, scope: !312)
!333 = !DILocation(line: 122, column: 2, scope: !305)
!334 = !DILocation(line: 115, column: 33, scope: !298)
!335 = !DILocation(line: 115, column: 2, scope: !298)
!336 = distinct !{!336, !302, !337}
!337 = !DILocation(line: 122, column: 2, scope: !295)
!338 = !DILocation(line: 125, column: 6, scope: !339)
!339 = distinct !DILexicalBlock(scope: !279, file: !3, line: 125, column: 6)
!340 = !DILocation(line: 125, column: 11, scope: !339)
!341 = !DILocation(line: 125, column: 19, scope: !339)
!342 = !DILocation(line: 125, column: 6, scope: !279)
!343 = !DILocation(line: 126, column: 21, scope: !339)
!344 = !DILocation(line: 126, column: 3, scope: !339)
!345 = !DILocation(line: 128, column: 9, scope: !279)
!346 = !DILocation(line: 128, column: 2, scope: !279)
!347 = !DILocation(line: 129, column: 1, scope: !279)
!348 = distinct !DISubprogram(name: "clear_fcurve_keys", scope: !3, file: !3, line: 132, type: !349, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !68}
!351 = !DILocalVariable(name: "fcu", arg: 1, scope: !348, file: !3, line: 132, type: !68)
!352 = !DILocation(line: 132, column: 32, scope: !348)
!353 = !DILocation(line: 134, column: 6, scope: !354)
!354 = distinct !DILexicalBlock(scope: !348, file: !3, line: 134, column: 6)
!355 = !DILocation(line: 134, column: 11, scope: !354)
!356 = !DILocation(line: 134, column: 6, scope: !348)
!357 = !DILocation(line: 135, column: 3, scope: !354)
!358 = !DILocation(line: 135, column: 13, scope: !354)
!359 = !DILocation(line: 135, column: 18, scope: !354)
!360 = !DILocation(line: 136, column: 2, scope: !348)
!361 = !DILocation(line: 136, column: 7, scope: !348)
!362 = !DILocation(line: 136, column: 12, scope: !348)
!363 = !DILocation(line: 138, column: 2, scope: !348)
!364 = !DILocation(line: 138, column: 7, scope: !348)
!365 = !DILocation(line: 138, column: 15, scope: !348)
!366 = !DILocation(line: 139, column: 1, scope: !348)
!367 = distinct !DISubprogram(name: "duplicate_fcurve_keys", scope: !3, file: !3, line: 144, type: !349, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!368 = !DILocalVariable(name: "fcu", arg: 1, scope: !367, file: !3, line: 144, type: !68)
!369 = !DILocation(line: 144, column: 36, scope: !367)
!370 = !DILocalVariable(name: "newbezt", scope: !367, file: !3, line: 146, type: !129)
!371 = !DILocation(line: 146, column: 13, scope: !367)
!372 = !DILocalVariable(name: "i", scope: !367, file: !3, line: 147, type: !66)
!373 = !DILocation(line: 147, column: 6, scope: !367)
!374 = !DILocation(line: 150, column: 6, scope: !375)
!375 = distinct !DILexicalBlock(scope: !367, file: !3, line: 150, column: 6)
!376 = !DILocation(line: 150, column: 6, scope: !367)
!377 = !DILocation(line: 151, column: 3, scope: !375)
!378 = !DILocation(line: 153, column: 9, scope: !379)
!379 = distinct !DILexicalBlock(scope: !367, file: !3, line: 153, column: 2)
!380 = !DILocation(line: 153, column: 7, scope: !379)
!381 = !DILocation(line: 153, column: 14, scope: !382)
!382 = distinct !DILexicalBlock(scope: !379, file: !3, line: 153, column: 2)
!383 = !DILocation(line: 153, column: 18, scope: !382)
!384 = !DILocation(line: 153, column: 23, scope: !382)
!385 = !DILocation(line: 153, column: 16, scope: !382)
!386 = !DILocation(line: 153, column: 2, scope: !379)
!387 = !DILocation(line: 155, column: 7, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 155, column: 7)
!389 = distinct !DILexicalBlock(scope: !382, file: !3, line: 153, column: 37)
!390 = !DILocation(line: 155, column: 12, scope: !388)
!391 = !DILocation(line: 155, column: 17, scope: !388)
!392 = !DILocation(line: 155, column: 20, scope: !388)
!393 = !DILocation(line: 155, column: 23, scope: !388)
!394 = !DILocation(line: 155, column: 7, scope: !389)
!395 = !DILocation(line: 157, column: 14, scope: !396)
!396 = distinct !DILexicalBlock(scope: !388, file: !3, line: 155, column: 33)
!397 = !DILocation(line: 157, column: 47, scope: !396)
!398 = !DILocation(line: 157, column: 52, scope: !396)
!399 = !DILocation(line: 157, column: 60, scope: !396)
!400 = !DILocation(line: 157, column: 46, scope: !396)
!401 = !DILocation(line: 157, column: 44, scope: !396)
!402 = !DILocation(line: 157, column: 12, scope: !396)
!403 = !DILocation(line: 159, column: 11, scope: !396)
!404 = !DILocation(line: 159, column: 4, scope: !396)
!405 = !DILocation(line: 159, column: 20, scope: !396)
!406 = !DILocation(line: 159, column: 25, scope: !396)
!407 = !DILocation(line: 159, column: 52, scope: !396)
!408 = !DILocation(line: 159, column: 54, scope: !396)
!409 = !DILocation(line: 159, column: 51, scope: !396)
!410 = !DILocation(line: 159, column: 49, scope: !396)
!411 = !DILocation(line: 160, column: 11, scope: !396)
!412 = !DILocation(line: 160, column: 21, scope: !396)
!413 = !DILocation(line: 160, column: 19, scope: !396)
!414 = !DILocation(line: 160, column: 23, scope: !396)
!415 = !DILocation(line: 160, column: 4, scope: !396)
!416 = !DILocation(line: 160, column: 28, scope: !396)
!417 = !DILocation(line: 160, column: 33, scope: !396)
!418 = !DILocation(line: 160, column: 40, scope: !396)
!419 = !DILocation(line: 160, column: 38, scope: !396)
!420 = !DILocation(line: 161, column: 11, scope: !396)
!421 = !DILocation(line: 161, column: 21, scope: !396)
!422 = !DILocation(line: 161, column: 19, scope: !396)
!423 = !DILocation(line: 161, column: 23, scope: !396)
!424 = !DILocation(line: 161, column: 4, scope: !396)
!425 = !DILocation(line: 161, column: 28, scope: !396)
!426 = !DILocation(line: 161, column: 33, scope: !396)
!427 = !DILocation(line: 161, column: 40, scope: !396)
!428 = !DILocation(line: 161, column: 38, scope: !396)
!429 = !DILocation(line: 161, column: 42, scope: !396)
!430 = !DILocation(line: 161, column: 68, scope: !396)
!431 = !DILocation(line: 161, column: 73, scope: !396)
!432 = !DILocation(line: 161, column: 84, scope: !396)
!433 = !DILocation(line: 161, column: 86, scope: !396)
!434 = !DILocation(line: 161, column: 81, scope: !396)
!435 = !DILocation(line: 161, column: 67, scope: !396)
!436 = !DILocation(line: 161, column: 65, scope: !396)
!437 = !DILocation(line: 162, column: 4, scope: !396)
!438 = !DILocation(line: 162, column: 9, scope: !396)
!439 = !DILocation(line: 162, column: 16, scope: !396)
!440 = !DILocation(line: 165, column: 4, scope: !396)
!441 = !DILocation(line: 165, column: 14, scope: !396)
!442 = !DILocation(line: 165, column: 19, scope: !396)
!443 = !DILocation(line: 166, column: 16, scope: !396)
!444 = !DILocation(line: 166, column: 4, scope: !396)
!445 = !DILocation(line: 166, column: 9, scope: !396)
!446 = !DILocation(line: 166, column: 14, scope: !396)
!447 = !DILocation(line: 169, column: 4, scope: !448)
!448 = distinct !DILexicalBlock(scope: !396, file: !3, line: 169, column: 4)
!449 = !DILocation(line: 170, column: 5, scope: !396)
!450 = !DILocation(line: 173, column: 4, scope: !451)
!451 = distinct !DILexicalBlock(scope: !396, file: !3, line: 173, column: 4)
!452 = !DILocation(line: 174, column: 3, scope: !396)
!453 = !DILocation(line: 175, column: 2, scope: !389)
!454 = !DILocation(line: 153, column: 33, scope: !382)
!455 = !DILocation(line: 153, column: 2, scope: !382)
!456 = distinct !{!456, !386, !457}
!457 = !DILocation(line: 175, column: 2, scope: !379)
!458 = !DILocation(line: 176, column: 1, scope: !367)
!459 = distinct !DISubprogram(name: "clean_fcurve", scope: !3, file: !3, line: 182, type: !460, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !68, !67}
!462 = !DILocalVariable(name: "fcu", arg: 1, scope: !459, file: !3, line: 182, type: !68)
!463 = !DILocation(line: 182, column: 27, scope: !459)
!464 = !DILocalVariable(name: "thresh", arg: 2, scope: !459, file: !3, line: 182, type: !67)
!465 = !DILocation(line: 182, column: 38, scope: !459)
!466 = !DILocalVariable(name: "old_bezts", scope: !459, file: !3, line: 184, type: !129)
!467 = !DILocation(line: 184, column: 13, scope: !459)
!468 = !DILocalVariable(name: "bezt", scope: !459, file: !3, line: 184, type: !129)
!469 = !DILocation(line: 184, column: 25, scope: !459)
!470 = !DILocalVariable(name: "beztn", scope: !459, file: !3, line: 184, type: !129)
!471 = !DILocation(line: 184, column: 32, scope: !459)
!472 = !DILocalVariable(name: "lastb", scope: !459, file: !3, line: 185, type: !129)
!473 = !DILocation(line: 185, column: 13, scope: !459)
!474 = !DILocalVariable(name: "totCount", scope: !459, file: !3, line: 186, type: !66)
!475 = !DILocation(line: 186, column: 6, scope: !459)
!476 = !DILocalVariable(name: "i", scope: !459, file: !3, line: 186, type: !66)
!477 = !DILocation(line: 186, column: 16, scope: !459)
!478 = !DILocation(line: 189, column: 7, scope: !479)
!479 = distinct !DILexicalBlock(scope: !459, file: !3, line: 189, column: 6)
!480 = !DILocation(line: 189, column: 11, scope: !479)
!481 = !DILocation(line: 189, column: 20, scope: !479)
!482 = !DILocation(line: 189, column: 24, scope: !479)
!483 = !DILocation(line: 189, column: 29, scope: !479)
!484 = !DILocation(line: 189, column: 34, scope: !479)
!485 = !DILocation(line: 189, column: 43, scope: !479)
!486 = !DILocation(line: 189, column: 47, scope: !479)
!487 = !DILocation(line: 189, column: 52, scope: !479)
!488 = !DILocation(line: 189, column: 60, scope: !479)
!489 = !DILocation(line: 189, column: 6, scope: !459)
!490 = !DILocation(line: 190, column: 3, scope: !479)
!491 = !DILocation(line: 193, column: 14, scope: !459)
!492 = !DILocation(line: 193, column: 19, scope: !459)
!493 = !DILocation(line: 193, column: 12, scope: !459)
!494 = !DILocation(line: 194, column: 13, scope: !459)
!495 = !DILocation(line: 194, column: 18, scope: !459)
!496 = !DILocation(line: 194, column: 11, scope: !459)
!497 = !DILocation(line: 195, column: 2, scope: !459)
!498 = !DILocation(line: 195, column: 7, scope: !459)
!499 = !DILocation(line: 195, column: 12, scope: !459)
!500 = !DILocation(line: 196, column: 2, scope: !459)
!501 = !DILocation(line: 196, column: 7, scope: !459)
!502 = !DILocation(line: 196, column: 15, scope: !459)
!503 = !DILocation(line: 199, column: 9, scope: !459)
!504 = !DILocation(line: 199, column: 7, scope: !459)
!505 = !DILocation(line: 200, column: 21, scope: !459)
!506 = !DILocation(line: 200, column: 26, scope: !459)
!507 = !DILocation(line: 200, column: 32, scope: !459)
!508 = !DILocation(line: 200, column: 43, scope: !459)
!509 = !DILocation(line: 200, column: 49, scope: !459)
!510 = !DILocation(line: 200, column: 2, scope: !459)
!511 = !DILocation(line: 205, column: 9, scope: !512)
!512 = distinct !DILexicalBlock(scope: !459, file: !3, line: 205, column: 2)
!513 = !DILocation(line: 205, column: 7, scope: !512)
!514 = !DILocation(line: 205, column: 14, scope: !515)
!515 = distinct !DILexicalBlock(scope: !512, file: !3, line: 205, column: 2)
!516 = !DILocation(line: 205, column: 18, scope: !515)
!517 = !DILocation(line: 205, column: 16, scope: !515)
!518 = !DILocation(line: 205, column: 2, scope: !512)
!519 = !DILocalVariable(name: "prev", scope: !520, file: !3, line: 206, type: !158)
!520 = distinct !DILexicalBlock(scope: !515, file: !3, line: 205, column: 33)
!521 = !DILocation(line: 206, column: 9, scope: !520)
!522 = !DILocalVariable(name: "cur", scope: !520, file: !3, line: 206, type: !158)
!523 = !DILocation(line: 206, column: 18, scope: !520)
!524 = !DILocalVariable(name: "next", scope: !520, file: !3, line: 206, type: !158)
!525 = !DILocation(line: 206, column: 26, scope: !520)
!526 = !DILocation(line: 209, column: 7, scope: !527)
!527 = distinct !DILexicalBlock(scope: !520, file: !3, line: 209, column: 7)
!528 = !DILocation(line: 209, column: 12, scope: !527)
!529 = !DILocation(line: 209, column: 21, scope: !527)
!530 = !DILocation(line: 209, column: 9, scope: !527)
!531 = !DILocation(line: 209, column: 7, scope: !520)
!532 = !DILocation(line: 210, column: 13, scope: !533)
!533 = distinct !DILexicalBlock(scope: !527, file: !3, line: 209, column: 27)
!534 = !DILocation(line: 210, column: 26, scope: !533)
!535 = !DILocation(line: 210, column: 28, scope: !533)
!536 = !DILocation(line: 210, column: 23, scope: !533)
!537 = !DILocation(line: 210, column: 10, scope: !533)
!538 = !DILocation(line: 211, column: 14, scope: !533)
!539 = !DILocation(line: 211, column: 21, scope: !533)
!540 = !DILocation(line: 211, column: 4, scope: !533)
!541 = !DILocation(line: 211, column: 12, scope: !533)
!542 = !DILocation(line: 211, column: 42, scope: !533)
!543 = !DILocation(line: 211, column: 49, scope: !533)
!544 = !DILocation(line: 211, column: 32, scope: !533)
!545 = !DILocation(line: 211, column: 40, scope: !533)
!546 = !DILocation(line: 212, column: 3, scope: !533)
!547 = !DILocation(line: 214, column: 10, scope: !548)
!548 = distinct !DILexicalBlock(scope: !527, file: !3, line: 213, column: 8)
!549 = !DILocation(line: 215, column: 14, scope: !548)
!550 = !DILocation(line: 215, column: 22, scope: !548)
!551 = !DILocation(line: 215, column: 4, scope: !548)
!552 = !DILocation(line: 215, column: 12, scope: !548)
!553 = !DILocation(line: 217, column: 12, scope: !520)
!554 = !DILocation(line: 217, column: 17, scope: !520)
!555 = !DILocation(line: 217, column: 25, scope: !520)
!556 = !DILocation(line: 217, column: 30, scope: !520)
!557 = !DILocation(line: 217, column: 38, scope: !520)
!558 = !DILocation(line: 217, column: 22, scope: !520)
!559 = !DILocation(line: 217, column: 9, scope: !520)
!560 = !DILocation(line: 218, column: 11, scope: !520)
!561 = !DILocation(line: 218, column: 23, scope: !520)
!562 = !DILocation(line: 218, column: 21, scope: !520)
!563 = !DILocation(line: 218, column: 8, scope: !520)
!564 = !DILocation(line: 221, column: 13, scope: !520)
!565 = !DILocation(line: 221, column: 20, scope: !520)
!566 = !DILocation(line: 221, column: 3, scope: !520)
!567 = !DILocation(line: 221, column: 11, scope: !520)
!568 = !DILocation(line: 221, column: 41, scope: !520)
!569 = !DILocation(line: 221, column: 48, scope: !520)
!570 = !DILocation(line: 221, column: 31, scope: !520)
!571 = !DILocation(line: 221, column: 39, scope: !520)
!572 = !DILocation(line: 222, column: 12, scope: !520)
!573 = !DILocation(line: 222, column: 18, scope: !520)
!574 = !DILocation(line: 222, column: 3, scope: !520)
!575 = !DILocation(line: 222, column: 10, scope: !520)
!576 = !DILocation(line: 222, column: 38, scope: !520)
!577 = !DILocation(line: 222, column: 44, scope: !520)
!578 = !DILocation(line: 222, column: 29, scope: !520)
!579 = !DILocation(line: 222, column: 36, scope: !520)
!580 = !DILocation(line: 225, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !520, file: !3, line: 225, column: 7)
!582 = !DILocation(line: 225, column: 7, scope: !520)
!583 = !DILocation(line: 230, column: 8, scope: !584)
!584 = distinct !DILexicalBlock(scope: !585, file: !3, line: 230, column: 8)
!585 = distinct !DILexicalBlock(scope: !581, file: !3, line: 225, column: 40)
!586 = !DILocation(line: 230, column: 14, scope: !584)
!587 = !DILocation(line: 230, column: 18, scope: !584)
!588 = !DILocation(line: 230, column: 51, scope: !584)
!589 = !DILocation(line: 231, column: 9, scope: !584)
!590 = !DILocation(line: 231, column: 42, scope: !584)
!591 = !DILocation(line: 230, column: 8, scope: !585)
!592 = !DILocation(line: 234, column: 9, scope: !593)
!593 = distinct !DILexicalBlock(scope: !594, file: !3, line: 234, column: 9)
!594 = distinct !DILexicalBlock(scope: !584, file: !3, line: 232, column: 4)
!595 = !DILocation(line: 234, column: 18, scope: !593)
!596 = !DILocation(line: 234, column: 16, scope: !593)
!597 = !DILocation(line: 234, column: 9, scope: !594)
!598 = !DILocation(line: 235, column: 10, scope: !599)
!599 = distinct !DILexicalBlock(scope: !600, file: !3, line: 235, column: 10)
!600 = distinct !DILexicalBlock(scope: !593, file: !3, line: 234, column: 27)
!601 = !DILocation(line: 235, column: 42, scope: !599)
!602 = !DILocation(line: 235, column: 10, scope: !600)
!603 = !DILocation(line: 237, column: 26, scope: !604)
!604 = distinct !DILexicalBlock(scope: !599, file: !3, line: 235, column: 48)
!605 = !DILocation(line: 237, column: 31, scope: !604)
!606 = !DILocation(line: 237, column: 39, scope: !604)
!607 = !DILocation(line: 237, column: 7, scope: !604)
!608 = !DILocation(line: 238, column: 6, scope: !604)
!609 = !DILocation(line: 239, column: 5, scope: !600)
!610 = !DILocation(line: 240, column: 4, scope: !594)
!611 = !DILocation(line: 243, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !3, line: 243, column: 9)
!613 = distinct !DILexicalBlock(scope: !584, file: !3, line: 241, column: 9)
!614 = !DILocation(line: 243, column: 41, scope: !612)
!615 = !DILocation(line: 243, column: 9, scope: !613)
!616 = !DILocation(line: 245, column: 25, scope: !617)
!617 = distinct !DILexicalBlock(scope: !612, file: !3, line: 243, column: 47)
!618 = !DILocation(line: 245, column: 30, scope: !617)
!619 = !DILocation(line: 245, column: 38, scope: !617)
!620 = !DILocation(line: 245, column: 6, scope: !617)
!621 = !DILocation(line: 246, column: 5, scope: !617)
!622 = !DILocation(line: 248, column: 3, scope: !585)
!623 = !DILocation(line: 251, column: 8, scope: !624)
!624 = distinct !DILexicalBlock(scope: !625, file: !3, line: 251, column: 8)
!625 = distinct !DILexicalBlock(scope: !581, file: !3, line: 249, column: 8)
!626 = !DILocation(line: 251, column: 8, scope: !625)
!627 = !DILocation(line: 253, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !629, file: !3, line: 253, column: 9)
!629 = distinct !DILexicalBlock(scope: !624, file: !3, line: 251, column: 15)
!630 = !DILocation(line: 253, column: 41, scope: !628)
!631 = !DILocation(line: 253, column: 9, scope: !629)
!632 = !DILocation(line: 255, column: 25, scope: !633)
!633 = distinct !DILexicalBlock(scope: !628, file: !3, line: 253, column: 47)
!634 = !DILocation(line: 255, column: 30, scope: !633)
!635 = !DILocation(line: 255, column: 38, scope: !633)
!636 = !DILocation(line: 255, column: 6, scope: !633)
!637 = !DILocation(line: 256, column: 5, scope: !633)
!638 = !DILocation(line: 257, column: 14, scope: !639)
!639 = distinct !DILexicalBlock(scope: !628, file: !3, line: 257, column: 14)
!640 = !DILocation(line: 257, column: 46, scope: !639)
!641 = !DILocation(line: 257, column: 14, scope: !628)
!642 = !DILocation(line: 259, column: 25, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !3, line: 257, column: 52)
!644 = !DILocation(line: 259, column: 30, scope: !643)
!645 = !DILocation(line: 259, column: 38, scope: !643)
!646 = !DILocation(line: 259, column: 6, scope: !643)
!647 = !DILocation(line: 260, column: 5, scope: !643)
!648 = !DILocation(line: 261, column: 4, scope: !629)
!649 = !DILocation(line: 264, column: 9, scope: !650)
!650 = distinct !DILexicalBlock(scope: !651, file: !3, line: 264, column: 9)
!651 = distinct !DILexicalBlock(scope: !624, file: !3, line: 262, column: 9)
!652 = !DILocation(line: 264, column: 41, scope: !650)
!653 = !DILocation(line: 264, column: 9, scope: !651)
!654 = !DILocation(line: 266, column: 25, scope: !655)
!655 = distinct !DILexicalBlock(scope: !650, file: !3, line: 264, column: 47)
!656 = !DILocation(line: 266, column: 30, scope: !655)
!657 = !DILocation(line: 266, column: 38, scope: !655)
!658 = !DILocation(line: 266, column: 6, scope: !655)
!659 = !DILocation(line: 267, column: 5, scope: !655)
!660 = !DILocation(line: 270, column: 2, scope: !520)
!661 = !DILocation(line: 205, column: 29, scope: !515)
!662 = !DILocation(line: 205, column: 2, scope: !515)
!663 = distinct !{!663, !518, !664}
!664 = !DILocation(line: 270, column: 2, scope: !512)
!665 = !DILocation(line: 273, column: 6, scope: !666)
!666 = distinct !DILexicalBlock(scope: !459, file: !3, line: 273, column: 6)
!667 = !DILocation(line: 273, column: 6, scope: !459)
!668 = !DILocation(line: 274, column: 3, scope: !666)
!669 = !DILocation(line: 274, column: 13, scope: !666)
!670 = !DILocation(line: 275, column: 1, scope: !459)
!671 = distinct !DISubprogram(name: "smooth_fcurve", scope: !3, file: !3, line: 287, type: !349, scopeLine: 288, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!672 = !DILocalVariable(name: "fcu", arg: 1, scope: !671, file: !3, line: 287, type: !68)
!673 = !DILocation(line: 287, column: 28, scope: !671)
!674 = !DILocalVariable(name: "bezt", scope: !671, file: !3, line: 289, type: !129)
!675 = !DILocation(line: 289, column: 13, scope: !671)
!676 = !DILocalVariable(name: "i", scope: !671, file: !3, line: 290, type: !66)
!677 = !DILocation(line: 290, column: 6, scope: !671)
!678 = !DILocalVariable(name: "x", scope: !671, file: !3, line: 290, type: !66)
!679 = !DILocation(line: 290, column: 9, scope: !671)
!680 = !DILocalVariable(name: "totSel", scope: !671, file: !3, line: 290, type: !66)
!681 = !DILocation(line: 290, column: 12, scope: !671)
!682 = !DILocation(line: 292, column: 6, scope: !683)
!683 = distinct !DILexicalBlock(scope: !671, file: !3, line: 292, column: 6)
!684 = !DILocation(line: 292, column: 11, scope: !683)
!685 = !DILocation(line: 292, column: 16, scope: !683)
!686 = !DILocation(line: 292, column: 6, scope: !671)
!687 = !DILocation(line: 293, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !683, file: !3, line: 292, column: 25)
!689 = !DILocation(line: 297, column: 9, scope: !671)
!690 = !DILocation(line: 297, column: 14, scope: !671)
!691 = !DILocation(line: 297, column: 7, scope: !671)
!692 = !DILocation(line: 298, column: 9, scope: !693)
!693 = distinct !DILexicalBlock(scope: !671, file: !3, line: 298, column: 2)
!694 = !DILocation(line: 298, column: 7, scope: !693)
!695 = !DILocation(line: 298, column: 14, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !3, line: 298, column: 2)
!697 = !DILocation(line: 298, column: 18, scope: !696)
!698 = !DILocation(line: 298, column: 23, scope: !696)
!699 = !DILocation(line: 298, column: 16, scope: !696)
!700 = !DILocation(line: 298, column: 2, scope: !693)
!701 = !DILocation(line: 299, column: 7, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !3, line: 299, column: 7)
!703 = distinct !DILexicalBlock(scope: !696, file: !3, line: 298, column: 45)
!704 = !DILocation(line: 299, column: 7, scope: !703)
!705 = !DILocation(line: 300, column: 10, scope: !702)
!706 = !DILocation(line: 300, column: 4, scope: !702)
!707 = !DILocation(line: 301, column: 2, scope: !703)
!708 = !DILocation(line: 298, column: 33, scope: !696)
!709 = !DILocation(line: 298, column: 41, scope: !696)
!710 = !DILocation(line: 298, column: 2, scope: !696)
!711 = distinct !{!711, !700, !712}
!712 = !DILocation(line: 301, column: 2, scope: !693)
!713 = !DILocation(line: 304, column: 6, scope: !714)
!714 = distinct !DILexicalBlock(scope: !671, file: !3, line: 304, column: 6)
!715 = !DILocation(line: 304, column: 13, scope: !714)
!716 = !DILocation(line: 304, column: 6, scope: !671)
!717 = !DILocalVariable(name: "tarray", scope: !718, file: !3, line: 305, type: !719)
!718 = distinct !DILexicalBlock(scope: !714, file: !3, line: 304, column: 19)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "tSmooth_Bezt", file: !3, line: 283, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tSmooth_Bezt", file: !3, line: 280, size: 320, elements: !722)
!722 = !{!723, !725, !726, !727, !728, !729}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !721, file: !3, line: 281, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !721, file: !3, line: 281, baseType: !724, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "h3", scope: !721, file: !3, line: 281, baseType: !724, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !721, file: !3, line: 282, baseType: !67, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !721, file: !3, line: 282, baseType: !67, size: 32, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "y3", scope: !721, file: !3, line: 282, baseType: !67, size: 32, offset: 256)
!730 = !DILocation(line: 305, column: 17, scope: !718)
!731 = !DILocalVariable(name: "tsb", scope: !718, file: !3, line: 305, type: !719)
!732 = !DILocation(line: 305, column: 26, scope: !718)
!733 = !DILocation(line: 308, column: 18, scope: !718)
!734 = !DILocation(line: 308, column: 30, scope: !718)
!735 = !DILocation(line: 308, column: 37, scope: !718)
!736 = !DILocation(line: 308, column: 16, scope: !718)
!737 = !DILocation(line: 308, column: 7, scope: !718)
!738 = !DILocation(line: 311, column: 10, scope: !718)
!739 = !DILocation(line: 311, column: 15, scope: !718)
!740 = !DILocation(line: 311, column: 8, scope: !718)
!741 = !DILocation(line: 312, column: 10, scope: !742)
!742 = distinct !DILexicalBlock(scope: !718, file: !3, line: 312, column: 3)
!743 = !DILocation(line: 312, column: 17, scope: !742)
!744 = !DILocation(line: 312, column: 8, scope: !742)
!745 = !DILocation(line: 312, column: 23, scope: !746)
!746 = distinct !DILexicalBlock(scope: !742, file: !3, line: 312, column: 3)
!747 = !DILocation(line: 312, column: 27, scope: !746)
!748 = !DILocation(line: 312, column: 32, scope: !746)
!749 = !DILocation(line: 312, column: 25, scope: !746)
!750 = !DILocation(line: 312, column: 41, scope: !746)
!751 = !DILocation(line: 312, column: 45, scope: !746)
!752 = !DILocation(line: 312, column: 49, scope: !746)
!753 = !DILocation(line: 312, column: 47, scope: !746)
!754 = !DILocation(line: 0, scope: !746)
!755 = !DILocation(line: 312, column: 3, scope: !742)
!756 = !DILocation(line: 313, column: 8, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !3, line: 313, column: 8)
!758 = distinct !DILexicalBlock(scope: !746, file: !3, line: 312, column: 71)
!759 = !DILocation(line: 313, column: 8, scope: !758)
!760 = !DILocation(line: 315, column: 16, scope: !761)
!761 = distinct !DILexicalBlock(scope: !757, file: !3, line: 313, column: 27)
!762 = !DILocation(line: 315, column: 22, scope: !761)
!763 = !DILocation(line: 315, column: 5, scope: !761)
!764 = !DILocation(line: 315, column: 10, scope: !761)
!765 = !DILocation(line: 315, column: 13, scope: !761)
!766 = !DILocation(line: 316, column: 16, scope: !761)
!767 = !DILocation(line: 316, column: 22, scope: !761)
!768 = !DILocation(line: 316, column: 5, scope: !761)
!769 = !DILocation(line: 316, column: 10, scope: !761)
!770 = !DILocation(line: 316, column: 13, scope: !761)
!771 = !DILocation(line: 317, column: 16, scope: !761)
!772 = !DILocation(line: 317, column: 22, scope: !761)
!773 = !DILocation(line: 317, column: 5, scope: !761)
!774 = !DILocation(line: 317, column: 10, scope: !761)
!775 = !DILocation(line: 317, column: 13, scope: !761)
!776 = !DILocation(line: 320, column: 9, scope: !777)
!777 = distinct !DILexicalBlock(scope: !761, file: !3, line: 320, column: 9)
!778 = !DILocation(line: 320, column: 13, scope: !777)
!779 = !DILocation(line: 320, column: 20, scope: !777)
!780 = !DILocation(line: 320, column: 11, scope: !777)
!781 = !DILocation(line: 320, column: 9, scope: !761)
!782 = !DILocation(line: 321, column: 9, scope: !777)
!783 = !DILocation(line: 321, column: 6, scope: !777)
!784 = !DILocation(line: 323, column: 6, scope: !777)
!785 = !DILocation(line: 324, column: 4, scope: !761)
!786 = !DILocation(line: 325, column: 3, scope: !758)
!787 = !DILocation(line: 312, column: 59, scope: !746)
!788 = !DILocation(line: 312, column: 67, scope: !746)
!789 = !DILocation(line: 312, column: 3, scope: !746)
!790 = distinct !{!790, !755, !791}
!791 = !DILocation(line: 325, column: 3, scope: !742)
!792 = !DILocation(line: 335, column: 9, scope: !718)
!793 = !DILocation(line: 335, column: 7, scope: !718)
!794 = !DILocation(line: 336, column: 10, scope: !795)
!795 = distinct !DILexicalBlock(scope: !718, file: !3, line: 336, column: 3)
!796 = !DILocation(line: 336, column: 8, scope: !795)
!797 = !DILocation(line: 336, column: 15, scope: !798)
!798 = distinct !DILexicalBlock(scope: !795, file: !3, line: 336, column: 3)
!799 = !DILocation(line: 336, column: 19, scope: !798)
!800 = !DILocation(line: 336, column: 17, scope: !798)
!801 = !DILocation(line: 336, column: 3, scope: !795)
!802 = !DILocation(line: 338, column: 8, scope: !803)
!803 = distinct !DILexicalBlock(scope: !804, file: !3, line: 338, column: 8)
!804 = distinct !DILexicalBlock(scope: !798, file: !3, line: 336, column: 39)
!805 = !DILocation(line: 338, column: 33, scope: !803)
!806 = !DILocation(line: 338, column: 8, scope: !804)
!807 = !DILocalVariable(name: "tP1", scope: !808, file: !3, line: 339, type: !809)
!808 = distinct !DILexicalBlock(scope: !803, file: !3, line: 338, column: 39)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!811 = !DILocation(line: 339, column: 25, scope: !808)
!812 = !DILocation(line: 339, column: 31, scope: !808)
!813 = !DILocation(line: 339, column: 35, scope: !808)
!814 = !DILocalVariable(name: "tP2", scope: !808, file: !3, line: 340, type: !809)
!815 = !DILocation(line: 340, column: 25, scope: !808)
!816 = !DILocation(line: 340, column: 32, scope: !808)
!817 = !DILocation(line: 340, column: 34, scope: !808)
!818 = !DILocation(line: 340, column: 38, scope: !808)
!819 = !DILocation(line: 340, column: 31, scope: !808)
!820 = !DILocation(line: 340, column: 46, scope: !808)
!821 = !DILocation(line: 340, column: 50, scope: !808)
!822 = !DILocalVariable(name: "tN1", scope: !808, file: !3, line: 341, type: !809)
!823 = !DILocation(line: 341, column: 25, scope: !808)
!824 = !DILocation(line: 341, column: 31, scope: !808)
!825 = !DILocation(line: 341, column: 35, scope: !808)
!826 = !DILocalVariable(name: "tN2", scope: !808, file: !3, line: 342, type: !809)
!827 = !DILocation(line: 342, column: 25, scope: !808)
!828 = !DILocation(line: 342, column: 32, scope: !808)
!829 = !DILocation(line: 342, column: 34, scope: !808)
!830 = !DILocation(line: 342, column: 40, scope: !808)
!831 = !DILocation(line: 342, column: 38, scope: !808)
!832 = !DILocation(line: 342, column: 31, scope: !808)
!833 = !DILocation(line: 342, column: 51, scope: !808)
!834 = !DILocation(line: 342, column: 55, scope: !808)
!835 = !DILocalVariable(name: "p1", scope: !808, file: !3, line: 344, type: !836)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!837 = !DILocation(line: 344, column: 17, scope: !808)
!838 = !DILocation(line: 344, column: 23, scope: !808)
!839 = !DILocation(line: 344, column: 28, scope: !808)
!840 = !DILocation(line: 344, column: 22, scope: !808)
!841 = !DILocalVariable(name: "p2", scope: !808, file: !3, line: 345, type: !836)
!842 = !DILocation(line: 345, column: 17, scope: !808)
!843 = !DILocation(line: 345, column: 23, scope: !808)
!844 = !DILocation(line: 345, column: 22, scope: !808)
!845 = !DILocation(line: 345, column: 32, scope: !808)
!846 = !DILocation(line: 345, column: 37, scope: !808)
!847 = !DILocation(line: 345, column: 31, scope: !808)
!848 = !DILocation(line: 345, column: 45, scope: !808)
!849 = !DILocation(line: 345, column: 50, scope: !808)
!850 = !DILocation(line: 345, column: 44, scope: !808)
!851 = !DILocalVariable(name: "c1", scope: !808, file: !3, line: 346, type: !836)
!852 = !DILocation(line: 346, column: 17, scope: !808)
!853 = !DILocation(line: 346, column: 23, scope: !808)
!854 = !DILocation(line: 346, column: 28, scope: !808)
!855 = !DILocation(line: 346, column: 22, scope: !808)
!856 = !DILocalVariable(name: "n1", scope: !808, file: !3, line: 347, type: !836)
!857 = !DILocation(line: 347, column: 17, scope: !808)
!858 = !DILocation(line: 347, column: 23, scope: !808)
!859 = !DILocation(line: 347, column: 28, scope: !808)
!860 = !DILocation(line: 347, column: 22, scope: !808)
!861 = !DILocalVariable(name: "n2", scope: !808, file: !3, line: 348, type: !836)
!862 = !DILocation(line: 348, column: 17, scope: !808)
!863 = !DILocation(line: 348, column: 23, scope: !808)
!864 = !DILocation(line: 348, column: 22, scope: !808)
!865 = !DILocation(line: 348, column: 32, scope: !808)
!866 = !DILocation(line: 348, column: 37, scope: !808)
!867 = !DILocation(line: 348, column: 31, scope: !808)
!868 = !DILocation(line: 348, column: 45, scope: !808)
!869 = !DILocation(line: 348, column: 50, scope: !808)
!870 = !DILocation(line: 348, column: 44, scope: !808)
!871 = !DILocation(line: 351, column: 20, scope: !808)
!872 = !DILocation(line: 351, column: 18, scope: !808)
!873 = !DILocation(line: 351, column: 29, scope: !808)
!874 = !DILocation(line: 351, column: 27, scope: !808)
!875 = !DILocation(line: 351, column: 23, scope: !808)
!876 = !DILocation(line: 351, column: 38, scope: !808)
!877 = !DILocation(line: 351, column: 36, scope: !808)
!878 = !DILocation(line: 351, column: 32, scope: !808)
!879 = !DILocation(line: 351, column: 43, scope: !808)
!880 = !DILocation(line: 351, column: 41, scope: !808)
!881 = !DILocation(line: 351, column: 48, scope: !808)
!882 = !DILocation(line: 351, column: 46, scope: !808)
!883 = !DILocation(line: 351, column: 52, scope: !808)
!884 = !DILocation(line: 351, column: 5, scope: !808)
!885 = !DILocation(line: 351, column: 10, scope: !808)
!886 = !DILocation(line: 351, column: 13, scope: !808)
!887 = !DILocation(line: 352, column: 16, scope: !808)
!888 = !DILocation(line: 352, column: 21, scope: !808)
!889 = !DILocation(line: 352, column: 19, scope: !808)
!890 = !DILocation(line: 352, column: 30, scope: !808)
!891 = !DILocation(line: 352, column: 28, scope: !808)
!892 = !DILocation(line: 352, column: 24, scope: !808)
!893 = !DILocation(line: 352, column: 39, scope: !808)
!894 = !DILocation(line: 352, column: 37, scope: !808)
!895 = !DILocation(line: 352, column: 33, scope: !808)
!896 = !DILocation(line: 352, column: 48, scope: !808)
!897 = !DILocation(line: 352, column: 46, scope: !808)
!898 = !DILocation(line: 352, column: 42, scope: !808)
!899 = !DILocation(line: 352, column: 52, scope: !808)
!900 = !DILocation(line: 352, column: 5, scope: !808)
!901 = !DILocation(line: 352, column: 10, scope: !808)
!902 = !DILocation(line: 352, column: 13, scope: !808)
!903 = !DILocation(line: 354, column: 16, scope: !808)
!904 = !DILocation(line: 354, column: 21, scope: !808)
!905 = !DILocation(line: 354, column: 26, scope: !808)
!906 = !DILocation(line: 354, column: 31, scope: !808)
!907 = !DILocation(line: 354, column: 24, scope: !808)
!908 = !DILocation(line: 354, column: 35, scope: !808)
!909 = !DILocation(line: 354, column: 5, scope: !808)
!910 = !DILocation(line: 354, column: 10, scope: !808)
!911 = !DILocation(line: 354, column: 13, scope: !808)
!912 = !DILocation(line: 355, column: 4, scope: !808)
!913 = !DILocation(line: 356, column: 3, scope: !804)
!914 = !DILocation(line: 336, column: 28, scope: !798)
!915 = !DILocation(line: 336, column: 35, scope: !798)
!916 = !DILocation(line: 336, column: 3, scope: !798)
!917 = distinct !{!917, !801, !918}
!918 = !DILocation(line: 356, column: 3, scope: !795)
!919 = !DILocation(line: 359, column: 9, scope: !718)
!920 = !DILocation(line: 359, column: 7, scope: !718)
!921 = !DILocation(line: 360, column: 10, scope: !922)
!922 = distinct !DILexicalBlock(scope: !718, file: !3, line: 360, column: 3)
!923 = !DILocation(line: 360, column: 8, scope: !922)
!924 = !DILocation(line: 360, column: 15, scope: !925)
!925 = distinct !DILexicalBlock(scope: !922, file: !3, line: 360, column: 3)
!926 = !DILocation(line: 360, column: 19, scope: !925)
!927 = !DILocation(line: 360, column: 17, scope: !925)
!928 = !DILocation(line: 360, column: 3, scope: !922)
!929 = !DILocation(line: 362, column: 8, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 362, column: 8)
!931 = distinct !DILexicalBlock(scope: !925, file: !3, line: 360, column: 39)
!932 = !DILocation(line: 362, column: 33, scope: !930)
!933 = !DILocation(line: 362, column: 8, scope: !931)
!934 = !DILocation(line: 364, column: 16, scope: !935)
!935 = distinct !DILexicalBlock(scope: !930, file: !3, line: 362, column: 39)
!936 = !DILocation(line: 364, column: 21, scope: !935)
!937 = !DILocation(line: 364, column: 6, scope: !935)
!938 = !DILocation(line: 364, column: 11, scope: !935)
!939 = !DILocation(line: 364, column: 14, scope: !935)
!940 = !DILocation(line: 367, column: 19, scope: !935)
!941 = !DILocation(line: 367, column: 24, scope: !935)
!942 = !DILocation(line: 367, column: 18, scope: !935)
!943 = !DILocation(line: 367, column: 28, scope: !935)
!944 = !DILocation(line: 367, column: 39, scope: !935)
!945 = !DILocation(line: 367, column: 44, scope: !935)
!946 = !DILocation(line: 367, column: 47, scope: !935)
!947 = !DILocation(line: 367, column: 36, scope: !935)
!948 = !DILocation(line: 367, column: 6, scope: !935)
!949 = !DILocation(line: 367, column: 11, scope: !935)
!950 = !DILocation(line: 367, column: 14, scope: !935)
!951 = !DILocation(line: 368, column: 19, scope: !935)
!952 = !DILocation(line: 368, column: 24, scope: !935)
!953 = !DILocation(line: 368, column: 18, scope: !935)
!954 = !DILocation(line: 368, column: 28, scope: !935)
!955 = !DILocation(line: 368, column: 39, scope: !935)
!956 = !DILocation(line: 368, column: 44, scope: !935)
!957 = !DILocation(line: 368, column: 47, scope: !935)
!958 = !DILocation(line: 368, column: 36, scope: !935)
!959 = !DILocation(line: 368, column: 6, scope: !935)
!960 = !DILocation(line: 368, column: 11, scope: !935)
!961 = !DILocation(line: 368, column: 14, scope: !935)
!962 = !DILocation(line: 369, column: 4, scope: !935)
!963 = !DILocation(line: 370, column: 3, scope: !931)
!964 = !DILocation(line: 360, column: 28, scope: !925)
!965 = !DILocation(line: 360, column: 35, scope: !925)
!966 = !DILocation(line: 360, column: 3, scope: !925)
!967 = distinct !{!967, !928, !968}
!968 = !DILocation(line: 370, column: 3, scope: !922)
!969 = !DILocation(line: 373, column: 3, scope: !718)
!970 = !DILocation(line: 373, column: 13, scope: !718)
!971 = !DILocation(line: 374, column: 2, scope: !718)
!972 = !DILocation(line: 377, column: 21, scope: !671)
!973 = !DILocation(line: 377, column: 2, scope: !671)
!974 = !DILocation(line: 378, column: 1, scope: !671)
!975 = distinct !DISubprogram(name: "sample_fcurve", scope: !3, file: !3, line: 389, type: !349, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!976 = !DILocalVariable(name: "fcu", arg: 1, scope: !975, file: !3, line: 389, type: !68)
!977 = !DILocation(line: 389, column: 28, scope: !975)
!978 = !DILocalVariable(name: "bezt", scope: !975, file: !3, line: 391, type: !129)
!979 = !DILocation(line: 391, column: 13, scope: !975)
!980 = !DILocalVariable(name: "start", scope: !975, file: !3, line: 391, type: !129)
!981 = !DILocation(line: 391, column: 20, scope: !975)
!982 = !DILocalVariable(name: "end", scope: !975, file: !3, line: 391, type: !129)
!983 = !DILocation(line: 391, column: 35, scope: !975)
!984 = !DILocalVariable(name: "value_cache", scope: !975, file: !3, line: 392, type: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "TempFrameValCache", file: !3, line: 385, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TempFrameValCache", file: !3, line: 383, size: 64, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !987, file: !3, line: 384, baseType: !67, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !987, file: !3, line: 384, baseType: !67, size: 32, offset: 32)
!991 = !DILocation(line: 392, column: 21, scope: !975)
!992 = !DILocalVariable(name: "fp", scope: !975, file: !3, line: 392, type: !985)
!993 = !DILocation(line: 392, column: 35, scope: !975)
!994 = !DILocalVariable(name: "sfra", scope: !975, file: !3, line: 393, type: !66)
!995 = !DILocation(line: 393, column: 6, scope: !975)
!996 = !DILocalVariable(name: "range", scope: !975, file: !3, line: 393, type: !66)
!997 = !DILocation(line: 393, column: 12, scope: !975)
!998 = !DILocalVariable(name: "i", scope: !975, file: !3, line: 394, type: !66)
!999 = !DILocation(line: 394, column: 6, scope: !975)
!1000 = !DILocalVariable(name: "n", scope: !975, file: !3, line: 394, type: !66)
!1001 = !DILocation(line: 394, column: 9, scope: !975)
!1002 = !DILocalVariable(name: "nIndex", scope: !975, file: !3, line: 394, type: !66)
!1003 = !DILocation(line: 394, column: 12, scope: !975)
!1004 = !DILocation(line: 396, column: 6, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !975, file: !3, line: 396, column: 6)
!1006 = !DILocation(line: 396, column: 11, scope: !1005)
!1007 = !DILocation(line: 396, column: 16, scope: !1005)
!1008 = !DILocation(line: 396, column: 6, scope: !975)
!1009 = !DILocation(line: 397, column: 3, scope: !1005)
!1010 = !DILocation(line: 400, column: 9, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !975, file: !3, line: 400, column: 2)
!1012 = !DILocation(line: 400, column: 21, scope: !1011)
!1013 = !DILocation(line: 400, column: 26, scope: !1011)
!1014 = !DILocation(line: 400, column: 19, scope: !1011)
!1015 = !DILocation(line: 400, column: 7, scope: !1011)
!1016 = !DILocation(line: 400, column: 32, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 400, column: 2)
!1018 = !DILocation(line: 400, column: 36, scope: !1017)
!1019 = !DILocation(line: 400, column: 41, scope: !1017)
!1020 = !DILocation(line: 400, column: 34, scope: !1017)
!1021 = !DILocation(line: 400, column: 2, scope: !1011)
!1022 = !DILocation(line: 402, column: 7, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 402, column: 7)
!1024 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 400, column: 63)
!1025 = !DILocation(line: 402, column: 7, scope: !1024)
!1026 = !DILocation(line: 403, column: 8, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 403, column: 8)
!1028 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 402, column: 26)
!1029 = !DILocation(line: 403, column: 8, scope: !1028)
!1030 = !DILocation(line: 405, column: 11, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 403, column: 15)
!1032 = !DILocation(line: 405, column: 9, scope: !1031)
!1033 = !DILocation(line: 411, column: 24, scope: !1031)
!1034 = !DILocation(line: 411, column: 29, scope: !1031)
!1035 = !DILocation(line: 411, column: 41, scope: !1031)
!1036 = !DILocation(line: 411, column: 48, scope: !1031)
!1037 = !DILocation(line: 411, column: 39, scope: !1031)
!1038 = !DILocation(line: 411, column: 19, scope: !1031)
!1039 = !DILocation(line: 411, column: 13, scope: !1031)
!1040 = !DILocation(line: 411, column: 11, scope: !1031)
!1041 = !DILocation(line: 412, column: 24, scope: !1031)
!1042 = !DILocation(line: 412, column: 31, scope: !1031)
!1043 = !DILocation(line: 412, column: 18, scope: !1031)
!1044 = !DILocation(line: 412, column: 12, scope: !1031)
!1045 = !DILocation(line: 412, column: 10, scope: !1031)
!1046 = !DILocation(line: 414, column: 9, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 414, column: 9)
!1048 = !DILocation(line: 414, column: 9, scope: !1031)
!1049 = !DILocation(line: 415, column: 20, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 414, column: 16)
!1051 = !DILocation(line: 415, column: 60, scope: !1050)
!1052 = !DILocation(line: 415, column: 58, scope: !1050)
!1053 = !DILocation(line: 415, column: 18, scope: !1050)
!1054 = !DILocation(line: 418, column: 13, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 418, column: 6)
!1056 = !DILocation(line: 418, column: 23, scope: !1055)
!1057 = !DILocation(line: 418, column: 21, scope: !1055)
!1058 = !DILocation(line: 418, column: 11, scope: !1055)
!1059 = !DILocation(line: 418, column: 36, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 418, column: 6)
!1061 = !DILocation(line: 418, column: 40, scope: !1060)
!1062 = !DILocation(line: 418, column: 38, scope: !1060)
!1063 = !DILocation(line: 418, column: 46, scope: !1060)
!1064 = !DILocation(line: 418, column: 49, scope: !1060)
!1065 = !DILocation(line: 0, scope: !1060)
!1066 = !DILocation(line: 418, column: 6, scope: !1055)
!1067 = !DILocation(line: 419, column: 27, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 418, column: 64)
!1069 = !DILocation(line: 419, column: 34, scope: !1068)
!1070 = !DILocation(line: 419, column: 32, scope: !1068)
!1071 = !DILocation(line: 419, column: 19, scope: !1068)
!1072 = !DILocation(line: 419, column: 7, scope: !1068)
!1073 = !DILocation(line: 419, column: 11, scope: !1068)
!1074 = !DILocation(line: 419, column: 17, scope: !1068)
!1075 = !DILocation(line: 420, column: 33, scope: !1068)
!1076 = !DILocation(line: 420, column: 38, scope: !1068)
!1077 = !DILocation(line: 420, column: 42, scope: !1068)
!1078 = !DILocation(line: 420, column: 17, scope: !1068)
!1079 = !DILocation(line: 420, column: 7, scope: !1068)
!1080 = !DILocation(line: 420, column: 11, scope: !1068)
!1081 = !DILocation(line: 420, column: 15, scope: !1068)
!1082 = !DILocation(line: 421, column: 6, scope: !1068)
!1083 = !DILocation(line: 418, column: 54, scope: !1060)
!1084 = !DILocation(line: 418, column: 60, scope: !1060)
!1085 = !DILocation(line: 418, column: 6, scope: !1060)
!1086 = distinct !{!1086, !1066, !1087}
!1087 = !DILocation(line: 421, column: 6, scope: !1055)
!1088 = !DILocation(line: 424, column: 13, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 424, column: 6)
!1090 = !DILocation(line: 424, column: 23, scope: !1089)
!1091 = !DILocation(line: 424, column: 21, scope: !1089)
!1092 = !DILocation(line: 424, column: 11, scope: !1089)
!1093 = !DILocation(line: 424, column: 36, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 424, column: 6)
!1095 = !DILocation(line: 424, column: 40, scope: !1094)
!1096 = !DILocation(line: 424, column: 38, scope: !1094)
!1097 = !DILocation(line: 424, column: 46, scope: !1094)
!1098 = !DILocation(line: 424, column: 49, scope: !1094)
!1099 = !DILocation(line: 0, scope: !1094)
!1100 = !DILocation(line: 424, column: 6, scope: !1089)
!1101 = !DILocation(line: 425, column: 35, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 424, column: 64)
!1103 = !DILocation(line: 425, column: 40, scope: !1102)
!1104 = !DILocation(line: 425, column: 44, scope: !1102)
!1105 = !DILocation(line: 425, column: 51, scope: !1102)
!1106 = !DILocation(line: 425, column: 55, scope: !1102)
!1107 = !DILocation(line: 425, column: 16, scope: !1102)
!1108 = !DILocation(line: 425, column: 14, scope: !1102)
!1109 = !DILocation(line: 426, column: 7, scope: !1102)
!1110 = !DILocation(line: 426, column: 38, scope: !1102)
!1111 = !DILocation(line: 427, column: 6, scope: !1102)
!1112 = !DILocation(line: 424, column: 54, scope: !1094)
!1113 = !DILocation(line: 424, column: 60, scope: !1094)
!1114 = !DILocation(line: 424, column: 6, scope: !1094)
!1115 = distinct !{!1115, !1100, !1116}
!1116 = !DILocation(line: 427, column: 6, scope: !1089)
!1117 = !DILocation(line: 430, column: 6, scope: !1050)
!1118 = !DILocation(line: 430, column: 16, scope: !1050)
!1119 = !DILocation(line: 433, column: 13, scope: !1050)
!1120 = !DILocation(line: 433, column: 18, scope: !1050)
!1121 = !DILocation(line: 433, column: 25, scope: !1050)
!1122 = !DILocation(line: 433, column: 23, scope: !1050)
!1123 = !DILocation(line: 433, column: 29, scope: !1050)
!1124 = !DILocation(line: 433, column: 27, scope: !1050)
!1125 = !DILocation(line: 433, column: 35, scope: !1050)
!1126 = !DILocation(line: 433, column: 11, scope: !1050)
!1127 = !DILocation(line: 434, column: 12, scope: !1050)
!1128 = !DILocation(line: 434, column: 18, scope: !1050)
!1129 = !DILocation(line: 434, column: 8, scope: !1050)
!1130 = !DILocation(line: 435, column: 5, scope: !1050)
!1131 = !DILocation(line: 438, column: 13, scope: !1031)
!1132 = !DILocation(line: 438, column: 11, scope: !1031)
!1133 = !DILocation(line: 439, column: 9, scope: !1031)
!1134 = !DILocation(line: 440, column: 4, scope: !1031)
!1135 = !DILocation(line: 443, column: 13, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 441, column: 9)
!1137 = !DILocation(line: 443, column: 11, scope: !1136)
!1138 = !DILocation(line: 444, column: 9, scope: !1136)
!1139 = !DILocation(line: 446, column: 3, scope: !1028)
!1140 = !DILocation(line: 447, column: 2, scope: !1024)
!1141 = !DILocation(line: 400, column: 51, scope: !1017)
!1142 = !DILocation(line: 400, column: 59, scope: !1017)
!1143 = !DILocation(line: 400, column: 2, scope: !1017)
!1144 = distinct !{!1144, !1021, !1145}
!1145 = !DILocation(line: 447, column: 2, scope: !1011)
!1146 = !DILocation(line: 450, column: 21, scope: !975)
!1147 = !DILocation(line: 450, column: 2, scope: !975)
!1148 = !DILocation(line: 451, column: 1, scope: !975)
!1149 = distinct !DISubprogram(name: "free_anim_copybuf", scope: !3, file: !3, line: 486, type: !1150, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{null}
!1152 = !DILocalVariable(name: "aci", scope: !1149, file: !3, line: 488, type: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "tAnimCopybufItem", file: !3, line: 481, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tAnimCopybufItem", file: !3, line: 469, size: 512, elements: !1156)
!1156 = !{!1157, !1159, !1160, !1219, !1220, !1221, !1222, !1223, !1224}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1155, file: !3, line: 470, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1155, file: !3, line: 470, baseType: !1158, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1155, file: !3, line: 472, baseType: !1161, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1163, line: 130, baseType: !1164)
!1163 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1163, line: 117, size: 960, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1170, !1188, !1192, !1193, !1194, !1195, !1196}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1164, file: !1163, line: 118, baseType: !65, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1164, file: !1163, line: 118, baseType: !65, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1164, file: !1163, line: 119, baseType: !1169, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1164, file: !1163, line: 120, baseType: !1171, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1163, line: 136, size: 17600, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1179, !1183, !1184, !1185}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1172, file: !1163, line: 137, baseType: !1162, size: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1172, file: !1163, line: 138, baseType: !1161, size: 64, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1172, file: !1163, line: 139, baseType: !1177, size: 64, offset: 1024)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1163, line: 43, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1172, file: !1163, line: 140, baseType: !1180, size: 8192, offset: 1088)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 8192, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 1024)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1172, file: !1163, line: 141, baseType: !1180, size: 8192, offset: 9280)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1172, file: !1163, line: 148, baseType: !1171, size: 64, offset: 17472)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1172, file: !1163, line: 150, baseType: !1186, size: 64, offset: 17536)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1163, line: 45, flags: DIFlagFwdDecl)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1164, file: !1163, line: 121, baseType: !1189, size: 528, offset: 256)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 528, elements: !1190)
!1190 = !{!1191}
!1191 = !DISubrange(count: 66)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1164, file: !1163, line: 126, baseType: !110, size: 16, offset: 784)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1164, file: !1163, line: 127, baseType: !66, size: 32, offset: 800)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1164, file: !1163, line: 128, baseType: !66, size: 32, offset: 832)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1164, file: !1163, line: 128, baseType: !66, size: 32, offset: 864)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1164, file: !1163, line: 129, baseType: !1197, size: 64, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1163, line: 75, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1163, line: 62, size: 1024, elements: !1200)
!1200 = !{!1201, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1217, !1218}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1199, file: !1163, line: 63, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1199, file: !1163, line: 63, baseType: !1202, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1199, file: !1163, line: 64, baseType: !95, size: 8, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1199, file: !1163, line: 64, baseType: !95, size: 8, offset: 136)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1199, file: !1163, line: 65, baseType: !110, size: 16, offset: 144)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1199, file: !1163, line: 66, baseType: !94, size: 512, offset: 160)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1199, file: !1163, line: 67, baseType: !66, size: 32, offset: 672)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !1163, line: 69, baseType: !1210, size: 256, offset: 704)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1163, line: 60, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1163, line: 48, size: 256, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1211, file: !1163, line: 49, baseType: !65, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1211, file: !1163, line: 58, baseType: !85, size: 128, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1211, file: !1163, line: 59, baseType: !66, size: 32, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1211, file: !1163, line: 59, baseType: !66, size: 32, offset: 224)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1199, file: !1163, line: 70, baseType: !66, size: 32, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1199, file: !1163, line: 74, baseType: !66, size: 32, offset: 992)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !1155, file: !3, line: 473, baseType: !76, size: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !1155, file: !3, line: 474, baseType: !169, size: 64, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !1155, file: !3, line: 475, baseType: !66, size: 32, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !1155, file: !3, line: 477, baseType: !66, size: 32, offset: 352)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !1155, file: !3, line: 478, baseType: !129, size: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "id_type", scope: !1155, file: !3, line: 480, baseType: !110, size: 16, offset: 448)
!1225 = !DILocation(line: 488, column: 20, scope: !1149)
!1226 = !DILocalVariable(name: "acn", scope: !1149, file: !3, line: 488, type: !1153)
!1227 = !DILocation(line: 488, column: 26, scope: !1149)
!1228 = !DILocation(line: 491, column: 25, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 491, column: 2)
!1230 = !DILocation(line: 491, column: 13, scope: !1229)
!1231 = !DILocation(line: 491, column: 11, scope: !1229)
!1232 = !DILocation(line: 491, column: 7, scope: !1229)
!1233 = !DILocation(line: 491, column: 32, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1229, file: !3, line: 491, column: 2)
!1235 = !DILocation(line: 491, column: 2, scope: !1229)
!1236 = !DILocation(line: 492, column: 9, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 491, column: 48)
!1238 = !DILocation(line: 492, column: 14, scope: !1237)
!1239 = !DILocation(line: 492, column: 7, scope: !1237)
!1240 = !DILocation(line: 495, column: 7, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1237, file: !3, line: 495, column: 7)
!1242 = !DILocation(line: 495, column: 12, scope: !1241)
!1243 = !DILocation(line: 495, column: 7, scope: !1237)
!1244 = !DILocation(line: 496, column: 4, scope: !1241)
!1245 = !DILocation(line: 496, column: 14, scope: !1241)
!1246 = !DILocation(line: 496, column: 19, scope: !1241)
!1247 = !DILocation(line: 499, column: 7, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1237, file: !3, line: 499, column: 7)
!1249 = !DILocation(line: 499, column: 12, scope: !1248)
!1250 = !DILocation(line: 499, column: 7, scope: !1237)
!1251 = !DILocation(line: 500, column: 4, scope: !1248)
!1252 = !DILocation(line: 500, column: 14, scope: !1248)
!1253 = !DILocation(line: 500, column: 19, scope: !1248)
!1254 = !DILocation(line: 503, column: 31, scope: !1237)
!1255 = !DILocation(line: 503, column: 3, scope: !1237)
!1256 = !DILocation(line: 504, column: 2, scope: !1237)
!1257 = !DILocation(line: 491, column: 43, scope: !1234)
!1258 = !DILocation(line: 491, column: 41, scope: !1234)
!1259 = !DILocation(line: 491, column: 2, scope: !1234)
!1260 = distinct !{!1260, !1235, !1261}
!1261 = !DILocation(line: 504, column: 2, scope: !1229)
!1262 = !DILocation(line: 507, column: 2, scope: !1149)
!1263 = !DILocation(line: 508, column: 22, scope: !1149)
!1264 = !DILocation(line: 509, column: 21, scope: !1149)
!1265 = !DILocation(line: 510, column: 1, scope: !1149)
!1266 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !1267, file: !1267, line: 89, type: !1268, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !210)
!1267 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1268 = !DISubroutineType(types: !1269)
!1269 = !{null, !1270}
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!1271 = !DILocalVariable(name: "lb", arg: 1, scope: !1266, file: !1267, line: 89, type: !1270)
!1272 = !DILocation(line: 89, column: 53, scope: !1266)
!1273 = !DILocation(line: 89, column: 71, scope: !1266)
!1274 = !DILocation(line: 89, column: 75, scope: !1266)
!1275 = !DILocation(line: 89, column: 80, scope: !1266)
!1276 = !DILocation(line: 89, column: 59, scope: !1266)
!1277 = !DILocation(line: 89, column: 63, scope: !1266)
!1278 = !DILocation(line: 89, column: 69, scope: !1266)
!1279 = !DILocation(line: 89, column: 93, scope: !1266)
!1280 = distinct !DISubprogram(name: "copy_animedit_keys", scope: !3, file: !3, line: 515, type: !1281, scopeLine: 516, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !210)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!110, !1283, !1618}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimContext", file: !48, line: 89, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimContext", file: !48, line: 71, size: 640, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1291, !1292, !1295, !1298, !1301, !1315, !2417, !2418, !2419}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1285, file: !48, line: 72, baseType: !65, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !1285, file: !48, line: 73, baseType: !110, size: 16, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1285, file: !48, line: 75, baseType: !110, size: 16, offset: 80)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1285, file: !48, line: 76, baseType: !110, size: 16, offset: 96)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !1285, file: !48, line: 77, baseType: !110, size: 16, offset: 112)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1285, file: !48, line: 78, baseType: !1293, size: 64, offset: 128)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !48, line: 41, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "sl", scope: !1285, file: !48, line: 79, baseType: !1296, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !78, line: 44, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ar", scope: !1285, file: !48, line: 80, baseType: !1299, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !48, line: 43, flags: DIFlagFwdDecl)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !1285, file: !48, line: 82, baseType: !1302, size: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDopeSheet", file: !78, line: 519, size: 896, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1310, !1311, !1312, !1313, !1314}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1303, file: !78, line: 520, baseType: !1161, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1303, file: !78, line: 521, baseType: !85, size: 128, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "filter_grp", scope: !1303, file: !78, line: 523, baseType: !1308, size: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !78, line: 46, flags: DIFlagFwdDecl)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "searchstr", scope: !1303, file: !78, line: 524, baseType: !94, size: 512, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "filterflag", scope: !1303, file: !78, line: 526, baseType: !66, size: 32, offset: 768)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1303, file: !78, line: 527, baseType: !66, size: 32, offset: 800)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "renameIndex", scope: !1303, file: !78, line: 529, baseType: !66, size: 32, offset: 832)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1303, file: !78, line: 530, baseType: !66, size: 32, offset: 864)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1285, file: !48, line: 84, baseType: !1316, size: 64, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1318, line: 1216, size: 39680, elements: !1319)
!1318 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1319 = !{!1320, !1321, !1389, !1658, !1661, !1662, !1663, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1689, !1692, !1695, !1988, !1991, !2290, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2312, !2313, !2314, !2315, !2316, !2324, !2391, !2398, !2399, !2406, !2409, !2410, !2411, !2412, !2413, !2414}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1317, file: !1318, line: 1217, baseType: !1162, size: 960)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1317, file: !1318, line: 1218, baseType: !1322, size: 64, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !54, line: 838, size: 768, elements: !1324)
!1324 = !{!1325, !1339, !1340, !1350, !1351, !1382, !1383, !1384, !1385, !1386, !1387, !1388}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1323, file: !54, line: 840, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !78, line: 499, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !78, line: 486, size: 1600, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1328, file: !78, line: 487, baseType: !1162, size: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1328, file: !78, line: 489, baseType: !85, size: 128, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1328, file: !78, line: 490, baseType: !85, size: 128, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1328, file: !78, line: 491, baseType: !85, size: 128, offset: 1216)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1328, file: !78, line: 492, baseType: !85, size: 128, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1328, file: !78, line: 494, baseType: !66, size: 32, offset: 1472)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1328, file: !78, line: 495, baseType: !66, size: 32, offset: 1504)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1328, file: !78, line: 497, baseType: !66, size: 32, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1328, file: !78, line: 498, baseType: !66, size: 32, offset: 1568)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1323, file: !54, line: 844, baseType: !1326, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1323, file: !54, line: 848, baseType: !1341, size: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !54, line: 549, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !54, line: 544, size: 320, elements: !1344)
!1344 = !{!1345, !1347, !1348, !1349}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1343, file: !54, line: 545, baseType: !1346, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1343, file: !54, line: 545, baseType: !1346, size: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1343, file: !54, line: 547, baseType: !1326, size: 64, offset: 128)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1343, file: !54, line: 548, baseType: !85, size: 128, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1323, file: !54, line: 851, baseType: !85, size: 128, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1323, file: !54, line: 853, baseType: !1352, size: 64, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !54, line: 594, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !54, line: 561, size: 1664, elements: !1355)
!1355 = !{!1356, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1354, file: !54, line: 562, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1354, file: !54, line: 562, baseType: !1357, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1354, file: !54, line: 564, baseType: !85, size: 128, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1354, file: !54, line: 565, baseType: !1326, size: 64, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1354, file: !54, line: 566, baseType: !1341, size: 64, offset: 320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1354, file: !54, line: 568, baseType: !85, size: 128, offset: 384)
