; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_geom.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_geom.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!52 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!53 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!54 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!55 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!56 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!58 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!59 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!60 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!61 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!62 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUBuiltin", file: !9, line: 82, baseType: !10, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75}
!68 = !DIEnumerator(name: "GPU_VIEW_MATRIX", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "GPU_OBJECT_MATRIX", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "GPU_INVERSE_VIEW_MATRIX", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "GPU_INVERSE_OBJECT_MATRIX", value: 8, isUnsigned: true)
!72 = !DIEnumerator(name: "GPU_VIEW_POSITION", value: 16, isUnsigned: true)
!73 = !DIEnumerator(name: "GPU_VIEW_NORMAL", value: 32, isUnsigned: true)
!74 = !DIEnumerator(name: "GPU_OBCOLOR", value: 64, isUnsigned: true)
!75 = !DIEnumerator(name: "GPU_AUTO_BUMPSCALE", value: 128, isUnsigned: true)
!76 = !{!77, !2464}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShaderCallData", file: !79, line: 92, baseType: !80)
!79 = !DIFile(filename: "blender/source/blender/nodes/shader/node_shader_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderCallData", file: !79, line: 89, size: 128, elements: !81)
!81 = !{!82, !2441}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "shi", scope: !80, file: !79, line: 90, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShadeInput", file: !85, line: 186, baseType: !86)
!85 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_shader_ext.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShadeInput", file: !85, line: 98, size: 11776, elements: !87)
!87 = !{!88, !2295, !2298, !2301, !2304, !2307, !2308, !2309, !2310, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2385, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !86, file: !85, line: 102, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !91, line: 93, size: 7552, elements: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !{!93, !165, !168, !169, !170, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !218, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !287, !288, !289, !290, !291, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2294}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !90, file: !91, line: 94, baseType: !94, size: 960)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !95, line: 130, baseType: !96)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !95, line: 117, size: 960, elements: !97)
!97 = !{!98, !100, !101, !103, !123, !127, !129, !131, !132, !133}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !95, line: 118, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !95, line: 118, baseType: !99, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !96, file: !95, line: 119, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !96, file: !95, line: 120, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !95, line: 136, size: 17600, elements: !106)
!106 = !{!107, !108, !110, !113, !118, !119, !120}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !95, line: 137, baseType: !94, size: 960)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !105, file: !95, line: 138, baseType: !109, size: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !105, file: !95, line: 139, baseType: !111, size: 64, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !95, line: 43, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !95, line: 140, baseType: !114, size: 8192, offset: 1088)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8192, elements: !116)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !{!117}
!117 = !DISubrange(count: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !105, file: !95, line: 141, baseType: !114, size: 8192, offset: 9280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !105, file: !95, line: 148, baseType: !104, size: 64, offset: 17472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !105, file: !95, line: 150, baseType: !121, size: 64, offset: 17536)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !95, line: 45, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !95, line: 121, baseType: !124, size: 528, offset: 256)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 528, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 66)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !96, file: !95, line: 126, baseType: !128, size: 16, offset: 784)
!128 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !96, file: !95, line: 127, baseType: !130, size: 32, offset: 800)
!130 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !96, file: !95, line: 128, baseType: !130, size: 32, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !96, file: !95, line: 128, baseType: !130, size: 32, offset: 864)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !96, file: !95, line: 129, baseType: !134, size: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !95, line: 75, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !95, line: 62, size: 1024, elements: !137)
!137 = !{!138, !140, !141, !142, !143, !144, !148, !149, !163, !164}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !95, line: 63, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !136, file: !95, line: 63, baseType: !139, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !136, file: !95, line: 64, baseType: !115, size: 8, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !136, file: !95, line: 64, baseType: !115, size: 8, offset: 136)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !136, file: !95, line: 65, baseType: !128, size: 16, offset: 144)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !95, line: 66, baseType: !145, size: 512, offset: 160)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !136, file: !95, line: 67, baseType: !130, size: 32, offset: 672)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !95, line: 69, baseType: !150, size: 256, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !95, line: 60, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !95, line: 48, size: 256, elements: !152)
!152 = !{!153, !154, !161, !162}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !151, file: !95, line: 49, baseType: !99, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !151, file: !95, line: 58, baseType: !155, size: 128, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !156, line: 71, baseType: !157)
!156 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !156, line: 69, size: 128, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !157, file: !156, line: 70, baseType: !99, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !157, file: !156, line: 70, baseType: !99, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !151, file: !95, line: 59, baseType: !130, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !151, file: !95, line: 59, baseType: !130, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !95, line: 70, baseType: !130, size: 32, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !136, file: !95, line: 74, baseType: !130, size: 32, offset: 992)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !90, file: !91, line: 95, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !91, line: 48, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !90, file: !91, line: 97, baseType: !128, size: 16, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !90, file: !91, line: 97, baseType: !128, size: 16, offset: 1040)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !90, file: !91, line: 99, baseType: !171, size: 32, offset: 1056)
!171 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !90, file: !91, line: 99, baseType: !171, size: 32, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !90, file: !91, line: 99, baseType: !171, size: 32, offset: 1120)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !90, file: !91, line: 100, baseType: !171, size: 32, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !90, file: !91, line: 100, baseType: !171, size: 32, offset: 1184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !90, file: !91, line: 100, baseType: !171, size: 32, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !90, file: !91, line: 101, baseType: !171, size: 32, offset: 1248)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !90, file: !91, line: 101, baseType: !171, size: 32, offset: 1280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !90, file: !91, line: 101, baseType: !171, size: 32, offset: 1312)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !90, file: !91, line: 102, baseType: !171, size: 32, offset: 1344)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !90, file: !91, line: 102, baseType: !171, size: 32, offset: 1376)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !90, file: !91, line: 102, baseType: !171, size: 32, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !90, file: !91, line: 103, baseType: !171, size: 32, offset: 1440)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !90, file: !91, line: 103, baseType: !171, size: 32, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !90, file: !91, line: 103, baseType: !171, size: 32, offset: 1504)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !90, file: !91, line: 103, baseType: !171, size: 32, offset: 1536)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !90, file: !91, line: 103, baseType: !171, size: 32, offset: 1568)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !90, file: !91, line: 104, baseType: !171, size: 32, offset: 1600)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !90, file: !91, line: 104, baseType: !171, size: 32, offset: 1632)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !90, file: !91, line: 104, baseType: !171, size: 32, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !90, file: !91, line: 104, baseType: !171, size: 32, offset: 1696)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !90, file: !91, line: 104, baseType: !171, size: 32, offset: 1728)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !90, file: !91, line: 105, baseType: !171, size: 32, offset: 1760)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !90, file: !91, line: 108, baseType: !195, size: 704, offset: 1792)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !91, line: 53, size: 704, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !195, file: !91, line: 54, baseType: !171, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !195, file: !91, line: 55, baseType: !171, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !195, file: !91, line: 56, baseType: !171, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !195, file: !91, line: 57, baseType: !171, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !195, file: !91, line: 59, baseType: !202, size: 96, offset: 128)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 96, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 3)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !195, file: !91, line: 60, baseType: !202, size: 96, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !195, file: !91, line: 61, baseType: !202, size: 96, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !195, file: !91, line: 63, baseType: !171, size: 32, offset: 416)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !195, file: !91, line: 64, baseType: !171, size: 32, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !195, file: !91, line: 65, baseType: !171, size: 32, offset: 480)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !195, file: !91, line: 67, baseType: !128, size: 16, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !195, file: !91, line: 68, baseType: !128, size: 16, offset: 528)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !195, file: !91, line: 69, baseType: !128, size: 16, offset: 544)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !195, file: !91, line: 70, baseType: !128, size: 16, offset: 560)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !195, file: !91, line: 72, baseType: !171, size: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !195, file: !91, line: 73, baseType: !171, size: 32, offset: 608)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !195, file: !91, line: 74, baseType: !171, size: 32, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !195, file: !91, line: 75, baseType: !171, size: 32, offset: 672)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !90, file: !91, line: 109, baseType: !219, size: 128, offset: 2496)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !91, line: 79, size: 128, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !91, line: 80, baseType: !130, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !219, file: !91, line: 81, baseType: !130, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !219, file: !91, line: 82, baseType: !130, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !219, file: !91, line: 83, baseType: !130, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !90, file: !91, line: 111, baseType: !171, size: 32, offset: 2624)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !90, file: !91, line: 111, baseType: !171, size: 32, offset: 2656)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !90, file: !91, line: 112, baseType: !171, size: 32, offset: 2688)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !90, file: !91, line: 112, baseType: !171, size: 32, offset: 2720)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !90, file: !91, line: 113, baseType: !171, size: 32, offset: 2752)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !90, file: !91, line: 114, baseType: !171, size: 32, offset: 2784)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !90, file: !91, line: 114, baseType: !171, size: 32, offset: 2816)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !90, file: !91, line: 115, baseType: !128, size: 16, offset: 2848)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !90, file: !91, line: 115, baseType: !128, size: 16, offset: 2864)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !90, file: !91, line: 116, baseType: !128, size: 16, offset: 2880)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !90, file: !91, line: 117, baseType: !115, size: 8, offset: 2896)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !90, file: !91, line: 117, baseType: !115, size: 8, offset: 2904)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !90, file: !91, line: 119, baseType: !171, size: 32, offset: 2912)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !90, file: !91, line: 119, baseType: !171, size: 32, offset: 2944)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !90, file: !91, line: 120, baseType: !128, size: 16, offset: 2976)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !90, file: !91, line: 120, baseType: !128, size: 16, offset: 2992)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !90, file: !91, line: 121, baseType: !171, size: 32, offset: 3008)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !90, file: !91, line: 121, baseType: !171, size: 32, offset: 3040)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !90, file: !91, line: 122, baseType: !171, size: 32, offset: 3072)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !90, file: !91, line: 123, baseType: !171, size: 32, offset: 3104)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !90, file: !91, line: 124, baseType: !128, size: 16, offset: 3136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !90, file: !91, line: 125, baseType: !128, size: 16, offset: 3152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !90, file: !91, line: 127, baseType: !130, size: 32, offset: 3168)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !90, file: !91, line: 127, baseType: !130, size: 32, offset: 3200)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !90, file: !91, line: 128, baseType: !130, size: 32, offset: 3232)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !90, file: !91, line: 128, baseType: !130, size: 32, offset: 3264)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !90, file: !91, line: 129, baseType: !128, size: 16, offset: 3296)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !90, file: !91, line: 129, baseType: !128, size: 16, offset: 3312)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !90, file: !91, line: 129, baseType: !128, size: 16, offset: 3328)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !90, file: !91, line: 129, baseType: !128, size: 16, offset: 3344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !90, file: !91, line: 130, baseType: !171, size: 32, offset: 3360)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !90, file: !91, line: 130, baseType: !171, size: 32, offset: 3392)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !90, file: !91, line: 130, baseType: !171, size: 32, offset: 3424)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !90, file: !91, line: 130, baseType: !171, size: 32, offset: 3456)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !90, file: !91, line: 131, baseType: !171, size: 32, offset: 3488)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !90, file: !91, line: 131, baseType: !171, size: 32, offset: 3520)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !90, file: !91, line: 131, baseType: !171, size: 32, offset: 3552)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !90, file: !91, line: 131, baseType: !171, size: 32, offset: 3584)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !90, file: !91, line: 132, baseType: !171, size: 32, offset: 3616)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !90, file: !91, line: 132, baseType: !171, size: 32, offset: 3648)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !90, file: !91, line: 133, baseType: !145, size: 512, offset: 3680)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !90, file: !91, line: 135, baseType: !171, size: 32, offset: 4192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !90, file: !91, line: 136, baseType: !171, size: 32, offset: 4224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !90, file: !91, line: 137, baseType: !171, size: 32, offset: 4256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !90, file: !91, line: 138, baseType: !130, size: 32, offset: 4288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !90, file: !91, line: 141, baseType: !115, size: 8, offset: 4320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !90, file: !91, line: 141, baseType: !115, size: 8, offset: 4328)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !90, file: !91, line: 141, baseType: !115, size: 8, offset: 4336)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !90, file: !91, line: 141, baseType: !115, size: 8, offset: 4344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !90, file: !91, line: 142, baseType: !128, size: 16, offset: 4352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !90, file: !91, line: 142, baseType: !128, size: 16, offset: 4368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !90, file: !91, line: 142, baseType: !128, size: 16, offset: 4384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !90, file: !91, line: 145, baseType: !115, size: 8, offset: 4400)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !90, file: !91, line: 145, baseType: !115, size: 8, offset: 4408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !90, file: !91, line: 148, baseType: !128, size: 16, offset: 4416)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !90, file: !91, line: 148, baseType: !128, size: 16, offset: 4432)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !90, file: !91, line: 149, baseType: !171, size: 32, offset: 4448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !90, file: !91, line: 149, baseType: !171, size: 32, offset: 4480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !90, file: !91, line: 152, baseType: !284, size: 128, offset: 4512)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 128, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 4)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !90, file: !91, line: 153, baseType: !171, size: 32, offset: 4640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !90, file: !91, line: 154, baseType: !171, size: 32, offset: 4672)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !90, file: !91, line: 157, baseType: !128, size: 16, offset: 4704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !90, file: !91, line: 157, baseType: !128, size: 16, offset: 4720)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !90, file: !91, line: 160, baseType: !292, size: 64, offset: 4736)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !294, line: 113, size: 6208, elements: !295)
!294 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!295 = !{!296, !297, !298, !299, !300, !301, !305}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !293, file: !294, line: 114, baseType: !128, size: 16)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !293, file: !294, line: 114, baseType: !128, size: 16, offset: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !293, file: !294, line: 115, baseType: !115, size: 8, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !293, file: !294, line: 115, baseType: !115, size: 8, offset: 40)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !293, file: !294, line: 116, baseType: !115, size: 8, offset: 48)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !294, line: 117, baseType: !302, size: 8, offset: 56)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !294, line: 119, baseType: !306, size: 6144, offset: 64)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 6144, elements: !316)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !294, line: 109, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !294, line: 106, size: 192, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !308, file: !294, line: 107, baseType: !171, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !308, file: !294, line: 107, baseType: !171, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !308, file: !294, line: 107, baseType: !171, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !308, file: !294, line: 107, baseType: !171, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !308, file: !294, line: 107, baseType: !171, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !308, file: !294, line: 108, baseType: !130, size: 32, offset: 160)
!316 = !{!317}
!317 = !DISubrange(count: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !90, file: !91, line: 161, baseType: !292, size: 64, offset: 4800)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !90, file: !91, line: 162, baseType: !115, size: 8, offset: 4864)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !90, file: !91, line: 162, baseType: !115, size: 8, offset: 4872)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !90, file: !91, line: 163, baseType: !115, size: 8, offset: 4880)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !90, file: !91, line: 163, baseType: !115, size: 8, offset: 4888)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !90, file: !91, line: 164, baseType: !128, size: 16, offset: 4896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !90, file: !91, line: 164, baseType: !128, size: 16, offset: 4912)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !90, file: !91, line: 165, baseType: !171, size: 32, offset: 4928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !90, file: !91, line: 165, baseType: !171, size: 32, offset: 4960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !90, file: !91, line: 167, baseType: !328, size: 1152, offset: 4992)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 1152, elements: !2252)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !294, line: 57, size: 2496, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !2049, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !330, file: !294, line: 59, baseType: !128, size: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !330, file: !294, line: 59, baseType: !128, size: 16, offset: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !330, file: !294, line: 59, baseType: !128, size: 16, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !330, file: !294, line: 59, baseType: !128, size: 16, offset: 48)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !330, file: !294, line: 60, baseType: !337, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !339, line: 115, size: 11392, elements: !340)
!339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!340 = !{!341, !342, !343, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !360, !370, !384, !385, !426, !427, !431, !432, !448, !449, !450, !451, !452, !453, !454, !456, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !534, !535, !536, !537, !538, !539, !540, !541, !542, !545, !548, !551, !552, !553, !554, !555, !558, !561, !564, !565, !571, !572, !573, !574, !575, !576, !578, !581, !584, !588, !2037, !2038}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !339, line: 116, baseType: !94, size: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !338, file: !339, line: 117, baseType: !166, size: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !338, file: !339, line: 119, baseType: !344, size: 64, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !339, line: 57, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !338, file: !339, line: 121, baseType: !128, size: 16, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !338, file: !339, line: 121, baseType: !128, size: 16, offset: 1104)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !338, file: !339, line: 122, baseType: !130, size: 32, offset: 1120)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !338, file: !339, line: 122, baseType: !130, size: 32, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !338, file: !339, line: 122, baseType: !130, size: 32, offset: 1184)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !338, file: !339, line: 123, baseType: !145, size: 512, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !338, file: !339, line: 124, baseType: !337, size: 64, offset: 1728)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !338, file: !339, line: 124, baseType: !337, size: 64, offset: 1792)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !338, file: !339, line: 127, baseType: !337, size: 64, offset: 1856)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !338, file: !339, line: 127, baseType: !337, size: 64, offset: 1920)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !338, file: !339, line: 127, baseType: !337, size: 64, offset: 1984)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !338, file: !339, line: 128, baseType: !358, size: 64, offset: 2048)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !91, line: 49, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !338, file: !339, line: 130, baseType: !361, size: 64, offset: 2112)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !339, line: 97, size: 832, elements: !363)
!363 = !{!364, !368, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !362, file: !339, line: 98, baseType: !365, size: 768)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 768, elements: !366)
!366 = !{!367, !204}
!367 = !DISubrange(count: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !362, file: !339, line: 99, baseType: !130, size: 32, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !362, file: !339, line: 99, baseType: !130, size: 32, offset: 800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !338, file: !339, line: 131, baseType: !371, size: 64, offset: 2176)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !373, line: 486, size: 1600, elements: !374)
!373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !372, file: !373, line: 487, baseType: !94, size: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !372, file: !373, line: 489, baseType: !155, size: 128, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !372, file: !373, line: 490, baseType: !155, size: 128, offset: 1088)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !372, file: !373, line: 491, baseType: !155, size: 128, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !372, file: !373, line: 492, baseType: !155, size: 128, offset: 1344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !373, line: 494, baseType: !130, size: 32, offset: 1472)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !372, file: !373, line: 495, baseType: !130, size: 32, offset: 1504)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !372, file: !373, line: 497, baseType: !130, size: 32, offset: 1536)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !372, file: !373, line: 498, baseType: !130, size: 32, offset: 1568)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !338, file: !339, line: 132, baseType: !371, size: 64, offset: 2240)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !338, file: !339, line: 133, baseType: !386, size: 64, offset: 2304)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !373, line: 334, size: 1728, elements: !388)
!388 = !{!389, !390, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !425}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !387, file: !373, line: 335, baseType: !155, size: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !387, file: !373, line: 336, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !373, line: 47, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !373, line: 338, baseType: !128, size: 16, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !387, file: !373, line: 338, baseType: !128, size: 16, offset: 208)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !387, file: !373, line: 339, baseType: !10, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !387, file: !373, line: 340, baseType: !130, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !387, file: !373, line: 342, baseType: !171, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !387, file: !373, line: 343, baseType: !202, size: 96, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !387, file: !373, line: 344, baseType: !202, size: 96, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !387, file: !373, line: 347, baseType: !155, size: 128, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !387, file: !373, line: 349, baseType: !130, size: 32, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !387, file: !373, line: 350, baseType: !130, size: 32, offset: 672)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !387, file: !373, line: 351, baseType: !99, size: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !387, file: !373, line: 352, baseType: !99, size: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !387, file: !373, line: 354, baseType: !406, size: 384, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !373, line: 116, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !373, line: 94, size: 384, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !407, file: !373, line: 96, baseType: !130, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !407, file: !373, line: 96, baseType: !130, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !407, file: !373, line: 97, baseType: !130, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !407, file: !373, line: 97, baseType: !130, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !407, file: !373, line: 99, baseType: !128, size: 16, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !407, file: !373, line: 100, baseType: !128, size: 16, offset: 144)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !407, file: !373, line: 102, baseType: !128, size: 16, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !407, file: !373, line: 105, baseType: !128, size: 16, offset: 176)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !407, file: !373, line: 108, baseType: !128, size: 16, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !407, file: !373, line: 109, baseType: !128, size: 16, offset: 208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !407, file: !373, line: 111, baseType: !128, size: 16, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !407, file: !373, line: 112, baseType: !128, size: 16, offset: 240)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !407, file: !373, line: 114, baseType: !130, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !407, file: !373, line: 114, baseType: !130, size: 32, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !407, file: !373, line: 115, baseType: !130, size: 32, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !407, file: !373, line: 115, baseType: !130, size: 32, offset: 352)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !387, file: !373, line: 355, baseType: !145, size: 512, offset: 1216)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !339, line: 134, baseType: !99, size: 64, offset: 2368)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !338, file: !339, line: 136, baseType: !428, size: 64, offset: 2432)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !430, line: 61, flags: DIFlagFwdDecl)
!430 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !338, file: !339, line: 138, baseType: !406, size: 384, offset: 2496)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !338, file: !339, line: 139, baseType: !433, size: 64, offset: 2880)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !373, line: 80, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !373, line: 72, size: 192, elements: !436)
!436 = !{!437, !444, !445, !446, !447}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !435, file: !373, line: 73, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !373, line: 59, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !373, line: 56, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !440, file: !373, line: 57, baseType: !202, size: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !440, file: !373, line: 58, baseType: !130, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !435, file: !373, line: 74, baseType: !130, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !435, file: !373, line: 76, baseType: !130, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !435, file: !373, line: 77, baseType: !130, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !373, line: 79, baseType: !130, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !338, file: !339, line: 141, baseType: !155, size: 128, offset: 2944)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !338, file: !339, line: 142, baseType: !155, size: 128, offset: 3072)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !338, file: !339, line: 143, baseType: !155, size: 128, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !338, file: !339, line: 144, baseType: !155, size: 128, offset: 3328)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !338, file: !339, line: 146, baseType: !130, size: 32, offset: 3456)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !338, file: !339, line: 147, baseType: !130, size: 32, offset: 3488)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !338, file: !339, line: 150, baseType: !455, size: 64, offset: 3520)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !338, file: !339, line: 151, baseType: !457, size: 64, offset: 3584)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !338, file: !339, line: 152, baseType: !130, size: 32, offset: 3648)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !338, file: !339, line: 153, baseType: !130, size: 32, offset: 3680)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !338, file: !339, line: 156, baseType: !202, size: 96, offset: 3712)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !338, file: !339, line: 156, baseType: !202, size: 96, offset: 3808)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !338, file: !339, line: 156, baseType: !202, size: 96, offset: 3904)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !338, file: !339, line: 157, baseType: !202, size: 96, offset: 4000)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !338, file: !339, line: 158, baseType: !202, size: 96, offset: 4096)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !338, file: !339, line: 159, baseType: !202, size: 96, offset: 4192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !338, file: !339, line: 160, baseType: !202, size: 96, offset: 4288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !338, file: !339, line: 160, baseType: !202, size: 96, offset: 4384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !338, file: !339, line: 161, baseType: !284, size: 128, offset: 4480)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !338, file: !339, line: 161, baseType: !284, size: 128, offset: 4608)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !338, file: !339, line: 162, baseType: !202, size: 96, offset: 4736)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !338, file: !339, line: 162, baseType: !202, size: 96, offset: 4832)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !338, file: !339, line: 163, baseType: !171, size: 32, offset: 4928)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !338, file: !339, line: 163, baseType: !171, size: 32, offset: 4960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !338, file: !339, line: 164, baseType: !475, size: 512, offset: 4992)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 512, elements: !476)
!476 = !{!286, !286}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !338, file: !339, line: 165, baseType: !475, size: 512, offset: 5504)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !338, file: !339, line: 166, baseType: !475, size: 512, offset: 6016)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !338, file: !339, line: 167, baseType: !475, size: 512, offset: 6528)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !338, file: !339, line: 176, baseType: !475, size: 512, offset: 7040)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !338, file: !339, line: 178, baseType: !10, size: 32, offset: 7552)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !338, file: !339, line: 180, baseType: !128, size: 16, offset: 7584)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !338, file: !339, line: 181, baseType: !128, size: 16, offset: 7600)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !338, file: !339, line: 183, baseType: !128, size: 16, offset: 7616)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !338, file: !339, line: 183, baseType: !128, size: 16, offset: 7632)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !338, file: !339, line: 184, baseType: !128, size: 16, offset: 7648)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !338, file: !339, line: 184, baseType: !128, size: 16, offset: 7664)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !338, file: !339, line: 185, baseType: !128, size: 16, offset: 7680)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !338, file: !339, line: 186, baseType: !128, size: 16, offset: 7696)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !338, file: !339, line: 187, baseType: !128, size: 16, offset: 7712)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !338, file: !339, line: 188, baseType: !115, size: 8, offset: 7728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !338, file: !339, line: 189, baseType: !115, size: 8, offset: 7736)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !338, file: !339, line: 192, baseType: !130, size: 32, offset: 7744)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !338, file: !339, line: 192, baseType: !130, size: 32, offset: 7776)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !338, file: !339, line: 192, baseType: !130, size: 32, offset: 7808)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !338, file: !339, line: 192, baseType: !130, size: 32, offset: 7840)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !338, file: !339, line: 194, baseType: !130, size: 32, offset: 7872)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !338, file: !339, line: 202, baseType: !171, size: 32, offset: 7904)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !338, file: !339, line: 202, baseType: !171, size: 32, offset: 7936)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !338, file: !339, line: 202, baseType: !171, size: 32, offset: 7968)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !338, file: !339, line: 211, baseType: !171, size: 32, offset: 8000)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !338, file: !339, line: 212, baseType: !171, size: 32, offset: 8032)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !338, file: !339, line: 213, baseType: !171, size: 32, offset: 8064)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !338, file: !339, line: 214, baseType: !171, size: 32, offset: 8096)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !338, file: !339, line: 215, baseType: !171, size: 32, offset: 8128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !338, file: !339, line: 216, baseType: !171, size: 32, offset: 8160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !338, file: !339, line: 219, baseType: !171, size: 32, offset: 8192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !338, file: !339, line: 220, baseType: !171, size: 32, offset: 8224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !338, file: !339, line: 221, baseType: !171, size: 32, offset: 8256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !338, file: !339, line: 224, baseType: !511, size: 16, offset: 8288)
!511 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !338, file: !339, line: 224, baseType: !511, size: 16, offset: 8304)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !338, file: !339, line: 226, baseType: !128, size: 16, offset: 8320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !338, file: !339, line: 228, baseType: !115, size: 8, offset: 8336)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !338, file: !339, line: 229, baseType: !115, size: 8, offset: 8344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !338, file: !339, line: 231, baseType: !128, size: 16, offset: 8352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !338, file: !339, line: 232, baseType: !115, size: 8, offset: 8368)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !338, file: !339, line: 233, baseType: !115, size: 8, offset: 8376)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !338, file: !339, line: 234, baseType: !171, size: 32, offset: 8384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !338, file: !339, line: 235, baseType: !171, size: 32, offset: 8416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !338, file: !339, line: 237, baseType: !155, size: 128, offset: 8448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !338, file: !339, line: 238, baseType: !155, size: 128, offset: 8576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !338, file: !339, line: 239, baseType: !155, size: 128, offset: 8704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !338, file: !339, line: 240, baseType: !155, size: 128, offset: 8832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !338, file: !339, line: 242, baseType: !171, size: 32, offset: 8960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !338, file: !339, line: 244, baseType: !128, size: 16, offset: 8992)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !338, file: !339, line: 245, baseType: !511, size: 16, offset: 9008)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !338, file: !339, line: 246, baseType: !284, size: 128, offset: 9024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !338, file: !339, line: 248, baseType: !130, size: 32, offset: 9152)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !338, file: !339, line: 249, baseType: !130, size: 32, offset: 9184)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !338, file: !339, line: 251, baseType: !532, size: 64, offset: 9216)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !339, line: 251, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !338, file: !339, line: 253, baseType: !115, size: 8, offset: 9280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !338, file: !339, line: 254, baseType: !115, size: 8, offset: 9288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !338, file: !339, line: 255, baseType: !128, size: 16, offset: 9296)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !338, file: !339, line: 256, baseType: !202, size: 96, offset: 9312)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !338, file: !339, line: 258, baseType: !155, size: 128, offset: 9408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !338, file: !339, line: 259, baseType: !155, size: 128, offset: 9536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !338, file: !339, line: 260, baseType: !155, size: 128, offset: 9664)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !338, file: !339, line: 261, baseType: !155, size: 128, offset: 9792)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !338, file: !339, line: 263, baseType: !543, size: 64, offset: 9920)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !339, line: 52, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !338, file: !339, line: 264, baseType: !546, size: 64, offset: 9984)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !339, line: 53, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !338, file: !339, line: 265, baseType: !549, size: 64, offset: 10048)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !91, line: 46, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !338, file: !339, line: 267, baseType: !115, size: 8, offset: 10112)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !338, file: !339, line: 268, baseType: !115, size: 8, offset: 10120)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !338, file: !339, line: 269, baseType: !128, size: 16, offset: 10128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !338, file: !339, line: 270, baseType: !171, size: 32, offset: 10144)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !338, file: !339, line: 272, baseType: !556, size: 64, offset: 10176)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !339, line: 54, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !338, file: !339, line: 275, baseType: !559, size: 64, offset: 10240)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !339, line: 275, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !338, file: !339, line: 277, baseType: !562, size: 64, offset: 10304)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !339, line: 56, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !338, file: !339, line: 277, baseType: !562, size: 64, offset: 10368)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !338, file: !339, line: 278, baseType: !566, size: 64, offset: 10432)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !567, line: 27, baseType: !568)
!567 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !569, line: 45, baseType: !570)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!570 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !338, file: !339, line: 279, baseType: !566, size: 64, offset: 10496)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !339, line: 280, baseType: !10, size: 32, offset: 10560)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !338, file: !339, line: 281, baseType: !10, size: 32, offset: 10592)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !338, file: !339, line: 283, baseType: !155, size: 128, offset: 10624)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !338, file: !339, line: 284, baseType: !155, size: 128, offset: 10752)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !338, file: !339, line: 285, baseType: !577, size: 64, offset: 10880)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !338, file: !339, line: 287, baseType: !579, size: 64, offset: 10944)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !339, line: 59, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !338, file: !339, line: 288, baseType: !582, size: 64, offset: 11008)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !339, line: 288, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !338, file: !339, line: 290, baseType: !585, size: 64, offset: 11072)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 64, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 2)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !338, file: !339, line: 291, baseType: !589, size: 64, offset: 11136)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !591, line: 65, baseType: !592)
!591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !591, line: 50, size: 320, elements: !593)
!593 = !{!594, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !592, file: !591, line: 51, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !430, line: 1216, size: 39680, elements: !597)
!597 = !{!598, !599, !600, !601, !1255, !1256, !1257, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1284, !1611, !1614, !1897, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1919, !1920, !1921, !1922, !1923, !1931, !1998, !2005, !2006, !2013, !2016, !2017, !2018, !2019, !2020, !2021}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !596, file: !430, line: 1217, baseType: !94, size: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !596, file: !430, line: 1218, baseType: !166, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !596, file: !430, line: 1220, baseType: !337, size: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !596, file: !430, line: 1221, baseType: !602, size: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !604, line: 52, size: 4224, elements: !605)
!604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !675, !676, !677, !678, !679, !680, !682, !698}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !603, file: !604, line: 53, baseType: !94, size: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !603, file: !604, line: 54, baseType: !166, size: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !603, file: !604, line: 56, baseType: !128, size: 16, offset: 1024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !603, file: !604, line: 56, baseType: !128, size: 16, offset: 1040)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !603, file: !604, line: 57, baseType: !128, size: 16, offset: 1056)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !603, file: !604, line: 57, baseType: !128, size: 16, offset: 1072)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !603, file: !604, line: 59, baseType: !171, size: 32, offset: 1088)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !603, file: !604, line: 59, baseType: !171, size: 32, offset: 1120)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !603, file: !604, line: 59, baseType: !171, size: 32, offset: 1152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !603, file: !604, line: 60, baseType: !171, size: 32, offset: 1184)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !603, file: !604, line: 60, baseType: !171, size: 32, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !603, file: !604, line: 60, baseType: !171, size: 32, offset: 1248)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !603, file: !604, line: 61, baseType: !171, size: 32, offset: 1280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !603, file: !604, line: 61, baseType: !171, size: 32, offset: 1312)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !603, file: !604, line: 61, baseType: !171, size: 32, offset: 1344)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !603, file: !604, line: 68, baseType: !171, size: 32, offset: 1376)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !603, file: !604, line: 68, baseType: !171, size: 32, offset: 1408)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !603, file: !604, line: 68, baseType: !171, size: 32, offset: 1440)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !603, file: !604, line: 69, baseType: !171, size: 32, offset: 1472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !603, file: !604, line: 69, baseType: !171, size: 32, offset: 1504)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !603, file: !604, line: 74, baseType: !171, size: 32, offset: 1536)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !603, file: !604, line: 79, baseType: !171, size: 32, offset: 1568)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !603, file: !604, line: 81, baseType: !128, size: 16, offset: 1600)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !603, file: !604, line: 91, baseType: !128, size: 16, offset: 1616)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !603, file: !604, line: 92, baseType: !128, size: 16, offset: 1632)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !603, file: !604, line: 93, baseType: !128, size: 16, offset: 1648)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !603, file: !604, line: 94, baseType: !128, size: 16, offset: 1664)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !603, file: !604, line: 94, baseType: !128, size: 16, offset: 1680)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !603, file: !604, line: 94, baseType: !128, size: 16, offset: 1696)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !603, file: !604, line: 94, baseType: !128, size: 16, offset: 1712)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !603, file: !604, line: 96, baseType: !171, size: 32, offset: 1728)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !603, file: !604, line: 96, baseType: !171, size: 32, offset: 1760)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !603, file: !604, line: 96, baseType: !171, size: 32, offset: 1792)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !603, file: !604, line: 96, baseType: !171, size: 32, offset: 1824)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !603, file: !604, line: 98, baseType: !171, size: 32, offset: 1856)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !603, file: !604, line: 98, baseType: !171, size: 32, offset: 1888)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !603, file: !604, line: 98, baseType: !171, size: 32, offset: 1920)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !603, file: !604, line: 98, baseType: !171, size: 32, offset: 1952)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !603, file: !604, line: 99, baseType: !171, size: 32, offset: 1984)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !603, file: !604, line: 99, baseType: !171, size: 32, offset: 2016)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !603, file: !604, line: 100, baseType: !171, size: 32, offset: 2048)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !603, file: !604, line: 100, baseType: !171, size: 32, offset: 2080)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !603, file: !604, line: 103, baseType: !128, size: 16, offset: 2112)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !603, file: !604, line: 103, baseType: !128, size: 16, offset: 2128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !603, file: !604, line: 103, baseType: !128, size: 16, offset: 2144)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !603, file: !604, line: 103, baseType: !128, size: 16, offset: 2160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !603, file: !604, line: 106, baseType: !171, size: 32, offset: 2176)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !603, file: !604, line: 106, baseType: !171, size: 32, offset: 2208)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !603, file: !604, line: 106, baseType: !171, size: 32, offset: 2240)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !603, file: !604, line: 106, baseType: !171, size: 32, offset: 2272)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !603, file: !604, line: 107, baseType: !128, size: 16, offset: 2304)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !603, file: !604, line: 107, baseType: !128, size: 16, offset: 2320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !603, file: !604, line: 107, baseType: !128, size: 16, offset: 2336)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !603, file: !604, line: 107, baseType: !128, size: 16, offset: 2352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !603, file: !604, line: 108, baseType: !171, size: 32, offset: 2368)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !603, file: !604, line: 108, baseType: !171, size: 32, offset: 2400)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !603, file: !604, line: 109, baseType: !171, size: 32, offset: 2432)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !603, file: !604, line: 109, baseType: !171, size: 32, offset: 2464)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !603, file: !604, line: 110, baseType: !171, size: 32, offset: 2496)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !603, file: !604, line: 110, baseType: !171, size: 32, offset: 2528)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !603, file: !604, line: 110, baseType: !171, size: 32, offset: 2560)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !603, file: !604, line: 111, baseType: !128, size: 16, offset: 2592)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !603, file: !604, line: 111, baseType: !128, size: 16, offset: 2608)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !603, file: !604, line: 112, baseType: !128, size: 16, offset: 2624)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !603, file: !604, line: 112, baseType: !128, size: 16, offset: 2640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !603, file: !604, line: 112, baseType: !128, size: 16, offset: 2656)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !603, file: !604, line: 115, baseType: !128, size: 16, offset: 2672)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !603, file: !604, line: 118, baseType: !674, size: 64, offset: 2688)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !603, file: !604, line: 118, baseType: !674, size: 64, offset: 2752)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !603, file: !604, line: 121, baseType: !358, size: 64, offset: 2816)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !603, file: !604, line: 122, baseType: !328, size: 1152, offset: 2880)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !603, file: !604, line: 123, baseType: !128, size: 16, offset: 4032)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !603, file: !604, line: 123, baseType: !128, size: 16, offset: 4048)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !603, file: !604, line: 123, baseType: !681, size: 32, offset: 4064)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 32, elements: !586)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !603, file: !604, line: 126, baseType: !683, size: 64, offset: 4096)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !95, line: 159, size: 448, elements: !685)
!685 = !{!686, !688, !689, !690, !691, !694}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !684, file: !95, line: 161, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !586)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !684, file: !95, line: 162, baseType: !687, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !684, file: !95, line: 163, baseType: !681, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !684, file: !95, line: 164, baseType: !681, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !684, file: !95, line: 165, baseType: !692, size: 128, offset: 192)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 128, elements: !586)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !684, file: !95, line: 166, baseType: !695, size: 128, offset: 320)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 128, elements: !586)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !95, line: 46, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !603, file: !604, line: 129, baseType: !699, size: 64, offset: 4160)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !701, line: 328, size: 3456, elements: !702)
!701 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!702 = !{!703, !704, !705, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1238, !1242, !1246, !1250, !1251, !1252, !1253, !1254}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !700, file: !701, line: 329, baseType: !94, size: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !700, file: !701, line: 330, baseType: !166, size: 64, offset: 960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !700, file: !701, line: 332, baseType: !706, size: 64, offset: 1024)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !708, line: 283, size: 4096, elements: !709)
!708 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !{!710, !711, !712, !713, !717, !718, !722, !1180, !1188, !1192, !1198, !1202, !1203, !1204, !1205, !1209, !1210}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !708, line: 284, baseType: !130, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !707, file: !708, line: 285, baseType: !145, size: 512, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !707, file: !708, line: 287, baseType: !145, size: 512, offset: 544)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !707, file: !708, line: 288, baseType: !714, size: 2048, offset: 1056)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !707, file: !708, line: 289, baseType: !130, size: 32, offset: 3104)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !707, file: !708, line: 292, baseType: !719, size: 64, offset: 3136)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !699}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !707, file: !708, line: 293, baseType: !723, size: 64, offset: 3200)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !699, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !701, line: 167, size: 3712, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1172, !1173, !1174, !1175, !1176, !1177}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !727, file: !701, line: 168, baseType: !726, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !727, file: !701, line: 168, baseType: !726, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !727, file: !701, line: 168, baseType: !726, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !727, file: !701, line: 170, baseType: !134, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !727, file: !701, line: 172, baseType: !734, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !708, line: 144, size: 6016, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !913, !914, !915, !929, !933, !937, !938, !1018, !1022, !1026, !1027, !1028, !1029, !1033, !1034, !1038, !1042, !1046, !1050, !1054, !1058, !1062, !1063, !1080, !1082, !1108, !1128}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !735, file: !708, line: 145, baseType: !99, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !735, file: !708, line: 145, baseType: !99, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !735, file: !708, line: 146, baseType: !128, size: 16, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !735, file: !708, line: 148, baseType: !145, size: 512, offset: 144)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !735, file: !708, line: 149, baseType: !130, size: 32, offset: 672)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !735, file: !708, line: 151, baseType: !145, size: 512, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !735, file: !708, line: 152, baseType: !714, size: 2048, offset: 1216)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !735, file: !708, line: 153, baseType: !130, size: 32, offset: 3264)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !735, file: !708, line: 155, baseType: !171, size: 32, offset: 3296)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !735, file: !708, line: 155, baseType: !171, size: 32, offset: 3328)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !735, file: !708, line: 155, baseType: !171, size: 32, offset: 3360)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !735, file: !708, line: 156, baseType: !171, size: 32, offset: 3392)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !735, file: !708, line: 156, baseType: !171, size: 32, offset: 3424)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !735, file: !708, line: 156, baseType: !171, size: 32, offset: 3456)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !735, file: !708, line: 157, baseType: !128, size: 16, offset: 3488)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !735, file: !708, line: 157, baseType: !128, size: 16, offset: 3504)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !735, file: !708, line: 157, baseType: !128, size: 16, offset: 3520)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !735, file: !708, line: 160, baseType: !755, size: 64, offset: 3584)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !708, line: 109, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !708, line: 98, size: 1408, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !912}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !757, file: !708, line: 99, baseType: !130, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !757, file: !708, line: 99, baseType: !130, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !708, line: 100, baseType: !145, size: 512, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !757, file: !708, line: 101, baseType: !171, size: 32, offset: 576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !757, file: !708, line: 101, baseType: !171, size: 32, offset: 608)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !757, file: !708, line: 101, baseType: !171, size: 32, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !757, file: !708, line: 101, baseType: !171, size: 32, offset: 672)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !757, file: !708, line: 102, baseType: !171, size: 32, offset: 704)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !757, file: !708, line: 102, baseType: !171, size: 32, offset: 736)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !757, file: !708, line: 103, baseType: !130, size: 32, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !757, file: !708, line: 104, baseType: !130, size: 32, offset: 800)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !757, file: !708, line: 107, baseType: !771, size: 64, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !701, line: 87, size: 2816, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !897}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !772, file: !701, line: 88, baseType: !771, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !772, file: !701, line: 88, baseType: !771, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !772, file: !701, line: 88, baseType: !771, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !772, file: !701, line: 90, baseType: !134, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !772, file: !701, line: 92, baseType: !145, size: 512, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !772, file: !701, line: 94, baseType: !145, size: 512, offset: 768)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !772, file: !701, line: 99, baseType: !99, size: 64, offset: 1280)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !701, line: 101, baseType: !128, size: 16, offset: 1344)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !701, line: 101, baseType: !128, size: 16, offset: 1360)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !772, file: !701, line: 102, baseType: !128, size: 16, offset: 1376)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !772, file: !701, line: 103, baseType: !128, size: 16, offset: 1392)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !772, file: !701, line: 104, baseType: !786, size: 64, offset: 1408)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !708, line: 114, size: 1600, elements: !788)
!788 = !{!789, !790, !813, !817, !821, !825, !829, !833, !834, !838, !867, !868, !869}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !787, file: !708, line: 115, baseType: !145, size: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !787, file: !708, line: 117, baseType: !791, size: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !794, !797, !799, !799, !811}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !796, line: 60, flags: DIFlagFwdDecl)
!796 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !708, line: 73, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !801, line: 55, size: 192, elements: !802)
!801 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!802 = !{!803, !807, !810}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !800, file: !801, line: 58, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !801, line: 56, size: 64, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !804, file: !801, line: 57, baseType: !99, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !800, file: !801, line: 60, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !701, line: 335, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !800, file: !801, line: 61, baseType: !99, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !787, file: !708, line: 118, baseType: !814, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !794, !799, !799, !674}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !787, file: !708, line: 120, baseType: !818, size: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !794, !797, !799}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !787, file: !708, line: 121, baseType: !822, size: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !794, !799, !674}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !787, file: !708, line: 122, baseType: !826, size: 64, offset: 768)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !699, !771, !808}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !787, file: !708, line: 123, baseType: !830, size: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !699, !771, !726, !771, !811}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !787, file: !708, line: 124, baseType: !830, size: 64, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !787, file: !708, line: 125, baseType: !835, size: 64, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !699, !771, !726, !771}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !787, file: !708, line: 128, baseType: !839, size: 256, offset: 1024)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !801, line: 436, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !801, line: 430, size: 256, elements: !841)
!841 = !{!842, !843, !846, !862}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !840, file: !801, line: 431, baseType: !99, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !840, file: !801, line: 432, baseType: !844, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !801, line: 417, baseType: !809)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !840, file: !801, line: 433, baseType: !847, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !801, line: 408, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!130, !794, !799, !851, !853}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !801, line: 38, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !801, line: 348, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !801, line: 337, size: 256, elements: !856)
!856 = !{!857, !858, !859, !860, !861}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !855, file: !801, line: 339, baseType: !99, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !855, file: !801, line: 342, baseType: !851, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !855, file: !801, line: 345, baseType: !130, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !855, file: !801, line: 347, baseType: !130, size: 32, offset: 160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !855, file: !801, line: 347, baseType: !130, size: 32, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !840, file: !801, line: 434, baseType: !863, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !801, line: 409, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !99}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !787, file: !708, line: 129, baseType: !839, size: 256, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !787, file: !708, line: 132, baseType: !130, size: 32, offset: 1536)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !787, file: !708, line: 132, baseType: !130, size: 32, offset: 1568)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !772, file: !701, line: 105, baseType: !145, size: 512, offset: 1472)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !772, file: !701, line: 107, baseType: !171, size: 32, offset: 1984)
