; ModuleID = 'blender/source/blender/editors/space_nla/nla_channels.c'
source_filename = "blender/source/blender/editors/space_nla/nla_channels.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!133 = !DIEnumerator(name: "ADT_NLA_SKEYS_COLLAPSED", value: 16, isUnsigned: true)
!134 = !DIEnumerator(name: "ADT_DRIVERS_COLLAPSED", value: 1024, isUnsigned: true)
!135 = !DIEnumerator(name: "ADT_DRIVERS_DISABLED", value: 2048, isUnsigned: true)
!136 = !DIEnumerator(name: "ADT_UI_SELECTED", value: 16384, isUnsigned: true)
!137 = !DIEnumerator(name: "ADT_UI_ACTIVE", value: 32768, isUnsigned: true)
!138 = !DIEnumerator(name: "ADT_CURVES_NOT_VISIBLE", value: 65536, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimChannels_SetFlag", file: !39, line: 393, baseType: !5, size: 32, elements: !140)
!140 = !{!141, !142, !143, !144}
!141 = !DIEnumerator(name: "ACHANNEL_SETFLAG_CLEAR", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "ACHANNEL_SETFLAG_ADD", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "ACHANNEL_SETFLAG_INVERT", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "ACHANNEL_SETFLAG_TOGGLE", value: 3, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaTrack_Flag", file: !127, line: 685, baseType: !5, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152}
!147 = !DIEnumerator(name: "NLATRACK_ACTIVE", value: 1, isUnsigned: true)
!148 = !DIEnumerator(name: "NLATRACK_SELECTED", value: 2, isUnsigned: true)
!149 = !DIEnumerator(name: "NLATRACK_MUTED", value: 4, isUnsigned: true)
!150 = !DIEnumerator(name: "NLATRACK_SOLO", value: 8, isUnsigned: true)
!151 = !DIEnumerator(name: "NLATRACK_PROTECTED", value: 16, isUnsigned: true)
!152 = !DIEnumerator(name: "NLATRACK_DISABLED", value: 1024, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !92, line: 67, baseType: !5, size: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163}
!155 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!158 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!159 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!160 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!161 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!162 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!163 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDopeSheet_FilterFlag", file: !165, line: 535, baseType: !5, size: 32, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!167 = !DIEnumerator(name: "ADS_FILTER_ONLYSEL", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "ADS_FILTER_ONLYDRIVERS", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "ADS_FILTER_ONLYNLA", value: 4, isUnsigned: true)
!170 = !DIEnumerator(name: "ADS_FILTER_SELEDIT", value: 8, isUnsigned: true)
!171 = !DIEnumerator(name: "ADS_FILTER_SUMMARY", value: 16, isUnsigned: true)
!172 = !DIEnumerator(name: "ADS_FILTER_ONLYOBGROUP", value: 32, isUnsigned: true)
!173 = !DIEnumerator(name: "ADS_FILTER_NOSHAPEKEYS", value: 64, isUnsigned: true)
!174 = !DIEnumerator(name: "ADS_FILTER_NOMESH", value: 128, isUnsigned: true)
!175 = !DIEnumerator(name: "ADS_FILTER_NOOBJ", value: 256, isUnsigned: true)
!176 = !DIEnumerator(name: "ADS_FILTER_NOLAT", value: 512, isUnsigned: true)
!177 = !DIEnumerator(name: "ADS_FILTER_NOCAM", value: 1024, isUnsigned: true)
!178 = !DIEnumerator(name: "ADS_FILTER_NOMAT", value: 2048, isUnsigned: true)
!179 = !DIEnumerator(name: "ADS_FILTER_NOLAM", value: 4096, isUnsigned: true)
!180 = !DIEnumerator(name: "ADS_FILTER_NOCUR", value: 8192, isUnsigned: true)
!181 = !DIEnumerator(name: "ADS_FILTER_NOWOR", value: 16384, isUnsigned: true)
!182 = !DIEnumerator(name: "ADS_FILTER_NOSCE", value: 32768, isUnsigned: true)
!183 = !DIEnumerator(name: "ADS_FILTER_NOPART", value: 65536, isUnsigned: true)
!184 = !DIEnumerator(name: "ADS_FILTER_NOMBA", value: 131072, isUnsigned: true)
!185 = !DIEnumerator(name: "ADS_FILTER_NOARM", value: 262144, isUnsigned: true)
!186 = !DIEnumerator(name: "ADS_FILTER_NONTREE", value: 524288, isUnsigned: true)
!187 = !DIEnumerator(name: "ADS_FILTER_NOTEX", value: 1048576, isUnsigned: true)
!188 = !DIEnumerator(name: "ADS_FILTER_NOSPK", value: 2097152, isUnsigned: true)
!189 = !DIEnumerator(name: "ADS_FILTER_NOLINESTYLE", value: 4194304, isUnsigned: true)
!190 = !DIEnumerator(name: "ADS_FILTER_NOMODIFIERS", value: 8388608, isUnsigned: true)
!191 = !DIEnumerator(name: "ADS_FILTER_NLA_NOACT", value: 33554432, isUnsigned: true)
!192 = !DIEnumerator(name: "ADS_FILTER_INCL_HIDDEN", value: 67108864, isUnsigned: true)
!193 = !DIEnumerator(name: "ADS_FILTER_BY_FCU_NAME", value: 134217728, isUnsigned: true)
!194 = !DIEnumerator(name: "ADS_FILTER_ONLY_ERRORS", value: 268435456, isUnsigned: true)
!195 = !DIEnumerator(name: "ADS_FILTER_NOOBDATA", value: 10828800, isUnsigned: true)
!196 = !{!197, !210, !219, !232, !2000, !2002, !2004, !581, !2006}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaTrack", file: !127, line: 682, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaTrack", file: !127, line: 673, size: 832, elements: !200)
!200 = !{!201, !203, !204, !212, !213, !214}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !127, line: 674, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !127, line: 674, baseType: !202, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !199, file: !127, line: 676, baseType: !205, size: 128, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !206, line: 71, baseType: !207)
!206 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !206, line: 69, size: 128, elements: !208)
!208 = !{!209, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !207, file: !206, line: 70, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !207, file: !206, line: 70, baseType: !210, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !199, file: !127, line: 678, baseType: !40, size: 32, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !199, file: !127, line: 679, baseType: !40, size: 32, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !127, line: 681, baseType: !215, size: 512, offset: 320)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 512, elements: !217)
!216 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!217 = !{!218}
!218 = !DISubrange(count: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceNla", file: !108, line: 399, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNla", file: !108, line: 386, size: 1856, elements: !222)
!222 = !{!223, !238, !239, !240, !241, !242, !243, !244, !245, !246, !318}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !108, line: 387, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !108, line: 85, size: 448, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !108, line: 86, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !108, line: 86, baseType: !224, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !225, file: !108, line: 87, baseType: !205, size: 128, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !225, file: !108, line: 88, baseType: !40, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !225, file: !108, line: 89, baseType: !232, size: 32, offset: 288)
!232 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !225, file: !108, line: 90, baseType: !234, size: 128, offset: 320)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 128, elements: !236)
!235 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!236 = !{!237}
!237 = !DISubrange(count: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !221, file: !108, line: 387, baseType: !224, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !221, file: !108, line: 388, baseType: !205, size: 128, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !221, file: !108, line: 389, baseType: !40, size: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !221, file: !108, line: 390, baseType: !232, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !221, file: !108, line: 391, baseType: !234, size: 128, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "autosnap", scope: !221, file: !108, line: 393, baseType: !235, size: 16, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !108, line: 394, baseType: !235, size: 16, offset: 464)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !221, file: !108, line: 395, baseType: !40, size: 32, offset: 480)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !221, file: !108, line: 397, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDopeSheet", file: !165, line: 519, size: 896, elements: !249)
!249 = !{!250, !309, !310, !313, !314, !315, !316, !317}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !248, file: !165, line: 520, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !253, line: 130, baseType: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !253, line: 117, size: 960, elements: !255)
!255 = !{!256, !257, !258, !260, !278, !282, !283, !284, !285, !286}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !253, line: 118, baseType: !210, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !254, file: !253, line: 118, baseType: !210, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !254, file: !253, line: 119, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !254, file: !253, line: 120, baseType: !261, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !253, line: 136, size: 17600, elements: !263)
!263 = !{!264, !265, !266, !269, !273, !274, !275}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !262, file: !253, line: 137, baseType: !252, size: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !262, file: !253, line: 138, baseType: !251, size: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !262, file: !253, line: 139, baseType: !267, size: 64, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !253, line: 43, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !253, line: 140, baseType: !270, size: 8192, offset: 1088)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 8192, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !262, file: !253, line: 141, baseType: !270, size: 8192, offset: 9280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !262, file: !253, line: 148, baseType: !261, size: 64, offset: 17472)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !262, file: !253, line: 150, baseType: !276, size: 64, offset: 17536)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !253, line: 45, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !253, line: 121, baseType: !279, size: 528, offset: 256)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 528, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 66)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !254, file: !253, line: 126, baseType: !235, size: 16, offset: 784)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !254, file: !253, line: 127, baseType: !40, size: 32, offset: 800)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !254, file: !253, line: 128, baseType: !40, size: 32, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !254, file: !253, line: 128, baseType: !40, size: 32, offset: 864)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !254, file: !253, line: 129, baseType: !287, size: 64, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !253, line: 75, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !253, line: 62, size: 1024, elements: !290)
!290 = !{!291, !293, !294, !295, !296, !297, !298, !299, !307, !308}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !253, line: 63, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !289, file: !253, line: 63, baseType: !292, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !253, line: 64, baseType: !216, size: 8, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !289, file: !253, line: 64, baseType: !216, size: 8, offset: 136)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !289, file: !253, line: 65, baseType: !235, size: 16, offset: 144)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !253, line: 66, baseType: !215, size: 512, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !289, file: !253, line: 67, baseType: !40, size: 32, offset: 672)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !253, line: 69, baseType: !300, size: 256, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !253, line: 60, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !253, line: 48, size: 256, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !301, file: !253, line: 49, baseType: !210, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !301, file: !253, line: 58, baseType: !205, size: 128, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !301, file: !253, line: 59, baseType: !40, size: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !301, file: !253, line: 59, baseType: !40, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !289, file: !253, line: 70, baseType: !40, size: 32, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !289, file: !253, line: 74, baseType: !40, size: 32, offset: 992)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !248, file: !165, line: 521, baseType: !205, size: 128, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "filter_grp", scope: !248, file: !165, line: 523, baseType: !311, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !165, line: 46, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "searchstr", scope: !248, file: !165, line: 524, baseType: !215, size: 512, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "filterflag", scope: !248, file: !165, line: 526, baseType: !40, size: 32, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !248, file: !165, line: 527, baseType: !40, size: 32, offset: 800)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "renameIndex", scope: !248, file: !165, line: 529, baseType: !40, size: 32, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !248, file: !165, line: 530, baseType: !40, size: 32, offset: 864)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !221, file: !108, line: 398, baseType: !319, size: 1280, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !320, line: 71, baseType: !321)
!320 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !320, line: 40, size: 1280, elements: !322)
!322 = !{!323, !332, !333, !341, !342, !343, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !364, !365, !366, !369}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !321, file: !320, line: 41, baseType: !324, size: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !325, line: 95, baseType: !326)
!325 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !325, line: 92, size: 128, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !326, file: !325, line: 93, baseType: !232, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !326, file: !325, line: 93, baseType: !232, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !326, file: !325, line: 94, baseType: !232, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !326, file: !325, line: 94, baseType: !232, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !321, file: !320, line: 41, baseType: !324, size: 128, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !321, file: !320, line: 42, baseType: !334, size: 128, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !325, line: 89, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !325, line: 86, size: 128, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !335, file: !325, line: 87, baseType: !40, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !335, file: !325, line: 87, baseType: !40, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !335, file: !325, line: 88, baseType: !40, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !335, file: !325, line: 88, baseType: !40, size: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !321, file: !320, line: 42, baseType: !334, size: 128, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !321, file: !320, line: 43, baseType: !334, size: 128, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !321, file: !320, line: 45, baseType: !344, size: 64, offset: 640)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 64, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 2)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !321, file: !320, line: 45, baseType: !344, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !321, file: !320, line: 46, baseType: !232, size: 32, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !321, file: !320, line: 46, baseType: !232, size: 32, offset: 800)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !321, file: !320, line: 48, baseType: !235, size: 16, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !321, file: !320, line: 49, baseType: !235, size: 16, offset: 848)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !321, file: !320, line: 51, baseType: !235, size: 16, offset: 864)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !321, file: !320, line: 52, baseType: !235, size: 16, offset: 880)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !321, file: !320, line: 53, baseType: !235, size: 16, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !321, file: !320, line: 55, baseType: !235, size: 16, offset: 912)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !321, file: !320, line: 56, baseType: !235, size: 16, offset: 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !321, file: !320, line: 58, baseType: !235, size: 16, offset: 944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !321, file: !320, line: 58, baseType: !235, size: 16, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !321, file: !320, line: 59, baseType: !235, size: 16, offset: 976)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !321, file: !320, line: 59, baseType: !235, size: 16, offset: 992)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !321, file: !320, line: 61, baseType: !235, size: 16, offset: 1008)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !321, file: !320, line: 63, baseType: !363, size: 64, offset: 1024)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !321, file: !320, line: 64, baseType: !40, size: 32, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !321, file: !320, line: 65, baseType: !40, size: 32, offset: 1120)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !321, file: !320, line: 68, baseType: !367, size: 64, offset: 1152)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !320, line: 68, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !321, file: !320, line: 69, baseType: !370, size: 64, offset: 1216)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !372, line: 490, size: 768, elements: !373)
!372 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!373 = !{!374, !375, !376, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !372, line: 491, baseType: !370, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !371, file: !372, line: 491, baseType: !370, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !371, file: !372, line: 493, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !92, line: 169, size: 2048, elements: !379)
!379 = !{!380, !381, !382, !383, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1966, !1969, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !92, line: 170, baseType: !377, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !378, file: !92, line: 170, baseType: !377, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !378, file: !92, line: 172, baseType: !210, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !378, file: !92, line: 174, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !386, line: 49, size: 1984, elements: !387)
!386 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !{!388, !389, !390, !391, !392, !393, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !385, file: !386, line: 50, baseType: !252, size: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !385, file: !386, line: 52, baseType: !205, size: 128, offset: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !385, file: !386, line: 53, baseType: !205, size: 128, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !385, file: !386, line: 54, baseType: !205, size: 128, offset: 1216)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !385, file: !386, line: 55, baseType: !205, size: 128, offset: 1344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !385, file: !386, line: 57, baseType: !394, size: 64, offset: 1472)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !396, line: 1216, size: 39680, elements: !397)
!396 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!397 = !{!398, !399, !467, !742, !745, !746, !747, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !773, !838, !1265, !1480, !1483, !1764, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1786, !1787, !1788, !1789, !1790, !1798, !1865, !1872, !1873, !1880, !1881, !1882, !1883, !1884, !1885, !1886}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !395, file: !396, line: 1217, baseType: !252, size: 960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !395, file: !396, line: 1218, baseType: !400, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !127, line: 838, size: 768, elements: !402)
!402 = !{!403, !417, !418, !428, !429, !460, !461, !462, !463, !464, !465, !466}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !401, file: !127, line: 840, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !165, line: 499, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !165, line: 486, size: 1600, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !406, file: !165, line: 487, baseType: !252, size: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !406, file: !165, line: 489, baseType: !205, size: 128, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !406, file: !165, line: 490, baseType: !205, size: 128, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !406, file: !165, line: 491, baseType: !205, size: 128, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !406, file: !165, line: 492, baseType: !205, size: 128, offset: 1344)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !165, line: 494, baseType: !40, size: 32, offset: 1472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !406, file: !165, line: 495, baseType: !40, size: 32, offset: 1504)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !406, file: !165, line: 497, baseType: !40, size: 32, offset: 1536)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !406, file: !165, line: 498, baseType: !40, size: 32, offset: 1568)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !401, file: !127, line: 844, baseType: !404, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !401, file: !127, line: 848, baseType: !419, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !127, line: 549, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !127, line: 544, size: 320, elements: !422)
!422 = !{!423, !425, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !127, line: 545, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !127, line: 545, baseType: !424, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !421, file: !127, line: 547, baseType: !404, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !421, file: !127, line: 548, baseType: !205, size: 128, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !401, file: !127, line: 851, baseType: !205, size: 128, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !401, file: !127, line: 853, baseType: !430, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !127, line: 594, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !127, line: 561, size: 1664, elements: !433)
!433 = !{!434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !432, file: !127, line: 562, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !432, file: !127, line: 562, baseType: !435, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !432, file: !127, line: 564, baseType: !205, size: 128, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !432, file: !127, line: 565, baseType: !404, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !432, file: !127, line: 566, baseType: !419, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !432, file: !127, line: 568, baseType: !205, size: 128, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !432, file: !127, line: 569, baseType: !205, size: 128, offset: 512)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !127, line: 571, baseType: !215, size: 512, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !432, file: !127, line: 573, baseType: !232, size: 32, offset: 1152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !432, file: !127, line: 574, baseType: !232, size: 32, offset: 1184)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !432, file: !127, line: 576, baseType: !232, size: 32, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !432, file: !127, line: 576, baseType: !232, size: 32, offset: 1248)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !432, file: !127, line: 577, baseType: !232, size: 32, offset: 1280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !432, file: !127, line: 577, baseType: !232, size: 32, offset: 1312)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !432, file: !127, line: 579, baseType: !232, size: 32, offset: 1344)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !432, file: !127, line: 580, baseType: !232, size: 32, offset: 1376)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !432, file: !127, line: 582, baseType: !232, size: 32, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !432, file: !127, line: 582, baseType: !232, size: 32, offset: 1440)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !432, file: !127, line: 583, baseType: !235, size: 16, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !432, file: !127, line: 585, baseType: !235, size: 16, offset: 1488)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !432, file: !127, line: 586, baseType: !235, size: 16, offset: 1504)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !127, line: 588, baseType: !235, size: 16, offset: 1520)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !432, file: !127, line: 590, baseType: !210, size: 64, offset: 1536)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !127, line: 592, baseType: !40, size: 32, offset: 1600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !432, file: !127, line: 593, baseType: !40, size: 32, offset: 1632)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !401, file: !127, line: 858, baseType: !205, size: 128, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !401, file: !127, line: 859, baseType: !205, size: 128, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !127, line: 862, baseType: !40, size: 32, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !401, file: !127, line: 863, baseType: !40, size: 32, offset: 672)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !401, file: !127, line: 866, baseType: !235, size: 16, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !401, file: !127, line: 867, baseType: !235, size: 16, offset: 720)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !401, file: !127, line: 868, baseType: !232, size: 32, offset: 736)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !395, file: !396, line: 1220, baseType: !468, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !470, line: 115, size: 11392, elements: !471)
!470 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!471 = !{!472, !473, !474, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !492, !502, !504, !505, !548, !549, !552, !553, !569, !570, !571, !572, !573, !574, !575, !580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !596, !597, !598, !599, !600, !601, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !661, !662, !663, !664, !665, !666, !667, !668, !669, !672, !675, !676, !677, !678, !679, !680, !683, !686, !689, !690, !696, !697, !698, !699, !700, !701, !703, !706, !709, !710, !730, !731}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !469, file: !470, line: 116, baseType: !252, size: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !469, file: !470, line: 117, baseType: !400, size: 64, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !469, file: !470, line: 119, baseType: !475, size: 64, offset: 1024)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !470, line: 57, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !470, line: 121, baseType: !235, size: 16, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !469, file: !470, line: 121, baseType: !235, size: 16, offset: 1104)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !469, file: !470, line: 122, baseType: !40, size: 32, offset: 1120)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !469, file: !470, line: 122, baseType: !40, size: 32, offset: 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !469, file: !470, line: 122, baseType: !40, size: 32, offset: 1184)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !469, file: !470, line: 123, baseType: !215, size: 512, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !469, file: !470, line: 124, baseType: !468, size: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !469, file: !470, line: 124, baseType: !468, size: 64, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !469, file: !470, line: 127, baseType: !468, size: 64, offset: 1856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !469, file: !470, line: 127, baseType: !468, size: 64, offset: 1920)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !469, file: !470, line: 127, baseType: !468, size: 64, offset: 1984)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !469, file: !470, line: 128, baseType: !489, size: 64, offset: 2048)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !491, line: 46, flags: DIFlagFwdDecl)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !469, file: !470, line: 130, baseType: !493, size: 64, offset: 2112)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !470, line: 97, size: 832, elements: !495)
!495 = !{!496, !500, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !494, file: !470, line: 98, baseType: !497, size: 768)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 768, elements: !498)
!498 = !{!237, !499}
!499 = !DISubrange(count: 3)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !470, line: 99, baseType: !40, size: 32, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !494, file: !470, line: 99, baseType: !40, size: 32, offset: 800)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !469, file: !470, line: 131, baseType: !503, size: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !469, file: !470, line: 132, baseType: !503, size: 64, offset: 2240)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !469, file: !470, line: 133, baseType: !506, size: 64, offset: 2304)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !165, line: 334, size: 1728, elements: !508)
!508 = !{!509, !510, !513, !514, !515, !516, !517, !518, !521, !522, !523, !524, !525, !526, !527, !547}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !507, file: !165, line: 335, baseType: !205, size: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !507, file: !165, line: 336, baseType: !511, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !165, line: 47, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !165, line: 338, baseType: !235, size: 16, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !507, file: !165, line: 338, baseType: !235, size: 16, offset: 208)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !507, file: !165, line: 339, baseType: !5, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !507, file: !165, line: 340, baseType: !40, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !507, file: !165, line: 342, baseType: !232, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !507, file: !165, line: 343, baseType: !519, size: 96, offset: 320)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 96, elements: !520)
!520 = !{!499}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !507, file: !165, line: 344, baseType: !519, size: 96, offset: 416)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !507, file: !165, line: 347, baseType: !205, size: 128, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !507, file: !165, line: 349, baseType: !40, size: 32, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !507, file: !165, line: 350, baseType: !40, size: 32, offset: 672)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !507, file: !165, line: 351, baseType: !210, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !507, file: !165, line: 352, baseType: !210, size: 64, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !507, file: !165, line: 354, baseType: !528, size: 384, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !165, line: 116, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !165, line: 94, size: 384, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !529, file: !165, line: 96, baseType: !40, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !529, file: !165, line: 96, baseType: !40, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !529, file: !165, line: 97, baseType: !40, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !529, file: !165, line: 97, baseType: !40, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !529, file: !165, line: 99, baseType: !235, size: 16, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !529, file: !165, line: 100, baseType: !235, size: 16, offset: 144)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !529, file: !165, line: 102, baseType: !235, size: 16, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !529, file: !165, line: 105, baseType: !235, size: 16, offset: 176)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !529, file: !165, line: 108, baseType: !235, size: 16, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !529, file: !165, line: 109, baseType: !235, size: 16, offset: 208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !529, file: !165, line: 111, baseType: !235, size: 16, offset: 224)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !529, file: !165, line: 112, baseType: !235, size: 16, offset: 240)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !529, file: !165, line: 114, baseType: !40, size: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !529, file: !165, line: 114, baseType: !40, size: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !529, file: !165, line: 115, baseType: !40, size: 32, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !529, file: !165, line: 115, baseType: !40, size: 32, offset: 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !507, file: !165, line: 355, baseType: !215, size: 512, offset: 1216)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !469, file: !470, line: 134, baseType: !210, size: 64, offset: 2368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !469, file: !470, line: 136, baseType: !550, size: 64, offset: 2432)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !470, line: 58, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !469, file: !470, line: 138, baseType: !528, size: 384, offset: 2496)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !469, file: !470, line: 139, baseType: !554, size: 64, offset: 2880)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !165, line: 80, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !165, line: 72, size: 192, elements: !557)
!557 = !{!558, !565, !566, !567, !568}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !556, file: !165, line: 73, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !165, line: 59, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !165, line: 56, size: 128, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !561, file: !165, line: 57, baseType: !519, size: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !165, line: 58, baseType: !40, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !556, file: !165, line: 74, baseType: !40, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !556, file: !165, line: 76, baseType: !40, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !556, file: !165, line: 77, baseType: !40, size: 32, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !556, file: !165, line: 79, baseType: !40, size: 32, offset: 160)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !469, file: !470, line: 141, baseType: !205, size: 128, offset: 2944)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !469, file: !470, line: 142, baseType: !205, size: 128, offset: 3072)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !469, file: !470, line: 143, baseType: !205, size: 128, offset: 3200)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !469, file: !470, line: 144, baseType: !205, size: 128, offset: 3328)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !469, file: !470, line: 146, baseType: !40, size: 32, offset: 3456)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !469, file: !470, line: 147, baseType: !40, size: 32, offset: 3488)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !469, file: !470, line: 150, baseType: !576, size: 64, offset: 3520)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !579, line: 46, flags: DIFlagFwdDecl)
!579 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!580 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !469, file: !470, line: 151, baseType: !581, size: 64, offset: 3584)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !469, file: !470, line: 152, baseType: !40, size: 32, offset: 3648)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !469, file: !470, line: 153, baseType: !40, size: 32, offset: 3680)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !469, file: !470, line: 156, baseType: !519, size: 96, offset: 3712)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !469, file: !470, line: 156, baseType: !519, size: 96, offset: 3808)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !469, file: !470, line: 156, baseType: !519, size: 96, offset: 3904)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !469, file: !470, line: 157, baseType: !519, size: 96, offset: 4000)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !469, file: !470, line: 158, baseType: !519, size: 96, offset: 4096)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !469, file: !470, line: 159, baseType: !519, size: 96, offset: 4192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !469, file: !470, line: 160, baseType: !519, size: 96, offset: 4288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !469, file: !470, line: 160, baseType: !519, size: 96, offset: 4384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !469, file: !470, line: 161, baseType: !593, size: 128, offset: 4480)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 4)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !469, file: !470, line: 161, baseType: !593, size: 128, offset: 4608)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !469, file: !470, line: 162, baseType: !519, size: 96, offset: 4736)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !469, file: !470, line: 162, baseType: !519, size: 96, offset: 4832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !469, file: !470, line: 163, baseType: !232, size: 32, offset: 4928)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !469, file: !470, line: 163, baseType: !232, size: 32, offset: 4960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !469, file: !470, line: 164, baseType: !602, size: 512, offset: 4992)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 512, elements: !603)
!603 = !{!595, !595}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !469, file: !470, line: 165, baseType: !602, size: 512, offset: 5504)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !469, file: !470, line: 166, baseType: !602, size: 512, offset: 6016)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !469, file: !470, line: 167, baseType: !602, size: 512, offset: 6528)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !469, file: !470, line: 176, baseType: !602, size: 512, offset: 7040)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !469, file: !470, line: 178, baseType: !5, size: 32, offset: 7552)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !469, file: !470, line: 180, baseType: !235, size: 16, offset: 7584)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !469, file: !470, line: 181, baseType: !235, size: 16, offset: 7600)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !469, file: !470, line: 183, baseType: !235, size: 16, offset: 7616)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !469, file: !470, line: 183, baseType: !235, size: 16, offset: 7632)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !469, file: !470, line: 184, baseType: !235, size: 16, offset: 7648)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !469, file: !470, line: 184, baseType: !235, size: 16, offset: 7664)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !469, file: !470, line: 185, baseType: !235, size: 16, offset: 7680)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !469, file: !470, line: 186, baseType: !235, size: 16, offset: 7696)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !469, file: !470, line: 187, baseType: !235, size: 16, offset: 7712)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !469, file: !470, line: 188, baseType: !216, size: 8, offset: 7728)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !469, file: !470, line: 189, baseType: !216, size: 8, offset: 7736)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !469, file: !470, line: 192, baseType: !40, size: 32, offset: 7744)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !469, file: !470, line: 192, baseType: !40, size: 32, offset: 7776)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !469, file: !470, line: 192, baseType: !40, size: 32, offset: 7808)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !469, file: !470, line: 192, baseType: !40, size: 32, offset: 7840)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !469, file: !470, line: 194, baseType: !40, size: 32, offset: 7872)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !469, file: !470, line: 202, baseType: !232, size: 32, offset: 7904)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !469, file: !470, line: 202, baseType: !232, size: 32, offset: 7936)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !469, file: !470, line: 202, baseType: !232, size: 32, offset: 7968)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !469, file: !470, line: 211, baseType: !232, size: 32, offset: 8000)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !469, file: !470, line: 212, baseType: !232, size: 32, offset: 8032)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !469, file: !470, line: 213, baseType: !232, size: 32, offset: 8064)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !469, file: !470, line: 214, baseType: !232, size: 32, offset: 8096)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !469, file: !470, line: 215, baseType: !232, size: 32, offset: 8128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !469, file: !470, line: 216, baseType: !232, size: 32, offset: 8160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !469, file: !470, line: 219, baseType: !232, size: 32, offset: 8192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !469, file: !470, line: 220, baseType: !232, size: 32, offset: 8224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !469, file: !470, line: 221, baseType: !232, size: 32, offset: 8256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !469, file: !470, line: 224, baseType: !638, size: 16, offset: 8288)
!638 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !469, file: !470, line: 224, baseType: !638, size: 16, offset: 8304)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !469, file: !470, line: 226, baseType: !235, size: 16, offset: 8320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !469, file: !470, line: 228, baseType: !216, size: 8, offset: 8336)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !469, file: !470, line: 229, baseType: !216, size: 8, offset: 8344)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !469, file: !470, line: 231, baseType: !235, size: 16, offset: 8352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !469, file: !470, line: 232, baseType: !216, size: 8, offset: 8368)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !469, file: !470, line: 233, baseType: !216, size: 8, offset: 8376)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !469, file: !470, line: 234, baseType: !232, size: 32, offset: 8384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !469, file: !470, line: 235, baseType: !232, size: 32, offset: 8416)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !469, file: !470, line: 237, baseType: !205, size: 128, offset: 8448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !469, file: !470, line: 238, baseType: !205, size: 128, offset: 8576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !469, file: !470, line: 239, baseType: !205, size: 128, offset: 8704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !469, file: !470, line: 240, baseType: !205, size: 128, offset: 8832)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !469, file: !470, line: 242, baseType: !232, size: 32, offset: 8960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !469, file: !470, line: 244, baseType: !235, size: 16, offset: 8992)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !469, file: !470, line: 245, baseType: !638, size: 16, offset: 9008)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !469, file: !470, line: 246, baseType: !593, size: 128, offset: 9024)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !469, file: !470, line: 248, baseType: !40, size: 32, offset: 9152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !469, file: !470, line: 249, baseType: !40, size: 32, offset: 9184)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !469, file: !470, line: 251, baseType: !659, size: 64, offset: 9216)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !470, line: 251, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !469, file: !470, line: 253, baseType: !216, size: 8, offset: 9280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !469, file: !470, line: 254, baseType: !216, size: 8, offset: 9288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !469, file: !470, line: 255, baseType: !235, size: 16, offset: 9296)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !469, file: !470, line: 256, baseType: !519, size: 96, offset: 9312)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !469, file: !470, line: 258, baseType: !205, size: 128, offset: 9408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !469, file: !470, line: 259, baseType: !205, size: 128, offset: 9536)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !469, file: !470, line: 260, baseType: !205, size: 128, offset: 9664)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !469, file: !470, line: 261, baseType: !205, size: 128, offset: 9792)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !469, file: !470, line: 263, baseType: !670, size: 64, offset: 9920)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !470, line: 52, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !469, file: !470, line: 264, baseType: !673, size: 64, offset: 9984)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !470, line: 53, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !469, file: !470, line: 265, baseType: !311, size: 64, offset: 10048)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !469, file: !470, line: 267, baseType: !216, size: 8, offset: 10112)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !469, file: !470, line: 268, baseType: !216, size: 8, offset: 10120)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !469, file: !470, line: 269, baseType: !235, size: 16, offset: 10128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !469, file: !470, line: 270, baseType: !232, size: 32, offset: 10144)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !469, file: !470, line: 272, baseType: !681, size: 64, offset: 10176)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !470, line: 54, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !469, file: !470, line: 275, baseType: !684, size: 64, offset: 10240)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !470, line: 275, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !469, file: !470, line: 277, baseType: !687, size: 64, offset: 10304)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !470, line: 56, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !469, file: !470, line: 277, baseType: !687, size: 64, offset: 10368)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !469, file: !470, line: 278, baseType: !691, size: 64, offset: 10432)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !692, line: 27, baseType: !693)
!692 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !694, line: 45, baseType: !695)
!694 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!695 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !469, file: !470, line: 279, baseType: !691, size: 64, offset: 10496)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !469, file: !470, line: 280, baseType: !5, size: 32, offset: 10560)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !469, file: !470, line: 281, baseType: !5, size: 32, offset: 10592)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !469, file: !470, line: 283, baseType: !205, size: 128, offset: 10624)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !469, file: !470, line: 284, baseType: !205, size: 128, offset: 10752)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !469, file: !470, line: 285, baseType: !702, size: 64, offset: 10880)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !469, file: !470, line: 287, baseType: !704, size: 64, offset: 10944)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !470, line: 59, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !469, file: !470, line: 288, baseType: !707, size: 64, offset: 11008)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !470, line: 288, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !469, file: !470, line: 290, baseType: !344, size: 64, offset: 11072)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !469, file: !470, line: 291, baseType: !711, size: 64, offset: 11136)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !713, line: 65, baseType: !714)
!713 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !713, line: 50, size: 320, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !714, file: !713, line: 51, baseType: !394, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !714, file: !713, line: 53, baseType: !40, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !714, file: !713, line: 54, baseType: !40, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !714, file: !713, line: 55, baseType: !40, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !714, file: !713, line: 55, baseType: !40, size: 32, offset: 160)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !714, file: !713, line: 56, baseType: !216, size: 8, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !714, file: !713, line: 56, baseType: !216, size: 8, offset: 200)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !714, file: !713, line: 57, baseType: !216, size: 8, offset: 208)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !714, file: !713, line: 57, baseType: !216, size: 8, offset: 216)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !714, file: !713, line: 59, baseType: !235, size: 16, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !714, file: !713, line: 59, baseType: !235, size: 16, offset: 240)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !714, file: !713, line: 59, baseType: !235, size: 16, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !713, line: 61, baseType: !235, size: 16, offset: 272)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !714, file: !713, line: 63, baseType: !40, size: 32, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !469, file: !470, line: 293, baseType: !205, size: 128, offset: 11200)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !469, file: !470, line: 294, baseType: !732, size: 64, offset: 11328)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !470, line: 113, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !470, line: 108, size: 256, elements: !735)
!735 = !{!736, !738, !739, !740, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !734, file: !470, line: 109, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !734, file: !470, line: 109, baseType: !737, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !734, file: !470, line: 110, baseType: !468, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !734, file: !470, line: 111, baseType: !40, size: 32, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !734, file: !470, line: 112, baseType: !232, size: 32, offset: 224)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !395, file: !396, line: 1221, baseType: !743, size: 64, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !396, line: 52, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !395, file: !396, line: 1223, baseType: !394, size: 64, offset: 1152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !395, file: !396, line: 1225, baseType: !205, size: 128, offset: 1216)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !395, file: !396, line: 1226, baseType: !748, size: 64, offset: 1344)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !396, line: 69, size: 320, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !749, file: !396, line: 70, baseType: !748, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !749, file: !396, line: 70, baseType: !748, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !749, file: !396, line: 71, baseType: !5, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !749, file: !396, line: 71, baseType: !5, size: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !749, file: !396, line: 72, baseType: !40, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !749, file: !396, line: 73, baseType: !235, size: 16, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !749, file: !396, line: 73, baseType: !235, size: 16, offset: 240)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !749, file: !396, line: 74, baseType: !468, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !395, file: !396, line: 1227, baseType: !468, size: 64, offset: 1408)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !395, file: !396, line: 1229, baseType: !519, size: 96, offset: 1472)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !395, file: !396, line: 1230, baseType: !519, size: 96, offset: 1568)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !395, file: !396, line: 1231, baseType: !519, size: 96, offset: 1664)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !395, file: !396, line: 1231, baseType: !519, size: 96, offset: 1760)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !395, file: !396, line: 1233, baseType: !5, size: 32, offset: 1856)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !395, file: !396, line: 1234, baseType: !40, size: 32, offset: 1888)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !395, file: !396, line: 1235, baseType: !5, size: 32, offset: 1920)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !396, line: 1237, baseType: !235, size: 16, offset: 1952)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !395, file: !396, line: 1239, baseType: !216, size: 8, offset: 1968)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !395, file: !396, line: 1240, baseType: !770, size: 8, offset: 1976)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 8, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 1)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !395, file: !396, line: 1242, baseType: !774, size: 64, offset: 1984)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !776, line: 328, size: 3456, elements: !777)
!776 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !779, !780, !783, !784, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !809, !814, !815, !818, !822, !826, !830, !834, !835, !836, !837}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !775, file: !776, line: 329, baseType: !252, size: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !775, file: !776, line: 330, baseType: !400, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !775, file: !776, line: 332, baseType: !781, size: 64, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !776, line: 332, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !775, file: !776, line: 333, baseType: !215, size: 512, offset: 1088)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !775, file: !776, line: 335, baseType: !785, size: 64, offset: 1600)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !775, file: !776, line: 337, baseType: !550, size: 64, offset: 1664)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !775, file: !776, line: 338, baseType: !344, size: 64, offset: 1728)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !775, file: !776, line: 340, baseType: !205, size: 128, offset: 1792)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !775, file: !776, line: 340, baseType: !205, size: 128, offset: 1920)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !775, file: !776, line: 342, baseType: !40, size: 32, offset: 2048)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !775, file: !776, line: 342, baseType: !40, size: 32, offset: 2080)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !775, file: !776, line: 343, baseType: !40, size: 32, offset: 2112)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !775, file: !776, line: 345, baseType: !40, size: 32, offset: 2144)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !775, file: !776, line: 346, baseType: !40, size: 32, offset: 2176)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !775, file: !776, line: 347, baseType: !235, size: 16, offset: 2208)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !775, file: !776, line: 348, baseType: !235, size: 16, offset: 2224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !775, file: !776, line: 349, baseType: !40, size: 32, offset: 2240)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !775, file: !776, line: 351, baseType: !40, size: 32, offset: 2272)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !775, file: !776, line: 353, baseType: !235, size: 16, offset: 2304)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !775, file: !776, line: 354, baseType: !235, size: 16, offset: 2320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !775, file: !776, line: 355, baseType: !40, size: 32, offset: 2336)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !775, file: !776, line: 357, baseType: !324, size: 128, offset: 2368)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !775, file: !776, line: 363, baseType: !205, size: 128, offset: 2496)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !775, file: !776, line: 363, baseType: !205, size: 128, offset: 2624)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !775, file: !776, line: 368, baseType: !807, size: 64, offset: 2752)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !776, line: 48, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !775, file: !776, line: 372, baseType: !810, size: 32, offset: 2816)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !776, line: 274, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !776, line: 271, size: 32, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !811, file: !776, line: 273, baseType: !5, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !775, file: !776, line: 373, baseType: !40, size: 32, offset: 2848)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !775, file: !776, line: 382, baseType: !816, size: 64, offset: 2880)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !776, line: 46, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !775, file: !776, line: 385, baseType: !819, size: 64, offset: 2944)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !210, !232}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !775, file: !776, line: 386, baseType: !823, size: 64, offset: 3008)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !210, !581}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !775, file: !776, line: 387, baseType: !827, size: 64, offset: 3072)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!40, !210}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !775, file: !776, line: 388, baseType: !831, size: 64, offset: 3136)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !210}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !775, file: !776, line: 389, baseType: !210, size: 64, offset: 3200)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !775, file: !776, line: 389, baseType: !210, size: 64, offset: 3264)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !775, file: !776, line: 389, baseType: !210, size: 64, offset: 3328)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !775, file: !776, line: 389, baseType: !210, size: 64, offset: 3392)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !395, file: !396, line: 1244, baseType: !839, size: 64, offset: 2048)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !841, line: 200, size: 17024, elements: !842)
!841 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!842 = !{!843, !844, !845, !846, !1258, !1259, !1260, !1261, !1262, !1263, !1264}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !840, file: !841, line: 201, baseType: !702, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !840, file: !841, line: 202, baseType: !205, size: 128, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !840, file: !841, line: 203, baseType: !205, size: 128, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !840, file: !841, line: 206, baseType: !847, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !841, line: 190, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !841, line: 126, size: 2816, elements: !850)
!850 = !{!851, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !949, !950, !951, !952, !1229, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1257}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !849, file: !841, line: 127, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !849, file: !841, line: 127, baseType: !852, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !849, file: !841, line: 128, baseType: !210, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !849, file: !841, line: 129, baseType: !210, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !849, file: !841, line: 130, baseType: !215, size: 512, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !849, file: !841, line: 132, baseType: !40, size: 32, offset: 768)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !849, file: !841, line: 132, baseType: !40, size: 32, offset: 800)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !849, file: !841, line: 133, baseType: !40, size: 32, offset: 832)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !849, file: !841, line: 134, baseType: !40, size: 32, offset: 864)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !849, file: !841, line: 134, baseType: !40, size: 32, offset: 896)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !849, file: !841, line: 134, baseType: !40, size: 32, offset: 928)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !849, file: !841, line: 135, baseType: !40, size: 32, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !849, file: !841, line: 135, baseType: !40, size: 32, offset: 992)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !849, file: !841, line: 136, baseType: !40, size: 32, offset: 1024)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !849, file: !841, line: 136, baseType: !40, size: 32, offset: 1056)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !849, file: !841, line: 137, baseType: !40, size: 32, offset: 1088)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !849, file: !841, line: 137, baseType: !40, size: 32, offset: 1120)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !849, file: !841, line: 138, baseType: !232, size: 32, offset: 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !849, file: !841, line: 139, baseType: !232, size: 32, offset: 1184)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !849, file: !841, line: 139, baseType: !232, size: 32, offset: 1216)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !849, file: !841, line: 141, baseType: !235, size: 16, offset: 1248)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !849, file: !841, line: 142, baseType: !235, size: 16, offset: 1264)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !849, file: !841, line: 143, baseType: !40, size: 32, offset: 1280)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !849, file: !841, line: 144, baseType: !40, size: 32, offset: 1312)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !849, file: !841, line: 146, baseType: !877, size: 64, offset: 1344)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !841, line: 114, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !841, line: 99, size: 7232, elements: !880)
!880 = !{!881, !883, !884, !885, !886, !887, !888, !899, !903, !917, !926, !933, !943}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !879, file: !841, line: 100, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !879, file: !841, line: 100, baseType: !882, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !879, file: !841, line: 101, baseType: !40, size: 32, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !879, file: !841, line: 101, baseType: !40, size: 32, offset: 160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !879, file: !841, line: 102, baseType: !40, size: 32, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !879, file: !841, line: 102, baseType: !40, size: 32, offset: 224)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !879, file: !841, line: 103, baseType: !889, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !841, line: 59, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !841, line: 56, size: 2112, elements: !892)
!892 = !{!893, !897, !898}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !891, file: !841, line: 57, baseType: !894, size: 2048)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 2048, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !891, file: !841, line: 58, baseType: !40, size: 32, offset: 2048)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !891, file: !841, line: 58, baseType: !40, size: 32, offset: 2080)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !879, file: !841, line: 106, baseType: !900, size: 6144, offset: 320)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 6144, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 768)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !879, file: !841, line: 107, baseType: !904, size: 64, offset: 6464)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !841, line: 97, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !841, line: 83, size: 8320, elements: !907)
!907 = !{!908, !909, !910, !913, !914, !915, !916}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !906, file: !841, line: 84, baseType: !900, size: 6144)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !906, file: !841, line: 87, baseType: !894, size: 2048, offset: 6144)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !906, file: !841, line: 88, baseType: !911, size: 64, offset: 8192)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !713, line: 41, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !906, file: !841, line: 90, baseType: !235, size: 16, offset: 8256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !906, file: !841, line: 92, baseType: !235, size: 16, offset: 8272)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !906, file: !841, line: 93, baseType: !235, size: 16, offset: 8288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !906, file: !841, line: 95, baseType: !235, size: 16, offset: 8304)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !879, file: !841, line: 108, baseType: !918, size: 64, offset: 6528)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !841, line: 66, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !841, line: 61, size: 128, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !920, file: !841, line: 62, baseType: !40, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !920, file: !841, line: 63, baseType: !40, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !920, file: !841, line: 64, baseType: !40, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !920, file: !841, line: 65, baseType: !40, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !879, file: !841, line: 109, baseType: !927, size: 64, offset: 6592)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !841, line: 71, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !841, line: 68, size: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !929, file: !841, line: 69, baseType: !40, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !929, file: !841, line: 70, baseType: !40, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !879, file: !841, line: 110, baseType: !934, size: 64, offset: 6656)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !841, line: 81, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !841, line: 73, size: 352, elements: !937)
!937 = !{!938, !939, !940, !941, !942}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !936, file: !841, line: 74, baseType: !519, size: 96)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !936, file: !841, line: 75, baseType: !519, size: 96, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !936, file: !841, line: 76, baseType: !519, size: 96, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !936, file: !841, line: 77, baseType: !40, size: 32, offset: 288)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !936, file: !841, line: 78, baseType: !40, size: 32, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !879, file: !841, line: 113, baseType: !944, size: 512, offset: 6720)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !945, line: 182, baseType: !946)
!945 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !945, line: 180, size: 512, elements: !947)
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !946, file: !945, line: 181, baseType: !215, size: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !849, file: !841, line: 148, baseType: !489, size: 64, offset: 1408)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !849, file: !841, line: 151, baseType: !394, size: 64, offset: 1472)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !849, file: !841, line: 152, baseType: !468, size: 64, offset: 1536)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !849, file: !841, line: 153, baseType: !953, size: 64, offset: 1600)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !955, line: 64, size: 19136, elements: !956)
!955 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!956 = !{!957, !958, !959, !960, !961, !962, !964, !965, !966, !967, !970, !971, !1215, !1216, !1224, !1225, !1226, !1227, !1228}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !954, file: !955, line: 65, baseType: !252, size: 960)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !954, file: !955, line: 66, baseType: !400, size: 64, offset: 960)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !955, line: 68, baseType: !270, size: 8192, offset: 1024)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !954, file: !955, line: 70, baseType: !40, size: 32, offset: 9216)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !954, file: !955, line: 71, baseType: !40, size: 32, offset: 9248)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !954, file: !955, line: 72, baseType: !963, size: 64, offset: 9280)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !345)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !954, file: !955, line: 74, baseType: !232, size: 32, offset: 9344)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !954, file: !955, line: 74, baseType: !232, size: 32, offset: 9376)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !954, file: !955, line: 76, baseType: !911, size: 64, offset: 9408)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !954, file: !955, line: 77, baseType: !968, size: 64, offset: 9472)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !955, line: 77, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !954, file: !955, line: 78, baseType: !550, size: 64, offset: 9536)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !954, file: !955, line: 80, baseType: !972, size: 2624, offset: 9600)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !973, line: 340, size: 2624, elements: !974)
